-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Фев 06 2023 г., 19:12
-- Версия сервера: 10.5.15-MariaDB-0+deb11u1
-- Версия PHP: 7.4.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gs70`
--

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

CREATE TABLE `accounts` (
  `id` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `password` varchar(65) NOT NULL,
  `salt` varchar(10) CHARACTER SET cp1251 NOT NULL,
  `email` varchar(61) NOT NULL DEFAULT 'None',
  `confirm_email` int(11) NOT NULL,
  `level` int(11) NOT NULL DEFAULT 1,
  `exp` int(11) NOT NULL,
  `refer` int(11) NOT NULL,
  `sex` int(11) NOT NULL,
  `skin` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `bank` int(11) NOT NULL,
  `admin` int(11) NOT NULL,
  `a_secret` int(11) NOT NULL,
  `prefix` varchar(15) CHARACTER SET cp1251 NOT NULL DEFAULT '[A]',
  `a_3d_prefix` int(11) NOT NULL,
  `admin_warn` int(11) NOT NULL,
  `AdminPass` int(11) NOT NULL,
  `driving_lic` int(11) NOT NULL,
  `weapon_lic` int(11) NOT NULL,
  `suspect` int(11) NOT NULL,
  `phone` int(11) NOT NULL,
  `phone_balance` int(11) NOT NULL,
  `phone_color` int(11) NOT NULL DEFAULT 9,
  `law_abiding` int(11) NOT NULL,
  `improvements` int(11) NOT NULL,
  `power` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `metall` int(11) NOT NULL,
  `wife` int(11) NOT NULL,
  `team` int(11) NOT NULL,
  `subdivison` int(11) NOT NULL,
  `wage` int(11) NOT NULL,
  `job` int(11) NOT NULL,
  `house_type` int(11) NOT NULL DEFAULT -1,
  `house_room` int(11) NOT NULL DEFAULT -1,
  `house` int(11) NOT NULL DEFAULT -1,
  `business` int(11) NOT NULL DEFAULT -1,
  `fuel_st` int(11) NOT NULL DEFAULT -1,
  `reg_time` int(11) NOT NULL,
  `reg_ip` varchar(16) NOT NULL,
  `last_ip` varchar(16) NOT NULL,
  `last_login` int(11) NOT NULL,
  `game_for_hour` int(11) NOT NULL,
  `game_for_day` int(11) NOT NULL,
  `game_for_day_prev` int(11) NOT NULL,
  `setting_phone` varchar(13) NOT NULL DEFAULT 'None',
  `setting_pin_code` varchar(5) NOT NULL DEFAULT 'None',
  `request_phone` int(11) NOT NULL,
  `request_pin` int(11) NOT NULL,
  `setting1` int(11) NOT NULL DEFAULT 2,
  `setting2` int(11) NOT NULL DEFAULT 1,
  `setting4` int(11) NOT NULL DEFAULT 1,
  `setting5` int(11) NOT NULL DEFAULT 0,
  `setting6` int(11) NOT NULL DEFAULT 1,
  `warn` int(11) NOT NULL,
  `warn_time` int(11) NOT NULL,
  `mute` int(11) NOT NULL,
  `skill_colt` int(11) NOT NULL,
  `skill_sdpistol` int(11) NOT NULL,
  `skill_deagle` int(11) NOT NULL,
  `skill_shotgun` int(11) NOT NULL,
  `skill_mp5` int(11) NOT NULL,
  `skill_ak47` int(11) NOT NULL,
  `skill_m4` int(11) NOT NULL,
  `skill_sniper_rifle` int(11) NOT NULL,
  `skill_sawnoff` int(11) NOT NULL,
  `skill_combat_sg` int(11) NOT NULL,
  `skill_micro_uzi` int(11) NOT NULL,
  `donate_current` int(11) NOT NULL,
  `donate_total` int(11) NOT NULL,
  `org_skin` int(11) NOT NULL,
  `setting_spawn` int(11) NOT NULL,
  `hospital` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT 100,
  `car_slots` int(11) NOT NULL DEFAULT 1,
  `jail` int(11) NOT NULL,
  `premium` int(11) NOT NULL,
  `premium_date` int(11) NOT NULL,
  `rub` int(11) NOT NULL,
  `player` int(11) NOT NULL,
  `gifts` int(11) NOT NULL,
  `cmdaccess` varchar(32) NOT NULL DEFAULT '000000000000000',
  `family` int(11) NOT NULL,
  `family_rank` int(11) NOT NULL,
  `test` int(11) NOT NULL,
  `quest_1` int(11) NOT NULL,
  `quest_2` int(11) NOT NULL,
  `quest_3` int(11) NOT NULL,
  `quest_4` int(11) NOT NULL,
  `quest_5` int(11) NOT NULL,
  `quest_6` int(11) NOT NULL,
  `quest_7` int(11) NOT NULL,
  `quest_8` int(11) NOT NULL,
  `quest_exp_1` int(11) NOT NULL,
  `quest_exp_2` int(11) NOT NULL,
  `quest_exp_3` int(11) NOT NULL,
  `quest_exp_4` int(11) NOT NULL,
  `quest_exp_5` int(11) NOT NULL,
  `quest_exp_6` int(11) NOT NULL,
  `quest_exp_7` int(11) NOT NULL,
  `quest_exp_8` int(11) NOT NULL,
  `youtube` int(11) NOT NULL,
  `AntiBh` int(11) NOT NULL,
  `get_adm_status` int(11) NOT NULL DEFAULT 0,
  `get_adm_hour` int(11) NOT NULL DEFAULT 0,
  `online` int(11) NOT NULL DEFAULT 0,
  `totalhour` int(11) DEFAULT NULL,
  `quest231` int(11) NOT NULL DEFAULT 0,
  `quest232` int(11) NOT NULL DEFAULT 0,
  `quest233` int(11) NOT NULL,
  `postcard` int(11) NOT NULL,
  `repcarid` int(11) NOT NULL,
  `helper` int(11) NOT NULL,
  `healme` int(11) NOT NULL,
  `QuestBox1` int(11) NOT NULL,
  `QuestBox2` int(11) NOT NULL,
  `QuestBox3` int(11) NOT NULL,
  `QuestBox4` int(11) NOT NULL,
  `QuestBox5` int(11) NOT NULL,
  `QuestBox6` int(11) NOT NULL,
  `repair` int(11) NOT NULL,
  `fmute` int(11) NOT NULL,
  `fwarn` int(11) NOT NULL,
  `owarn` int(11) NOT NULL,
  `dmz_kills` int(11) NOT NULL,
  `Progress1` int(11) NOT NULL,
  `Progress2` int(11) NOT NULL,
  `Progress3` int(11) NOT NULL,
  `Progress4` int(11) NOT NULL,
  `Progress5` int(11) NOT NULL,
  `Progress6` int(11) NOT NULL,
  `ProgressExp1` int(11) NOT NULL,
  `ProgressExp2` int(11) NOT NULL,
  `ProgressExp3` int(11) NOT NULL,
  `ProgressExp4` int(11) NOT NULL,
  `ProgressExp5` int(11) NOT NULL,
  `ProgressExp6` int(11) NOT NULL,
  `capt_kills` int(11) NOT NULL,
  `coins` int(11) NOT NULL,
  `ytpromo_activate` int(11) NOT NULL,
  `3d_prefix` int(11) NOT NULL,
  `loader_skill` int(11) NOT NULL,
  `premium_time` int(11) NOT NULL,
  `antisliv` int(11) NOT NULL,
  `QuestBox` int(11) NOT NULL,
  `flower1` int(11) NOT NULL,
  `flower2` int(11) NOT NULL,
  `flower3` int(11) NOT NULL,
  `TakeFlower` int(11) NOT NULL,
  `CongratulateWomen` int(11) NOT NULL,
  `BuyPerfume` int(11) NOT NULL,
  `GivePerfume` int(11) NOT NULL,
  `BuyCake` int(11) NOT NULL,
  `BuyProducts` int(11) NOT NULL,
  `BuyCandle` int(11) NOT NULL,
  `EndQuest8marta` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `accounts`
--

INSERT INTO `accounts` (`id`, `name`, `password`, `salt`, `email`, `confirm_email`, `level`, `exp`, `refer`, `sex`, `skin`, `money`, `bank`, `admin`, `a_secret`, `prefix`, `a_3d_prefix`, `admin_warn`, `AdminPass`, `driving_lic`, `weapon_lic`, `suspect`, `phone`, `phone_balance`, `phone_color`, `law_abiding`, `improvements`, `power`, `drugs`, `ammo`, `metall`, `wife`, `team`, `subdivison`, `wage`, `job`, `house_type`, `house_room`, `house`, `business`, `fuel_st`, `reg_time`, `reg_ip`, `last_ip`, `last_login`, `game_for_hour`, `game_for_day`, `game_for_day_prev`, `setting_phone`, `setting_pin_code`, `request_phone`, `request_pin`, `setting1`, `setting2`, `setting4`, `setting5`, `setting6`, `warn`, `warn_time`, `mute`, `skill_colt`, `skill_sdpistol`, `skill_deagle`, `skill_shotgun`, `skill_mp5`, `skill_ak47`, `skill_m4`, `skill_sniper_rifle`, `skill_sawnoff`, `skill_combat_sg`, `skill_micro_uzi`, `donate_current`, `donate_total`, `org_skin`, `setting_spawn`, `hospital`, `health`, `car_slots`, `jail`, `premium`, `premium_date`, `rub`, `player`, `gifts`, `cmdaccess`, `family`, `family_rank`, `test`, `quest_1`, `quest_2`, `quest_3`, `quest_4`, `quest_5`, `quest_6`, `quest_7`, `quest_8`, `quest_exp_1`, `quest_exp_2`, `quest_exp_3`, `quest_exp_4`, `quest_exp_5`, `quest_exp_6`, `quest_exp_7`, `quest_exp_8`, `youtube`, `AntiBh`, `get_adm_status`, `get_adm_hour`, `online`, `totalhour`, `quest231`, `quest232`, `quest233`, `postcard`, `repcarid`, `helper`, `healme`, `QuestBox1`, `QuestBox2`, `QuestBox3`, `QuestBox4`, `QuestBox5`, `QuestBox6`, `repair`, `fmute`, `fwarn`, `owarn`, `dmz_kills`, `Progress1`, `Progress2`, `Progress3`, `Progress4`, `Progress5`, `Progress6`, `ProgressExp1`, `ProgressExp2`, `ProgressExp3`, `ProgressExp4`, `ProgressExp5`, `ProgressExp6`, `capt_kills`, `coins`, `ytpromo_activate`, `3d_prefix`, `loader_skill`, `premium_time`, `antisliv`, `QuestBox`, `flower1`, `flower2`, `flower3`, `TakeFlower`, `CongratulateWomen`, `BuyPerfume`, `GivePerfume`, `BuyCake`, `BuyProducts`, `BuyCandle`, `EndQuest8marta`) VALUES
(7, 'Black_Boss', '2E12649343D934F40FB540E0E4CE39F13528FB8F70474F69FEAA14E7F3CB955F', 'Y:BJgTQihD', 'None', 0, 1, 0, 0, 0, 79, 10800, 0, 0, 0, '[A]', 0, 0, 0, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675457272, '127.0.0.1', '127.0.0.1', 1675639949, 0, 0, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 900, 900, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(5, 'Leo_Clemente', 'FEBA1233D0FBB464844C55DE45F1C941ED5962C22EA4B8F51C0DCB5EE4D1FBBC', 'cnk^9hkC?9', 'None', 0, 1, 2, 0, 0, 62, 51202, 0, 8, 0, '[A]', 0, 0, 1914, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675438329, '127.0.0.1', '127.0.0.1', 1675699779, 235, 7837, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1806, 1806, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(6, 'Leo_Clement', 'AE4E2CCDE62F4F0381BF408480BBDD6330783B840921A7E0D05248DE2A0DAEE2', 'gp4LxqoLTJ', 'None', 0, 1, 0, 0, 0, 78, 800, 0, 0, 0, '[A]', 0, 0, 0, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675438988, '127.0.0.1', '127.0.0.1', 1675439001, 6, 6, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(11, 'Temik_Simonov', '3EE836951D75E94A7B0A0ACDA534A31BC06F05DBC7574F9D60E933B7CE3E1E78', 'OO::D6_fZB', 'None', 0, 1, 0, 0, 0, 78, 10210800, 0, 0, 0, '[A]', 0, 0, 0, 2, 1, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675547445, '127.0.0.1', '127.0.0.1', 1675548328, 256, 786, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(8, 'kristen', '45D11497DB6E1F22A4F0D304A62C8048022470F9AB802CCDF0C7D7B96D8DF7A6', 'Vm=Q@gW}|E', 'None', 0, 1, 0, 0, 0, 78, 800, 0, 8, 0, '[A]', 0, 0, 1234, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675536557, '127.0.0.1', '127.0.0.1', 1675543623, 40, 723, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(9, 'Mance_Playy', '09375996D5E964768A01F52CC4A1AB61AFE5474780DEDCDBB3F76ABBFDE15930', '6\\q^@?\\kH^', 'None', 0, 1, 0, 0, 0, 78, 800, 0, 8, 0, '[A]', 0, 0, 8642, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675536569, '127.0.0.1', '127.0.0.1', 1675607817, 212, 212, 374, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 79, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(10, 'Restrari_Restrari', '2BE6D4C962EC492ECEB1799961AD0BD7DCC8F99C9AF64F5CD3804C71A1849C63', 'xY1Q{q|6Fc', 'None', 0, 1, 0, 0, 0, 134, 80000700, 0, 8, 0, '[A]', 0, 0, 1234, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675536613, '127.0.0.1', '127.0.0.1', 1675699663, 297, 457, 58, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 83, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1675548081, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(12, 'Mance_Play', '552E037D9975F371166281AD77A6DD49C682BDC48A8F87DF737E4AB1A3855E63', 'TqY^n}NWO8', 'None', 0, 1, 0, 0, 0, 78, 800, 0, 0, 0, '[A]', 0, 0, 0, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675617688, '127.0.0.1', '127.0.0.1', 1675617696, 6, 6, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(13, 'Lev_Clemente', '39AE3A635535D851C6FD9755F7D6D57C0AC7D704EBB61A44CDBC238EE5B32B71', 'RcmMYmGN^c', 'None', 0, 1, 0, 0, 0, 78, 500800, 0, 8, 0, '[A]', 0, 0, 1914, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675622089, '127.0.0.1', '127.0.0.1', 1675699612, 1071, 1071, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(14, 'Black_Bosss', '8856F83B3986D0A41D9197F515273DA9CF78BFC4DAEA4672D22782D62BD8F935', ']41g/JRIv}', 'None', 0, 1, 0, 0, 0, 134, 800, 0, 0, 0, '[A]', 0, 0, 0, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675639991, '127.0.0.1', '127.0.0.1', 1675640180, 162, 162, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(15, 'Jony_Permyako', '1228E214C14641ED3A630279452EB6B11D175D200D55C49C31603EF50847E83A', 'Iqw}_X;^Fv', 'None', 0, 1, 0, 0, 0, 78, 400, 0, 0, 0, '[A]', 0, 0, 0, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675692275, '127.0.0.1', '127.0.0.1', 1675692434, 136, 136, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(16, 'Lorenzo_Paint', '9016C8F936119BFA1B1632AC91CCCE1A2B64295329F1E85793AB308CA6FA7CAE', 'W{JL;PIxcj', 'None', 0, 1, 0, 0, 0, 78, 800, 0, 0, 0, '[A]', 0, 0, 0, 2, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1675692318, '127.0.0.1', '127.0.0.1', 1675692390, 62, 62, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `aclogs`
--

CREATE TABLE `aclogs` (
  `id` int(11) NOT NULL,
  `type` varchar(16) NOT NULL,
  `date` varchar(24) NOT NULL,
  `name` varchar(24) NOT NULL,
  `reason` varchar(32) NOT NULL,
  `data` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 ROW_FORMAT=COMPRESSED;

--
-- Дамп данных таблицы `aclogs`
--

INSERT INTO `aclogs` (`id`, `type`, `date`, `name`, `reason`, `data`) VALUES
(1, 'panellog', '10-7-2022', 'Alexey_Vernetto', '[kick] speed diff #2', '19:25:15 | 85.140.92.95 | 2 | 87 | 0.0'),
(2, 'panellog', '10-7-2022', 'Alexey_Vernetto', '[kick] over speed', '19:25:15 | 85.140.92.95 | 2 | 87 | 0.0'),
(3, 'panellog', '14-1-2023', 'Kichiro_Hirutomi', '[kick] over speed', '0:40:16 | 146.120.199.110 | 2 | 105 | 0.0'),
(4, 'panellog', '14-1-2023', 'Kichiro_Hirutomi', '[kick] speed diff #2', '0:40:22 | 146.120.199.110 | 2 | 106 | 0.0'),
(5, 'panellog', '14-1-2023', 'Conor', '[kick] speed diff #2', '0:55:12 | 146.120.199.110 | 2 | 96 | 0.0'),
(6, 'panellog', '14-1-2023', 'Conor', '[kick] over speed', '0:55:21 | 146.120.199.110 | 2 | 96 | 0.0'),
(7, 'panellog', '14-1-2023', 'Conor', '[kick] speed diff #2', '1:3:55 | 146.120.199.110 | 2 | 100 | 0.0'),
(8, 'panellog', '4-2-2023', 'kristen', '[kick] speed diff #2', '21:50:44 | 37.212.21.161 | 2 | 144 | 6.673'),
(9, 'panellog', '6-2-2023', 'Leo_Clemente', '[kick] over speed', '16:9:23 | 85.140.93.144 | 2 | 56 | 0.025');

-- --------------------------------------------------------

--
-- Структура таблицы `action_log`
--

CREATE TABLE `action_log` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `type` int(11) NOT NULL,
  `description` varchar(128) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `action_log`
--

INSERT INTO `action_log` (`id`, `acc_id`, `uip`, `type`, `description`, `time`) VALUES
(1, 5, '85.140.93.165', 3, 'Смотрит список администрации', 1675438438),
(2, 5, '85.140.93.165', 3, 'Установил Leo_Clemente[acc:5] скин 62', 1675439133),
(3, 5, '85.140.93.165', 10, 'Выдал Leo_Clemente[acc:5] 400 руб', 1675439146),
(4, 5, '85.140.93.165', 10, 'Выдал Leo_Clemente[acc:5] 30002 руб', 1675439197),
(5, 5, '85.140.93.165', 3, 'Смотрит список администрации', 1675451245),
(6, 5, '85.140.93.209', 5, 'Назначил Leo_Clemente[acc:5] лидером Отдел полиции №1 (ГИБДД)[5]', 1675535443),
(7, 5, '85.140.93.209', 3, 'Использует меню телепортов', 1675535788),
(8, 5, '85.140.93.209', 5, 'Назначил Leo_Clemente[acc:5] лидером Отдел полиции №1 (ГИБДД)[5]', 1675536239),
(9, 5, '85.140.93.209', 3, 'Телепортировался к Leo_Clemente[acc:5] его авто', 1675536335),
(10, 5, '85.140.93.209', 3, 'Телепортировал к себе kristen[acc:8]', 1675536571),
(11, 5, '85.140.93.209', 3, 'Телепортировал к себе Mance_Playy[acc:9]', 1675536610),
(12, 5, '85.140.93.209', 3, 'Телепортировал к себе Restrari_Restrari[acc:10]', 1675536626),
(13, 5, '85.140.93.209', 3, 'Телепортировал к себе Restrari_Restrari[acc:10]', 1675536631),
(14, 5, '85.140.93.209', 3, 'Телепортировал к себе Restrari_Restrari[acc:10]', 1675536635),
(15, 5, '85.140.93.209', 3, 'Телепортировал к себе Restrari_Restrari[acc:10]', 1675536639),
(16, 5, '85.140.93.209', 10, 'Поставил kristen[acc:8] на пост администратора', 1675536668),
(17, 5, '85.140.93.209', 10, 'Поставил Mance_Playy[acc:9] на пост администратора', 1675536674),
(18, 5, '85.140.93.209', 10, 'Поставил Restrari_Restrari[acc:10] на пост администратора', 1675536676),
(19, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 2', 1675536691),
(20, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 3', 1675536693),
(21, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 4', 1675536694),
(22, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 5', 1675536696),
(23, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 6', 1675536697),
(24, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 7', 1675536699),
(25, 5, '85.140.93.209', 10, 'Повысил kristen[acc:8] до адм. уровня 8', 1675536701),
(26, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 2', 1675536704),
(27, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 3', 1675536706),
(28, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 4', 1675536708),
(29, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 5', 1675536709),
(30, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 6', 1675536710),
(31, 8, '37.212.21.161', 1, 'пасибо сладкий', 1675536711),
(32, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 7', 1675536714),
(33, 5, '85.140.93.209', 10, 'Повысил Mance_Playy[acc:9] до адм. уровня 8', 1675536716),
(34, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 2', 1675536720),
(35, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 3', 1675536722),
(36, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 4', 1675536724),
(37, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 5', 1675536726),
(38, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 6', 1675536727),
(39, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 7', 1675536729),
(40, 5, '85.140.93.209', 10, 'Повысил Restrari_Restrari[acc:10] до адм. уровня 8', 1675536730),
(41, 10, '95.215.249.85', 3, 'Телепортировался к Leo_Clemente[acc:5]', 1675536906),
(42, 8, '37.212.21.161', 3, 'Подбросил kristen[acc:8]', 1675536992),
(43, 8, '37.212.21.161', 3, 'Подбросил kristen[acc:8]', 1675537015),
(44, 8, '37.212.21.161', 1, 'КОРЫТА НИХУЯ НЕ ЕДИТ', 1675537081),
(45, 8, '37.212.21.161', 3, 'Установил время 12:00 на сервере', 1675537097),
(46, 8, '37.212.21.161', 3, 'Установил время 12:00 на сервере', 1675537149),
(47, 5, '85.140.93.209', 3, 'Телепортировался к kristen[acc:8]', 1675537155),
(48, 8, '37.212.21.161', 3, 'Выдал Leo_Clemente[acc:5] скин 99', 1675537173),
(49, 8, '37.212.21.161', 3, 'Выдал kristen[acc:8] скин 99', 1675537185),
(50, 8, '37.212.21.161', 3, 'Зареспавнил весь незанятый транспорт', 1675537306),
(51, 8, '37.212.21.161', 3, 'Зареспавнил весь незанятый транспорт', 1675537309),
(52, 10, '95.215.249.85', 1, 'какой у меня ID скажи плз я со сборки сижу хуйны ебаная не вижу', 1675538440),
(53, 5, '85.140.93.209', 1, '1', 1675538477),
(54, 10, '95.215.249.85', 3, 'Выдал Restrari_Restrari[acc:10] скин 103', 1675538495),
(55, 10, '95.215.249.85', 5, 'Взял временное лидерство Арзамасская ОПГ[8]', 1675538791),
(56, 10, '95.215.249.85', 1, 'завтра ещё будет?', 1675538832),
(57, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675538963),
(58, 10, '95.215.249.85', 3, 'Выдал Restrari_Restrari[acc:10] скин 241', 1675543097),
(59, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675543149),
(60, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543231),
(61, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543233),
(62, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543234),
(63, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543236),
(64, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543239),
(65, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543240),
(66, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543242),
(67, 10, '95.215.249.85', 10, 'Выдал Restrari_Restrari[acc:10] 10000000 руб', 1675543245),
(68, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675543405),
(69, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675543416),
(70, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675543440),
(71, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675543493),
(72, 8, '37.212.21.161', 3, 'Подбросил kristen[acc:8]', 1675543604),
(73, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547461),
(74, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547527),
(75, 10, '95.215.249.85', 3, 'Установил Temik_Simonov[acc:11] уровень здоровья на 100', 1675547562),
(76, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547568),
(77, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547571),
(78, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547576),
(79, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547580),
(80, 10, '95.215.249.85', 3, 'Выдал Temik_Simonov[acc:11] скин 102', 1675547618),
(81, 10, '95.215.249.85', 3, 'Выдал Temik_Simonov[acc:11] лицензию 3', 1675547705),
(82, 10, '95.215.249.85', 10, 'Выдал Temik_Simonov[acc:11] 10000 руб', 1675547727),
(83, 10, '95.215.249.85', 10, 'Выдал Temik_Simonov[acc:11] 100000 руб', 1675547731),
(84, 10, '95.215.249.85', 10, 'Выдал Temik_Simonov[acc:11] 100000 руб', 1675547733),
(85, 10, '95.215.249.85', 10, 'Выдал Temik_Simonov[acc:11] 10000000 руб', 1675547739),
(86, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675547751),
(87, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547814),
(88, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547826),
(89, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547828),
(90, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547836),
(91, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675547848),
(92, 10, '95.215.249.85', 3, 'Телепортировался к Temik_Simonov[acc:11]', 1675547953),
(93, 10, '95.215.249.85', 3, 'Подбросил Temik_Simonov[acc:11]', 1675547982),
(94, 10, '95.215.249.85', 3, 'Подбросил Temik_Simonov[acc:11]', 1675547983),
(95, 10, '95.215.249.85', 3, 'Подбросил Temik_Simonov[acc:11]', 1675547984),
(96, 10, '95.215.249.85', 3, 'Установил Temik_Simonov[acc:11] уровень здоровья на 0', 1675548048),
(97, 10, '95.215.249.85', 3, 'Установил Temik_Simonov[acc:11] уровень здоровья на 0', 1675548052),
(98, 10, '95.215.249.85', 3, 'Посадил в тюрьму Temik_Simonov[acc:11] на 30 мин. Причина: Отстань', 1675548066),
(99, 10, '95.215.249.85', 3, 'Выпустил из тюрьмы Temik_Simonov[acc:11]', 1675548086),
(100, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675548100),
(101, 10, '95.215.249.85', 3, 'Выдал Temik_Simonov[acc:11] скин 102', 1675548115),
(102, 10, '95.215.249.85', 3, 'Выдал Temik_Simonov[acc:11] скин 103', 1675548120),
(103, 10, '95.215.249.85', 3, 'Заспавнил Temik_Simonov[acc:11]', 1675548190),
(104, 10, '95.215.249.85', 3, 'Заспавнил Temik_Simonov[acc:11]', 1675548198),
(105, 10, '95.215.249.85', 3, 'Телепортировал к себе Temik_Simonov[acc:11]', 1675548225),
(106, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675548247),
(107, 10, '95.215.249.85', 3, 'Заспавнил Temik_Simonov[acc:11]', 1675548262),
(108, 9, '109.248.253.215', 3, 'Использует меню телепортов', 1675607620),
(109, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675609463),
(110, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675609465),
(111, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675609466),
(112, 10, '95.215.249.85', 3, 'Использует меню телепортов', 1675610663),
(113, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675615614),
(114, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675615616),
(115, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675615618),
(116, 10, '95.215.249.85', 3, 'Подбросил Restrari_Restrari[acc:10]', 1675615619),
(117, 10, '95.215.249.85', 3, 'Следит за Leo_Clemente[acc:5]', 1675615633),
(118, 5, '85.140.93.118', 3, 'Смотрит список администрации', 1675616360),
(119, 5, '85.140.93.144', 3, 'Зареспавнил весь незанятый транспорт', 1675692199),
(120, 5, '85.140.93.144', 3, 'Зареспавнил весь незанятый транспорт', 1675692239),
(121, 5, '85.140.93.144', 3, 'Телепортировался к Lev_Clemente[acc:13]', 1675696392),
(122, 5, '85.140.93.144', 10, 'Поставил Lev_Clemente[acc:13] на пост администратора', 1675696405),
(123, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 2', 1675696871),
(124, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 3', 1675696873),
(125, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 4', 1675696874),
(126, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 5', 1675696876),
(127, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 6', 1675696877),
(128, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 7', 1675696878),
(129, 5, '85.140.93.144', 10, 'Повысил Lev_Clemente[acc:13] до адм. уровня 8', 1675696880),
(130, 13, '85.140.93.144', 3, 'Выдал Lev_Clemente[acc:13] скин 78', 1675696883),
(131, 13, '85.140.93.144', 3, 'Выдал Lev_Clemente[acc:13] скин 79', 1675696885),
(132, 13, '85.140.93.144', 3, 'Выдал Lev_Clemente[acc:13] скин 78', 1675696887),
(133, 13, '85.140.93.144', 3, 'Телепортировался к Leo_Clemente[acc:5]', 1675697096),
(134, 13, '85.140.93.144', 3, 'Телепортировал к себе Leo_Clemente[acc:5]', 1675697209),
(135, 13, '85.140.93.144', 3, 'Использует меню телепортов', 1675697715),
(136, 13, '85.140.93.144', 3, 'Заспавнил Lev_Clemente[acc:13]', 1675697731),
(137, 13, '85.140.93.144', 3, 'Использует меню телепортов', 1675698984),
(138, 13, '85.140.93.144', 3, 'Использует меню телепортов', 1675699023),
(139, 13, '85.140.93.144', 10, 'Выдал Lev_Clemente[acc:13] 500000 руб', 1675699496),
(140, 10, '95.215.249.85', 1, 'Саламчик', 1675699674);

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts`
--

CREATE TABLE `bank_accounts` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `name` varchar(21) NOT NULL DEFAULT 'None',
  `balance` int(11) NOT NULL,
  `pin` varchar(9) NOT NULL DEFAULT '0000',
  `reg_time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts_log`
--

CREATE TABLE `bank_accounts_log` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `description` varchar(64) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `ban_list`
--

CREATE TABLE `ban_list` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `time` int(11) NOT NULL,
  `ban_time` int(11) NOT NULL,
  `ip` varchar(16) NOT NULL,
  `description` varchar(32) NOT NULL,
  `admin` varchar(24) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `business`
--

CREATE TABLE `business` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `improvements` int(11) NOT NULL,
  `products` int(11) NOT NULL,
  `prod_price` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `interior` int(11) NOT NULL,
  `enter_price` int(11) NOT NULL,
  `enter_music` int(11) NOT NULL,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL,
  `eviction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `business`
--

INSERT INTO `business` (`id`, `owner_id`, `name`, `improvements`, `products`, `prod_price`, `balance`, `rent_time`, `price`, `rent_price`, `type`, `interior`, `enter_price`, `enter_music`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `eviction`) VALUES
(1, 0, '', 6, 0, 0, 33402400, 0, 1000000, 10000, 1, 0, 100, 0, 0, 171.947, 738.35, 12.752, 173.823, 737.331, 12.2488, 248.735, 0),
(2, 0, '', 6, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 1000, 4, 0, 60.0766, 396.429, 10.0043, 58.504, 397.444, 10.0043, 59.243, 0),
(3, 0, '', 1, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 777, 1, 0, 112.167, 476.68, 11.3836, 110.703, 474.769, 11.3836, 147.446, 0),
(4, 0, '', 6, 0, 0, 36560350, 0, 1000000, 10000, 1, 0, 100, 1, 0, 400.058, 965.637, 12.2467, 398.435, 966.38, 12.0023, 66.9036, 0),
(5, 0, '', 6, 0, 0, 33218900, 0, 1000000, 10000, 1, 0, 5000, 4, 0, -288.961, 955.923, 12.641, -288.66, 958.372, 12.3608, 0.675795, 0),
(6, 0, '', 0, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 222, 0, 0, 1867.87, 1383.13, 9.75565, 1869.58, 1382.87, 9.75565, 271.06, 0),
(7, 0, '', 6, 0, 0, 36610120, 0, 1000000, 10000, 1, 0, 5000, 0, 0, -310.214, 447.576, 13.1093, -313.346, 448.362, 12.764, 83.3864, 0),
(8, 0, '', 6, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 0, 0, 0, 101.818, 812.641, 12.0526, 102.391, 814.185, 12.0294, 336.361, 0),
(9, 0, '', 6, 0, 0, 33429380, 0, 1000000, 10000, 1, 0, 1000, 0, 0, 12.9781, 911.011, 12.1456, 15.0025, 909.071, 12.1446, 223.424, 0),
(10, 0, '', 6, 0, 0, 36276575, 0, 1000000, 10000, 1, 0, 5000, 0, 0, 300.335, 1784.18, 12.2164, 299.938, 1781.41, 12.0283, 175.695, 0),
(11, 0, '', 6, 0, 0, 33558850, 0, 1000000, 10000, 1, 0, 5000, 0, 0, 2260.83, -2106.94, 21.9609, 2258.81, -2106.68, 21.9609, 92.9546, 0),
(12, 0, '', 6, 0, 0, 36348280, 0, 1000000, 10000, 1, 0, 5000, 2, 0, -541.443, 1303.49, 20.8908, -541.018, 1305.45, 20.7349, 340.589, 0),
(13, 0, '', 6, 0, 0, 36632700, 0, 1000000, 10000, 1, 0, 5000, 3, 0, -346.027, 956.11, 12.641, -345.697, 958.087, 12.6123, 0.079129, 0),
(14, 0, '', 6, 0, 0, 33556392, 0, 1000000, 10000, 1, 0, 4999, 2, 0, 302.682, 1664.82, 11.9978, 304.155, 1665.28, 11.9978, 307.751, 0),
(15, 0, '', 0, 0, 0, 33483410, 0, 1000000, 10000, 1, 0, 2000, 0, 0, 2353.48, -749.338, 14.9546, 2351.78, -749.508, 14.5062, 185.481, 0),
(16, 0, '', 0, 0, 0, 1479980, 0, 1000000, 10000, 1, 0, 100, 0, 0, 203.583, 828.749, 13.3807, 202.873, 827.412, 12.9522, 163.695, 0),
(17, 0, '', 6, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 4999, 1, 0, 2554.66, -2206.4, 22.4537, 2554.58, -2204.34, 22.4537, 351.582, 0),
(18, 0, '', 6, 0, 0, 33578200, 0, 1000000, 10000, 1, 0, 5000, 0, 0, -2232.54, 224.344, 24.5139, -2232.67, 222.646, 24.5161, 173.907, 0),
(19, 0, '', 6, 0, 0, 33387840, 0, 1000000, 10000, 1, 0, 500, 0, 0, -2241.98, 224.805, 24.7783, -2242.55, 222.827, 24.5109, 173.613, 1),
(20, 0, '', 6, 0, 0, 33432658, 0, 1000000, 10000, 1, 0, 777, 0, 0, -359.958, 1025, 13.2453, -362.989, 1024.73, 13.2443, 94.9952, 0),
(21, 0, '', 6, 0, 0, 36594210, 0, 1000000, 10000, 1, 0, 20, 0, 0, 1950.08, 1905.8, 15.4875, 1952.25, 1906.03, 15.518, 269.783, 0),
(22, 0, '', 6, 0, 0, 51950000, 0, 5000000, 50000, 3, 2, 5000, 5, 0, 649.614, 654.42, 12.1855, 648.913, 652.386, 12.1395, 159.377, 0),
(23, 0, '', 6, 0, 0, 51950000, 0, 5000000, 50000, 4, 3, 100, 0, 0, 2450.39, -1903.5, 22.0114, 2453.14, -1903.42, 21.9839, 269.949, 0),
(24, 0, '', 6, 0, 0, 36681400, 0, 5000000, 50000, 5, 4, 0, 0, 0, 145.761, 673.122, 12.763, 144.949, 671.425, 12.7593, 159.2, 0),
(25, 0, '', 6, 0, 0, 644000, 0, 5000000, 50000, 5, 4, 4444, 4, 0, 253.786, 1055.1, 12.1645, 257.209, 1054.67, 12.1697, 262.488, 0),
(26, 0, '', 6, 0, 0, 34438600, 0, 5000000, 50000, 5, 4, 5000, 0, 0, 2260.83, -2099.92, 21.9609, 2258.88, -2099.99, 21.9609, 89.9466, 1),
(56, 0, '', 6, 0, 0, 23139500, 0, 300000, 0, 1, 0, 1000, 0, 0, 1945.7, 2069.13, 16.1989, 1946.27, 2065.99, 15.7053, 193.853, 0),
(27, 0, '', 6, 0, 0, 33783400, 0, 5000000, 50000, 5, 4, 5000, 0, 0, 131.729, 662.958, 12.7598, 134.643, 661.798, 12.7598, 250.025, 0),
(28, 0, '', 6, 0, 0, 33689000, 0, 5000000, 50000, 5, 4, 5000, 5, 0, -2157.92, 115.127, 26.1419, -2155.03, 116.676, 26.3275, 291.534, 0),
(29, 0, '', 6, 0, 0, 51950000, 0, 5000000, 50000, 5, 4, 100, 0, 0, -2550.97, 2937.42, 38.1288, -2550.85, 2934.69, 37.634, 180.27, 0),
(30, 0, '', 0, 0, 0, 36646400, 0, 5000000, 50000, 5, 4, 100, 0, 0, 384.431, 931.001, 12.2302, 381.981, 931.703, 12.0023, 71.1223, 0),
(31, 0, '', 0, 0, 0, 51950000, 0, 5000000, 50000, 6, 5, 5000, 0, 0, -112.497, 986.783, 12.7591, -112.828, 984.11, 12.7591, 178.972, 0),
(32, 0, '', 0, 0, 0, 51950000, 0, 5000000, 50000, 6, 5, 5000, 0, 0, 2412.4, -1841.73, 22.9498, 2412.38, -1844.08, 21.961, 179.265, 0),
(33, 0, '', 0, 0, 0, 51950000, 0, 5000000, 50000, 6, 5, 0, 0, 0, 177.708, 491.215, 13.1466, 174.941, 493.417, 13.1466, 60.9921, 0),
(34, 0, '', 6, 0, 0, 51950000, 0, 5800000, 58000, 7, 6, 100, 0, 0, -2243.72, 263.255, 24.5391, -2243.12, 264.799, 24.5391, 348.489, 0),
(35, 0, '', 6, 0, 0, 51950000, 0, 10150000, 101500, 7, 6, 5000, 0, 0, 2494.82, -718.345, 12.3706, 2495.4, -721.815, 12.3315, 11.8428, 0),
(36, 0, '', 6, 0, 0, 51950000, 0, 6150000, 61500, 7, 6, 5000, 0, 0, 1763.43, 2251.93, 15.864, 1763.33, 2253.68, 15.8643, 358.806, 0),
(37, 0, '', 6, 0, 0, 51950000, 0, 8200000, 82000, 7, 6, 4444, 4, 0, 1410.86, 460.272, 13.163, 1409.41, 457.428, 13.163, 146.915, 0),
(38, 0, '', 0, 20, 200, 0, 1673654400, 12000000, 120000, 8, 7, 5000, 0, 0, 1333.49, 2372.6, 17.6642, 1333.63, 2368.66, 17.6642, 181.583, 0),
(39, 0, '', 0, 0, 0, 36570000, 0, 4620000, 46200, 9, 8, 5000, 0, 0, 380.035, 918.528, 12.0023, 378.57, 919.394, 12.0023, 65.5253, 0),
(57, 0, '', 0, 0, 0, 35912000, 0, 700000, 0, 5, 0, 4444, 0, 0, 1921.68, 2092.95, 16.1989, 1918.57, 2093.3, 15.7053, 85.5835, 0),
(58, 0, '', 6, 0, 0, 36576900, 0, 1000000, 0, 1, 0, 0, 2, 0, 1839.76, 2191.35, 15.5671, 1842.68, 2191.77, 15.6422, 270.86, 0),
(60, 0, '', 6, 0, 0, 15517520, 0, 1000000, 0, 1, 0, 4090, 0, 0, 256.405, 680.098, 12, 255.08, 677.186, 12, 148.226, 0),
(61, 0, '', 0, 0, 0, 0, 0, 50000000, 0, 10, 9, 0, 0, 0, 1852.64, 2199.57, 15.9025, 1852.79, 2197.02, 15.9068, 172.541, 0),
(62, 0, '', 6, 0, 0, 33415450, 0, 5000000, 0, 1, 0, 5000, 0, 0, -502.044, 1272.12, 20.8908, -499.594, 1271.24, 20.7424, 61.7039, 0),
(63, 0, '', 6, 0, 0, 33546570, 0, 3000000, 0, 1, 0, 3500, 0, 0, -5.06985, 911.411, 12.002, -6.80267, 907.861, 12.002, 325.228, 0),
(65, 0, '', 6, 0, 0, 51950000, 0, 50000000, 0, 10, 0, 0, 0, 0, 367.578, 845.433, 12.1789, 0, 0, 0, 0, 0),
(64, 0, '', 6, 0, 0, 51950000, 0, 500000000, 0, 5, 0, 3000, 0, 0, -510.637, -1628.02, 40.8817, -505.794, -1628.36, 40.9692, 115.701, 0),
(66, 0, '', 0, 0, 0, 51950000, 0, 50000000, 0, 11, 0, 0, 0, 0, 219.359, 416.856, 11.5371, 223.043, 415.368, 11.2402, 67.0849, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `business_gps`
--

CREATE TABLE `business_gps` (
  `id` int(11) NOT NULL,
  `bid` int(11) NOT NULL,
  `pos` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `business_gps`
--

INSERT INTO `business_gps` (`id`, `bid`, `pos`, `time`) VALUES
(87, 43, 0, 1614078832),
(66, 33, 0, 1613794201);

-- --------------------------------------------------------

--
-- Структура таблицы `business_profit`
--

CREATE TABLE `business_profit` (
  `id` int(11) NOT NULL,
  `bid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL,
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `car_obmen`
--

CREATE TABLE `car_obmen` (
  `car_1` int(11) NOT NULL DEFAULT 5,
  `car_2` int(11) NOT NULL DEFAULT 5,
  `car_3` int(11) NOT NULL DEFAULT 5,
  `car_4` int(11) NOT NULL DEFAULT 5,
  `car_5` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `change_names`
--

CREATE TABLE `change_names` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(21) NOT NULL,
  `time` int(11) NOT NULL,
  `ip` varchar(16) NOT NULL DEFAULT '255.255.255.255'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `charity`
--

CREATE TABLE `charity` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `charity`
--

INSERT INTO `charity` (`id`, `uid`, `money`, `time`) VALUES
(1, 150, 100000, 1613044031),
(2, 131, 1000000000, 1613045505),
(3, 272, 50, 1613058578),
(4, 339, 100, 1613060795),
(5, 32, 10000000, 1613749239),
(6, 418, 100000, 1613810348),
(7, 23, 1, 1613823985),
(8, 121, 5000000, 1613836371),
(9, 121, 10000000, 1613836417),
(10, 376, 1000000, 1613848338),
(11, 376, 1000000, 1613848393),
(12, 376, 1000000, 1613848407),
(13, 376, 1000000, 1613848416),
(14, 376, 900000000, 1613849366),
(15, 376, 1000000000, 1613849428),
(16, 376, 1000000000, 1613849503),
(17, 376, 1000000000, 1613849540),
(18, 57, 50000000, 1613857659),
(19, 389, 1, 1613908036),
(20, 142, 10000, 1613911244),
(21, 111, 50000000, 1613920977),
(22, 437, 10000000, 1613935503),
(23, 276, 1, 1613938618),
(24, 548, 10000000, 1613948859),
(25, 851, 10000, 1613977620),
(26, 361, 6000, 1613995622),
(27, 749, 10000000, 1613997569),
(28, 682, 100000001, 1614007367),
(29, 75, 1000000000, 1614014839),
(30, 670, 100000000, 1614015711),
(31, 218, 100000, 1614081014),
(32, 1328, 50000000, 1614113112),
(33, 1302, 10000000, 1614146212),
(34, 1471, 100000000, 1614166375),
(35, 1311, 50000, 1614174011),
(36, 1311, 1000000, 1614174035),
(37, 1941, 100000000, 1614181196),
(38, 1950, 1000000, 1614182774),
(39, 1796, 5000, 1614192206),
(40, 2166, 1, 1614197141),
(41, 572, 50000000, 1614197664),
(42, 1303, 1, 1614205627),
(43, 2237, 5000000, 1614208109),
(44, 2237, 100000000, 1614208157),
(45, 2381, 500, 1614246318),
(46, 2381, 1000000, 1614246349),
(47, 2172, 2000000, 1614256689),
(48, 2172, 8, 1614278499),
(49, 2287, 500000, 1614349017),
(50, 2866, 1000000, 1614357795),
(51, 2077, 10, 1614376458),
(52, 2199, 160000000, 1614398261),
(53, 2934, 1, 1614411008),
(54, 2934, 1000000, 1614411028),
(55, 3042, 10000000, 1614417011),
(56, 95, 103, 1614425686),
(57, 2320, 1, 1614460454),
(58, 3124, 1000000, 1614466341),
(59, 363, 100000000, 1614477721),
(60, 58, 1000000, 1614489312),
(61, 58, 1000000, 1614489347),
(62, 58, 10000000, 1614489381),
(63, 58, 100000000, 1614489435),
(64, 1001, 1, 1614505291),
(65, 1001, 100000, 1614505303),
(66, 1001, 10000000, 1614505316),
(67, 1001, 10000000, 1614505331),
(68, 3345, 440000, 1614507955),
(69, 3301, 10000000, 1614508053),
(70, 3403, 1000000, 1614516118),
(71, 1923, 100000, 1614518841);

-- --------------------------------------------------------

--
-- Структура таблицы `debug`
--

CREATE TABLE `debug` (
  `id` int(11) NOT NULL,
  `text` varchar(256) NOT NULL,
  `date` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `donate_log`
--

CREATE TABLE `donate_log` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) CHARACTER SET utf8 NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `donate` int(11) NOT NULL,
  `description` varchar(64) CHARACTER SET utf8 NOT NULL DEFAULT 'None'
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `donate_log`
--

INSERT INTO `donate_log` (`id`, `uid`, `uip`, `time`, `donate`, `description`) VALUES
(1, 7, '85.140.93.165', 1675457292, 900, 'None'),
(2, 5, '85.140.93.209', 1675535587, 900, 'None'),
(3, 5, '85.140.93.209', 1675535634, 900, 'None'),
(4, 5, '85.140.93.209', 1675537260, 2, 'акция'),
(5, 8, '37.212.21.161', 1675537260, 2, 'акция'),
(6, 10, '95.215.249.85', 1675548060, 2, 'акция'),
(7, 11, '85.26.234.133', 1675548060, 2, 'акция'),
(8, 5, '85.140.93.118', 1675616460, 2, 'акция'),
(9, 13, '85.140.93.118', 1675623660, 2, 'акция'),
(10, 5, '85.140.93.144', 1675695660, 2, 'акция');

-- --------------------------------------------------------

--
-- Структура таблицы `donations`
--

CREATE TABLE `donations` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `time` varchar(16) NOT NULL,
  `date` varchar(16) NOT NULL,
  `activated` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `entrances`
--

CREATE TABLE `entrances` (
  `id` int(11) NOT NULL,
  `floors` int(11) NOT NULL DEFAULT 2,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `entrances`
--

INSERT INTO `entrances` (`id`, `floors`, `pos_x`, `pos_y`, `pos_z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`) VALUES
(1, 2, -206.366, 1088.86, 12.3796, -208.692, 1088.88, 12.001, 92.0321),
(2, 2, -206.182, 1066.57, 12.3796, -209.008, 1066.7, 12.001, 85.9693),
(3, 2, -233.97, 1088.89, 12.3796, -236.59, 1089, 12.001, 86.0554),
(4, 2, -233.823, 1066.76, 12.3796, -236.6, 1066.77, 12.001, 93.4894),
(5, 2, 208.584, 1543.62, 12.1415, 210.681, 1543.23, 12, 258.441),
(6, 2, 215.227, 1577.16, 12.1359, 217.458, 1576.69, 12, 255.018),
(7, 2, 221.762, 1610.48, 12.1359, 224.114, 1610.06, 12, 260.391),
(8, 2, 276.996, 1544.6, 12.4547, 275.178, 1544.82, 12.3204, 81.5462),
(9, 2, 280.661, 1578.3, 12.4547, 278.794, 1578.4, 12.3204, 82.5096),
(10, 2, 284.298, 1612.4, 12.4547, 282.087, 1612.48, 12.3281, 84.5186),
(11, 2, 116.239, 903.97, 12.1778, 113.973, 904.706, 12, 67.9472),
(12, 2, 121.804, 919.435, 12.1778, 120.094, 920.067, 12, 68.284),
(13, 2, 121.804, 919.435, 12.1778, 120.094, 920.067, 12, 68.284),
(14, 2, 121.804, 919.435, 12.1778, 120.094, 920.067, 12, 68.284),
(15, 2, -293.359, 1029.92, 12.3796, -293.45, 1031.92, 12.1338, 357.257),
(16, 2, -271.129, 1029.77, 12.3796, -271.227, 1031.85, 12.1338, 359.929),
(17, 2, -222.309, 996.306, 12.3796, -222.276, 998.468, 12.001, 1.50558),
(18, 2, -244.601, 996.116, 12.3796, -244.597, 998.263, 12.001, 358.771),
(19, 2, -284.934, 1003.43, 12.3796, -284.936, 1005.8, 12.126, 1.43081),
(20, 2, -307.239, 1003.28, 12.3796, -307.282, 1005.29, 12.1338, 0),
(21, 2, -337.378, 1003.4, 12.1338, -337.347, 1005.21, 12.1338, 3.74481),
(22, 2, -359.588, 1003.29, 12.1338, -359.571, 1005.29, 12.1338, 0.342069),
(23, 2, -440.21, 996.475, 12.3796, -440.148, 998.643, 12.0842, 358.5),
(24, 2, -418.01, 996.221, 12.3796, -417.863, 998.654, 12.1416, 1.36802),
(25, 2, -179.345, 1066.68, 12.3796, -181.462, 1066.48, 12.001, 90.9827),
(26, 2, -179.345, 1088.97, 12.3796, -182.229, 1088.77, 12.001, 92.9487),
(27, 2, -179.344, 1038.63, 12.3796, -182.273, 1038.79, 12.001, 88.7893),
(28, 2, -179.486, 1016.41, 12.3796, -182.188, 1016.33, 12.001, 92.3221),
(29, 2, -183.44, 986.881, 12.3796, -183.168, 989.427, 12.001, 3.96131),
(30, 2, -205.569, 986.92, 12.3796, -205.645, 989.61, 12.001, 0.200768),
(31, 2, -2170.42, 129.625, 29.0623, -2168.4, 130.322, 29.0623, 291.64),
(32, 2, -2163.56, 112.12, 29.0623, -2161.59, 112.932, 29.0623, 292.422),
(33, 2, -2177.26, 147.085, 29.0623, -2175.31, 147.957, 29.0623, 293.52),
(34, 2, -2184.15, 164.668, 29.0623, -2182.24, 165.636, 29.0623, 289.602),
(35, 2, -2191.8, 184.197, 29.0623, -2189.77, 184.853, 29.0623, 292.58),
(36, 2, -2333.51, 275.676, 23.9369, -2330.17, 275.037, 23.9398, 257.665),
(37, 2, -2315.63, 307.423, 24.3226, -2312.13, 306.771, 24.3226, 261.239),
(38, 2, -2333.93, -129.574, 22.3804, -2332.25, -128.008, 22.0837, 319.377),
(39, 2, -2313.29, -147.343, 22.3804, -2311.28, -144.963, 22.2752, 320.134),
(40, 2, -2292.65, -165.115, 23.982, -2290.06, -162.262, 23.6853, 317.791),
(41, 2, -2272, -182.887, 23.982, -2270.19, -180.748, 23.6853, 321.54),
(42, 2, -2251.41, -200.46, 24.8179, -2250.44, -198.278, 24.404, 337.409),
(43, 2, -2226.71, -206.127, 24.982, -2226.3, -204.218, 24.6853, 348.376),
(44, 2, -2200.04, -211.315, 24.982, -2199.61, -209.41, 24.6853, 347.436),
(45, 2, -2173.2, -216.529, 24.982, -2172.79, -214.718, 24.6853, 351.196),
(46, 2, -2153.6, -201.608, 26.1929, -2155.42, -201.164, 25.8884, 82.33);

-- --------------------------------------------------------

--
-- Структура таблицы `family`
--

CREATE TABLE `family` (
  `id` int(11) NOT NULL,
  `name` varchar(64) CHARACTER SET utf8 NOT NULL,
  `u_id` int(11) NOT NULL,
  `time` int(11) NOT NULL,
  `color` int(11) NOT NULL,
  `level` int(11) NOT NULL,
  `exp` int(11) NOT NULL,
  `rank1` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank2` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank3` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank4` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank5` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank6` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank7` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank8` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank9` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank10` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `money` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `tree` int(11) NOT NULL,
  `metal` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `house_id` int(11) NOT NULL DEFAULT -1,
  `score` int(11) NOT NULL,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `pos_fa` float NOT NULL,
  `inter` float NOT NULL,
  `world` float NOT NULL,
  `r_TakeMoney` int(11) NOT NULL,
  `r_TakeDrugs` int(11) NOT NULL,
  `r_TakeMetall` int(11) NOT NULL,
  `r_TakeAmmo` int(11) NOT NULL,
  `r_Inv` int(11) NOT NULL,
  `r_UnInv` int(11) NOT NULL,
  `r_Mute` int(11) NOT NULL,
  `r_UnMute` int(11) NOT NULL,
  `r_Warn` int(11) NOT NULL,
  `r_UnWarn` int(11) NOT NULL,
  `r_GiveRang` int(11) NOT NULL,
  `family_cars` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Структура таблицы `family_cars`
--

CREATE TABLE `family_cars` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `color_1` int(11) NOT NULL,
  `color_2` int(11) NOT NULL,
  `rang` int(11) NOT NULL,
  `pos_x` int(11) NOT NULL,
  `pos_y` int(11) NOT NULL,
  `pos_z` int(11) NOT NULL,
  `angle` int(11) NOT NULL,
  `fuel` int(11) NOT NULL DEFAULT 50,
  `create_time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `fuel_stations`
--

CREATE TABLE `fuel_stations` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL DEFAULT 'None',
  `improvements` int(11) NOT NULL,
  `fuels` int(11) NOT NULL,
  `fuel_price` int(11) NOT NULL,
  `buy_fuel_price` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `eviction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `fuel_stations`
--

INSERT INTO `fuel_stations` (`id`, `owner_id`, `name`, `improvements`, `fuels`, `fuel_price`, `buy_fuel_price`, `balance`, `rent_time`, `price`, `rent_price`, `lock`, `x`, `y`, `z`, `eviction`) VALUES
(11, 0, 'Заправочная станция', 4, 1000, 3, 10, 10034575, 0, 90000000, 9000, 0, 2877.87, 541.919, 26.3542, 0),
(10, 0, 'Заправочная станция', 0, 1000, 3, 0, 11523225, 0, 90000000, 9000, 0, 2674.46, 2616.66, 16.9724, 0),
(9, 0, 'Заправочная станция', 0, 1000, 3, 0, 28860735, 0, 100000000, 10000, 0, 2245.21, -1784.98, 21.7109, 0),
(8, 0, 'Заправочная станция', 4, 1000, 3, 10, 66322550, 0, 90000000, 9000, 0, 2368.07, -766.732, 14.0431, 0),
(7, 0, 'Заправочная станция', 4, 1000, 3, 0, 9697210, 0, 90000000, 9000, 0, -890.503, 1486.84, 27.4242, 0),
(14, 0, 'None', 4, 1000, 3, 0, 58078200, 0, 1000000, 10000, 0, -537.518, 1315.61, 20.7424, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `fuel_stations_profit`
--

CREATE TABLE `fuel_stations_profit` (
  `id` int(11) NOT NULL,
  `fid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL,
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `full_dostup`
--

CREATE TABLE `full_dostup` (
  `id` int(11) NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `full_dostup`
--

INSERT INTO `full_dostup` (`id`, `name`) VALUES
(5, 'Leo_Clemente');

-- --------------------------------------------------------

--
-- Структура таблицы `gang_repositories`
--

CREATE TABLE `gang_repositories` (
  `id` int(11) NOT NULL,
  `metall` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `lock` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `gang_repositories`
--

INSERT INTO `gang_repositories` (`id`, `metall`, `ammo`, `drugs`, `money`, `lock`) VALUES
(1, 2000, 10000, 500, 20000, 1),
(2, 2000, 10000, 500, 20000, 1),
(3, 2000, 10000, 500, 20000, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `gang_zones`
--

CREATE TABLE `gang_zones` (
  `id` int(11) NOT NULL,
  `min_x` float NOT NULL,
  `min_y` float NOT NULL,
  `max_x` float NOT NULL,
  `max_y` float NOT NULL,
  `fraction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `gang_zones`
--

INSERT INTO `gang_zones` (`id`, `min_x`, `min_y`, `max_x`, `max_y`, `fraction`) VALUES
(1, -2667, 149, -2567, 249, 3),
(2, -2567, 149, -2467, 249, 3),
(3, -2467, 149, -2367, 249, 3),
(4, -2367, 149, -2267, 249, 3),
(5, -2267, 149, -2167, 249, 3),
(6, -2167, 149, -2067, 249, 3),
(7, -2167, 49, -2067, 149, 3),
(8, -2267, 49, -2167, 149, 3),
(9, -2367, 49, -2267, 149, 3),
(10, -2467, 49, -2367, 149, 3),
(11, -2567, 49, -2467, 149, 3),
(12, -2667, 49, -2567, 149, 3),
(13, -2667, -51, -2567, 49, 3),
(14, -2567, -51, -2467, 49, 3),
(15, -2467, -51, -2367, 49, 3),
(16, -2367, -51, -2267, 49, 3),
(17, -2267, -51, -2167, 49, 3),
(18, -2167, -51, -2067, 49, 3),
(19, -2167, -151, -2067, -51, 3),
(20, -2267, -151, -2167, -51, 3),
(21, -2367, -151, -2267, -51, 3),
(22, -2467, -151, -2367, -51, 3),
(23, -2567, -151, -2467, -51, 3),
(24, -2667, -151, -2567, -51, 3),
(25, -2667, -251, -2567, -151, 3),
(26, -2567, -251, -2467, -151, 3),
(27, -2467, -251, -2367, -151, 3),
(28, -2367, -251, -2267, -151, 3),
(29, -2267, -251, -2167, -151, 3),
(30, -2167, -251, -2067, -151, 1),
(31, 1974, 2007, 2074, 2107, 1),
(32, 1874, 2007, 1974, 2107, 1),
(33, 1774, 2007, 1874, 2107, 1),
(34, 1674, 2007, 1774, 2107, 1),
(35, 1574, 2007, 1674, 2107, 1),
(36, 1574, 2107, 1674, 2207, 2),
(37, 1674, 2107, 1774, 2207, 2),
(38, 1774, 2107, 1874, 2207, 2),
(39, 1874, 2107, 1974, 2207, 1),
(40, 1974, 2107, 2074, 2207, 1),
(41, 1974, 2207, 2074, 2307, 1),
(42, 1874, 2207, 1974, 2307, 1),
(43, 1774, 2207, 1874, 2307, 1),
(44, 1674, 2207, 1774, 2307, 1),
(45, 1574, 2207, 1674, 2307, 1),
(46, 1574, 2307, 1674, 2407, 1),
(47, 1674, 2307, 1774, 2407, 1),
(48, 1774, 2307, 1874, 2407, 1),
(49, 1874, 2307, 1974, 2407, 1),
(50, 1974, 2307, 2074, 2407, 1),
(51, 1974, 2407, 2074, 2507, 1),
(52, 1874, 2407, 1974, 2507, 1),
(53, 1774, 2407, 1874, 2507, 1),
(54, 1674, 2407, 1774, 2507, 1),
(55, 1574, 2407, 1674, 2507, 1),
(56, 1574, 2507, 1674, 2607, 1),
(57, 1674, 2507, 1774, 2607, 1),
(58, 1774, 2507, 1874, 2607, 3),
(59, 1874, 2507, 1974, 2607, 3),
(60, 1974, 2507, 2074, 2607, 2),
(61, 1751, -311, 1851, -211, 2),
(62, 1751, -411, 1851, -311, 3),
(63, 1651, -411, 1751, -311, 3),
(64, 1651, -311, 1751, -211, 1),
(65, 1551, -311, 1651, -211, 2),
(66, 1551, -411, 1651, -311, 2),
(67, 1451, -411, 1551, -311, 2),
(68, 1451, -311, 1551, -211, 3),
(69, 981, -265, 1081, -165, 3),
(70, 981, -365, 1081, -265, 0),
(71, 981, -465, 1081, -365, 3),
(72, 881, -465, 981, -365, 1),
(73, 881, -365, 981, -265, 1),
(74, 881, -265, 981, -165, 1),
(75, 781, -265, 881, -165, 1),
(76, 781, -365, 881, -265, 1),
(77, 781, -465, 881, -365, 0),
(78, 681, -465, 781, -365, 1),
(79, 681, -365, 781, -265, 1),
(80, 681, -265, 781, -165, 0),
(81, 581, -265, 681, -165, 3),
(82, 581, -365, 681, -265, 3),
(83, 581, -465, 681, -365, 3),
(84, 481, -465, 581, -365, 3),
(85, 481, -365, 581, -265, 3),
(86, 481, -265, 581, -165, 0),
(87, 381, -265, 481, -165, 0),
(88, 381, -365, 481, -265, 0),
(89, 381, -465, 481, -365, 3),
(90, 281, -365, 381, -265, 2),
(91, 2401, -330, 2501, -230, 2),
(92, 2501, -330, 2601, -230, 2),
(93, 2501, -230, 2601, -130, 2),
(94, 2501, -130, 2601, -30, 2),
(95, 2401, -230, 2501, -130, 2),
(96, 2401, -130, 2501, -30, 2),
(97, 2301, -230, 2401, -130, 2),
(98, 2601, -330, 2701, -230, 2),
(99, 2601, -230, 2701, -130, 3),
(100, 2201, -230, 2301, -130, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `gift`
--

CREATE TABLE `gift` (
  `id` int(16) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `gift`
--

INSERT INTO `gift` (`id`, `x`, `y`, `z`) VALUES
(7, -2480.86, 2827.01, 37.636),
(8, -2484.53, 2823.11, 37.636),
(9, -2491.47, 2824.58, 37.636),
(10, 2285.66, 2644.08, 20.231),
(11, -794.595, -458.9, 741.103),
(12, 724.995, 1443.39, 12.004),
(13, 1789.07, 2147.58, 16.072),
(14, 1789.55, 2090.84, 15.854),
(15, 615.115, 1723.72, 12.071),
(16, 548.536, 1685.86, 12.285),
(17, 1816.03, 2516.47, 15.664),
(18, 203.522, 1693.14, 12.003),
(19, -116.845, 933.761, 12.002),
(20, -410.271, 929.259, 12.118),
(21, 186.086, 819.896, 12.002),
(22, -899.961, 847.547, 12.671),
(23, 1334.67, 2369.56, 17.664),
(24, 1904.88, 2287.96, 15.711),
(25, 1920.47, 1721.52, 15.993),
(26, 1829.78, 1709.1, 16.253),
(27, 1797.74, 1610.69, 16.104),
(28, 1645.52, 1768.98, 16.01),
(29, 1624.2, 1703.22, 16.217),
(30, 1586.36, 1631.21, 16.003),
(31, 1513.19, 1660.9, 16.078),
(32, 1467.76, 1718.65, 17.253),
(33, 1530.12, 1802.63, 16.26),
(34, 1507.59, -2469.83, 45.975),
(35, 1725.69, -2419.32, 11),
(36, 1897.76, -2352.61, 11.213),
(37, 1911.71, -2239.65, 11.19),
(38, 1881.05, -2205.22, 11.25),
(39, 2512.17, -1926.74, 22.328),
(40, 1695.09, -2331.96, 11.008),
(41, 623.586, -1263.35, 40.734),
(42, -624.236, -1697.69, 39.997),
(43, -560.273, -1634.82, 40.916),
(44, -2177.25, -178.017, 25.891),
(45, -2445.9, 119.47, 18.39),
(46, -2572.52, -131.687, 13.931),
(47, -1810.74, 1539.52, 35.279),
(48, -339.556, 1493.82, 20.747),
(49, -284.951, 1455.17, 20.747),
(50, -245.685, 1392.52, 20.747),
(51, 165.758, 1613.34, 12.003),
(52, 770.015, 775.16, 12.085),
(53, 568.766, 385.019, 12.106),
(54, 691.163, 869.931, 12),
(55, -123.093, 617.269, 12.012),
(56, -180.595, 944.447, 12.002),
(57, 1969.79, 2428.41, 15.974),
(58, 1940.82, 2435.37, 16.619),
(59, 1924.09, 2427.08, 16.022),
(60, 1965.04, 2131.56, 15.943),
(61, 1938.2, 2029.33, 15.871),
(62, 2308.35, 1761.66, 0.895),
(63, -169.861, 847.918, 15.489);

-- --------------------------------------------------------

--
-- Структура таблицы `gift_lose`
--

CREATE TABLE `gift_lose` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `gift_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `gift_lose`
--

INSERT INTO `gift_lose` (`id`, `uid`, `gift_id`) VALUES
(25, 3, 1),
(26, 410, 1),
(27, 5, 1),
(28, 291, 1),
(29, 291, 2),
(30, 291, 3),
(31, 291, 4),
(32, 874, 4),
(33, 1068, 4),
(34, 680, 4),
(35, 291, 5),
(36, 1048, 4),
(37, 796, 4),
(38, 980, 4),
(39, 1048, 5),
(40, 1013, 4),
(41, 1071, 6),
(42, 291, 6),
(43, 670, 4),
(44, 1042, 4),
(45, 1065, 4),
(46, 275, 4),
(47, 1064, 6),
(48, 1055, 4),
(49, 291, 7),
(50, 291, 8),
(51, 291, 9),
(52, 589, 4),
(53, 874, 6),
(54, 291, 10),
(55, 291, 11),
(56, 781, 11),
(57, 342, 11),
(58, 28, 2),
(59, 704, 4),
(60, 1064, 4),
(61, 758, 4),
(62, 275, 6),
(63, 530, 4),
(64, 1048, 6),
(65, 874, 3),
(66, 589, 5),
(67, 874, 2),
(68, 28, 6),
(69, 218, 4),
(70, 636, 4),
(71, 275, 5),
(72, 57, 7),
(73, 636, 5),
(74, 1048, 2),
(75, 57, 4),
(76, 57, 5),
(77, 1071, 7),
(78, 291, 12),
(79, 589, 12),
(80, 530, 5),
(81, 1068, 6),
(82, 1065, 10),
(83, 1062, 4),
(84, 111, 4),
(85, 530, 7),
(86, 1071, 8),
(87, 636, 10),
(88, 530, 8),
(89, 874, 12),
(90, 530, 9),
(91, 704, 6),
(92, 874, 7),
(93, 670, 5),
(94, 796, 5),
(95, 291, 13),
(96, 186, 2),
(97, 57, 8),
(98, 28, 13),
(99, 874, 8),
(100, 670, 7),
(101, 796, 7),
(102, 1048, 13),
(103, 291, 14),
(104, 363, 10),
(105, 291, 15),
(106, 1062, 10),
(107, 670, 10),
(108, 796, 10),
(109, 1062, 8),
(110, 291, 16),
(111, 874, 9),
(112, 1062, 9),
(113, 874, 11),
(114, 291, 17),
(115, 636, 8),
(116, 275, 8),
(117, 291, 18),
(118, 1071, 13),
(119, 291, 19),
(120, 636, 9),
(121, 291, 20),
(122, 704, 8),
(123, 291, 21),
(124, 111, 10),
(125, 291, 23),
(126, 111, 8),
(127, 874, 10),
(128, 28, 14),
(129, 291, 24),
(130, 342, 4),
(131, 111, 9),
(132, 186, 5),
(133, 704, 5),
(134, 670, 9),
(135, 796, 9),
(136, 363, 9),
(137, 186, 4),
(138, 342, 5),
(139, 342, 10),
(140, 528, 6),
(141, 528, 13),
(142, 291, 25),
(143, 291, 26),
(144, 874, 20),
(145, 528, 2),
(146, 1048, 8),
(147, 874, 21),
(148, 437, 4),
(149, 1048, 9),
(150, 291, 27),
(151, 670, 8),
(152, 291, 28),
(153, 589, 28),
(154, 874, 17),
(155, 28, 15),
(156, 874, 22),
(157, 28, 16),
(158, 680, 28),
(159, 28, 19),
(160, 874, 15),
(161, 111, 7),
(162, 28, 20),
(163, 536, 10),
(164, 796, 8),
(165, 363, 8),
(166, 874, 16),
(167, 291, 29),
(168, 28, 21),
(169, 111, 5),
(170, 291, 30),
(171, 680, 26),
(172, 874, 19),
(173, 275, 7),
(174, 795, 2),
(175, 536, 4),
(176, 874, 18),
(177, 291, 31),
(178, 795, 13),
(179, 291, 33),
(180, 291, 34),
(181, 874, 14),
(182, 1048, 10),
(183, 363, 12),
(184, 28, 17),
(185, 796, 12),
(186, 46, 8),
(187, 680, 14),
(188, 795, 6),
(189, 680, 15),
(190, 28, 22),
(191, 46, 10),
(192, 680, 19),
(193, 536, 5),
(194, 796, 13),
(195, 363, 13),
(196, 680, 18),
(197, 275, 10),
(198, 1072, 6),
(199, 46, 9),
(200, 275, 13),
(201, 1048, 41),
(202, 363, 2),
(203, 680, 17),
(204, 670, 2),
(205, 796, 2),
(206, 28, 18),
(207, 680, 21),
(208, 275, 2),
(209, 46, 4),
(210, 363, 6),
(211, 796, 6),
(212, 275, 12),
(213, 363, 5),
(214, 291, 44),
(215, 186, 44),
(216, 1049, 44),
(217, 363, 4),
(218, 874, 40),
(219, 291, 45),
(220, 249, 8),
(221, 76, 44),
(222, 275, 15),
(223, 275, 18),
(224, 275, 19),
(225, 340, 44),
(226, 275, 16),
(227, 1055, 5),
(228, 275, 17),
(229, 340, 10),
(230, 76, 8),
(231, 186, 10),
(232, 275, 22),
(233, 46, 5),
(234, 76, 45),
(235, 340, 4),
(236, 76, 9),
(237, 465, 14),
(238, 275, 14),
(239, 69, 9),
(240, 589, 8),
(241, 69, 8),
(242, 874, 44),
(243, 111, 44),
(244, 69, 45),
(245, 69, 10),
(246, 69, 44),
(247, 896, 42),
(248, 670, 41),
(249, 796, 41),
(250, 680, 40),
(251, 680, 7),
(252, 363, 7),
(253, 437, 8),
(254, 680, 12),
(255, 186, 7),
(256, 186, 40),
(257, 111, 40),
(258, 437, 7),
(259, 680, 6),
(260, 69, 7),
(261, 69, 40),
(262, 680, 13),
(263, 186, 11),
(264, 28, 1),
(265, 111, 45),
(266, 680, 3),
(267, 1055, 9),
(268, 680, 2),
(269, 437, 6),
(270, 437, 13),
(271, 437, 2),
(272, 465, 45),
(273, 680, 10),
(274, 465, 8),
(275, 340, 9),
(276, 680, 8),
(277, 680, 45),
(278, 465, 39),
(279, 680, 9),
(280, 28, 10),
(281, 437, 10),
(282, 28, 44),
(283, 363, 42),
(284, 437, 45),
(285, 186, 45),
(286, 896, 11),
(287, 69, 6),
(288, 69, 13),
(289, 186, 37),
(290, 437, 37),
(291, 186, 38),
(292, 437, 38),
(293, 69, 2),
(294, 186, 39),
(295, 437, 39),
(296, 1065, 14),
(297, 69, 14),
(298, 69, 15),
(299, 1065, 15),
(300, 69, 17),
(301, 1065, 16),
(302, 69, 18),
(303, 1065, 17),
(304, 69, 19),
(305, 1065, 18),
(306, 69, 16),
(307, 437, 33),
(308, 186, 33),
(309, 1065, 6),
(310, 1065, 13),
(311, 69, 28),
(312, 1065, 2),
(313, 437, 44),
(314, 1065, 5),
(315, 874, 30),
(316, 874, 32),
(317, 531, 42),
(318, 874, 31),
(319, 1065, 8),
(320, 69, 26),
(321, 1065, 45),
(322, 1064, 10),
(323, 874, 33),
(324, 1064, 44),
(325, 874, 34),
(326, 28, 12),
(327, 531, 45),
(328, 531, 8),
(329, 1074, 8),
(330, 531, 10),
(331, 531, 13),
(332, 531, 6),
(333, 531, 3),
(334, 69, 5),
(335, 69, 4),
(336, 531, 5),
(337, 874, 45),
(338, 531, 4),
(339, 1076, 6),
(340, 1079, 6),
(341, 531, 39),
(342, 531, 37),
(343, 1077, 6),
(344, 531, 38),
(345, 1077, 4),
(346, 363, 38),
(347, 363, 39),
(348, 363, 44),
(349, 1075, 11),
(350, 1065, 12),
(351, 396, 7),
(352, 396, 4),
(353, 1080, 6),
(354, 1075, 38),
(355, 396, 10),
(356, 396, 8),
(357, 396, 45),
(358, 396, 9),
(359, 1080, 14),
(360, 1080, 15),
(361, 1080, 9),
(362, 1080, 44),
(363, 443, 11),
(364, 443, 9),
(365, 443, 8),
(366, 443, 45),
(367, 531, 9),
(368, 443, 10),
(369, 396, 39),
(370, 531, 43),
(371, 443, 5),
(372, 443, 4),
(373, 383, 27),
(374, 443, 44),
(375, 443, 1),
(376, 396, 11),
(377, 363, 41),
(378, 363, 16),
(379, 443, 39),
(380, 363, 15),
(381, 363, 19),
(382, 363, 18),
(383, 363, 21),
(384, 363, 17),
(385, 1083, 6),
(386, 363, 14),
(387, 1074, 12),
(388, 383, 6),
(389, 383, 14),
(390, 383, 15),
(391, 383, 17),
(392, 383, 18),
(393, 383, 21),
(394, 383, 20),
(395, 383, 22),
(396, 383, 10),
(397, 925, 8),
(398, 925, 45),
(399, 283, 10),
(400, 925, 14),
(401, 925, 15),
(402, 340, 15),
(403, 340, 14),
(404, 925, 16),
(405, 925, 19),
(406, 340, 18),
(407, 925, 18),
(408, 246, 8),
(409, 340, 20),
(410, 925, 20),
(411, 340, 19),
(412, 340, 16),
(413, 340, 17),
(414, 925, 10),
(415, 363, 26),
(416, 363, 27),
(417, 246, 45),
(418, 246, 10),
(419, 1085, 6),
(420, 1031, 4),
(421, 443, 20),
(422, 1085, 4),
(423, 443, 21),
(424, 340, 26),
(425, 246, 6),
(426, 1031, 5),
(427, 443, 18),
(428, 443, 17),
(429, 363, 33),
(430, 246, 5),
(431, 246, 4),
(432, 443, 15),
(433, 443, 16),
(434, 443, 14),
(435, 8, 4),
(436, 1031, 44),
(437, 1031, 8),
(438, 1031, 10),
(439, 1031, 6),
(440, 1031, 7),
(441, 1031, 40),
(442, 1031, 11),
(443, 925, 6),
(444, 1031, 13),
(445, 925, 12),
(446, 1031, 45),
(447, 925, 4),
(448, 340, 6),
(449, 743, 6),
(450, 743, 7),
(451, 743, 40),
(452, 576, 44),
(453, 743, 8),
(454, 743, 45),
(455, 743, 10),
(456, 119, 7),
(457, 576, 6),
(458, 199, 45),
(459, 199, 8),
(460, 119, 5),
(461, 743, 44),
(462, 1086, 6),
(463, 8, 8),
(464, 199, 4),
(465, 8, 10),
(466, 1014, 6),
(467, 363, 1),
(468, 410, 2),
(469, 410, 3),
(470, 410, 4),
(471, 410, 7),
(472, 329, 3),
(473, 329, 2),
(474, 329, 1),
(475, 972, 2),
(476, 972, 1),
(477, 972, 3),
(478, 833, 6),
(479, 261, 4),
(480, 261, 5),
(481, 833, 1),
(482, 833, 2),
(483, 833, 3),
(484, 32, 5),
(485, 1129, 6),
(486, 550, 5),
(487, 1140, 6),
(488, 1155, 7),
(489, 5, 2),
(490, 5, 3),
(491, 1021, 4),
(492, 75, 3),
(493, 75, 2),
(494, 75, 1),
(495, 75, 5),
(496, 75, 4),
(497, 75, 7),
(498, 1260, 4),
(499, 1187, 3),
(500, 1187, 2),
(501, 1187, 1),
(502, 516, 4),
(503, 1197, 4),
(504, 970, 6);

-- --------------------------------------------------------

--
-- Структура таблицы `hotels`
--

CREATE TABLE `hotels` (
  `id` int(11) NOT NULL,
  `hotel_id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `hotels`
--

INSERT INTO `hotels` (`id`, `hotel_id`, `owner_id`, `rent_time`, `status`) VALUES
(1, 0, 0, 0, 0),
(2, 0, 0, 0, 1),
(3, 0, 0, 0, 1),
(4, 0, 0, 0, 1),
(5, 0, 0, 0, 1),
(6, 0, 0, 0, 1),
(7, 0, 0, 0, 1),
(8, 0, 0, 0, 0),
(9, 0, 0, 0, 0),
(10, 0, 0, 0, 0),
(11, 0, 0, 0, 0),
(12, 0, 0, 0, 0),
(13, 0, 0, 0, 0),
(14, 0, 0, 0, 0),
(15, 0, 0, 0, 0),
(16, 0, 0, 0, 0),
(17, 0, 0, 0, 0),
(18, 0, 0, 0, 0),
(19, 0, 0, 0, 0),
(20, 0, 0, 0, 0),
(21, 0, 0, 0, 0),
(22, 0, 0, 0, 0),
(23, 0, 0, 0, 0),
(24, 0, 0, 0, 0),
(25, 0, 0, 0, 0),
(26, 0, 0, 0, 0),
(27, 0, 0, 0, 0),
(28, 0, 0, 0, 0),
(29, 0, 0, 0, 0),
(30, 0, 0, 0, 0),
(31, 0, 0, 0, 0),
(32, 0, 0, 0, 0),
(33, 0, 0, 0, 0),
(34, 0, 0, 0, 0),
(35, 0, 0, 0, 0),
(36, 0, 0, 0, 0),
(37, 0, 0, 0, 0),
(38, 0, 0, 0, 0),
(39, 0, 0, 0, 0),
(40, 0, 0, 0, 0),
(41, 0, 0, 0, 0),
(42, 0, 0, 0, 0),
(43, 0, 0, 0, 0),
(44, 0, 0, 0, 0),
(45, 0, 0, 0, 0),
(46, 0, 0, 0, 0),
(47, 0, 0, 0, 0),
(48, 0, 0, 0, 0),
(49, 0, 0, 0, 0),
(50, 0, 0, 0, 0),
(51, 0, 0, 0, 0),
(52, 0, 0, 0, 0),
(53, 0, 0, 0, 0),
(54, 0, 0, 0, 0),
(55, 0, 0, 0, 0),
(56, 0, 0, 0, 0),
(57, 0, 0, 0, 0),
(58, 0, 0, 0, 0),
(59, 0, 0, 0, 0),
(60, 0, 0, 0, 0),
(61, 0, 0, 0, 0),
(62, 0, 0, 0, 0),
(63, 0, 0, 0, 0),
(64, 0, 0, 0, 0),
(65, 0, 0, 0, 0),
(66, 0, 0, 0, 0),
(67, 0, 0, 0, 0),
(68, 0, 0, 0, 0),
(69, 0, 0, 0, 0),
(70, 0, 0, 0, 0),
(71, 0, 0, 0, 0),
(72, 0, 0, 0, 0),
(73, 0, 0, 0, 0),
(74, 0, 0, 0, 0),
(75, 0, 0, 0, 0),
(76, 0, 0, 0, 0),
(77, 0, 0, 0, 0),
(78, 0, 0, 0, 0),
(79, 0, 0, 0, 0),
(80, 0, 0, 0, 0),
(81, 0, 0, 0, 0),
(82, 0, 0, 0, 0),
(83, 0, 0, 0, 0),
(84, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `houses`
--

CREATE TABLE `houses` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `improvements` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `entrance` int(11) NOT NULL DEFAULT -1,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL,
  `car_x` float NOT NULL,
  `car_y` float NOT NULL,
  `car_z` float NOT NULL,
  `car_angle` float NOT NULL,
  `store_x` float NOT NULL,
  `store_y` float NOT NULL,
  `store_z` float NOT NULL,
  `eviction` int(11) NOT NULL,
  `store_metall` int(11) NOT NULL,
  `store_drugs` int(11) NOT NULL,
  `store_weapon` int(11) NOT NULL,
  `store_ammo` int(11) NOT NULL,
  `store_skin` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `houses`
--

INSERT INTO `houses` (`id`, `owner_id`, `name`, `improvements`, `rent_time`, `price`, `rent_price`, `type`, `entrance`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `car_x`, `car_y`, `car_z`, `car_angle`, `store_x`, `store_y`, `store_z`, `eviction`, `store_metall`, `store_drugs`, `store_weapon`, `store_ammo`, `store_skin`) VALUES
(1, 0, '', 5, 0, 30000000, 7000, 6, -1, 0, -681.871, 909.614, 13.0814, -681.696, 906.357, 12.5611, 179.864, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(2, 0, '', 5, 0, 300000, 7000, 6, -1, 0, -722.573, 910.056, 13.1247, -722.972, 904.671, 12.5611, 174.177, -998.152, 746.812, 12.1348, 71.7873, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(3, 0, '', 0, 0, 5000000, 7000, 0, -1, 0, 1838.18, 1338.24, 9.75565, -744.82, 718.793, 11.8373, 357.014, 1833.38, 1326.51, 9.8282, 93.9606, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(4, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 1813.15, 1333.2, 9.75565, 1812.91, 1330.75, 9.75565, 177.179, 1815.05, 1325.43, 9.91828, 91.4933, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(5, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 1800.64, 1337.81, 9.75565, 1801.27, 1335.48, 9.75565, 177.657, 1794.94, 1326.15, 9.85514, 89.8407, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(6, 0, '', 5, 0, 1000000, 7000, 0, -1, 0, 1784.26, 1338.18, 9.75565, 1784.04, 1336.19, 9.75565, 183.924, 1788.21, 1338.37, 9.75565, 179.98, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(7, 0, '', 0, 0, 3000000, 7000, 0, -1, 0, 1764.04, 1334.3, 9.75565, 1766.16, 1334.11, 9.75565, 273.538, 1766.49, 1327.62, 9.75565, 92.4101, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(8, 0, '', 5, 0, 7000000, 7000, 0, -1, 0, 1865.3, 1358.19, 9.75565, 1865.51, 1360.67, 9.75565, 0.457568, 1870.99, 1366.57, 9.78858, 179.831, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(9, 0, '', 5, 0, 3000000, 7000, 0, -1, 0, 1865.87, 1337.14, 9.75565, 1865.92, 1339.07, 9.75565, 0.052339, 1872.02, 1341.17, 9.84551, 178.492, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(10, 0, '', 5, 0, 3000000, 7000, 0, -1, 0, 1859.47, 1404.84, 9.75565, 1859.56, 1402.23, 9.75565, 180, 1872.23, 1401.38, 9.85196, 187.806, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(11, 0, '', 0, 0, 3000000, 7000, 0, -1, 0, 1865.04, 1419.27, 10.2281, 1865.63, 1421.57, 9.75565, 354.897, 1871.51, 1426.82, 9.81496, 184.006, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(12, 0, '', 0, 0, 3000000, 7000, 0, -1, 0, 1866.21, 1439.86, 9.75565, 1866.24, 1441.66, 9.75565, 357.529, 1870.95, 1444, 9.78611, 186.615, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(13, 0, '', 0, 0, 5000000, 7000, 0, -1, 0, 2038.9, 1339.88, 26.1435, -998.152, 746.812, 12.1348, 71.7873, -998.152, 746.812, 12.1348, 71.7873, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(14, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2060.48, 1339.87, 26.1435, 2060.04, 1338.31, 26.1431, 181.308, 2060.11, 1326.08, 26.2445, 91.3083, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(15, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2204.58, -231.381, 2.06699, 2206.82, -228.955, 2.25525, 277.201, 2211.3, -234.127, 1.87778, 5.1858, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(16, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2240.53, -197.184, 2.38868, 2242.59, -197.361, 2.29445, 271.396, 2238.01, -206.463, 2.1434, 176.373, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(17, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2261.31, -230.6, 2.07146, 2261.11, -228.177, 2.1372, 1.26067, 2255.77, -231.819, 2.05207, 3.01565, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(18, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2329.97, -205.21, 2.4335, 2316.32, -207.188, 2.16208, 182.683, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(19, 0, '', 0, 0, 5000000, 7000, 0, -1, 0, 2381.84, -202.405, 2.7631, 2381.45, -204.764, 2.13854, 180.509, 2377.47, -204.53, 2.13854, 180.423, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(20, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2422.07, -206.157, 2.35224, 2424.88, -207.299, 2.13854, 176.225, 2423.47, -212.532, 2.14481, 83.7904, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(21, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2414.87, -230.591, 2.06488, 2414.84, -228.595, 2.0888, 358.774, 2410.25, -231.852, 2.05712, 1.34348, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(22, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2466.45, -201.208, 2.14461, 2465.12, -202.897, 2.14461, 92.2998, 2460.18, -200.027, 2.14461, 182.3, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(23, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2487.49, -252.622, 1.84195, 2489.96, -252.104, 1.87508, 357.379, 2485.33, -244.838, 2.34694, 14.6319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(24, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2513.72, -230.512, 2.56648, 2513.41, -228.206, 2.56648, 88.8398, 2507.64, -232.153, 2.45217, 1.48161, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(25, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -785.534, 915.499, 13.0786, -785.899, 913.447, 13.0786, 180.362, -780.734, 902.264, 12.5538, 178.732, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(26, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -829.38, 909.598, 13.0814, -829.351, 907.061, 12.5611, 181.278, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(27, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -870.147, 910.056, 13.1247, -869.911, 907.648, 13.131, 182.031, -861.567, 905.655, 12.5611, 179.966, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(28, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -933.41, 915.487, 13.0786, -933.384, 913.293, 13.0786, 177.809, -926.255, 901.563, 12.5538, 184.076, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(29, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -975.353, 909.615, 13.0814, -975.096, 907.13, 12.5611, 180.731, -963.752, 902.586, 12.5538, 179.792, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(30, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -968.533, 851.711, 13.0786, -971.872, 851.895, 12.5538, 88.2741, -983.279, 844.578, 12.5538, 91.1568, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(31, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -973.983, 790.814, 13.1247, -977.415, 790.899, 12.6794, 87.2088, -976.715, 781.68, 12.5611, 88.7756, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(32, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -974.458, 753.127, 13.0814, -976.956, 753.312, 12.5611, 90.4049, -982.507, 741.463, 12.5538, 88.7128, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(33, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -848.743, 753.141, 13.0814, -851.451, 752.94, 12.5611, 89.9034, -856.244, 741.16, 12.5611, 89.2141, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(34, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -848.094, 790.744, 13.1247, -850.43, 790.775, 13.131, 89.4218, -852.261, 782.263, 12.5611, 88.0629, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(35, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -842.646, 851.644, 13.0786, -844.634, 851.778, 13.0786, 90.5893, -856.238, 844.828, 12.5538, 92.5517, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(36, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -791.782, 841.27, 13.0814, -789.443, 841.379, 12.5611, 261.73, -785.377, 853.62, 12.5538, 264.425, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(37, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -792.192, 803.566, 13.1247, -789.327, 803.486, 12.9825, 271.275, -787.451, 811.279, 12.5611, 271.922, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(38, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -797.588, 742.829, 13.0786, -794.696, 742.695, 12.7114, 271.189, -784.155, 749.379, 12.5538, 271.46, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(39, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -730.554, 753.198, 13.0814, -733.028, 753.165, 12.5611, 81.7463, -739.391, 741.919, 12.5538, 93.4848, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(40, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -730.225, 790.771, 13.131, -732.538, 790.786, 13.131, 90.0579, -733.258, 782.347, 12.5611, 92.5216, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(41, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -724.671, 851.594, 13.0786, -726.863, 851.53, 13.0786, 89.2828, -738.767, 843.65, 12.5538, 94.9425, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(42, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -674.694, 841.237, 13.0814, -672.484, 841.119, 12.5611, 266.73, -666.594, 852.935, 12.5538, 272.432, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(43, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -675.142, 803.555, 13.1247, -672.578, 803.435, 12.9825, 270.823, -672.304, 811.617, 12.5611, 270.905, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(44, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -680.573, 742.795, 13.0786, -677.603, 743.082, 12.7114, 90.7994, -666.647, 749.483, 12.5538, 269.628, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(45, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 2685.6, -231.553, 3.97524, 2685.56, -229.216, 3.97524, 2.22396, 2698.83, -233.507, 3.97524, 7.15497, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(46, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2627.62, -232.8, 3.97524, 2627.53, -230.269, 3.97524, 3.87646, 2641.5, -233.218, 3.97524, 2.83082, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(47, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2608.46, -200.931, 6.83413, 2606.42, -200.792, 6.41226, 93.7575, 2605.57, -190.668, 6.91647, 176.749, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(48, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 2590.71, -230.937, 4.03638, 2590.52, -228.926, 4.04053, 357.939, 2595.93, -235.218, 3.97888, 5.41627, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(49, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2524.48, -198.869, 3.72267, 2524.78, -202.072, 3.02409, 180.406, 2531.21, -199.023, 3.1993, 186.861, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(50, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2250.71, 1363.36, 11.3606, 2250.55, 1360.87, 11.3643, 184.523, 2238.22, 1368.55, 11.353, 103.118, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(51, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2207.51, 1363.42, 11.3606, 2209.74, 1363.74, 11.3601, 273.738, 2219.16, 1354.26, 11.5189, 94.4271, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(52, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 465.347, -1249.77, 41.8968, 466.02, -1247.6, 40.7343, 341.171, 459.281, -1244.9, 40.7343, 340.921, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(53, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 531.188, -1275.49, 40.7343, 532.174, -1273.38, 40.7343, 339.331, 533.845, -1260.7, 40.8498, 272.61, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(54, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 525.155, -1305, 40.7343, 525.849, -1302.69, 40.7343, 351.831, 536.735, -1303.86, 40.7239, 326.88, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(55, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 579.831, -1289.01, 40.7343, 580.6, -1286.9, 40.7343, 340.749, 573.354, -1289.93, 40.6267, 346.346, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(56, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 622.28, -1250.17, 41.8203, 622.017, -1252.59, 40.7343, 164.321, 627.778, -1249.33, 40.7343, 164.07, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(57, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 641.989, -1265.94, 41.8848, 641.107, -1268.57, 40.7343, 162.108, 634.578, -1265.87, 40.7343, 167.345, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(58, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 629.064, -1320.47, 41.5092, 668.287, -1286.27, 40.7343, 157.549, 664.748, -1300.49, 40.4491, 77.7309, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(59, 0, '', 1, 0, 5000000, 7000, 1, -1, 0, 680.528, -1284.15, 41.8848, 680.176, -1285.74, 41.0098, 160.636, 674.81, -1301.27, 40.6322, 161.136, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(60, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 733.133, -1308.76, 40.672, 735.056, -1308.9, 40.6996, 251.629, 730.512, -1321.5, 40.2951, 248.703, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(61, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 720.156, -1351.02, 40.7165, 718.409, -1350.28, 40.7165, 73.2154, 714.882, -1358.07, 40.7165, 247.951, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(62, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 778.244, -1315.23, 40.7165, 776.639, -1314.74, 40.7165, 73.9675, 769.048, -1322.08, 40.7165, 167.236, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(63, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 785.178, -1319.98, 41.8189, 785.503, -1321.91, 41.8189, 140.438, 788.617, -1327.23, 40.6862, 166.319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(64, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 826.264, -1339.17, 40.7165, 827.851, -1340.28, 40.7092, 248.958, 823.398, -1348.97, 40.7165, 77.6057, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(65, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 826.275, -1387.15, 40.7165, 826.497, -1385.44, 40.7165, 343.374, 823.202, -1368.17, 40.7125, 251.985, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(66, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 811.911, -1371.2, 40.7165, 812.487, -1369.22, 40.7092, 344.502, 811.461, -1363.27, 40.6565, 246.972, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(67, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 778.237, -1369.94, 40.7165, 777.011, -1371.9, 40.7165, 161.662, 772.075, -1369.88, 40.7165, 345.798, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(68, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1749.92, 2188.99, 15.9201, 1752.14, 2188.94, 15.8865, 272.566, 1750.8, 2199.84, 15.959, 274.716, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(69, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1745.97, 2115.04, 16.009, 1747.64, 2114.86, 15.9955, 272.628, 1750.15, 2117.98, 16.0251, 264.149, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(70, 0, '', 0, 1673654400, 5000000, 7000, 1, -1, 0, 1911.98, 2266.08, 15.7223, 1911.9, 2264.66, 15.7723, 180.157, 1901.92, 2270.13, 15.8427, 352.136, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(71, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1945.36, 1845.48, 15.4198, 1947.26, 1845.72, 15.4198, 267.793, 1953.74, 1842.65, 15.525, 190.254, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(72, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1943.5, 1806.87, 15.5073, 1942.92, 1808.72, 15.3979, 3.4856, 1951.94, 1812.3, 15.5252, 183.862, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(73, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 1989.22, 1793.93, 15.4441, 1986.77, 1794.81, 15.5466, 81.9251, 1982.07, 1800.58, 15.584, 82.4265, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(74, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1994.83, 1746.2, 15.6989, 1992.68, 1746.14, 15.6989, 89.6134, 1985.42, 1748.85, 15.6989, 88.027, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(75, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1944.01, 1753.15, 15.3423, 1945.73, 1753.2, 15.3423, 271.348, 1952.3, 1748.19, 15.5097, 270.013, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(76, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -425.162, 1440.38, 20.9844, -425.245, 1442.2, 20.7421, 358.008, -433.16, 1444.21, 20.7421, 3.41713, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(77, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -423.341, 1464.19, 21.3906, -423.552, 1462.23, 20.8906, 179.972, -430.957, 1465.47, 20.7422, 174.311, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(78, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -410.581, 1441.88, 21.3906, -410.678, 1443.74, 20.8906, 1.32913, -402.344, 1439.35, 20.7421, 5.27737, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(79, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -397.837, 1463.92, 21.197, -397.669, 1462.35, 20.8906, 181.6, -410.036, 1465.79, 20.7421, 184.733, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(80, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -391.905, 1441.38, 21.4921, -391.744, 1443.21, 20.9637, 1.43149, -380.477, 1440.66, 20.7421, 11.6461, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(81, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -376.115, 1464.68, 21.4921, -376.222, 1462.77, 20.9119, 178.968, -387.457, 1467.4, 20.7421, 177.193, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(82, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -364.914, 1465.68, 20.9844, -364.743, 1463.99, 20.7421, 180.996, -356.19, 1462.59, 20.7421, 178.321, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(83, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -351.675, 1441.13, 21.3906, -350.313, 1440.92, 20.8906, 269.522, -355.819, 1431.47, 20.7421, 277.543, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(84, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -329.338, 1427.34, 21.4921, -330.969, 1427.13, 21.0743, 88.0374, -336.504, 1428.61, 20.7469, 183.437, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(85, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -328.339, 1415.81, 20.9844, -329.72, 1415.85, 20.7421, 89.8548, -332.36, 1407.15, 20.7421, 90.3132, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(86, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -351.864, 1421.12, 21.1973, -350.137, 1420.74, 20.8906, 270.815, -352.585, 1409.75, 20.7422, 269.354, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(87, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -292.945, 1442.34, 21.3905, -293.042, 1443.58, 20.8905, 0.081564, -283.14, 1438.66, 20.7421, 359.06, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(88, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -289.77, 1465.66, 20.9844, -289.806, 1463.78, 20.7421, 179.123, -281.466, 1461.95, 20.7421, 181.273, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(89, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -300.876, 1463.93, 21.1971, -300.663, 1462.32, 20.8906, 179.914, -312.018, 1464.46, 20.7421, 173.604, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(90, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -260.416, 1464.19, 21.3905, -260.552, 1460.96, 20.8905, 176.757, -268.297, 1466.1, 20.7421, 183.862, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(91, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -272.757, 1441.4, 21.4921, -272.746, 1443.19, 20.973, 355.735, -261.755, 1440.76, 20.7421, 3.94447, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(92, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -232.337, 1419.83, 21.4921, -234.24, 1419.95, 20.9158, 89.8381, -231.23, 1430.15, 20.7421, 91.2167, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(93, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -254.872, 1413.5, 21.1977, -253.382, 1413.52, 20.8906, 273.304, -257.392, 1402.29, 20.7422, 273.994, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(94, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -260.536, 1374.17, 21.3905, -260.649, 1372.92, 21.1303, 181.81, -268.603, 1376.34, 20.7421, 179.805, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(95, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -289.84, 1375.68, 20.9844, -289.628, 1373.97, 20.7421, 179.867, -281.549, 1372.2, 20.7421, 184.775, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(96, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -272.877, 1351.38, 21.4921, -272.686, 1353.12, 21.0118, 358.697, -261.12, 1348.57, 20.7421, 359.429, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(97, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -231.349, 1386.35, 20.9844, -233.167, 1386.34, 20.7421, 91.0055, -235.643, 1378, 20.7421, 94.3466, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(98, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -232.859, 1401.01, 21.3905, -234.66, 1401.04, 20.8905, 88.037, -231.906, 1409.12, 20.7421, 93.301, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(99, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -293.169, 1352.34, 21.3905, -292.939, 1354.14, 20.8905, 1.51659, -284.363, 1349.55, 20.7421, 3.02077, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(100, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -353.632, 1302.69, 20.9844, -351.91, 1302.39, 20.7421, 268.057, -350.644, 1310.77, 20.7421, 273.591, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(101, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -329.851, 1300.97, 21.3905, -331.736, 1300.95, 20.8905, 89.2045, -328.737, 1309.13, 20.7421, 91.3978, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(102, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -351.674, 1289.53, 21.3906, -350.469, 1289.65, 20.8906, 270.603, -354.3, 1280, 20.7421, 271.856, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(103, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -328.337, 1286.25, 20.9844, -330.026, 1286.26, 20.7421, 91.0612, -331.45, 1277.86, 20.7421, 89.2009, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(104, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -373.511, 1250.88, 21.3906, -373.686, 1251.99, 21.2286, 358.752, -365.589, 1249.28, 20.7421, 3.76572, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(105, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -388.083, 1249.4, 20.9844, -387.946, 1251.19, 20.7421, 359.63, -396.471, 1252.99, 20.7421, 5.10154, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(106, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -417.614, 1250.88, 21.3906, -417.256, 1252.44, 20.8906, 356.246, -409.16, 1250.21, 20.7421, 2.01091, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(107, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -404.945, 1272.93, 21.1974, -405.101, 1271.27, 20.8906, 177.746, -417.189, 1274.28, 20.7421, 184.577, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(108, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -383.128, 1273.64, 21.4921, -383.083, 1271.45, 20.8906, 178.145, -394.387, 1277.65, 20.7421, 176.559, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(109, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -451.967, 1274.53, 20.9844, -451.817, 1272.96, 20.7421, 179.587, -443.666, 1271.15, 20.7421, 177.1, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(110, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -441.686, 1309.5, 21.3906, -439.884, 1309.79, 20.8906, 270.784, -444.347, 1300.32, 20.7421, 273.478, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(111, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -419.83, 1298.92, 21.3906, -421.736, 1299.25, 20.8906, 86.3147, -418.823, 1307.11, 20.7421, 93.4982, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(112, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -444.682, 1282.47, 20.9921, -443.003, 1282.5, 20.9921, 268.379, -436.343, 1286.04, 20.8908, 287.387, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(113, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -410.085, 1352.13, 21.1971, -410.226, 1354.1, 20.8905, 0.476833, -398.711, 1351.54, 20.7421, 6.36763, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(114, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -419.428, 1374.19, 21.3905, -419.504, 1371.49, 20.8905, 178.053, -426.771, 1375.6, 20.7421, 185.635, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(115, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -394.199, 1374.67, 21.4921, -394.07, 1373.18, 21.1525, 178.531, -405.406, 1377.29, 20.7421, 175.19, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(116, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -233.292, 1483.73, 21.3905, -234.865, 1483.67, 20.8905, 90.2325, -232.209, 1493.42, 20.7421, 93.4912, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(117, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -260.507, 1526.68, 21.3905, -260.298, 1525.2, 20.8905, 178.593, -268.581, 1527.66, 20.7421, 184.359, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(118, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -272.927, 1503.9, 21.4921, -272.649, 1505.63, 21.0078, 359.2, -261.504, 1503.63, 20.7421, 356.858, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(119, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -278.894, 1526.39, 21.1972, -278.698, 1524.92, 20.8905, 179.071, -290.41, 1527.95, 20.7421, 187.218, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(120, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -301.195, 1527.18, 21.4921, -300.878, 1526.02, 21.3519, 181.578, -312.304, 1528.67, 20.7421, 105.678, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(121, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -306.239, 1502.89, 20.9844, -306.121, 1504.68, 20.7421, 0.242283, -314.521, 1507.17, 20.7421, 4.67194, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(122, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -293, 1505.09, 21.3905, -293.041, 1506.39, 20.8905, 2.31029, -283.651, 1502.21, 20.7421, 185.569, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(123, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -355.886, 1526.23, 21.3906, -355.953, 1524.32, 20.8906, 180.285, -365.738, 1526.56, 20.7421, 2.0399, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(124, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -369.969, 1504.65, 21.1976, -370.045, 1505.77, 21.0421, 357.696, -358.428, 1502.85, 20.7421, 182.146, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(125, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -376.125, 1527.18, 21.4921, -375.969, 1525.32, 20.9426, 180.285, -387.038, 1527.95, 20.7421, 5.73736, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(126, 0, '', 1, 0, 50000000, 7000, 6, -1, 0, -388.513, 1504.38, 21.3905, -388.467, 1506.02, 20.8905, 357.822, -380.621, 1503.68, 20.7421, 184.629, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(127, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -408.831, 1528.18, 20.9844, -408.844, 1526.33, 20.7421, 180.575, -400.602, 1525.8, 20.7421, 185.421, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(128, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -411.941, 1504.84, 21.3905, -411.768, 1506.4, 20.8905, 359.98, -403.175, 1504.11, 20.7421, 187.927, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(129, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -419.916, 1526.43, 21.1973, -419.796, 1525.31, 21.0474, 179.487, -431.212, 1526.06, 20.7422, 2.18167, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(130, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -435.795, 1503.89, 21.4921, -436.178, 1506.25, 20.8905, 359.98, -424.871, 1504.76, 20.7421, 194.319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(131, 0, '', 2, 0, 50000000, 7000, 6, -1, 0, -460.632, 1490.12, 20.9844, -459.277, 1490.1, 20.7421, 271.232, -457.879, 1498.07, 20.7421, 270.961, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(132, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -458.685, 1476.96, 21.3906, -457.392, 1477.03, 20.8906, 269.477, -460.585, 1467.69, 20.7422, 280.131, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(133, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -458.885, 1437.56, 21.1975, -457.283, 1437.45, 20.8906, 271.294, -459.233, 1425.94, 20.7421, 274.365, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(134, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -459.635, 1415.45, 21.4921, -458.077, 1415.3, 21.1172, 275.055, -459.328, 1403.95, 20.7421, 87.4091, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(135, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -437.298, 1401.41, 21.3906, -438.562, 1401.45, 20.8906, 89.5202, -437.341, 1410.79, 20.7421, 268.392, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(136, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -460.636, 1378.19, 20.9844, -458.981, 1378.29, 20.7421, 268.412, -458.245, 1386.65, 20.7421, 276.641, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(137, 0, '', 5, 0, 5000000, 7000, 3, -1, 0, 394.404, 701.187, 12.802, 395.196, 702.649, 12.4392, 335.191, 399.485, 698.061, 12.117, 341.5, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(138, 0, '', 5, 0, 5000000, 7000, 3, -1, 0, 473.25, 673.052, 12.1515, 471.56, 673.618, 12.126, 68.5648, 469.493, 677.414, 12.1315, 342.816, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(139, 0, '', 0, 0, 5000000, 7000, 3, -1, 0, 485.676, 672.548, 12.1311, 485.903, 674.764, 12.135, 340.204, 491.847, 678.574, 12.149, 251.635, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(140, 0, '', 0, 0, 5000000, 7000, 3, -1, 0, 504.005, 662.206, 12.4645, 502.455, 662.698, 12.1381, 66.4736, 515.125, 661.209, 12.1102, 335.21, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(141, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(142, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(143, 0, '', 5, 0, 450000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(144, 0, '', 0, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(145, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(146, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(147, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(148, 0, '', 5, 0, 450000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(149, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(150, 0, '', 5, 0, 450000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(151, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(152, 0, '', 5, 0, 450000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(153, 0, '', 0, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(154, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(155, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(156, 0, '', 0, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(157, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(158, 0, '', 0, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(159, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(160, 0, '', 5, 0, 500000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(161, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(162, 0, '', 5, 0, 500000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(163, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(164, 0, '', 5, 0, 500000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(165, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(166, 0, '', 5, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(167, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(168, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(169, 0, '', 0, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(170, 0, '', 5, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(171, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(172, 0, '', 5, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(173, 0, '', 0, 0, 450000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(174, 0, '', 5, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(175, 0, '', 5, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(176, 0, '', 0, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(177, 0, '', 0, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(178, 0, '', 0, 0, 450000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(179, 0, '', 5, 0, 450000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(180, 0, '', 0, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(181, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(182, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(183, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(184, 0, '', 5, 0, 450000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(185, 0, '', 0, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(186, 0, '', 5, 0, 450000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(187, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(188, 0, '', 0, 0, 450000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(189, 0, '', 5, 0, 450000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(190, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(191, 0, '', 0, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(192, 0, '', 0, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(193, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(194, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(195, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(196, 0, '', 0, 0, 450000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(197, 0, '', 5, 0, 450000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(198, 0, '', 0, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(199, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(200, 0, '', 0, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(201, 0, '', 0, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(202, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(203, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(204, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(205, 0, '', 5, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(206, 0, '', 5, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(207, 0, '', 0, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(208, 0, '', 5, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(209, 0, '', 0, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(210, 0, '', 5, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(211, 0, '', 5, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(212, 0, '', 5, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(213, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(214, 0, '', 0, 0, 450000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(215, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(216, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(217, 0, '', 5, 0, 450000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(218, 0, '', 0, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(219, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(220, 0, '', 5, 0, 450000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(221, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(222, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(223, 0, '', 4, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(224, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(225, 0, '', 5, 0, 450000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(226, 0, '', 5, 0, 450000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(227, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(228, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(229, 0, '', 0, 0, 500000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(230, 0, '', 5, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(231, 0, '', 5, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(232, 0, '', 0, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(233, 0, '', 1, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(234, 0, '', 5, 0, 500000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(235, 0, '', 5, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(236, 0, '', 5, 0, 500000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(237, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(238, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(239, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(240, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(241, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(242, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(243, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(244, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(245, 0, '', 5, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(246, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(247, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(248, 0, '', 0, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(249, 0, '', 0, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(250, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(251, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(252, 0, '', 0, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(253, 0, '', 5, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(254, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(255, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(256, 0, '', 5, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(257, 0, '', 0, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(258, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(259, 0, '', 5, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(260, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(261, 0, '', 5, 0, 450000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(262, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(263, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(264, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(265, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(266, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(267, 0, '', 0, 0, 450000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(268, 0, '', 5, 0, 450000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(269, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(270, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(271, 0, '', 5, 0, 450000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(272, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(273, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(274, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(275, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(276, 0, '', 5, 0, 450000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(277, 0, '', 0, 0, 450000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(278, 0, '', 0, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(279, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(280, 0, '', 0, 0, 450000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(281, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(282, 0, '', 5, 0, 450000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(283, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(284, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(285, 0, '', 5, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(286, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(287, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(288, 0, '', 0, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(289, 0, '', 5, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(290, 0, '', 5, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(291, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(292, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(293, 0, '', 5, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(294, 0, '', 5, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(295, 0, '', 0, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(296, 0, '', 5, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(297, 0, '', 0, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(298, 0, '', 5, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(299, 0, '', 5, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(300, 0, '', 0, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(301, 0, '', 5, 0, 450000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(302, 0, '', 5, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(303, 0, '', 0, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(304, 0, '', 5, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(305, 0, '', 0, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(306, 0, '', 5, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(307, 0, '', 5, 0, 450000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(308, 0, '', 5, 0, 450000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(309, 0, '', 5, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(310, 0, '', 0, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(311, 0, '', 5, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(312, 0, '', 5, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(313, 0, '', 0, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(314, 0, '', 5, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(315, 0, '', 0, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(316, 0, '', 0, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(317, 0, '', 0, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(318, 0, '', 5, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(319, 0, '', 5, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(320, 0, '', 0, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(321, 0, '', 5, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(322, 0, '', 5, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(323, 0, '', 5, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(324, 0, '', 5, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(325, 0, '', 5, 0, 450000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(326, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(327, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(328, 0, '', 5, 0, 450000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(329, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(330, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(331, 0, '', 0, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(332, 0, '', 0, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(333, 0, '', 0, 0, 500000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(334, 0, '', 0, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(335, 0, '', 5, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(336, 0, '', 5, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(337, 0, '', 5, 0, 500000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(338, 0, '', 5, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(339, 0, '', 5, 0, 500000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(340, 0, '', 0, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(341, 0, '', 0, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(342, 0, '', 0, 0, 450000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(343, 0, '', 5, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(344, 0, '', 0, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(345, 0, '', 5, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(346, 0, '', 0, 0, 450000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(347, 0, '', 0, 0, 450000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(348, 0, '', 5, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(349, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(350, 0, '', 0, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(351, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(352, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(353, 0, '', 5, 0, 450000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(354, 0, '', 0, 0, 450000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(355, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(356, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(357, 0, '', 0, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(358, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(359, 0, '', 0, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(360, 0, '', 5, 0, 450000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(361, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(362, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(363, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(364, 0, '', 5, 0, 450000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(365, 0, '', 5, 0, 450000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(366, 0, '', 0, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(367, 0, '', 5, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(368, 0, '', 5, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(369, 0, '', 5, 0, 450000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(370, 0, '', 0, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(371, 0, '', 5, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(372, 0, '', 2, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(373, 0, '', 5, 0, 450000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(374, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(375, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(376, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(377, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(378, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(379, 0, '', 0, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(380, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(381, 0, '', 4, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(382, 0, '', 5, 0, 450000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(383, 0, '', 0, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(384, 0, '', 0, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(385, 0, '', 5, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(386, 0, '', 3, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(387, 0, '', 5, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(388, 0, '', 5, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(389, 0, '', 5, 0, 450000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(390, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(391, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(392, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(393, 0, '', 0, 0, 450000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(394, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(395, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(396, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(397, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
INSERT INTO `houses` (`id`, `owner_id`, `name`, `improvements`, `rent_time`, `price`, `rent_price`, `type`, `entrance`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `car_x`, `car_y`, `car_z`, `car_angle`, `store_x`, `store_y`, `store_z`, `eviction`, `store_metall`, `store_drugs`, `store_weapon`, `store_ammo`, `store_skin`) VALUES
(398, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(399, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(400, 0, '', 5, 0, 500000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(401, 0, '', 0, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(402, 0, '', 5, 0, 500000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(403, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(404, 0, '', 0, 0, 500000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(405, 0, '', 5, 0, 450000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(406, 0, '', 5, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(407, 0, '', 0, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(408, 0, '', 0, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(409, 0, '', 5, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(410, 0, '', 0, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(411, 0, '', 5, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(412, 0, '', 5, 0, 450000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(413, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(414, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(415, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(416, 0, '', 0, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(417, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(418, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(419, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(420, 0, '', 0, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(421, 0, '', 5, 0, 450000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(422, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(423, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(424, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(425, 0, '', 5, 0, 450000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(426, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(427, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(428, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(429, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(430, 0, '', 5, 0, 450000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(431, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(432, 0, '', 5, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(433, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(434, 0, '', 5, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(435, 0, '', 5, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(436, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(437, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(438, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(439, 0, '', 5, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(440, 0, '', 5, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(441, 0, '', 5, 0, 450000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(442, 0, '', 5, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(443, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(444, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(445, 0, '', 5, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(446, 0, '', 5, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(447, 0, '', 5, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(448, 0, '', 0, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(449, 0, '', 5, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(450, 0, '', 5, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(451, 0, '', 0, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(452, 0, '', 0, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(453, 0, '', 0, 0, 450000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(454, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(455, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(456, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(457, 0, '', 5, 0, 450000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(458, 0, '', 0, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(459, 0, '', 0, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(460, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(461, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(462, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(463, 0, '', 0, 0, 450000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(464, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(465, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(466, 0, '', 0, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(467, 0, '', 5, 0, 450000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(468, 0, '', 0, 0, 450000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(469, 0, '', 5, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(470, 0, '', 5, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(471, 0, '', 0, 0, 450000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(472, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(473, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(474, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(475, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(476, 0, '', 5, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(477, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(478, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(479, 0, '', 5, 0, 450000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(480, 0, '', 5, 0, 450000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(481, 0, '', 0, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(482, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(483, 0, '', 0, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(484, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(485, 0, '', 1, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(486, 0, '', 0, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(487, 0, '', 5, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(488, 0, '', 5, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(489, 0, '', 5, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(490, 0, '', 0, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(491, 0, '', 0, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(492, 0, '', 5, 0, 450000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(493, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(494, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(495, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(496, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(497, 0, '', 5, 0, 450000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(498, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(499, 0, '', 0, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(500, 0, '', 3, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(501, 0, '', 5, 0, 450000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(502, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(503, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(504, 0, '', 0, 0, 450000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(505, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(506, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(507, 0, '', 0, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(508, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -915.642, 742.634, 13.0786, -911.77, 742.832, 12.5538, 266.362, -901.488, 753.024, 12.5845, 3.25374, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(509, 0, '', 5, 0, 100000, 7000, 6, -1, 0, -2.83529, 595.115, 13.0936, -2.72501, 597.511, 12.7131, 315.935, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(510, 0, '', 5, 0, 100000, 7000, 6, -1, 0, 8.77968, 594.24, 13.0997, 9.80212, 597.247, 12.1772, 345.124, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(511, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -910.2, 803.403, 13.1247, -905.621, 803.598, 12.5611, 268.369, -907.983, 809.465, 12.5886, 270.603, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(512, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -909.759, 841.158, 13.0814, -906.767, 841.352, 12.5611, 271.502, -901.315, 850.322, 12.6162, 270.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(530, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 836.383, -1332.92, 40.7165, 833.409, -1333.68, 40.7165, 96.9411, 832.977, -1333.57, 40.7165, 74.0158, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(522, 0, '', 0, 0, 10000000, 0, 5, -1, 0, -286.996, 1249.53, 20.9844, -287.945, 1254.64, 20.8743, 224.162, -295.549, 1254.49, 20.7421, 181.861, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(523, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -316.422, 1251.69, 21.3906, -316.76, 1255.08, 20.8823, 1.0893, -317.552, 1257.26, 20.7414, 3.98212, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(513, 0, '', 0, 0, 50, 0, 6, -1, 0, -306.522, 488.966, 13.223, -309.333, 489.443, 12.8737, 256.344, -321.401, 490.382, 12.8096, 82.1275, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(514, 0, '', 5, 0, 100000000, 0, 0, -1, 0, 2290.85, -191.04, 2.14294, 2289.33, -193.151, 2.14294, 135.187, 2295.71, -210.163, 2.18921, 203.911, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(515, 0, '', 5, 0, 100000000, 0, 2, -1, 0, 2355.03, -261.294, 2.79638, 2356.2, -265.236, 2.79638, 33.9029, 2342.25, -263.525, 1.48889, 87.161, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(516, 0, '', 0, 0, 100000000, 0, 0, -1, 0, 2625.76, -180.869, 7.20756, 2628.45, -184.284, 7.22695, 254.059, 2629.4, -186.107, 7.15312, 267.869, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(517, 0, '', 0, 0, 50, 0, 6, -1, 0, -303.15, 516.448, 13.2285, -307.02, 517.289, 12.8656, 251.935, -317.54, 517.546, 12.6296, 98.692, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(518, 0, '', 5, 0, 10000000, 0, 6, -1, 0, -232.118, 1335, 20.9844, -237.101, 1334.89, 20.8898, 97.8873, -234.816, 1326.01, 20.7421, 75.4721, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(519, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -232.829, 1305.51, 21.3906, -237.241, 1305.4, 20.8823, 98.0557, -240.117, 1301.87, 20.7414, 352.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(520, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -232.333, 1290.93, 20.9844, -236.257, 1290.66, 20.8573, 86.2938, -240.482, 1286.15, 20.7414, 344.773, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(521, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -272.323, 1250.88, 21.3906, -272.709, 1256.92, 20.8898, 2.80142, -277.096, 1258.74, 20.7414, 264.582, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(560, 0, '', 5, 0, 50000000, 0, 2, -1, 0, 669.086, -1283.81, 41.8848, 668.113, -1285.04, 41.0098, 198.469, 662.598, -1301.22, 40.4405, 132.458, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(524, 0, '', 5, 0, 10000000, 0, 5, -1, 0, 1787.55, 2409.34, 15.3082, 1784.32, 2407.95, 15.2733, 285.625, 1787.28, 2402.74, 15.2737, 217.318, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(554, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2210.36, -95.159, 26.125, -2210.6, -95.429, 26.125, 101.839, -2213.64, -95.9077, 26.125, 100.191, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(563, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1911.18, 1086.44, 28.769, 1912.15, 1086.56, 28.769, 272.656, 1913.01, 1090.29, 28.769, 279.567, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(531, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 772.416, -1273.58, 40.7107, 769.649, -1274.68, 40.7165, 108.351, 766.488, -1274.32, 40.7165, 80.3046, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(561, 0, '', 0, 0, 5000000, 0, 2, -1, 0, -2812.33, -670.784, 8.62537, -2811.96, -671.979, 8.56018, 181.892, -2805.69, -671.704, 8.33861, 182.271, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(552, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2201.14, -107.546, 26.125, -2199.73, -107.922, 26.125, 275.373, -2199.46, -110.804, 26.125, 236.851, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(525, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 668.764, -1363.1, 40.7343, 671.394, -1364.64, 40.7343, 70.4924, 673.607, -1363.34, 40.7343, 300.653, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(526, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 734.808, -1392.2, 40.7134, 730.713, -1390.25, 40.7114, 249.873, 730.575, -1390.55, 40.7115, 118.385, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(527, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 760.23, -1402.05, 40.7168, 0, 0, 0, 0, 765.159, -1403.86, 40.7166, 252.769, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(528, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 791.408, -1407.55, 40.7165, 0, 0, 0, 0, 790.245, -1401.16, 40.7165, 9.00012, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(529, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 829.752, -1413.33, 40.7092, 825.182, -1412.94, 40.7165, 82.5647, 824.649, -1412.82, 40.7165, 78.5232, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(532, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 729.248, -1254.39, 40.9853, 730.12, -1257.73, 40.8622, 196.773, 730.107, -1260.27, 40.824, 177.245, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(533, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 700.42, -1250.33, 40.838, 699.54, -1252.91, 40.7343, 159.758, 696.08, -1257.62, 40.7343, 147.893, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(559, 0, '', 5, 0, 200000, 0, 0, -1, 0, -1543.25, 1584.09, 36.7768, -1544.43, 1583.68, 36.7768, 113.52, -1545.02, 1578.13, 36.7768, 194.254, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(534, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 656.188, -1232.2, 40.7344, 656.802, -1235.06, 40.7344, 186.86, 659.74, -1237.82, 40.7344, 226.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(535, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 644.801, -1244.29, 40.7343, 644.469, -1240.46, 40.7343, 30.3543, 644.469, -1240.46, 40.7343, 30.3543, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(536, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 570.416, -1316.85, 40.7343, 570.307, -1314.74, 40.7343, 352.398, 568.051, -1309.97, 40.7343, 34.6926, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(537, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 548.99, -1312.38, 40.7343, 545.486, -1310.67, 40.7343, 54.9576, 544.006, -1309.85, 40.7343, 59.9365, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(538, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 474.123, -1281.21, 40.7343, 473.429, -1278.54, 40.7343, 352.642, 471.497, -1274.93, 40.7343, 27.3912, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(539, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 468.885, -1254.2, 41.8655, 469.225, -1254.39, 41.8655, 152.511, 468.288, -1261.06, 40.7343, 168.987, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(540, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2223.52, -179.206, 2.46963, 2224.77, -179.031, 2.14385, 249.964, 2230.29, -180.342, 2.1435, 287.416, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(541, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2238.36, -168.02, 2.81221, 2240.67, -168.433, 2.77114, 248.015, 2244.9, -169.235, 2.69577, 261.733, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(542, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2253.29, -167.95, 2.81916, 2253.29, -167.95, 2.81916, 271.618, 2247.52, -169.558, 2.67337, 94.2607, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(543, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2251.19, -200.52, 2.1435, 2250.24, -200.591, 2.1435, 95.9314, 2246.91, -211.047, 2.1435, 216.889, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(544, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2409.29, -260.755, 1.66805, 2406.7, -260.811, 1.75318, 83.2179, 2403.28, -261.662, 1.75457, 105.823, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(545, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2474.37, -264.483, 1.55164, 2466.48, -259.073, 1.81765, 72.504, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(546, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2533.49, -190.739, 3.1993, 2531.81, -190.61, 3.1993, 94.4167, 2527.44, -190.6, 3.04771, 87.2098, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(547, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2609.07, -169.404, 7.32303, 2609.07, -169.404, 7.32303, 8.33922, 2604.16, -175.285, 7.24449, 120.49, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(548, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2205.32, -261.845, 1.61755, 2204.02, -266.187, 1.63748, 79.3288, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(549, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2602.49, -243.833, 3.97888, 2602.49, -243.833, 3.97888, 293.651, 2596.2, -249.211, 3.97888, 143.347, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(550, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2684, -260.958, 3.97524, 2682.17, -261.113, 3.97524, 112.116, 2673.22, -264.327, 4.12566, 108.562, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(551, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2198.26, -97.4927, 26.125, -2196.56, -101.415, 26.125, 119.872, -2196.38, -104.029, 26.125, 180.719, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(553, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2212.51, -107.581, 26.1179, -2212.51, -107.581, 26.1179, 265.764, -2217.92, -106.578, 26.125, 75.1224, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(555, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2195.93, -94.7812, 26.1179, -2195.93, -94.7812, 26.1179, 78.8916, -2188.95, -84.3278, 26.125, 346.332, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(556, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2181.97, -140.857, 26.125, -2181.97, -140.857, 26.125, 161.413, -2181.08, -135.202, 26.125, 344.964, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(557, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2188.79, -139.533, 26.125, -2188.95, -138.087, 26.125, 349.277, -2188.87, -130.554, 26.125, 357.8, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(558, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2195.91, -138.144, 26.125, -2196.01, -136.655, 26.125, 323.861, -2198.82, -135.762, 26.125, 7.20593, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(562, 0, '', 5, 0, 5000000, 0, 2, -1, 0, -2790.45, -709.893, 7.26051, -2788.45, -709.265, 6.47324, 314.297, -2783.39, -703.876, 6.36812, 290.893, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(564, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1894.06, 1086.17, 28.769, 1895.35, 1086.3, 28.769, 254.574, 1895.99, 1091.29, 28.769, 9.25485, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(565, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1909.75, 1066.22, 28.8205, 1911.4, 1065.94, 28.7805, 270.055, 1911.22, 1069.18, 28.785, 8.56015, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(566, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1894.91, 1186.52, 30.3278, 1894.77, 1187.59, 30.3224, 355.42, 1899.78, 1188.68, 30.0135, 9.52159, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(567, 0, '', 0, 0, 5000000, 0, 2, -1, 0, 1633.86, 1294.77, 12.2211, 1634.63, 1295.76, 12.2077, 310.05, 1644.82, 1296.42, 12.0926, 283.956, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(568, 0, '', 4, 0, 5000000, 0, 2, -1, 0, 838.705, -1323.03, 40.7096, 837.788, -1322.35, 40.7107, 94.0755, 837.176, -1324.48, 40.7112, 81.0172, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(569, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 834.799, -1391.52, 41.7043, 835.544, -1389.81, 41.3085, 350.786, 842.848, -1392.13, 40.7071, 352.234, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(570, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 623.878, -1243.93, 40.7343, 623.207, -1245.25, 40.7343, 199.795, 630.627, -1242.6, 40.7343, 149.315, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(571, 0, '', 0, 0, 1, 0, 0, -1, 0, 2196.63, -172.736, 2.45325, 2194.6, -169.466, 2.67972, 213.806, 2194.6, -169.466, 2.67972, 213.806, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `houses_renters`
--

CREATE TABLE `houses_renters` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `house_id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `houses_renters`
--

INSERT INTO `houses_renters` (`id`, `owner_id`, `house_id`, `room_id`, `rent_time`, `time`) VALUES
(203, 2791, 565, 0, 0, 1614442958),
(132, 2397, 465, 0, 0, 1614270837),
(8, 404, 2, 1, 0, 1613828849),
(7, 460, 2, 0, 0, 1613817720),
(15, 595, 124, 0, 0, 1613892336),
(10, 437, 2, 2, 0, 1613837961),
(11, 514, 2, 3, 0, 1613837964),
(96, 2099, 129, 0, 0, 1614194529),
(20, 647, 92, 0, 0, 1613914055),
(26, 422, 116, 0, 0, 1613927540),
(204, 244, 253, 1, 0, 1614445758),
(23, 755, 222, 0, 0, 1613916256),
(79, 1420, 124, 1, 0, 1614154383),
(38, 650, 21, 0, 0, 1613988755),
(127, 2551, 92, 1, 0, 1614267680),
(88, 95, 124, 2, 0, 1614181372),
(87, 1205, 235, 0, 0, 1614180222),
(35, 951, 236, 0, 0, 1613985719),
(75, 965, 101, 0, 0, 1614147655),
(131, 1303, 2, 4, 0, 1614270505),
(44, 1036, 65, 0, 0, 1614016209),
(94, 2023, 536, 0, 0, 1614191174),
(46, 1038, 86, 1, 0, 1614017612),
(116, 2384, 191, 0, 0, 1614242972),
(74, 851, 86, 0, 0, 1614146917),
(50, 554, 130, 0, 0, 1614028245),
(170, 2911, 118, 2, 0, 1614359217),
(53, 1098, 86, 2, 0, 1614066288),
(144, 2553, 191, 1, 0, 1614318959),
(200, 3185, 106, 0, 0, 1614436725),
(65, 1282, 524, 0, 0, 1614105917),
(67, 1008, 52, 0, 0, 1614112204),
(84, 329, 510, 0, 0, 1614170641),
(138, 2663, 304, 1, 0, 1614276786),
(70, 186, 52, 1, 0, 1614114628),
(167, 1709, 76, 0, 0, 1614357082),
(227, 2054, 6, 0, 0, 1614518307),
(104, 1899, 124, 3, 0, 1614202426),
(105, 2263, 510, 1, 0, 1614215039),
(165, 2904, 101, 1, 0, 1614356506),
(164, 2892, 307, 1, 0, 1614355875),
(110, 1497, 26, 0, 0, 1614228048),
(129, 2037, 118, 0, 0, 1614269715),
(114, 1507, 58, 0, 0, 1614235953),
(115, 2127, 183, 0, 0, 1614236267),
(161, 2588, 29, 0, 0, 1614352980),
(118, 2394, 166, 0, 0, 1614245892),
(162, 1577, 41, 0, 0, 1614353299),
(140, 2612, 464, 0, 0, 1614280271),
(143, 2746, 286, 0, 0, 1614317257),
(133, 2372, 493, 0, 0, 1614271893),
(123, 2381, 160, 0, 0, 1614257581),
(142, 2737, 195, 0, 0, 1614314542),
(177, 2944, 47, 1, 0, 1614362079),
(168, 2883, 309, 0, 0, 1614358204),
(135, 2461, 183, 1, 0, 1614273854),
(137, 2155, 480, 1, 0, 1614276572),
(145, 1127, 118, 1, 0, 1614323204),
(212, 2251, 37, 3, 0, 1614464810),
(147, 2298, 510, 3, 0, 1614323860),
(148, 2762, 392, 0, 0, 1614324073),
(188, 1056, 41, 1, 0, 1614414246),
(152, 2793, 187, 0, 0, 1614336041),
(199, 28, 37, 2, 0, 1614435575),
(193, 559, 455, 0, 0, 1614419454),
(192, 3121, 67, 0, 0, 1614416690),
(163, 1135, 37, 0, 0, 1614353744),
(159, 2812, 477, 0, 0, 1614348905),
(160, 2860, 47, 0, 0, 1614350239),
(171, 2172, 129, 1, 0, 1614359295),
(196, 356, 253, 0, 0, 1614430219),
(189, 1070, 446, 0, 0, 1614414551),
(211, 2407, 307, 0, 0, 1614463331),
(175, 2934, 211, 0, 0, 1614360661),
(198, 2597, 327, 0, 0, 1614435275),
(178, 2961, 46, 1, 0, 1614362524),
(184, 853, 37, 1, 0, 1614374838),
(181, 2593, 354, 0, 0, 1614365562),
(182, 2928, 304, 0, 0, 1614368413),
(201, 2662, 493, 1, 0, 1614438864),
(202, 2876, 229, 0, 0, 1614439767),
(226, 2399, 283, 0, 0, 1614516631),
(209, 1939, 51, 0, 0, 1614457480),
(207, 2068, 228, 0, 0, 1614446611),
(208, 3102, 92, 2, 0, 1614448086),
(213, 3297, 37, 4, 0, 1614467435),
(215, 3331, 33, 0, 0, 1614496396),
(216, 3345, 53, 0, 0, 1614496678),
(219, 3294, 112, 1, 0, 1614498053),
(218, 3179, 112, 0, 0, 1614497704),
(220, 3250, 33, 1, 0, 1614502229),
(221, 2196, 182, 0, 0, 1614504085),
(222, 3395, 44, 0, 0, 1614510090),
(223, 3364, 33, 2, 0, 1614511716),
(224, 255, 33, 3, 0, 1614511883),
(225, 3403, 33, 4, 0, 1614512042),
(228, 3465, 101, 2, 0, 1614518509);

-- --------------------------------------------------------

--
-- Структура таблицы `leaders`
--

CREATE TABLE `leaders` (
  `id` int(11) NOT NULL,
  `accout_id` int(11) NOT NULL DEFAULT 0,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `frac_id` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `money_log`
--

CREATE TABLE `money_log` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `description` varchar(64) NOT NULL DEFAULT 'None'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `money_log`
--

INSERT INTO `money_log` (`id`, `uid`, `uip`, `time`, `money`, `description`) VALUES
(1, 1, '85.140.92.95', 1657470301, -300, 'Аренда велика'),
(2, 1, '85.140.92.95', 1657496594, -300, 'Аренда велика'),
(3, 1, '85.140.92.95', 1657498180, 64000, 'Конвертация доната 16 в игровую валюту'),
(4, 1, '85.140.92.95', 1657531940, -300, 'Аренда велика'),
(5, 1, '85.140.92.95', 1657532307, 800, 'Зарплата на работе шахтера'),
(6, 3, '146.120.199.110', 1673645958, 500000, 'Выдача денег от админа Kichiro_Hirutomi'),
(7, 3, '146.120.199.110', 1673646283, -50000, 'Покупка улучшения аккаунта'),
(8, 3, '146.120.199.110', 1673646290, -75000, 'Покупка улучшения аккаунта'),
(9, 3, '146.120.199.110', 1673646293, -100000, 'Покупка улучшения аккаунта'),
(10, 3, '146.120.199.110', 1673646296, -125000, 'Покупка улучшения аккаунта'),
(11, 3, '146.120.199.110', 1673646299, -150000, 'Покупка улучшения аккаунта'),
(12, 3, '146.120.199.110', 1673647073, 64000, 'Конвертация доната 16 в игровую валюту'),
(13, 3, '146.120.199.110', 1673647426, 32000, 'Конвертация доната 8 в игровую валюту'),
(14, 3, '146.120.199.110', 1673647433, -2500, 'Аренда велика'),
(15, 3, '146.120.199.110', 1673649112, -2500, 'Аренда велика'),
(16, 3, '146.120.199.110', 1673649319, 2400000, 'Конвертация доната 600 в игровую валюту'),
(17, 3, '146.120.199.110', 1673649328, 8000000, 'Конвертация доната 2000 в игровую валюту'),
(18, 3, '146.120.199.110', 1673649332, -5000000, 'Покупка дома'),
(19, 3, '146.120.199.110', 1673649365, 3500000, '[BANK] Продажа дома'),
(20, 3, '146.120.199.110', 1673649365, 0, 'Продажа дома государству'),
(21, 3, '146.120.199.110', 1673649553, 4000000, 'Конвертация доната 1000 в игровую валюту'),
(22, 3, '146.120.199.110', 1673649563, 2800000, 'Конвертация доната 700 в игровую валюту'),
(23, 3, '146.120.199.110', 1673649574, -12000000, 'Покупка бизнеса'),
(24, 3, '146.120.199.110', 1673649609, 1200000, 'Конвертация доната 300 в игровую валюту'),
(25, 3, '146.120.199.110', 1673649617, -15000, 'Покупка улучшений для Бизнеса'),
(26, 3, '146.120.199.110', 1673649620, -30000, 'Покупка улучшений для Бизнеса'),
(27, 3, '146.120.199.110', 1673649622, -80000, 'Покупка улучшений для Бизнеса'),
(28, 3, '146.120.199.110', 1673649624, -150000, 'Покупка улучшений для Бизнеса'),
(29, 3, '146.120.199.110', 1673649627, -300000, 'Покупка улучшений для Бизнеса'),
(30, 3, '146.120.199.110', 1673649629, -450000, 'Покупка улучшений для Бизнеса'),
(31, 3, '146.120.199.110', 1673649718, -2500, 'Аренда велика'),
(32, 5, '85.140.93.165', 1675439146, 400, 'Выдача денег от админа Leo_Clemente'),
(33, 5, '85.140.93.165', 1675439197, 30002, 'Выдача денег от админа Leo_Clemente'),
(34, 7, '85.140.93.165', 1675457292, 10000, 'None'),
(35, 5, '85.140.93.209', 1675535587, 10000, 'None'),
(36, 5, '85.140.93.209', 1675535634, 10000, 'None'),
(37, 5, '85.140.93.209', 1675537260, 0, '[BANK] Зарплата'),
(38, 10, '95.215.249.85', 1675543231, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(39, 10, '95.215.249.85', 1675543233, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(40, 10, '95.215.249.85', 1675543234, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(41, 10, '95.215.249.85', 1675543236, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(42, 10, '95.215.249.85', 1675543239, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(43, 10, '95.215.249.85', 1675543240, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(44, 10, '95.215.249.85', 1675543242, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(45, 10, '95.215.249.85', 1675543245, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(46, 10, '95.215.249.85', 1675543331, -100, 'Аренда велика'),
(47, 11, '85.26.234.133', 1675547727, 10000, 'Выдача денег от админа Restrari_Restrari'),
(48, 11, '85.26.234.133', 1675547731, 100000, 'Выдача денег от админа Restrari_Restrari'),
(49, 11, '85.26.234.133', 1675547733, 100000, 'Выдача денег от админа Restrari_Restrari'),
(50, 11, '85.26.234.133', 1675547739, 10000000, 'Выдача денег от админа Restrari_Restrari'),
(51, 15, '79.166.81.131', 1675692308, -300, 'Метка ТС на GPS'),
(52, 15, '79.166.81.131', 1675692438, -100, 'Аренда велика'),
(53, 13, '85.140.93.144', 1675699496, 500000, 'Выдача денег от админа Lev_Clemente');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `company` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `type`, `company`, `amount`, `price`, `time`) VALUES
(4, 1, 3, 8000, 10, 1613060914),
(5, 2, 36, 400, 25, 1613740339),
(15, 2, 10, 10, 200, 1613772592),
(8, 2, 12, 1000, 200, 1613741852),
(9, 2, 35, 1000, 200, 1613742230),
(13, 2, 11, 62, 100, 1613751765);

-- --------------------------------------------------------

--
-- Структура таблицы `ownable_cars`
--

CREATE TABLE `ownable_cars` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `color_1` int(11) NOT NULL DEFAULT -1,
  `color_2` int(11) NOT NULL DEFAULT -1,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `angle` float NOT NULL,
  `number` varchar(7) NOT NULL DEFAULT '------',
  `status` int(11) NOT NULL,
  `alarm` int(11) NOT NULL,
  `key_in` int(11) NOT NULL,
  `mileage` float NOT NULL,
  `create_time` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT 1000,
  `vinilcar` int(11) NOT NULL,
  `pt_engine` int(11) NOT NULL,
  `pt_brake` int(11) NOT NULL,
  `pt_stability` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `ownable_cars`
--

INSERT INTO `ownable_cars` (`id`, `owner_id`, `model_id`, `color_1`, `color_2`, `pos_x`, `pos_y`, `pos_z`, `angle`, `number`, `status`, `alarm`, `key_in`, `mileage`, `create_time`, `health`, `vinilcar`, `pt_engine`, `pt_brake`, `pt_stability`) VALUES
(1, 3, 429, 0, 0, 2521.82, -760.029, 12.108, 0.837199, '------', 0, 0, 0, 0, 1608102164, 1000, 0, 0, 0, 0),
(2, 3, 411, 0, 1, 2515.26, -760.347, 12.1076, 359.8, '------', 0, 0, 1, 5.37695, 1608102338, 703.169, 0, 0, 0, 0),
(3, 3, 467, 1, 0, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 79.8231, 1608789772, 1000, 0, 0, 0, 0),
(4, 22, 586, 0, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 1, 1.75056, 1610024968, 1000, 0, 0, 0, 0),
(436, 45, 490, 3, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613740811, 1000, 0, 0, 0, 0),
(6, 22, 451, 0, 0, -1474.58, 1543.87, 36.3916, 359.546, '------', 0, 0, 1, 1.08222, 1610026951, 1000, 0, 0, 0, 0),
(445, 104, 579, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.505, 1613741220, 1000, 0, 0, 0, 0),
(8, 35, 410, 1, 0, -346.232, 1286.4, 20.0513, 1.66577, 'P608ET', 0, 0, 0, 6.14972, 1610200945, 1000, 0, 0, 0, 0),
(9, 35, 400, 1, 0, -346.849, 1279.78, 20.0037, 0.13562, 'A111AA', 0, 0, 0, 4.29777, 1610201179, 1000, 0, 0, 0, 0),
(10, 35, 603, 0, 1, -346.49, 1294.3, 20.0574, 2.0328, 'B888BB', 0, 0, 0, 6.29887, 1610209090, 1000, 0, 0, 0, 0),
(11, 35, 579, 0, 1, -355.578, 1279.83, 20.1389, 269.644, 'O555OO', 1, 0, 1, 9.52584, 1610232706, 1000, 0, 0, 0, 0),
(12, 35, 415, 1, 1, -362.303, 1280, 19.8973, 267.634, 'B111BB', 0, 0, 0, 19.3508, 1610233170, 300, 0, 0, 0, 0),
(1034, 469, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 6.16666, 1613828710, 1000, 0, 0, 0, 0),
(1012, 476, 421, 40, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 6.11083, 1613827392, 1000, 0, 0, 0, 0),
(6124, 2746, 480, 111, 1, 2578.91, -2412.52, 21.1775, 87.6252, 'M553OM', 0, 0, 1, 31.4571, 1614408212, 1000, 0, 0, 0, 0),
(27, 81, 579, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, 'X666XX', 0, 0, 1, 1.27333, 1611923115, 1000, 0, 0, 0, 0),
(22, 79, 466, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, 'A777MP', 0, 0, 0, 0, 1611915576, 1000, 0, 0, 0, 0),
(19, 75, 429, 0, 0, 2575.18, -2445.32, 21.1933, 177.67, 'E777EE', 0, 0, 1, 69.3502, 1611914065, 1000, 0, 0, 0, 0),
(23, 79, 579, 1, 0, -677.036, 892.931, 11.972, 87.202, 'X777XX', 0, 0, 0, 2.45889, 1611915719, 1000, 0, 0, 0, 0),
(24, 79, 415, 0, 0, -672.495, 901.503, 11.7096, 178.941, 'O777MP', 0, 0, 0, 2.21944, 1611916083, 1000, 0, 0, 0, 0),
(25, 79, 402, 0, 1, -668.411, 901.353, 12.4013, 180.537, 'A777AA', 0, 0, 0, 10.7972, 1611916172, 1000, 0, 0, 0, 0),
(28, 79, 541, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, 'M777EP', 0, 0, 0, 0.141666, 1611923183, 1000, 0, 0, 0, 0),
(29, 75, 579, 0, 0, -398.403, 1344.89, 20.1391, 176.643, 'E666EE', 0, 0, 0, 67.7162, 1611923402, 300, 0, 0, 0, 0),
(30, 75, 541, 1, 1, 1819.26, 2103.62, 15.0571, 0.464219, 'A444AA', 0, 0, 1, 17.841, 1611930915, 1000, 0, 0, 0, 0),
(33, 181, 451, 0, 1, -737.406, 847.12, 11.7405, 89.1854, 'M777MM', 1, 0, 1, 102.797, 1611931580, 1000, 0, 0, 0, 0),
(38, 120, 402, 0, 0, -902.232, 855.25, 12.3983, 269.781, 'B666BB', 0, 0, 0, 1.15083, 1612980631, 1000, 0, 0, 0, 0),
(39, 120, 415, 1, 1, -928.566, 901.127, 11.7089, 180.743, '------', 0, 0, 0, 1.63139, 1612980658, 1000, 0, 0, 0, 0),
(40, 120, 451, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1612980670, 1000, 0, 0, 0, 0),
(41, 120, 466, 0, 1, -900.626, 854.257, 11.7778, 251.661, '------', 0, 0, 0, 0.230833, 1612980697, 1000, 0, 0, 0, 0),
(42, 120, 506, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1612980707, 1000, 0, 0, 0, 0),
(43, 120, 541, 1, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1612980759, 1000, 0, 0, 0, 0),
(44, 120, 477, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1612980817, 1000, 0, 0, 0, 0),
(45, 120, 603, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1612980830, 1000, 0, 0, 0, 0),
(46, 120, 410, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1612980847, 1000, 0, 0, 0, 0),
(47, 120, 405, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1612980877, 1000, 0, 0, 0, 0),
(48, 120, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613022635, 1000, 0, 0, 0, 0),
(51, 123, 603, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, 'E666KX', 0, 0, 0, 0.179722, 1613035452, 1000, 0, 0, 0, 0),
(52, 123, 451, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, 'P666PP', 0, 0, 0, 0, 1613035467, 1000, 0, 0, 0, 0),
(53, 123, 415, 1, 1, -963.8, 902.298, 11.7008, 179.814, 'A666AA', 0, 0, 0, 9.15891, 1613035479, 1000, 0, 0, 0, 0),
(54, 130, 402, 1, 0, -468.439, 1466.68, 20.5846, 271.436, 'T777TT', 0, 0, 1, 5.75639, 1613041612, 1000, 0, 0, 0, 0),
(1413, 579, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0.000277, 1613888454, 1000, 0, 0, 0, 0),
(98, 207, 545, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1613043976, 1000, 0, 0, 0, 0),
(544, 102, 415, 1, 1, -388.826, 1267.21, 19.9683, 268.729, '------', 0, 0, 0, 16.0439, 1613749132, 1000, 0, 0, 0, 0),
(61, 134, 466, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613042436, 1000, 0, 0, 0, 0),
(5133, 1839, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 0.657777, 1614271684, 1000, 0, 0, 0, 0),
(63, 134, 579, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613042463, 1000, 0, 0, 0, 0),
(64, 134, 579, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613042478, 1000, 0, 0, 0, 0),
(65, 134, 402, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613042490, 1000, 0, 0, 0, 0),
(66, 133, 429, 0, 1, 1375.51, 451.079, 12.6476, 146.918, 'T888TT', 0, 0, 0, 0, 1613042507, 1000, 0, 0, 0, 0),
(67, 134, 400, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613042528, 1000, 0, 0, 0, 0),
(68, 134, 415, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613042542, 1000, 0, 0, 0, 0),
(70, 134, 410, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613042554, 1000, 0, 0, 0, 0),
(71, 168, 415, 1, 0, -261.673, 1347.61, 19.8789, 0.020658, 'O837KT', 0, 0, 0, 6.25333, 1613042573, 1000, 0, 0, 0, 0),
(72, 146, 402, 0, 0, -733.252, 782.35, 12.3742, 92.6926, '------', 0, 0, 0, 8.50832, 1613042582, 1000, 0, 0, 0, 0),
(74, 134, 409, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613042592, 1000, 0, 0, 0, 0),
(1486, 603, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.000277, 1613894516, 1000, 0, 0, 0, 0),
(77, 134, 603, 1, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613042623, 1000, 0, 0, 0, 0),
(78, 153, 415, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.347777, 1613042810, 1000, 0, 0, 0, 0),
(79, 126, 434, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1613042811, 1000, 0, 0, 0, 0),
(81, 126, 436, 1, 0, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1613042870, 1000, 0, 0, 0, 0),
(95, 132, 426, 0, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 0, 0.040555, 1613043868, 1000, 0, 0, 0, 0),
(82, 126, 429, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 0, 1613042928, 1000, 0, 0, 0, 0),
(83, 129, 415, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613042943, 1000, 0, 0, 0, 0),
(84, 133, 426, 0, 0, 1375.51, 451.079, 12.6476, 146.918, 'M888EP', 0, 0, 0, 0, 1613042972, 1000, 0, 0, 0, 0),
(86, 145, 411, 1, 1, 1378.71, 448.596, 12.6462, 149.598, 'X111XX', 0, 0, 0, 0, 1613042987, 1000, 0, 0, 0, 0),
(87, 189, 410, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 1.63639, 1613043284, 1000, 0, 0, 0, 0),
(88, 171, 402, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0.546108, 1613043301, 1000, 0, 0, 0, 0),
(89, 188, 400, 0, 1, -239.293, 1090.51, 11.2622, 173.58, '------', 0, 0, 0, 3.90222, 1613043315, 1000, 0, 0, 0, 0),
(90, 176, 424, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 9.06805, 1613043342, 1000, 0, 0, 0, 0),
(91, 133, 415, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, 'M666EP', 0, 0, 1, 2.23944, 1613043407, 1000, 0, 0, 0, 0),
(5680, 1741, 505, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.607222, 1614351579, 1000, 0, 0, 0, 0),
(93, 174, 415, 1, 1, -209.576, 1063.83, 11.1529, 174.799, 'X777EP', 0, 0, 1, 10.0003, 1613043497, 300, 0, 0, 0, 0),
(94, 190, 496, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 1.95445, 1613043841, 1000, 0, 0, 0, 0),
(99, 145, 516, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, 'X005AM', 1, 0, 1, 0.375833, 1613044020, 1000, 0, 0, 0, 0),
(100, 126, 411, 0, 1, -790.447, 809.191, 11.7311, 270.656, 'C777AM', 0, 0, 0, 7.99279, 1613044045, 1000, 0, 0, 0, 0),
(490, 121, 402, 0, 1, -469.692, 1426.04, 20.5865, 90.9626, 'B541XX', 0, 0, 0, 31.6565, 1613745006, 1000, 0, 0, 0, 0),
(102, 194, 421, 1, 0, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 1.50722, 1613044134, 1000, 0, 0, 0, 0),
(104, 184, 541, 0, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0.351388, 1613044392, 1000, 0, 0, 0, 0),
(252, 158, 516, 1, 1, 1830.2, 2093.69, 15.9861, 7.69066, '------', 1, 0, 1, 5.58167, 1613055682, 1000, 0, 0, 0, 0),
(106, 203, 429, 0, 0, 2410.1, -233.18, 1.2512, 0.767412, '------', 0, 0, 1, 8.37694, 1613044406, 1000, 0, 0, 0, 0),
(107, 158, 402, 1, 1, 1830.66, 2095.99, 15.9162, 3.07781, 'O777OO', 0, 0, 1, 12.2828, 1613044420, 1000, 0, 0, 0, 0),
(109, 145, 579, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613044455, 1000, 0, 0, 0, 0),
(112, 162, 402, 1, 1, -739.388, 741.919, 12.4001, 93.4848, 'O318CC', 0, 0, 0, 18.0039, 1613044479, 1000, 0, 0, 0, 0),
(113, 159, 496, 1, 0, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1613044482, 1000, 0, 0, 0, 0),
(114, 145, 402, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613044490, 1000, 0, 0, 0, 0),
(514, 183, 410, 124, 1, -361.828, 1431, 19.9798, 274.783, '------', 0, 0, 1, 25.568, 1613747079, 1000, 0, 0, 0, 0),
(116, 145, 415, 1, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613044513, 1000, 0, 0, 0, 0),
(117, 145, 402, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 1, 0.007777, 1613044579, 1000, 0, 0, 0, 0),
(936, 46, 415, 6, 1, -437.341, 1410.79, 19.8873, 268.414, '------', 0, 0, 1, 21.6291, 1613820571, 1000, 0, 0, 0, 0),
(119, 131, 451, 1, 0, -861.784, 906.374, 11.7479, 185.216, 'A228MP', 0, 0, 0, 2.02083, 1613044693, 1000, 0, 0, 0, 0),
(546, 196, 429, 119, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 1, 0, 1, 1.70027, 1613749191, 1000, 0, 0, 0, 0),
(1487, 346, 410, 0, 1, -166.998, 990.041, 11.2421, 1.08884, '------', 0, 0, 0, 1.99167, 1613894567, 1000, 0, 0, 0, 0),
(121, 139, 436, 1, 0, -672.216, 901.645, 11.7774, 16.418, 'B777EC', 1, 0, 1, 11.4945, 1613044998, 1000, 0, 0, 0, 0),
(123, 184, 436, 1, 0, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 3.32306, 1613045080, 1000, 0, 0, 0, 0),
(577, 215, 490, 3, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 1, 0, 1, 0.132777, 1613751753, 1000, 0, 0, 0, 0),
(125, 136, 429, 1, 0, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 1, 1.32611, 1613045358, 1000, 0, 0, 0, 0),
(412, 49, 429, 1, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0.120277, 1613367622, 1000, 0, 0, 0, 0),
(131, 134, 404, 0, 1, 1827.91, 2104.73, 15.0864, 180.111, '------', 0, 0, 0, 0.202777, 1613045851, 1000, 0, 0, 0, 0),
(134, 221, 451, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.094166, 1613045902, 1000, 0, 0, 0, 0),
(130, 134, 516, 1, 0, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613045836, 1000, 0, 0, 0, 0),
(512, 225, 490, 1, 1, -332.36, 1407.15, 20.0504, 90.3132, '------', 0, 0, 1, 10.2305, 1613746941, 1000, 0, 0, 0, 0),
(133, 227, 400, 1, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 1.22444, 1613045883, 1000, 0, 0, 0, 0),
(143, 147, 439, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.066111, 1613046645, 1000, 0, 0, 0, 0),
(136, 201, 541, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0.029721, 1613045996, 1000, 0, 0, 0, 0),
(253, 158, 404, 0, 0, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613055736, 1000, 0, 0, 0, 0),
(502, 205, 521, 0, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 3.34222, 1613746265, 1000, 0, 0, 0, 0),
(144, 202, 579, 0, 1, -457.039, 1386.24, 20.1401, 266.064, 'O999OO', 0, 0, 0, 9.93389, 1613046921, 1000, 0, 0, 0, 0),
(145, 232, 496, 0, 1, 2431.47, -209.824, 1.39425, 5.60606, '------', 0, 0, 0, 5.86278, 1613047076, 1000, 0, 0, 0, 0),
(146, 248, 436, 0, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 2.69833, 1613047102, 1000, 0, 0, 0, 0),
(147, 250, 404, 1, 0, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613047205, 1000, 0, 0, 0, 0),
(149, 160, 429, 0, 0, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 0, 13.4097, 1613047411, 1000, 0, 0, 0, 0),
(225, 162, 415, 1, 0, -739.392, 741.919, 11.7334, 93.4848, '------', 0, 0, 0, 0.072222, 1613054293, 1000, 0, 0, 0, 0),
(151, 197, 466, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 1, 0, 1, 0.709166, 1613047843, 1000, 0, 0, 0, 0),
(152, 229, 402, 1, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 1, 0, 1, 3.78111, 1613047888, 1000, 0, 0, 0, 0),
(153, 229, 579, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, 'B444EC', 0, 0, 0, 0.219999, 1613047920, 1000, 0, 0, 0, 0),
(154, 272, 402, 1, 0, -402.84, 1441.63, 20.5864, 356.714, 'A555AA', 0, 0, 0, 3.50278, 1613048029, 1000, 0, 0, 0, 0),
(155, 182, 429, 0, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 0, 1613048153, 1000, 0, 0, 0, 0),
(900, 124, 402, 119, 1, 2591.71, -1509.26, 23.6347, 83.5577, '------', 0, 0, 0, 0.627499, 1613815927, 1000, 0, 0, 0, 0),
(156, 134, 516, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1613048412, 1000, 0, 0, 0, 0),
(160, 206, 429, 1, 0, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 7.61305, 1613048957, 300, 0, 0, 0, 0),
(163, 267, 402, 0, 0, -356.19, 1462.59, 20.5629, 178.317, 'B832XE', 0, 0, 0, 24.1117, 1613049182, 1000, 0, 0, 0, 0),
(164, 266, 451, 0, 1, -261.755, 1440.76, 19.9614, 3.94417, '------', 0, 0, 0, 1.42194, 1613049185, 1000, 0, 0, 0, 0),
(165, 221, 468, 1, 0, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0, 1613049276, 1000, 0, 0, 0, 0),
(230, 308, 429, 1, 1, -350.27, 1311.7, 19.9365, 83.9639, '------', 0, 0, 0, 1.93056, 1613054662, 1000, 0, 0, 0, 0),
(169, 133, 579, 0, 0, -785.369, 853.621, 11.9508, 264.394, 'B666OP', 0, 0, 0, 0.89111, 1613049628, 1000, 0, 0, 0, 0),
(629, 305, 579, 118, 1, -196.493, 1002.07, 11.3946, 270.48, '------', 0, 0, 0, 4.36805, 1613757629, 1000, 0, 0, 0, 0),
(594, 143, 558, 1, 1, 1926.29, 2267.91, 14.9373, 179.795, '------', 0, 0, 1, 5.21416, 1613754636, 1000, 0, 0, 0, 0),
(173, 160, 424, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 2.75278, 1613049762, 1000, 0, 0, 0, 0),
(586, 269, 401, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613753298, 1000, 0, 0, 0, 0),
(182, 238, 402, 0, 1, -437.345, 1410.79, 20.5859, 268.392, '------', 0, 0, 0, 7.40722, 1613050468, 1000, 0, 0, 0, 0),
(183, 243, 402, 0, 0, 1803.95, 2474.08, 15.6594, 304.577, '------', 0, 0, 0, 13.4375, 1613050498, 300, 0, 0, 0, 0),
(589, 233, 579, 2, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613753747, 1000, 0, 0, 0, 0),
(185, 257, 603, 1, 1, -455.421, 1498.32, 19.9873, 84.6797, 'X999XX', 0, 0, 0, 9.68167, 1613050543, 1000, 0, 0, 0, 0),
(186, 160, 521, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 0, 0.248055, 1613050697, 1000, 0, 0, 0, 0),
(187, 279, 541, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, 'B666EC', 1, 0, 0, 1.20444, 1613050706, 1000, 0, 0, 0, 0),
(600, 280, 401, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 1.60083, 1613754932, 1000, 0, 0, 0, 0),
(297, 334, 579, 0, 0, -380.483, 1432.43, 20.1391, 358.089, '------', 1, 0, 0, 1.68111, 1613058155, 1000, 0, 0, 0, 0),
(889, 283, 405, 0, 1, -216.519, 998.141, 11.2767, 62.7731, 'H286BH', 0, 0, 1, 11.4553, 1613815167, 1000, 0, 0, 0, 0),
(195, 277, 429, 1, 0, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 7.20473, 1613051384, 1000, 0, 0, 0, 0),
(196, 297, 404, 1, 0, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1613051424, 1000, 0, 0, 0, 0),
(679, 109, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613766140, 1000, 0, 0, 0, 0),
(291, 267, 466, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0.199999, 1613057768, 1000, 0, 0, 0, 0),
(559, 223, 579, 0, 1, -3.7194, 2635.95, 10.5473, 180.509, 'X513PA', 0, 0, 1, 7.79167, 1613750599, 1000, 0, 0, 0, 0),
(974, 268, 415, 2, 1, 2283.95, -2219.53, 21.1123, 343.628, '------', 0, 0, 0, 5.73805, 1613823482, 300, 0, 0, 0, 0),
(605, 263, 415, 118, 1, -199.936, 992.987, 11.1529, 95.8797, '------', 1, 0, 1, 2.13778, 1613755031, 1000, 0, 0, 0, 0),
(698, 362, 471, 4, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0.164166, 1613771079, 1000, 0, 0, 0, 0),
(2927, 1054, 421, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0, 1614025997, 1000, 0, 0, 0, 0),
(606, 260, 541, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 1.23611, 1613755052, 1000, 0, 0, 0, 0),
(215, 273, 466, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 1.04333, 1613052453, 1000, 0, 0, 0, 0),
(1518, 609, 533, 0, 1, 216.766, 1529.5, 11.1865, 359.266, '------', 1, 0, 1, 5.13528, 1613898146, 1000, 0, 0, 0, 0),
(6024, 342, 505, 13, 0, 2477.47, -740.933, 11.795, 0, 'M808XK', 0, 0, 0, 0, 1614381523, 1000, 0, 0, 0, 0),
(981, 290, 479, 3, 1, 1371.47, 452.445, 12.6497, 149.09, 'E578OT', 0, 0, 0, 0, 1613824307, 1000, 0, 0, 0, 0),
(222, 272, 468, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 0, 1613053839, 1000, 0, 0, 0, 0),
(223, 221, 521, 0, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0.108332, 1613054004, 1000, 0, 0, 0, 0),
(226, 162, 579, 0, 0, -739.389, 741.919, 11.9581, 93.485, '------', 0, 0, 0, 9.29639, 1613054340, 1000, 0, 0, 0, 0),
(232, 267, 415, 0, 1, -356.224, 1462.61, 19.881, 178.545, '------', 0, 0, 1, 12.7011, 1613054849, 1000, 0, 0, 0, 0),
(233, 272, 415, 0, 1, -413.309, 1426.4, 20.0456, 90.3067, 'C777EC', 0, 0, 0, 1.86, 1613054876, 1000, 0, 0, 0, 0),
(268, 295, 541, 0, 1, -403.102, 1497.15, 19.9494, 178.312, '------', 0, 0, 0, 2.34917, 1613057166, 1000, 0, 0, 0, 0),
(234, 203, 481, 0, 0, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0, 1613054911, 1000, 0, 0, 0, 0),
(235, 272, 579, 1, 1, -402.216, 1431.1, 20.1393, 0.812529, 'C777CC', 0, 0, 0, 11.3486, 1613054933, 1000, 0, 0, 0, 0),
(236, 241, 429, 0, 0, 1895.61, -2233.36, 10.4684, 352.53, 'O746OC', 0, 0, 0, 14.6536, 1613054984, 1000, 0, 0, 0, 0),
(237, 203, 471, 1, 0, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 1.94528, 1613055002, 1000, 0, 0, 0, 0),
(239, 272, 409, 0, 1, -412.627, 1431.94, 20.6906, 89.8227, 'B777BB', 0, 0, 0, 0.894444, 1613055016, 1000, 0, 0, 0, 0),
(1421, 546, 562, 3, 1, 2209.03, -235.194, 1.21195, 188.112, 'K428CP', 0, 0, 1, 19.1114, 1613889856, 1000, 0, 0, 0, 0),
(241, 300, 579, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613055134, 1000, 0, 0, 0, 0),
(242, 300, 402, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613055244, 1000, 0, 0, 0, 0),
(243, 300, 506, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613055258, 1000, 0, 0, 0, 0),
(244, 300, 541, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613055268, 1000, 0, 0, 0, 0),
(251, 300, 415, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, 'X666EP', 0, 0, 0, 0.978888, 1613055599, 1000, 0, 0, 0, 0),
(255, 158, 466, 0, 0, 2240.76, -207.175, 1.36114, 347.014, 'B572OM', 0, 0, 1, 11.1411, 1613055994, 1000, 0, 0, 0, 0),
(246, 314, 415, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 1, 3.45806, 1613055411, 1000, 0, 0, 0, 0),
(584, 259, 415, 3, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 1, 0, 1, 0.7875, 1613752885, 1000, 0, 0, 0, 0),
(248, 148, 466, 0, 1, -459.343, 1403.95, 19.9596, 87.407, '------', 0, 0, 0, 0.029166, 1613055485, 1000, 0, 0, 0, 0),
(250, 148, 541, 1, 1, -469.219, 1403.71, 19.9494, 269.931, 'A888AA', 0, 0, 0, 5.83083, 1613055564, 1000, 0, 0, 0, 0),
(1942, 820, 451, 6, 1, -204.05, 600.929, 11.2848, 82.3798, '------', 0, 0, 1, 5.16944, 1613928021, 300, 0, 0, 0, 0),
(256, 258, 415, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 1, 0, 0, 0, 1613056044, 1000, 0, 0, 0, 0),
(277, 182, 541, 1, 0, -288.962, 1537.17, 19.9863, 358.126, 'K444KK', 0, 0, 0, 3.5025, 1613057385, 1000, 0, 0, 0, 0),
(258, 139, 429, 0, 1, -665.399, 900.229, 11.8229, 300.356, '------', 1, 0, 1, 3.89945, 1613056565, 1000, 0, 0, 0, 0),
(766, 381, 505, 3, 1, 278.957, 1606.12, 12.454, 84.3901, '------', 0, 0, 1, 7.94361, 1613800732, 1000, 0, 0, 0, 0),
(259, 214, 445, 1, 0, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 2.15667, 1613056670, 1000, 0, 0, 0, 0),
(263, 313, 429, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 0, 1613056792, 1000, 0, 0, 0, 0),
(377, 184, 579, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 3.79889, 1613067023, 1000, 0, 0, 0, 0),
(284, 182, 410, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613057474, 1000, 0, 0, 0, 0),
(266, 330, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1613057085, 1000, 0, 0, 0, 0),
(271, 182, 402, 0, 0, -292.166, 1536.17, 20.6554, 359.151, '------', 0, 0, 0, 4.74138, 1613057251, 1000, 0, 0, 0, 0),
(272, 182, 415, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613057285, 1000, 0, 0, 0, 0),
(274, 182, 466, 1, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613057318, 1000, 0, 0, 0, 0),
(276, 182, 506, 0, 1, -292.179, 1530.41, 19.9908, 358.318, '------', 0, 0, 0, 2.45861, 1613057355, 1000, 0, 0, 0, 0),
(279, 182, 603, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613057424, 1000, 0, 0, 0, 0),
(1423, 586, 480, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613889998, 1000, 0, 0, 0, 0),
(281, 182, 409, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0.311388, 1613057453, 1000, 0, 0, 0, 0),
(282, 206, 415, 0, 1, 259.442, 1572, 10.9022, 184.176, '------', 0, 0, 1, 13.3567, 1613057454, 300, 0, 0, 0, 0),
(283, 126, 579, 0, 1, -790.363, 809.358, 11.9541, 270.226, 'X777AM', 0, 0, 0, 5.95805, 1613057455, 1000, 0, 0, 0, 0),
(285, 182, 405, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.2, 1613057493, 1000, 0, 0, 0, 0),
(286, 126, 415, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, 'X555AM', 0, 0, 0, 0.557777, 1613057493, 1000, 0, 0, 0, 0),
(287, 206, 579, 1, 0, -312.018, 1464.46, 20.1581, 173.604, 'X888AM', 1, 0, 1, 13.0374, 1613057501, 300, 0, 0, 0, 0),
(288, 126, 466, 0, 1, -782.606, 799.79, 11.7713, 358.957, 'O007OO', 0, 0, 0, 1.99361, 1613057520, 1000, 0, 0, 0, 0),
(289, 206, 466, 1, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613057526, 1000, 0, 0, 0, 0),
(290, 126, 402, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613057550, 1000, 0, 0, 0, 0),
(319, 185, 402, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 1, 1.34889, 1613060103, 1000, 0, 0, 0, 0),
(301, 291, 415, 1, 1, -231.744, 1492.82, 19.8971, 270.361, 'A253CX', 1, 0, 1, 15.2803, 1613058480, 1000, 0, 0, 0, 0),
(303, 600, 415, 1, 1, -682.045, 891.567, 11.7301, 176.685, 'A222AA', 0, 0, 1, 112.236, 1613058685, 1000, 0, 3, 3, 3),
(957, 245, 502, 114, 1, 2481.31, -740.893, 11.795, 0, 'P451PK', 1, 0, 0, 5.28361, 1613822489, 1000, 0, 0, 0, 0),
(916, 347, 480, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 3.49584, 1613818054, 1000, 0, 0, 0, 0),
(3214, 686, 506, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 0.267222, 1614082135, 1000, 0, 0, 0, 0),
(312, 270, 402, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 6.46639, 1613058890, 1000, 0, 0, 0, 0),
(313, 239, 579, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.204722, 1613058972, 1000, 0, 0, 0, 0),
(789, 96, 415, 3, 1, -365.589, 1249.28, 19.9039, 3.76566, 'M424KM', 0, 0, 0, 8.42582, 1613805598, 1000, 0, 0, 0, 0),
(879, 107, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1613814630, 1000, 0, 0, 0, 0),
(322, 341, 400, 1, 1, -257.102, 1368.21, 20.0769, 271.587, 'B777EK', 0, 0, 0, 2.58444, 1613060498, 1000, 0, 0, 0, 0),
(316, 257, 415, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613059775, 1000, 0, 0, 0, 0),
(317, 257, 579, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.055555, 1613059802, 1000, 0, 0, 0, 0),
(691, 345, 402, 0, 1, -199.175, 989.715, 11.843, 1.61521, 'K044TP', 1, 0, 1, 13.7595, 1613768495, 1000, 0, 0, 0, 0),
(680, 85, 451, 26, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 2.40639, 1613766147, 300, 0, 0, 0, 0),
(326, 288, 506, 1, 0, 4.5685, 2635.83, 10.5489, 179.416, 'H511CH', 1, 0, 1, 16.5236, 1613061074, 1000, 0, 0, 0, 0),
(327, 164, 451, 1, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 1, 0, 1, 1.20639, 1613061081, 1000, 0, 0, 0, 0),
(328, 164, 402, 0, 0, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613061102, 1000, 0, 0, 0, 0),
(329, 164, 579, 1, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613061115, 1000, 0, 0, 0, 0),
(330, 164, 603, 1, 0, -902.458, 747.902, 11.7968, 269.482, 'B888OP', 0, 0, 1, 1.7675, 1613061133, 1000, 0, 0, 0, 0),
(991, 23, 579, 3, 1, 491.845, 678.574, 11.5662, 251.635, 'M871EK', 1, 0, 0, 0.0175, 1613825608, 1000, 0, 0, 0, 0),
(707, 242, 415, 1, 1, -410.119, 1466.77, 19.8829, 188.388, '------', 0, 0, 1, 2.66805, 1613778077, 1000, 0, 0, 0, 0),
(334, 243, 415, 1, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613061244, 1000, 0, 0, 0, 0),
(335, 243, 579, 0, 0, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613061276, 1000, 0, 0, 0, 0),
(336, 243, 410, 0, 1, 237.899, 1612.38, 11.235, 100.041, 'E888EE', 0, 0, 0, 2.175, 1613061305, 1000, 0, 0, 0, 0),
(920, 460, 415, 119, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.811944, 1613818632, 1000, 0, 0, 0, 0),
(338, 336, 429, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1613061575, 1000, 0, 0, 0, 0),
(1157, 389, 533, 8, 1, -186.308, 991.924, 11.1822, 137.969, 'T432TT', 1, 0, 1, 20.5693, 1613839124, 1000, 0, 0, 0, 0),
(1366, 436, 415, 76, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.58, 1613876577, 1000, 0, 0, 0, 0),
(343, 352, 410, 1, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0.175833, 1613061879, 1000, 0, 0, 0, 0),
(344, 272, 466, 0, 0, -407.983, 1426.76, 20.108, 178.503, 'C666CC', 0, 0, 0, 2.45611, 1613061901, 1000, 0, 0, 0, 0),
(1526, 625, 404, 4, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613907769, 1000, 0, 0, 0, 0),
(3713, 1375, 411, 17, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1614156916, 1000, 0, 0, 0, 0),
(822, 67, 421, 0, 1, -901.572, 746.905, 12.3754, 270.617, 'K208TO', 0, 0, 1, 55.1153, 1613808448, 300, 0, 3, 3, 3),
(4611, 2293, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 5.50638, 1614225589, 1000, 0, 0, 0, 0),
(585, 167, 466, 0, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.776666, 1613753232, 1000, 0, 0, 0, 0),
(349, 355, 404, 0, 0, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613063408, 1000, 0, 0, 0, 0),
(359, 243, 436, 0, 1, 1962.45, 1724.69, 15.2484, 196.851, '------', 0, 0, 0, 10.9056, 1613064519, 1000, 0, 0, 0, 0),
(668, 324, 579, 121, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613763012, 1000, 0, 0, 0, 0),
(590, 94, 505, 1, 1, -981.661, 857.881, 12.7834, 97.6447, '------', 0, 0, 0, 2.34417, 1613753824, 1000, 0, 0, 0, 0),
(356, 241, 429, 0, 1, -177.419, 989.419, 11.1922, 359.522, 'E777KX', 0, 0, 0, 5.68306, 1613064167, 1000, 0, 0, 0, 0),
(731, 99, 558, 1, 1, 626.095, -1256.27, 39.9711, 160.524, 'C585AC', 0, 0, 1, 46.1648, 1613792345, 300, 0, 0, 0, 0),
(360, 349, 541, 1, 1, 2626.5, -241.103, 3.18252, 179.934, 'E999EE', 0, 0, 1, 7.63278, 1613064957, 300, 0, 0, 0, 0),
(362, 267, 521, 1, 0, -356.19, 1462.58, 20.3101, 178.321, '------', 0, 0, 0, 0.922777, 1613065272, 1000, 0, 0, 0, 0),
(1460, 41, 466, 6, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 3.34472, 1613892902, 1000, 0, 0, 0, 0),
(363, 267, 404, 0, 1, -356.173, 1462.63, 20.0245, 0.724161, '------', 0, 0, 0, 2.60806, 1613065560, 1000, 0, 0, 0, 0),
(980, 477, 451, 1, 1, -224.905, 1000.88, 11.1845, 78.844, '------', 1, 0, 1, 10.7914, 1613824218, 1000, 0, 0, 0, 0),
(366, 243, 451, 1, 1, 236.773, 1604.36, 11.1782, 83.9083, 'E111AA', 0, 0, 0, 11.1872, 1613066099, 1000, 0, 0, 0, 0),
(967, 329, 429, 6, 3, -283.684, 1351.12, 19.9364, 0.691537, 'K414KC', 0, 0, 0, 92.7257, 1613822905, 1000, 0, 0, 0, 0),
(368, 202, 468, 0, 0, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0, 1613066529, 1000, 0, 0, 0, 0),
(370, 182, 426, 0, 0, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1613066603, 1000, 0, 0, 0, 0),
(371, 202, 521, 1, 1, 491.692, 748.264, 11.5663, 241.711, 'O888OO', 0, 0, 0, 4.55139, 1613066622, 1000, 0, 0, 0, 0),
(372, 184, 415, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613066652, 1000, 0, 0, 0, 0),
(373, 182, 434, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 2.98389, 1613066662, 1000, 0, 0, 0, 0),
(375, 182, 445, 1, 0, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1613066708, 1000, 0, 0, 0, 0),
(376, 182, 458, 1, 0, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613066734, 1000, 0, 0, 0, 0),
(379, 202, 415, 0, 1, 489.845, 745.057, 11.1555, 247.307, 'O333OO', 0, 0, 0, 1.99139, 1613067689, 1000, 0, 0, 0, 0),
(380, 202, 402, 0, 1, 489.738, 743.918, 11.8455, 251.877, 'O444OO', 0, 0, 0, 2.59111, 1613067701, 1000, 0, 0, 0, 0),
(381, 202, 451, 1, 0, 489.299, 744.925, 11.1872, 248.615, 'O222OO', 0, 0, 0, 2.475, 1613067717, 1000, 0, 0, 0, 0),
(382, 202, 466, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, 'O111OO', 0, 0, 0, 0, 1613067733, 1000, 0, 0, 0, 0),
(383, 357, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 0.197777, 1613067858, 1000, 0, 0, 0, 0),
(385, 52, 478, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613116103, 1000, 0, 0, 0, 0),
(386, 52, 581, 1, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 1, 0.221666, 1613117231, 1000, 0, 0, 0, 0),
(387, 52, 461, 1, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0, 1613117637, 1000, 0, 0, 0, 0),
(388, 393, 402, 0, 1, 99.7113, 916.427, 11.8528, 67.5958, 'P824BE', 1, 0, 0, 7.10584, 1613139470, 1000, 0, 0, 0, 0),
(389, 304, 565, 5, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613140344, 1000, 0, 0, 0, 0),
(390, 304, 421, 1, 0, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 0.281111, 1613140713, 1000, 0, 0, 0, 0),
(391, 304, 426, 1, 0, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 1.34667, 1613140976, 1000, 0, 0, 0, 0),
(402, 438, 475, 0, 1, 1371.47, 452.445, 12.6497, 149.09, 'C606AB', 0, 0, 0, 0, 1613155033, 1000, 0, 0, 0, 0),
(1877, 802, 505, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1613924361, 1000, 0, 0, 0, 0),
(6514, 2982, 505, 40, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.876667, 1614444045, 1000, 0, 0, 0, 0),
(403, 438, 405, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 0, 1613155075, 1000, 0, 0, 0, 0),
(404, 438, 477, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1613155105, 1000, 0, 0, 0, 0),
(405, 438, 603, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613155127, 1000, 0, 0, 0, 0),
(406, 438, 587, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1613155163, 1000, 0, 0, 0, 0),
(407, 438, 560, 1, 1, 1371.47, 452.445, 12.6497, 149.09, 'B333OP', 0, 0, 0, 0, 1613155181, 1000, 0, 0, 0, 0),
(408, 438, 429, 0, 0, 1375.51, 451.079, 12.6476, 146.918, 'B606OP', 0, 0, 0, 0, 1613155889, 1000, 0, 0, 0, 0),
(409, 442, 415, 1, 0, 2047.04, 1455.67, 26.1761, 179.902, '------', 0, 0, 1, 2.07167, 1613156277, 300, 0, 0, 0, 0),
(410, 52, 401, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613361529, 1000, 0, 0, 0, 0),
(411, 52, 415, 126, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 1, 0.871109, 1613367391, 776.598, 0, 0, 0, 0),
(413, 304, 508, 4, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.423611, 1613405166, 1000, 0, 0, 0, 0),
(414, 52, 551, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 0, 1613412343, 1000, 0, 0, 0, 0),
(415, 52, 400, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613412733, 1000, 0, 0, 0, 0),
(416, 78, 402, 0, 0, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0.092499, 1613488198, 1000, 0, 0, 0, 0),
(417, 78, 505, 8, 1, 17.2699, 2636.2, 10.5487, 179.769, 'E111EE', 0, 0, 0, 0.958055, 1613676793, 1000, 0, 0, 0, 0),
(772, 401, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 2.96944, 1613802180, 1000, 0, 0, 0, 0),
(460, 61, 579, 0, 1, -396.546, 1253.18, 20.1395, 0.774419, 'X671KK', 1, 0, 1, 9.00861, 1613742088, 1000, 0, 0, 0, 0),
(614, 318, 527, 1, 1, 1382.34, 446.25, 12.6481, 148.528, 'E016CB', 0, 0, 0, 10.6545, 1613755456, 1000, 0, 0, 0, 0),
(623, 282, 558, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0.78611, 1613756437, 1000, 0, 0, 0, 0),
(704, 285, 415, 0, 1, 611.568, 1672.45, 11.2263, 274.669, '------', 1, 0, 1, 7.235, 1613774494, 1000, 0, 0, 0, 0),
(494, 149, 445, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0.438055, 1613745535, 300, 0, 0, 0, 0),
(503, 135, 426, 0, 1, -281.356, 1372.05, 19.9859, 183.698, '------', 0, 0, 1, 14.2819, 1613746517, 1000, 0, 0, 0, 0),
(784, 87, 489, 8, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0, 1613804020, 1000, 0, 0, 0, 0),
(857, 434, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 1.66389, 1613813044, 1000, 0, 0, 0, 0),
(461, 62, 402, 3, 1, 1979.17, 1792.12, 15.4261, 274.749, 'P228BC', 0, 0, 1, 9.10918, 1613742135, 1000, 0, 0, 0, 0),
(435, 54, 404, 0, 1, -863.348, 906.962, 11.8005, 183.932, 'K066OE', 0, 0, 1, 29.4045, 1613740776, 300, 0, 0, 0, 0),
(775, 391, 579, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 1, 0, 1, 1.48083, 1613802817, 1000, 0, 0, 0, 0),
(5578, 2842, 490, 8, 1, -2253.63, -194.96, 23.6797, 243.113, '------', 1, 0, 1, 11.4867, 1614343441, 1000, 0, 0, 0, 0),
(442, 29, 409, 1, 1, -380.488, 1440.66, 20.5521, 179.532, 'T785MO', 1, 0, 1, 13.3263, 1613741149, 1000, 0, 0, 0, 0),
(443, 127, 404, 122, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613741175, 1000, 0, 0, 0, 0),
(446, 80, 602, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 3.31445, 1613741244, 1000, 0, 0, 0, 0),
(548, 213, 541, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 0.058611, 1613749231, 1000, 0, 0, 0, 0),
(1811, 543, 502, 0, 1, 109.858, 919.937, 11.2317, 342.173, '------', 0, 0, 1, 10.7836, 1613921933, 1000, 0, 0, 0, 0),
(788, 412, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.115, 1613805138, 1000, 0, 0, 0, 0),
(705, 467, 579, 3, 1, -428.243, 1411.46, 20.1392, 90.1198, '------', 1, 0, 1, 10.0492, 1613776025, 1000, 0, 0, 0, 0),
(2138, 21, 602, 36, 1, 2620.2, -226.437, 3.65955, 25.9132, '------', 0, 0, 0, 1.23222, 1613949474, 1000, 0, 0, 0, 0),
(455, 77, 533, 17, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 1, 4.13833, 1613741475, 1000, 0, 0, 0, 0),
(5013, 1562, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614262852, 1000, 0, 0, 0, 0),
(468, 115, 579, 122, 1, -3.7194, 2635.95, 10.5473, 180.509, '------', 0, 0, 0, 0, 1613742495, 1000, 0, 0, 0, 0),
(1153, 312, 579, 0, 1, -331.667, 1008.64, 11.5273, 89.9566, 'C861EC', 1, 0, 1, 25.0113, 1613838954, 1000, 0, 0, 0, 0),
(6759, 3265, 562, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 1.72667, 1614455487, 1000, 0, 0, 0, 0),
(1276, 394, 579, 0, 1, -281.427, 1460.96, 20.142, 174.547, 'O378AM', 1, 0, 1, 45.8065, 1613850698, 1000, 0, 0, 0, 0),
(505, 65, 411, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0.417777, 1613746616, 1000, 0, 0, 0, 0),
(459, 103, 401, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 7.27472, 1613741841, 1000, 0, 0, 0, 0),
(1595, 728, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613913919, 1000, 0, 0, 0, 0),
(474, 27, 579, 0, 1, -672.375, 809.359, 11.9543, 273.717, 'T513TK', 0, 0, 1, 31.8368, 1613743943, 1000, 0, 0, 0, 0),
(3202, 1064, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614079942, 1000, 0, 0, 0, 0),
(1445, 578, 411, 119, 1, 1144.61, -1232.95, 36.224, 41.107, 'A851OM', 0, 0, 1, 11.3847, 1613892034, 300, 0, 0, 0, 0),
(1119, 494, 415, 124, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.967222, 1613835226, 1000, 0, 0, 0, 0),
(4954, 95, 579, 1, 1, 1892.49, -2232.89, 10.6471, 181.159, 'T400TC', 1, 0, 1, 70.3635, 1614256667, 1000, 0, 3, 3, 3),
(1546, 651, 404, 3, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1613909480, 1000, 0, 0, 0, 0),
(898, 51, 579, 0, 1, -402.995, 1442.66, 20.1156, 176.64, '------', 0, 0, 1, 9.31417, 1613815654, 1000, 0, 0, 0, 0),
(510, 219, 429, 1, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613746862, 1000, 0, 0, 0, 0),
(1204, 521, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.05861, 1613842949, 1000, 0, 0, 0, 0),
(2990, 1086, 505, 0, 1, 225.25, 1606.24, 12.1263, 79.7976, '------', 0, 0, 1, 3.81139, 1614055460, 1000, 0, 0, 0, 0),
(2980, 2, 401, 1, 1, 1852.18, 2194.84, 15.9955, 132.092, '------', 0, 0, 1, 0.191386, 1614054195, 1000, 0, 3, 3, 2),
(2385, 960, 415, 3, 1, -417.307, 1000.35, 11.3109, 84.6577, 'O657AT', 0, 0, 1, 13.6075, 1613985743, 1000, 0, 0, 0, 0),
(492, 117, 562, 1, 1, -331.159, 1277.96, 19.9626, 267.561, 'B703AM', 0, 0, 1, 19.8048, 1613745110, 1000, 0, 0, 0, 0),
(497, 154, 527, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 1.59222, 1613745838, 1000, 0, 0, 0, 0),
(498, 179, 541, 3, 1, -356.363, 1460.02, 19.9518, 340.485, 'E743XH', 1, 0, 1, 15.9769, 1613745886, 1000, 0, 0, 0, 0),
(859, 70, 402, 1, 1, 2477.47, -740.933, 11.795, 0, 'E568BH', 0, 0, 1, 7.55611, 1613813169, 300, 0, 0, 0, 0),
(516, 26, 541, 1, 1, 1743.09, 2120.75, 15.189, 270.62, '------', 0, 0, 0, 2.29527, 1613747212, 1000, 0, 0, 0, 0),
(615, 198, 521, 0, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 4.12055, 1613755465, 1000, 0, 0, 0, 0),
(524, 228, 475, 1, 1, -211.876, 992.398, 11.7432, 88.6309, '------', 0, 0, 1, 3.92694, 1613747601, 1000, 0, 0, 0, 0),
(765, 320, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, 'H568OM', 1, 0, 1, 9.51389, 1613800669, 1000, 0, 0, 0, 0),
(526, 71, 506, 124, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 1, 4.91639, 1613747685, 1000, 0, 0, 0, 0),
(1330, 339, 502, 111, 1, -312.636, 1463.48, 19.9746, 179.167, 'C488OE', 1, 0, 1, 5.61028, 1613859426, 1000, 0, 0, 0, 0),
(569, 234, 402, 1, 1, 213.252, 1535.41, 11.8395, 1.24024, 'A836EX', 0, 0, 1, 27.6129, 1613751444, 300, 0, 0, 0, 0),
(781, 210, 579, 0, 1, -283.14, 1438.66, 20.0805, 359.06, 'E302HA', 0, 0, 0, 11.2475, 1613803603, 1000, 0, 0, 0, 0),
(1013, 487, 421, 85, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.17194, 1613827401, 1000, 0, 0, 0, 0),
(702, 361, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 7.48388, 1613772749, 1000, 0, 0, 0, 0),
(540, 386, 480, 3, 1, 2410.25, -231.866, 1.25151, 89.8059, 'B083OC', 0, 0, 1, 20.2924, 1613748580, 300, 0, 0, 0, 0),
(1273, 293, 468, 3, 1, 2461.48, -204.351, 1.81378, 193.825, 'P343KT', 0, 0, 1, 4.73918, 1613850362, 1000, 0, 0, 0, 0),
(667, 100, 579, 0, 1, 502.794, 659.651, 11.5301, 251.148, '------', 1, 0, 1, 1.66056, 1613762918, 1000, 0, 0, 0, 0),
(556, 220, 410, 1, 1, -196.926, 993.731, 11.2324, 92.1387, '------', 0, 0, 0, 2.17056, 1613749626, 1000, 0, 0, 0, 0),
(5267, 1832, 466, 122, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 6.20305, 1614280845, 1000, 0, 0, 0, 0),
(579, 191, 490, 105, 1, -283.651, 1502.21, 20.0342, 185.569, 'E542AX', 0, 0, 1, 7.69306, 1613751852, 1000, 0, 0, 0, 0),
(703, 48, 415, 6, 1, 1830.94, 2095.81, 15.2277, 358.317, 'M227AP', 0, 0, 1, 25.7636, 1613773181, 1000, 0, 0, 0, 0),
(4617, 2102, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 7.48278, 1614227233, 1000, 0, 0, 0, 0),
(738, 281, 566, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 1.29528, 1613795064, 1000, 0, 0, 0, 0),
(632, 265, 410, 1, 1, -193.423, 999.014, 11.2369, 90.391, '------', 0, 0, 0, 9.84502, 1613758082, 1000, 0, 0, 0, 0),
(670, 327, 429, 0, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 0, 1613763956, 1000, 0, 0, 0, 0),
(1130, 506, 415, 125, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.435555, 1613836631, 1000, 0, 0, 0, 0),
(1300, 564, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.296111, 1613855143, 1000, 0, 0, 0, 0),
(740, 317, 490, 0, 1, 479.362, 748.352, 11.3386, 262.575, 'M536XC', 0, 0, 1, 49.4327, 1613795836, 1000, 0, 0, 0, 0),
(5084, 2400, 521, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 0, 1.67167, 1614266962, 1000, 0, 0, 0, 0),
(662, 319, 579, 0, 1, 236.651, 1625.2, 11.3981, 169.34, 'X077BK', 1, 0, 1, 9.63389, 1613761888, 1000, 0, 0, 0, 0),
(805, 415, 505, 107, 1, -309.79, 1012.03, 12.259, 90.0585, '------', 0, 0, 0, 7.46889, 1613806813, 1000, 0, 0, 0, 0),
(726, 373, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.476944, 1613789271, 1000, 0, 0, 0, 0),
(739, 251, 410, 4, 1, -749.632, 852.55, 11.8111, 261.945, '------', 1, 0, 1, 2.15889, 1613795790, 1000, 0, 0, 0, 0),
(728, 230, 415, 1, 1, 4.5685, 2635.83, 10.5489, 179.416, '------', 0, 0, 0, 2.29444, 1613790594, 1000, 0, 0, 0, 0),
(894, 33, 490, 0, 1, -689.48, 902.591, 12.0246, 86.6658, '------', 0, 0, 1, 13.4848, 1613815292, 1000, 0, 0, 0, 0),
(1520, 612, 558, 7, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613899420, 1000, 0, 0, 0, 0),
(5330, 380, 451, 114, 1, 1846.86, 1333.32, 8.94237, 183.795, 'X582XM', 1, 0, 1, 15.9227, 1614311533, 1000, 0, 0, 0, 0),
(803, 408, 505, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.948888, 1613806703, 1000, 0, 0, 0, 0),
(1523, 628, 401, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613907465, 1000, 0, 0, 0, 0),
(827, 403, 533, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 4.41611, 1613808980, 1000, 0, 0, 0, 0),
(779, 73, 401, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.052777, 1613803151, 1000, 0, 0, 0, 0),
(762, 106, 402, 114, 1, 17.2699, 2636.2, 10.5487, 179.769, '------', 0, 0, 0, 3.67528, 1613800221, 1000, 0, 0, 0, 0),
(767, 298, 415, 2, 1, 273.483, 1540.98, 11.4745, 262.609, '------', 0, 0, 1, 5.93445, 1613800990, 1000, 0, 0, 0, 0),
(2612, 1009, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.769722, 1614004455, 1000, 0, 0, 0, 0),
(2433, 650, 502, 7, 1, 2481.31, -740.893, 11.795, 0, 'M402TB', 0, 0, 0, 3.91806, 1613988838, 1000, 0, 0, 0, 0),
(1311, 284, 400, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 3.40361, 1613856691, 1000, 0, 0, 0, 0),
(2389, 616, 489, 0, 1, -428.318, 1450.23, 20.1639, 263.182, 'X003EP', 0, 0, 1, 43.8619, 1613986027, 1000, 0, 0, 0, 0),
(1280, 302, 451, 1, 1, -182.514, 1012.46, 11.1846, 275.156, '------', 1, 0, 1, 9.22472, 1613852719, 1000, 0, 0, 0, 0),
(820, 409, 400, 122, 1, 272.403, 1615.73, 11.5664, 178.623, '------', 0, 0, 1, 7.56528, 1613808415, 1000, 0, 0, 0, 0),
(817, 419, 562, 0, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 1.02305, 1613808007, 1000, 0, 0, 0, 0),
(818, 226, 426, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 1, 0, 1, 0.959444, 1613808030, 1000, 0, 0, 0, 0),
(826, 413, 466, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 1.68417, 1613808756, 1000, 0, 0, 0, 0),
(1107, 505, 603, 0, 1, 56.8042, 904.065, 11.2412, 221.714, '------', 0, 0, 0, 2.37278, 1613834363, 300, 0, 0, 0, 0),
(2225, 418, 451, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 5.10722, 1613972643, 300, 0, 0, 0, 0),
(847, 84, 579, 1, 1, -943.305, 908.053, 12.0256, 181.337, '------', 0, 0, 1, 6.38722, 1613812559, 1000, 0, 0, 0, 0),
(860, 278, 490, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 6.00305, 1613813188, 1000, 0, 0, 0, 0),
(1120, 93, 410, 6, 1, 1375.51, 451.079, 12.6476, 146.918, 'A430KX', 0, 0, 1, 16.5942, 1613835318, 1000, 0, 0, 0, 0),
(874, 55, 415, 114, 1, 2477.47, -740.933, 11.795, 0, 'C708EK', 0, 0, 0, 5.76111, 1613814304, 300, 0, 0, 0, 0),
(1260, 525, 415, 1, 1, 2481.31, -740.893, 11.795, 0, 'H420TE', 1, 0, 1, 2.20389, 1613848494, 1000, 0, 0, 0, 0),
(1073, 428, 579, 1, 1, 2567.46, -1992.59, 21.3578, 182.913, 'X368TX', 1, 0, 1, 3.30222, 1613831784, 1000, 0, 0, 0, 0),
(881, 424, 579, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 4.19472, 1613814732, 1000, 0, 0, 0, 0),
(893, 427, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.474444, 1613815281, 1000, 0, 0, 0, 0),
(1206, 514, 429, 116, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 2.79444, 1613843225, 1000, 0, 0, 0, 0),
(1502, 461, 505, 0, 0, 2481.31, -740.893, 11.795, 0, 'B177EE', 1, 0, 1, 2.28361, 1613896393, 1000, 0, 0, 0, 0),
(1560, 699, 480, 9, 1, 212.918, 1542.49, 11.1965, 262.831, 'B351BC', 1, 0, 1, 18.4858, 1613911086, 1000, 0, 0, 0, 0),
(903, 456, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613816229, 1000, 0, 0, 0, 0),
(908, 441, 505, 118, 1, 2481.31, -740.893, 11.795, 0, 'E256MX', 0, 0, 0, 2.52056, 1613817030, 1000, 0, 0, 0, 0),
(910, 451, 506, 124, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 1.03417, 1613817157, 1000, 0, 0, 0, 0),
(925, 195, 451, 1, 1, -231.909, 1409.12, 19.9422, 93.3022, '------', 0, 0, 0, 2.79166, 1613818975, 1000, 0, 0, 0, 0),
(911, 459, 602, 119, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 2.22083, 1613817418, 1000, 0, 0, 0, 0),
(2812, 600, 579, 0, 0, -224.921, 1314.83, 20.1393, 91.5222, 'B555OP', 0, 0, 1, 58.5277, 1614016091, 1000, 0, 0, 0, 0),
(933, 15, 603, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 1.19611, 1613819899, 1000, 0, 0, 0, 0),
(935, 463, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.12417, 1613819985, 1000, 0, 0, 0, 0),
(960, 473, 415, 106, 99, -448.675, 1000.94, 11.2923, 176.49, '------', 0, 0, 1, 19.5781, 1613822673, 1000, 0, 0, 0, 0),
(965, 458, 402, 0, 1, -191.198, 1091.91, 11.8409, 2.14122, '------', 1, 0, 1, 10.1286, 1613822879, 1000, 0, 0, 0, 0),
(6451, 2771, 402, 124, 1, -284.204, 961.872, 11.9161, 285.257, 'B146AX', 0, 0, 1, 16.4083, 1614442466, 300, 0, 0, 0, 0),
(969, 307, 415, 0, 0, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.551111, 1613822989, 1000, 0, 0, 0, 0),
(983, 395, 579, 0, 1, -199.04, 996.005, 11.3947, 271.184, '------', 0, 0, 0, 11.7575, 1613824822, 1000, 0, 0, 0, 0),
(975, 472, 415, 36, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.091666, 1613823496, 1000, 0, 0, 0, 0),
(976, 474, 415, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 4.61861, 1613823525, 1000, 0, 0, 0, 0),
(977, 470, 415, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 1.84833, 1613823612, 1000, 0, 0, 0, 0),
(1003, 479, 402, 2, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1613826730, 1000, 0, 0, 0, 0),
(1708, 208, 466, 0, 1, 115.712, 929.435, 11.2165, 340.952, 'O822TE', 1, 0, 1, 7.82916, 1613918100, 1000, 0, 0, 0, 0),
(1017, 488, 579, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 0, 2.34444, 1613827592, 1000, 0, 0, 0, 0),
(2118, 40, 505, 0, 1, -667.046, 747.229, 12.6826, 90.6108, 'T876TM', 0, 0, 1, 8.86502, 1613944513, 1000, 0, 0, 0, 0),
(6455, 682, 505, 2, 6, 2477.47, -740.933, 11.795, 0, 'C441AA', 1, 0, 1, 6.59251, 1614442528, 1000, 0, 0, 0, 0),
(6657, 3240, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 1, 0, 1, 3.82555, 1614450538, 1000, 0, 0, 0, 0),
(6620, 60, 415, 6, 0, -856.222, 743.662, 11.7087, 89.0182, 'X056CP', 0, 0, 1, 6.58805, 1614448618, 1000, 0, 3, 3, 3),
(1027, 400, 579, 2, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 4.69833, 1613828294, 1000, 0, 0, 0, 0),
(2963, 28, 404, 0, 75, 472.605, 748.473, 11.2424, 65.9355, 'X666AM', 0, 0, 1, 34.5217, 1614033678, 1000, 0, 0, 0, 0),
(2925, 1057, 451, 1, 1, 2487.41, -740.893, 11.795, 0, 'X453KT', 0, 0, 0, 1.41889, 1614025930, 1000, 0, 0, 0, 0),
(1101, 503, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.559166, 1613834205, 1000, 0, 0, 0, 0),
(1048, 497, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 0.101388, 1613829656, 1000, 0, 0, 0, 0),
(1061, 781, 415, 6, 1, -667.515, 747.177, 11.7089, 270.266, 'K222MA', 0, 0, 1, 146.104, 1613831237, 1000, 0, 0, 0, 0),
(1149, 31, 579, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 1.22055, 1613838413, 1000, 0, 0, 0, 0),
(1132, 453, 415, 0, 0, -292.465, 1012.08, 11.285, 86.4962, '------', 0, 0, 0, 6.3, 1613836873, 300, 0, 0, 0, 0),
(1155, 517, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 1, 0.163888, 1613839023, 1000, 0, 0, 0, 0),
(1389, 165, 541, 1, 1, -409.459, 1251.11, 19.9494, 181.785, '------', 0, 0, 1, 13.5959, 1613881667, 1000, 0, 0, 0, 0),
(3611, 971, 490, 1, 1, 479.098, 765.042, 11.3386, 342.479, '------', 1, 0, 1, 5.67249, 1614141283, 1000, 0, 0, 0, 0),
(1469, 595, 404, 3, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613893526, 1000, 0, 0, 0, 0),
(1242, 529, 402, 8, 1, 733.687, -1338.98, 40.5421, 71.1975, '------', 1, 0, 1, 5.24528, 1613846236, 1000, 0, 0, 0, 0),
(1426, 501, 400, 0, 1, 2257.28, -233.593, 1.32267, 356.877, '------', 0, 0, 1, 8.00191, 1613890147, 1000, 0, 0, 0, 0),
(1223, 343, 541, 125, 1, 2477.47, -740.933, 11.795, 0, 'K585OX', 0, 0, 1, 4.81333, 1613844656, 300, 0, 0, 0, 0),
(1468, 370, 559, 0, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 0.822222, 1613893477, 1000, 0, 0, 0, 0),
(1481, 141, 451, 26, 0, -186.293, 988.441, 11.1846, 1.80545, '------', 1, 0, 0, 2.73889, 1613894333, 1000, 0, 0, 0, 0),
(1228, 431, 404, 14, 1, 1726.08, 2268.93, 15.8773, 269.646, 'M056EA', 0, 0, 1, 5.55, 1613845016, 1000, 0, 0, 0, 0),
(1243, 39, 429, 125, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.813333, 1613846311, 1000, 0, 0, 0, 0),
(1249, 527, 402, 122, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 2.88611, 1613847004, 300, 0, 0, 0, 0),
(1256, 286, 436, 1, 1, 1918.33, -2233.62, 10.5047, 9.33667, 'B218XO', 0, 0, 1, 2.66889, 1613847701, 1000, 0, 0, 0, 0),
(1274, 372, 415, 0, 0, 474.951, 743.269, 11.1556, 159.558, '------', 1, 0, 1, 2.12305, 1613850401, 1000, 0, 0, 0, 0),
(4994, 2140, 521, 124, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0.068055, 1614261819, 1000, 0, 0, 0, 0),
(2727, 636, 411, 7, 1, 266.674, 1549.05, 11.4931, 168.858, 'M853BX', 0, 0, 0, 19.9239, 1614012068, 300, 0, 0, 0, 0),
(1773, 1817, 579, 0, 1, 824.967, -1373.86, 40.1107, 342.951, 'E541BC', 0, 0, 1, 26.9595, 1613919995, 1000, 0, 0, 0, 0),
(1462, 553, 521, 0, 1, 1951.45, 1810.58, 15.0891, 161.687, 'O321MC', 0, 0, 1, 42.6709, 1613892940, 1000, 0, 0, 0, 0);
INSERT INTO `ownable_cars` (`id`, `owner_id`, `model_id`, `color_1`, `color_2`, `pos_x`, `pos_y`, `pos_z`, `angle`, `number`, `status`, `alarm`, `key_in`, `mileage`, `create_time`, `health`, `vinilcar`, `pt_engine`, `pt_brake`, `pt_stability`) VALUES
(1290, 556, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 2.12333, 1613853496, 1000, 0, 0, 0, 0),
(1292, 557, 415, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.169722, 1613853768, 1000, 0, 0, 0, 0),
(3176, 785, 415, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.470277, 1614074754, 1000, 0, 0, 0, 0),
(3486, 549, 579, 0, 1, -380.621, 1503.68, 20.1593, 184.629, 'T087OO', 1, 0, 1, 16.1255, 1614108842, 1000, 0, 0, 0, 0),
(1556, 666, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613910635, 1000, 0, 0, 0, 0),
(1329, 137, 404, 1, 1, 2698.83, -233.507, 3.21708, 7.15487, '------', 1, 0, 0, 0.006388, 1613859378, 1000, 0, 0, 0, 0),
(1302, 563, 489, 0, 1, -387.363, 1535.36, 20.1591, 181.076, '------', 1, 0, 1, 3.23472, 1613855190, 1000, 0, 0, 0, 0),
(1379, 565, 579, 0, 1, 1873.91, 1363.14, 9.3522, 358.076, 'A638PH', 0, 0, 1, 21.0194, 1613879697, 1000, 0, 0, 0, 0),
(1318, 310, 558, 1, 1, 1998.76, 1739.8, 14.9205, 269.295, 'X620PM', 1, 0, 1, 25.7397, 1613858300, 1000, 0, 0, 0, 0),
(1324, 528, 411, 3, 1, 1792.26, 1325.49, 9.08773, 86.4071, 'K731MO', 1, 0, 1, 32.0075, 1613859228, 1000, 0, 0, 0, 0),
(7003, 3323, 404, 7, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614481706, 1000, 0, 0, 0, 0),
(1415, 200, 466, 122, 1, 2315.35, -208.359, 1.37895, 187.335, '------', 0, 0, 1, 3.69722, 1613888760, 1000, 0, 0, 0, 0),
(2184, 918, 587, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 4.70611, 1613960766, 1000, 0, 0, 0, 0),
(1342, 396, 475, 0, 1, -261.533, 1494.44, 20.4915, 0.221173, '------', 0, 0, 1, 15.2949, 1613864184, 300, 0, 0, 0, 0),
(1424, 489, 541, 3, 1, -312.344, 1006.62, 11.3354, 356.406, '------', 0, 0, 0, 4.44639, 1613890008, 1000, 0, 0, 0, 0),
(1428, 74, 579, 126, 1, -852.26, 782.263, 11.9679, 88.063, 'K023EA', 0, 0, 0, 2.16083, 1613890274, 1000, 0, 0, 0, 0),
(1390, 577, 579, 86, 1, 776.547, -1361.31, 40.1142, 72.2136, '------', 1, 0, 1, 1.67417, 1613883345, 1000, 0, 0, 0, 0),
(1391, 515, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 0, 0, 1613883501, 1000, 0, 0, 0, 0),
(6826, 1248, 502, 3, 0, 2477.47, -740.933, 11.795, 0, 'X666HO', 1, 0, 1, 14.9448, 1614459051, 1000, 0, 0, 0, 0),
(1393, 63, 402, 1, 1, -443.666, 1271.15, 20.574, 177.1, '------', 0, 0, 1, 9.83501, 1613884172, 300, 0, 0, 0, 0),
(1395, 511, 402, 0, 0, 2477.47, -740.933, 11.795, 0, 'C642KE', 1, 0, 1, 6.74667, 1613884559, 1000, 0, 0, 0, 0),
(1484, 150, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.438611, 1613894453, 1000, 0, 0, 0, 0),
(1470, 580, 579, 0, 1, 477.126, 741.463, 11.3977, 342.453, 'H601CM', 1, 0, 1, 10.7736, 1613893528, 1000, 0, 0, 0, 0),
(1435, 208, 421, 0, 1, 102.38, 919.482, 11.821, 248.405, 'A707XB', 1, 0, 1, 6.78805, 1613890977, 1000, 0, 0, 0, 0),
(1407, 490, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613886888, 1000, 0, 0, 0, 0),
(1417, 575, 466, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.15306, 1613888996, 1000, 0, 0, 0, 0),
(1488, 601, 507, 0, 1, 1375.51, 451.079, 12.6476, 146.918, 'X843OA', 0, 0, 1, 10.7736, 1613894679, 1000, 0, 0, 0, 0),
(1505, 410, 401, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 0.212221, 1613896780, 1000, 0, 0, 0, 0),
(2592, 793, 506, 6, 1, -299.63, 1034.29, 11.3011, 230.948, '------', 0, 0, 1, 6.67445, 1614002580, 1000, 0, 0, 0, 0),
(1506, 596, 402, 1, 1, -207.558, 990.57, 11.8421, 143.45, '------', 0, 0, 1, 9.62556, 1613896819, 1000, 0, 0, 0, 0),
(1509, 416, 415, 4, 1, 1831.88, 1327.89, 8.92911, 91.3776, '------', 1, 0, 1, 1.19667, 1613896989, 1000, 0, 0, 0, 0),
(1512, 567, 405, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 1.62778, 1613897261, 1000, 0, 0, 0, 0),
(1742, 776, 451, 1, 1, 2481.31, -740.893, 11.795, 0, 'C505AT', 1, 0, 0, 1.44083, 1613919074, 1000, 0, 0, 0, 0),
(1927, 832, 461, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 0.415277, 1613927208, 1000, 0, 0, 0, 0),
(1542, 643, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613909112, 1000, 0, 0, 0, 0),
(1580, 706, 402, 3, 1, 2002.57, 2014.74, 4.60025, 252.067, 'P102MC', 0, 0, 1, 24.3303, 1613912615, 300, 0, 0, 0, 0),
(1521, 15, 451, 3, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 1.25333, 1613899456, 300, 0, 0, 0, 0),
(1885, 569, 411, 119, 0, -732.716, 785.168, 11.7297, 89.2501, 'X830EP', 0, 0, 1, 30.7064, 1613924591, 1000, 0, 0, 0, 0),
(1831, 700, 541, 3, 1, -241.675, 1066.61, 11.2052, 355.848, '------', 1, 0, 1, 11.765, 1613922554, 1000, 0, 0, 0, 0),
(2412, 940, 559, 11, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 4.78139, 1613988178, 300, 0, 0, 0, 0),
(5429, 2320, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 1.54528, 1614327003, 1000, 0, 0, 0, 0),
(1536, 667, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613908766, 1000, 0, 0, 0, 0),
(1585, 689, 410, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613913247, 1000, 0, 0, 0, 0),
(1559, 598, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613910871, 1000, 0, 0, 0, 0),
(6856, 559, 502, 3, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 3.28778, 1614460831, 1000, 0, 0, 0, 0),
(1577, 718, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.358888, 1613912496, 1000, 0, 0, 0, 0),
(1568, 236, 411, 1, 1, -268.417, 1473.09, 19.9143, 179.094, '------', 0, 0, 1, 2.71389, 1613911653, 1000, 0, 0, 0, 0),
(3018, 1033, 502, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.67222, 1614059527, 1000, 0, 0, 0, 0),
(3462, 781, 579, 0, 0, -674.946, 735.274, 11.9508, 0.00001, 'B999OP', 0, 0, 0, 0.420831, 1614106237, 1000, 0, 0, 0, 0),
(1569, 698, 404, 2, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 0.298055, 1613911686, 1000, 0, 0, 0, 0),
(1976, 679, 502, 125, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.85472, 1613930159, 1000, 0, 0, 0, 0),
(2485, 758, 541, 3, 1, -261.651, 554.99, 12.1333, 174.395, 'M043CC', 1, 0, 1, 42.2414, 1613992531, 1000, 0, 0, 0, 0),
(2543, 995, 405, 4, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0.909166, 1613998861, 300, 0, 0, 0, 0),
(2726, 218, 579, 0, 1, -435.789, 1289.54, 20.2127, 177.133, 'C535AX', 1, 0, 1, 20.9528, 1614012000, 1000, 0, 0, 0, 0),
(1584, 719, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 0, 0.047777, 1613913230, 1000, 0, 0, 0, 0),
(2411, 829, 502, 3, 1, 2481.31, -740.893, 11.795, 0, 'E846OK', 0, 0, 0, 6.54611, 1613988162, 300, 0, 0, 0, 0),
(1588, 705, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613913631, 1000, 0, 0, 0, 0),
(1599, 287, 404, 71, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1613914241, 1000, 0, 0, 0, 0),
(1880, 672, 475, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613924429, 1000, 0, 0, 0, 0),
(1663, 755, 505, 0, 1, 103.509, 927.706, 12.1308, 185.584, 'X465KO', 1, 0, 1, 7.51695, 1613916492, 1000, 0, 0, 0, 0),
(2244, 291, 415, 1, 1, 2056.54, -485.855, 11.2246, 0.252788, 'X123XX', 0, 0, 1, 1.50527, 1613975037, 1000, 0, 3, 3, 3),
(2639, 988, 415, 85, 0, 2528.24, -201.126, 2.2391, 1.94158, '------', 0, 0, 0, 6.91638, 1614006823, 1000, 0, 0, 0, 0),
(3259, 1153, 402, 0, 1, -208.596, 1071.73, 11.8425, 89.4815, '------', 1, 0, 1, 10.205, 1614088248, 300, 0, 0, 0, 0),
(1628, 208, 415, 119, 1, 100.968, 918.826, 11.1561, 251.399, 'O004XA', 1, 0, 1, 10.8003, 1613915361, 300, 0, 0, 0, 0),
(3470, 1233, 490, 1, 1, -449.582, 992.679, 11.4865, 177.993, '------', 0, 0, 0, 32.4467, 1614107420, 1000, 0, 0, 0, 0),
(2045, 864, 402, 1, 1, 2584.57, -2424.59, 21.7302, 180.187, 'O143TM', 0, 0, 0, 2.32028, 1613935126, 1000, 0, 0, 0, 0),
(6139, 2931, 506, 6, 1, -401.892, 1430.88, 19.9171, 354.426, '------', 1, 0, 1, 3.38611, 1614409302, 1000, 0, 0, 0, 0),
(2728, 69, 579, 0, 1, -2330.33, 121.406, 20.3928, 168.623, 'B861OP', 0, 0, 0, 78.7839, 1614012082, 1000, 0, 3, 3, 3),
(1625, 389, 502, 0, 1, 1895.83, -2233.65, 10.4825, 357.792, 'E847KE', 1, 0, 1, 25.5836, 1613915268, 1000, 0, 0, 0, 0),
(1629, 733, 451, 3, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 3.79722, 1613915375, 1000, 0, 0, 0, 0),
(4789, 2196, 415, 119, 1, 216.836, 1573.18, 11.1526, 263.155, 'E465XC', 1, 0, 1, 13.508, 1614245032, 1000, 0, 0, 0, 0),
(4410, 2132, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 4.32361, 1614196640, 1000, 0, 0, 0, 0),
(1940, 817, 466, 1, 1, 2477.47, -740.933, 11.795, 0, 'A865BB', 0, 0, 1, 7.69027, 1613927998, 1000, 0, 0, 0, 0),
(2723, 1022, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'X515EH', 0, 0, 0, 7.50473, 1614011879, 1000, 0, 0, 0, 0),
(1637, 741, 402, 1, 1, 276.784, 1575.49, 12.171, 82.0292, 'M571BA', 1, 0, 1, 7.98416, 1613915583, 1000, 0, 0, 0, 0),
(1845, 791, 502, 0, 1, -412.377, 998.336, 11.389, 2.0406, '------', 0, 0, 0, 3.58, 1613923192, 1000, 0, 0, 0, 0),
(2609, 953, 505, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.774999, 1614003950, 1000, 0, 0, 0, 0),
(1839, 794, 402, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.25, 1613922936, 1000, 0, 0, 0, 0),
(2202, 931, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1613969709, 1000, 0, 0, 0, 0),
(2217, 933, 466, 3, 1, 2604.79, -196.217, 5.66176, 4.27408, '------', 0, 0, 0, 0.609722, 1613972069, 1000, 0, 0, 0, 0),
(3163, 1013, 429, 86, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.311111, 1614073537, 1000, 0, 0, 0, 0),
(1722, 589, 415, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 2.535, 1613918511, 1000, 0, 3, 3, 3),
(1664, 331, 415, 114, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.081944, 1613916498, 1000, 0, 0, 0, 0),
(2390, 554, 461, 0, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 5.76805, 1613986057, 1000, 0, 0, 0, 0),
(2953, 57, 603, 6, 1, -261.368, 1435.14, 19.9848, 3.94379, 'P827OT', 1, 0, 1, 5.87722, 1614028580, 1000, 0, 0, 0, 0),
(2514, 980, 541, 3, 0, -260.31, 1345.82, 19.9493, 0.997232, 'E101KX', 1, 0, 1, 57.6936, 1613994877, 1000, 0, 0, 0, 0),
(1673, 740, 521, 3, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0.054166, 1613916820, 1000, 0, 0, 0, 0),
(1678, 716, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1613916887, 1000, 0, 0, 0, 0),
(1689, 703, 506, 1, 1, 1598.82, -731.501, 40.2357, 225.976, '------', 1, 0, 1, 1.02028, 1613917501, 1000, 0, 0, 0, 0),
(1871, 262, 451, 121, 1, -357.085, 1409.32, 19.9095, 270.505, '------', 0, 0, 1, 18.1628, 1613924157, 300, 0, 0, 0, 0),
(1908, 655, 579, 24, 1, 2477.47, -740.933, 11.795, 0, 'H360CB', 0, 0, 0, 0, 1613926572, 1000, 0, 0, 0, 0),
(2087, 108, 579, 3, 1, 2698.83, -233.508, 3.28493, 7.15512, '------', 0, 0, 1, 3.82556, 1613938838, 300, 0, 0, 0, 0),
(1770, 762, 402, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.08222, 1613919903, 300, 0, 0, 0, 0),
(1701, 692, 579, 124, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 0, 0, 1613917895, 1000, 0, 0, 0, 0),
(1735, 723, 603, 3, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 1, 0, 1, 9.37333, 1613918755, 1000, 0, 0, 0, 0),
(1725, 541, 402, 1, 1, 2481.31, -740.893, 11.795, 0, 'T325TO', 0, 0, 1, 2.88333, 1613918572, 300, 0, 0, 0, 0),
(1734, 754, 490, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 8.14028, 1613918723, 1000, 0, 0, 0, 0),
(1900, 807, 415, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.21528, 1613926048, 1000, 0, 0, 0, 0),
(1739, 589, 409, 3, 1, 2481.31, -740.893, 11.795, 0, 'B482BH', 0, 0, 0, 0.504999, 1613918860, 300, 0, 0, 0, 0),
(3918, 871, 402, 1, 1, -422.566, 1448, 20.6609, 274.122, 'A311CP', 0, 0, 1, 32.6445, 1614174801, 1000, 0, 0, 0, 0),
(4480, 795, 466, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 5.05444, 1614200524, 300, 0, 0, 0, 0),
(1934, 328, 502, 1, 1, 2423.47, -212.531, 1.43129, 83.7432, '------', 1, 0, 1, 3.2525, 1613927507, 1000, 0, 0, 0, 0),
(1765, 774, 402, 17, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.159722, 1613919562, 1000, 0, 0, 0, 0),
(2030, 857, 411, 6, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 2.93361, 1613934002, 1000, 0, 0, 0, 0),
(3166, 998, 562, 122, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 1.83667, 1614073684, 1000, 0, 0, 0, 0),
(1865, 792, 410, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 1.14444, 1613923787, 1000, 0, 0, 0, 0),
(1935, 834, 402, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1613927529, 1000, 0, 0, 0, 0),
(1816, 787, 579, 3, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.94417, 1613922066, 1000, 0, 0, 0, 0),
(4803, 47, 436, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 3.09167, 1614245669, 1000, 0, 0, 0, 0),
(3030, 1061, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614060996, 1000, 0, 0, 0, 0),
(2019, 790, 402, 17, 1, 2477.47, -740.933, 11.795, 0, 'A172PX', 1, 0, 1, 4.10333, 1613933423, 1000, 0, 0, 0, 0),
(2372, 760, 579, 0, 1, 2481.31, -740.893, 11.795, 0, 'M663KM', 1, 0, 1, 3.39694, 1613985248, 1000, 0, 0, 0, 0),
(1857, 687, 502, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 1.22972, 1613923504, 1000, 0, 0, 0, 0),
(1861, 208, 579, 0, 1, 113.017, 917.843, 11.3949, 337.607, 'M815MB', 1, 0, 1, 7.90889, 1613923679, 1000, 0, 0, 0, 0),
(2650, 316, 579, 0, 1, 2481.31, -740.893, 11.795, 0, 'P836PE', 0, 0, 0, 1.61361, 1614007524, 1000, 0, 0, 0, 0),
(1881, 622, 533, 126, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1613924444, 1000, 0, 0, 0, 0),
(1886, 798, 415, 3, 1, 2481.31, -740.893, 11.795, 0, 'T571TP', 0, 0, 0, 0, 1613924768, 1000, 0, 0, 0, 0),
(1891, 806, 415, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 4.54083, 1613925148, 300, 0, 0, 0, 0),
(3716, 47, 490, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.15305, 1614157481, 1000, 0, 0, 0, 0),
(2081, 878, 404, 8, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1613938582, 1000, 0, 0, 0, 0),
(1897, 761, 415, 6, 1, -236.886, 1085.55, 11.1486, 280.923, 'K360HX', 0, 0, 1, 5.27472, 1613925786, 1000, 0, 0, 0, 0),
(3397, 1253, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 1, 0.297222, 1614097208, 1000, 0, 0, 0, 0),
(1960, 819, 401, 4, 1, 1726.08, 2260.7, 15.8772, 269.697, 'H044HP', 0, 0, 1, 3.56945, 1613928980, 1000, 0, 0, 0, 0),
(1917, 697, 451, 1, 1, 2481.31, -740.893, 11.795, 0, 'X375XO', 0, 0, 1, 3.76416, 1613926871, 300, 0, 0, 0, 0),
(2584, 852, 481, 0, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0, 1614001993, 1000, 0, 0, 0, 0),
(1924, 815, 451, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 4.01805, 1613927060, 300, 0, 0, 0, 0),
(1925, 805, 541, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 3.99278, 1613927072, 300, 0, 0, 0, 0),
(1931, 502, 402, 13, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 2.95639, 1613927392, 1000, 0, 0, 0, 0),
(7033, 90, 521, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 1, 1.64806, 1614489839, 1000, 0, 0, 0, 0),
(1943, 836, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1613928042, 1000, 0, 0, 0, 0),
(2261, 169, 579, 0, 1, 2487.41, -740.893, 11.795, 0, 'X410KA', 1, 0, 0, 11.4375, 1613977253, 1000, 0, 0, 0, 0),
(1947, 646, 579, 0, 1, 2481.31, -740.893, 11.795, 0, 'T226CP', 0, 0, 1, 1.22472, 1613928367, 1000, 0, 0, 0, 0),
(1948, 422, 534, 1, 1, 1754.71, -172.711, 14.9305, 117.019, '------', 0, 0, 0, 1.25917, 1613928389, 1000, 0, 0, 0, 0),
(1949, 838, 541, 3, 1, 2477.47, -740.933, 11.795, 0, 'H221OE', 1, 0, 1, 5.40194, 1613928427, 1000, 0, 0, 0, 0),
(3674, 481, 541, 6, 1, -271.748, 1036.65, 11.3187, 274.163, '------', 1, 0, 1, 12.5097, 1614148889, 1000, 0, 0, 0, 0),
(2739, 641, 541, 124, 1, 2245.22, -206.552, 1.41371, 355.769, '------', 0, 0, 0, 7.43583, 1614013016, 300, 0, 0, 0, 0),
(2114, 621, 579, 1, 1, 2477.47, -740.933, 11.795, 0, 'C005CH', 1, 0, 0, 1.35944, 1613943146, 1000, 0, 0, 0, 0),
(1977, 690, 579, 0, 1, -188.57, 994.561, 11.3941, 98.3818, '------', 0, 0, 1, 3.57666, 1613930227, 1000, 0, 0, 0, 0),
(6157, 1156, 579, 1, 1, -2312.07, -133.647, 21.6041, 229.903, 'O772HH', 0, 0, 1, 2.29111, 1614414249, 1000, 0, 0, 0, 0),
(1999, 648, 410, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1613932278, 1000, 0, 0, 0, 0),
(4088, 1944, 579, 125, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 6.32083, 1614181611, 1000, 0, 0, 0, 0),
(2000, 801, 415, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0.508333, 1613932284, 1000, 0, 0, 0, 0),
(2456, 969, 490, 1, 1, -2358.14, 58.5524, 20.6617, 117.383, 'P758KC', 0, 0, 0, 10.8217, 1613990918, 1000, 0, 0, 0, 0),
(2437, 714, 579, 0, 1, -362.882, 1011.06, 11.5318, 87.3971, 'K640AT', 0, 0, 0, 7.92833, 1613988980, 1000, 0, 0, 0, 0),
(2259, 594, 405, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 2.36472, 1613976947, 1000, 0, 0, 0, 0),
(2226, 704, 490, 125, 1, -790.519, 814.003, 11.9003, 269.869, 'B777OP', 1, 0, 1, 182.967, 1613972807, 1000, 0, 3, 3, 3),
(2061, 614, 415, 6, 0, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1613937085, 1000, 0, 0, 0, 0),
(3121, 972, 502, 123, 1, -235.635, 1377.96, 20.0026, 275.567, 'B880KM', 0, 0, 1, 45.3805, 1614069226, 1000, 0, 0, 0, 0),
(2375, 866, 602, 6, 0, 2481.31, -740.893, 11.795, 0, 'P275HM', 1, 0, 0, 1.38639, 1613985340, 1000, 0, 0, 0, 0),
(2357, 116, 579, 1, 1, 262.009, 1544.75, 11.3978, 165.43, '------', 1, 0, 1, 6.75251, 1613984204, 1000, 0, 0, 0, 0),
(2072, 875, 401, 1, 1, 1872.17, 1398.84, 9.08948, 337.52, '------', 1, 0, 1, 1.15083, 1613937994, 1000, 0, 0, 0, 0),
(2074, 867, 505, 25, 1, 1984.05, 1747.49, 15.8284, 90.507, 'H031OE', 1, 0, 1, 24.095, 1613938185, 1000, 0, 0, 0, 0),
(2075, 779, 402, 0, 1, -182.172, 1012.46, 11.84, 87.7184, 'A886CK', 1, 0, 1, 6.3225, 1613938211, 1000, 0, 0, 0, 0),
(2085, 720, 533, 7, 1, 2290.93, -202.278, 1.32837, 270.53, 'X258TB', 1, 0, 1, 10.7286, 1613938803, 1000, 0, 0, 0, 0),
(4655, 1539, 466, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.53167, 1614232847, 300, 0, 0, 0, 0),
(2095, 822, 415, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 3.18638, 1613940010, 1000, 0, 0, 0, 0),
(2158, 911, 451, 3, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 1.80222, 1613952770, 1000, 0, 0, 0, 0),
(2201, 930, 466, 13, 1, -248.215, 999.229, 11.2166, 1.95705, '------', 0, 0, 0, 2.86417, 1613969598, 1000, 0, 0, 0, 0),
(2101, 445, 402, 0, 1, -183.576, 1020.43, 11.8439, 264.588, 'O374XA', 0, 0, 1, 9.83999, 1613940574, 1000, 0, 0, 0, 0),
(5172, 2623, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 3.05584, 1614274642, 1000, 0, 0, 0, 0),
(2109, 1015, 579, 0, 1, 121.162, 924.302, 11.394, 69.9735, 'M123KK', 1, 0, 1, 41.251, 1613941487, 1000, 0, 0, 0, 0),
(2110, 893, 415, 3, 1, 2481.31, -740.893, 11.795, 0, 'E123CA', 0, 0, 1, 3.97444, 1613941812, 1000, 0, 0, 0, 0),
(2666, 946, 415, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.20472, 1614008631, 1000, 0, 0, 0, 0),
(6255, 2705, 502, 0, 1, 1813.27, 2494.55, 14.9572, 126.268, '------', 0, 0, 1, 0.059166, 1614423732, 1000, 0, 0, 0, 0),
(2922, 539, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.297499, 1614025049, 1000, 0, 0, 0, 0),
(2899, 294, 415, 3, 0, -352.585, 1409.75, 19.8856, 269.354, 'X111AM', 0, 0, 1, 9.32558, 1614021940, 1000, 0, 0, 0, 0),
(2126, 898, 402, 0, 1, 2477.47, -740.933, 11.795, 0, 'X646PK', 0, 0, 0, 0, 1613945723, 1000, 0, 0, 0, 0),
(2448, 585, 402, 118, 1, -2336.95, 63.2551, 20.9595, 357.464, '------', 0, 0, 1, 14.2733, 1613990638, 1000, 0, 0, 0, 0),
(2187, 597, 505, 1, 1, -310.193, 1006.84, 12.2533, 173.308, 'P708AT', 1, 0, 1, 5.93778, 1613962681, 1000, 0, 0, 0, 0),
(2994, 781, 402, 0, 0, -667.013, 753.038, 12.3974, 268.536, 'O666OO', 0, 0, 1, 12.9839, 1614055613, 1000, 0, 0, 0, 0),
(6859, 166, 421, 8, 1, -2344.03, 88.603, 20.8581, 76.2559, 'B884OO', 0, 0, 1, 8.21973, 1614461077, 1000, 0, 0, 0, 0),
(2211, 928, 579, 0, 1, 1824.17, 2517.51, 15.0612, 33.5038, 'B646OA', 1, 0, 1, 8.22527, 1613971233, 1000, 0, 0, 0, 0),
(2212, 932, 451, 1, 1, -221.294, 1007.63, 11.1865, 93.7049, '------', 1, 0, 1, 2.22361, 1613971508, 1000, 0, 0, 0, 0),
(2993, 710, 490, 0, 1, 1892.69, -2234.16, 10.5908, 193.464, '------', 0, 0, 0, 9.50584, 1614055566, 1000, 0, 0, 0, 0),
(2257, 7, 506, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 1.03472, 1613976514, 1000, 0, 0, 0, 0),
(5550, 2814, 415, 119, 1, 2477.47, -740.933, 11.795, 0, 'C021OO', 0, 0, 1, 4.03944, 1614340635, 1000, 0, 0, 0, 0),
(5327, 2530, 404, 124, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614311006, 1000, 0, 0, 0, 0),
(2233, 935, 402, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1613973354, 1000, 0, 0, 0, 0),
(2350, 833, 402, 9, 1, 1752.7, 2316.21, 15.7543, 90.4266, 'P626TX', 1, 0, 1, 42.6431, 1613983853, 1000, 0, 3, 3, 3),
(2236, 443, 502, 0, 1, -667.073, 747.42, 11.7867, 269.711, 'B222OP', 0, 0, 1, 10.6244, 1613973645, 1000, 0, 3, 3, 3),
(2237, 938, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'B375CK', 1, 0, 1, 1.46222, 1613973832, 1000, 0, 0, 0, 0),
(2239, 181, 429, 1, 1, -737.614, 847.161, 11.7488, 91.5371, 'B444OP', 0, 0, 1, 134.341, 1613974102, 1000, 0, 0, 0, 0),
(2240, 929, 415, 1, 1, 2477.47, -740.933, 11.795, 0, 'H863OH', 0, 0, 0, 2.815, 1613974108, 1000, 0, 0, 0, 0),
(2241, 674, 558, 0, 0, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1613974639, 1000, 0, 0, 0, 0),
(2245, 276, 451, 17, 1, -387.037, 1527.95, 19.9289, 5.83047, '------', 1, 0, 1, 4.21278, 1613975044, 1000, 0, 0, 0, 0),
(2441, 861, 489, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.08916, 1613989449, 1000, 0, 0, 0, 0),
(2765, 917, 468, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 1, 0, 1, 0.605, 1614014436, 1000, 0, 0, 0, 0),
(2341, 975, 421, 0, 1, 1808.92, 2516.54, 15.4873, 166.651, '------', 0, 0, 0, 7.57222, 1613983454, 1000, 0, 0, 0, 0),
(2575, 254, 400, 14, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.387222, 1614001462, 1000, 0, 0, 0, 0),
(2269, 813, 490, 0, 1, 2237.57, -187.654, 1.66276, 265.774, '------', 0, 0, 1, 9.6136, 1613977745, 1000, 0, 0, 0, 0),
(2298, 589, 558, 4, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1613979967, 1000, 0, 0, 0, 0),
(2286, 691, 451, 16, 1, -369.017, 831.987, 11.2645, 188.792, 'T117ET', 0, 0, 1, 22.6636, 1613979064, 1000, 0, 0, 0, 0),
(6570, 3095, 541, 124, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 6.18139, 1614446080, 1000, 0, 0, 0, 0),
(6565, 644, 490, 7, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 0.938888, 1614445738, 1000, 0, 0, 0, 0),
(2296, 730, 507, 0, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1613979761, 1000, 0, 0, 0, 0),
(2556, 8, 480, 1, 1, -818.747, 902.494, 11.7763, 182.015, 'B228OP', 0, 0, 1, 9.69473, 1614000154, 300, 0, 0, 0, 0),
(2305, 2450, 579, 4, 1, 1906.27, 1059.19, 28.1876, 278.341, 'E444KX', 0, 0, 1, 41.7515, 1613980941, 1000, 0, 0, 0, 0),
(2306, 7, 402, 4, 1, -427.958, 1370.54, 20.5866, 187.717, 'E333KX', 0, 0, 0, 5.70001, 1613980969, 1000, 0, 0, 0, 0),
(2307, 7, 415, 1, 1, -427.786, 1374.05, 19.8973, 159.308, 'E999KX', 0, 0, 1, 4.82972, 1613981001, 1000, 0, 0, 0, 0),
(2308, 7, 451, 3, 1, -427.623, 1382.53, 19.9287, 178.151, 'E555KX', 0, 0, 1, 36.4443, 1613981024, 1000, 0, 3, 3, 3),
(2309, 187, 426, 0, 1, -457.322, 1386.93, 19.9849, 92.2087, '------', 1, 0, 1, 2.48833, 1613981266, 1000, 0, 0, 0, 0),
(2969, 1073, 404, 118, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614038139, 1000, 0, 0, 0, 0),
(2430, 967, 451, 119, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1613988696, 1000, 0, 0, 0, 0),
(2717, 1027, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614011380, 1000, 0, 0, 0, 0),
(2562, 996, 415, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 3.68444, 1614000758, 1000, 0, 0, 0, 0),
(2451, 952, 541, 0, 1, 1810.78, 2510.31, 14.8715, 169.243, '------', 0, 0, 0, 2.95722, 1613990740, 1000, 0, 0, 0, 0),
(2360, 956, 602, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 9.03889, 1613984484, 1000, 0, 0, 0, 0),
(2541, 991, 402, 1, 1, 2481.31, -740.893, 11.795, 0, 'M572MB', 1, 0, 1, 1.55, 1613998369, 1000, 0, 0, 0, 0),
(2397, 155, 502, 3, 1, 2477.47, -740.933, 11.795, 0, 'K525CM', 1, 0, 1, 1.36833, 1613986696, 1000, 0, 0, 0, 0),
(2600, 443, 490, 1, 1, -666.29, 747.405, 11.8918, 271.28, 'O773HC', 0, 0, 1, 4.15416, 1614003108, 1000, 0, 0, 0, 0),
(2398, 590, 502, 33, 1, -2344.25, 86.7083, 20.2364, 80.2373, 'H666TB', 0, 0, 1, 84.2298, 1613986769, 1000, 0, 3, 3, 3),
(2502, 923, 602, 118, 1, 2477.47, -740.933, 11.795, 0, 'A411TP', 0, 0, 1, 2.16806, 1613993955, 1000, 0, 0, 0, 0),
(2470, 871, 541, 3, 1, -210.989, 1083.23, 11.2129, 332.907, 'E042KX', 0, 0, 1, 60.8432, 1613991938, 300, 0, 0, 0, 0),
(2902, 796, 541, 3, 0, 1955.77, 1744.81, 14.7337, 283.674, 'M751TX', 0, 0, 1, 41.7778, 1614022563, 1000, 0, 0, 0, 0),
(2469, 443, 579, 0, 1, -666.613, 752.774, 11.9507, 271.169, 'E408OO', 1, 0, 1, 58.2358, 1613991891, 1000, 0, 0, 0, 0),
(3210, 1129, 506, 121, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 4.67722, 1614081700, 1000, 0, 0, 0, 0),
(3360, 1211, 527, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 1, 1.65694, 1614094846, 1000, 0, 0, 0, 0),
(7101, 3344, 579, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 2.58694, 1614496405, 1000, 0, 0, 0, 0),
(5167, 1515, 404, 0, 1, 471.06, 774.96, 11.2423, 157.228, '------', 1, 0, 0, 3.455, 1614274503, 1000, 0, 0, 0, 0),
(2504, 912, 602, 0, 1, 2477.47, -740.933, 11.795, 0, 'E362TP', 1, 0, 0, 1.38889, 1613994005, 1000, 0, 0, 0, 0),
(3393, 1143, 415, 0, 1, -188.387, 1037.1, 11.1529, 1.38723, 'E703TT', 0, 0, 0, 14.5522, 1614096881, 1000, 0, 0, 0, 0),
(6516, 3018, 429, 24, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.34833, 1614444138, 1000, 0, 0, 0, 0),
(2511, 982, 451, 7, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.069166, 1613994322, 1000, 0, 0, 0, 0),
(3246, 1002, 466, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 26.6063, 1614086257, 1000, 0, 0, 0, 0),
(2520, 986, 466, 7, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1613995637, 1000, 0, 0, 0, 0),
(2545, 848, 579, 0, 1, -422.442, 1002.95, 11.5366, 88.0093, 'M285MO', 0, 0, 1, 47.2144, 1613999213, 1000, 0, 0, 0, 0),
(2889, 1051, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614021190, 1000, 0, 0, 0, 0),
(2527, 630, 429, 3, 1, 2487.41, -740.893, 11.795, 0, 'K353EP', 0, 0, 0, 5.58333, 1613996518, 1000, 0, 0, 0, 0),
(3019, 1092, 490, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.9425, 1614059633, 1000, 0, 0, 0, 0),
(3138, 757, 541, 124, 1, 2481.31, -740.893, 11.795, 0, 'C157KX', 0, 0, 0, 4.51917, 1614070609, 300, 0, 0, 0, 0),
(2557, 694, 466, 1, 1, 2477.47, -740.933, 11.795, 0, 'A173TH', 0, 0, 0, 1.56333, 1614000383, 1000, 0, 0, 0, 0),
(4631, 1905, 415, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 0.961944, 1614229867, 1000, 0, 0, 0, 0),
(2844, 398, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.7825, 1614017535, 1000, 0, 0, 0, 0),
(3425, 1063, 451, 0, 1, -263.634, 1246.35, 19.9288, 169.356, 'C007OT', 1, 0, 1, 11.0408, 1614100423, 1000, 0, 0, 0, 0),
(2991, 97, 558, 1, 1, -398.047, 1349.79, 19.9678, 184.301, 'B014MX', 0, 0, 1, 35.9852, 1614055499, 1000, 0, 0, 0, 0),
(3420, 1263, 411, 1, 1, -271.266, 1276.14, 19.9105, 178.868, '------', 0, 0, 1, 6.54333, 1614099773, 1000, 0, 0, 0, 0),
(2595, 1005, 415, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 4.33722, 1614002903, 1000, 0, 0, 0, 0),
(5659, 88, 415, 0, 0, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 0.915278, 1614350498, 1000, 0, 0, 0, 0),
(2813, 57, 541, 124, 1, -261.968, 1445.77, 19.9518, 0.460132, 'B233MB', 1, 0, 1, 2.13249, 1614016127, 1000, 0, 0, 0, 0),
(2968, 1071, 410, 0, 1, 1215.72, 60.8105, 17.0435, 280.333, 'O634HT', 0, 0, 1, 6.90916, 1614036059, 1000, 0, 0, 0, 0),
(4995, 83, 415, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 14.7175, 1614261836, 1000, 0, 0, 0, 0),
(2972, 1078, 404, 125, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614040978, 1000, 0, 0, 0, 0),
(7536, 3486, 541, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614518957, 1000, 0, 0, 0, 0),
(4309, 1914, 451, 18, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0.031388, 1614190163, 1000, 0, 0, 0, 0),
(3333, 1169, 579, 0, 1, -304.649, 1009.55, 11.5271, 80.5341, '------', 0, 0, 0, 5.17972, 1614093087, 1000, 0, 0, 0, 0),
(7466, 3422, 527, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 1, 0.799444, 1614516792, 1000, 0, 0, 0, 0),
(2897, 69, 502, 1, 1, -424.818, 1503.42, 19.9754, 181.499, 'O836PX', 0, 0, 0, 29.0894, 1614021900, 1000, 0, 0, 0, 0),
(2747, 764, 451, 6, 1, -268.788, 1038.45, 11.2619, 0.159024, 'T676HE', 0, 0, 1, 10.6622, 1614013252, 300, 0, 0, 0, 0),
(3990, 1342, 490, 1, 1, -2168.96, -209.07, 24.0417, 80.1888, 'P687HK', 0, 0, 1, 48.4683, 1614178091, 1000, 0, 0, 0, 0),
(3703, 1420, 533, 0, 1, 2477.47, -740.933, 11.795, 0, 'A458HB', 1, 0, 1, 2.06611, 1614155254, 1000, 0, 0, 0, 0),
(3106, 725, 415, 1, 0, -261.516, 1494.07, 19.8969, 0.202711, 'O461TE', 1, 0, 1, 17.22, 1614067684, 1000, 0, 0, 0, 0),
(2850, 1047, 404, 14, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614018109, 1000, 0, 0, 0, 0),
(2851, 465, 510, 0, 0, -232.776, 1431.31, 20.3509, 90.8271, 'P538AO', 0, 0, 0, 0, 1614018221, 1000, 0, 0, 0, 0),
(2938, 1058, 451, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614026940, 1000, 0, 0, 0, 0),
(5951, 1987, 490, 79, 1, -2203.73, -206.588, 23.8149, 79.7383, 'C104HM', 0, 0, 1, 19.5483, 1614373270, 1000, 0, 0, 0, 0),
(7337, 261, 579, 85, 1, -2233.62, -193.24, 23.8033, 79.9207, '------', 1, 0, 1, 0.415554, 1614510810, 1000, 0, 0, 0, 0),
(2860, 1052, 415, 85, 1, 825.788, -1374.09, 39.8678, 339.507, '------', 0, 0, 1, 12.8342, 1614018730, 1000, 0, 0, 0, 0),
(2879, 862, 502, 79, 1, 255.258, 784.387, 11.3872, 358.321, '------', 0, 0, 0, 7.6364, 1614020560, 1000, 0, 0, 0, 0),
(3871, 743, 402, 0, 1, 2512.56, -158.571, 4.57526, 135.066, 'K612BM', 0, 0, 1, 47.9965, 1614172298, 300, 0, 3, 3, 3),
(3459, 321, 404, 1, 1, -69.4599, 932.161, 11.2439, 350.295, '------', 0, 0, 1, 20.0364, 1614103126, 1000, 0, 0, 0, 0),
(4357, 2170, 415, 2, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614193101, 1000, 0, 0, 0, 0),
(4904, 2692, 579, 0, 1, -785.243, 802.811, 11.9579, 359.809, '------', 0, 0, 0, 25.4594, 1614251857, 1000, 0, 0, 0, 0),
(3291, 957, 415, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.08555, 1614090746, 1000, 0, 0, 0, 0),
(7402, 585, 415, 121, 1, -2335.31, 69.5863, 20.1751, 348.282, '------', 0, 0, 1, 9.60139, 1614513775, 1000, 0, 0, 0, 0),
(2900, 1036, 415, 85, 1, 826.071, -1374.83, 39.8691, 335.805, '------', 1, 0, 1, 8.49417, 1614022163, 1000, 0, 0, 0, 0),
(2951, 554, 579, 0, 1, -429.087, 1492.2, 20.2113, 93.9817, 'H844XB', 0, 0, 1, 19.615, 1614028520, 1000, 0, 0, 0, 0),
(2929, 1037, 541, 124, 1, -290.326, 960.613, 11.357, 280.971, '------', 0, 0, 0, 12.5267, 1614026098, 1000, 0, 0, 0, 0),
(4368, 1065, 402, 0, 1, 624.292, -1315.29, 40.5787, 338.986, 'H002TX', 0, 0, 0, 5.63832, 1614194130, 1000, 0, 0, 0, 0),
(2911, 613, 489, 0, 1, 276.961, 1625.09, 11.5164, 351.853, 'P874PO', 1, 0, 1, 5.69056, 1614023697, 1000, 0, 0, 0, 0),
(2935, 28, 409, 0, 1, 492.634, 760.294, 11.7986, 70.5243, '------', 0, 0, 1, 7.50806, 1614026623, 1000, 0, 0, 0, 0),
(2940, 28, 579, 0, 1, -785.547, 817.288, 12.0368, 237.859, 'T601TT', 0, 0, 1, 26.4, 1614027078, 1000, 0, 0, 0, 0),
(4619, 1497, 411, 13, 1, -816.823, 902.389, 11.7259, 359.439, 'C542OK', 1, 0, 1, 1.79806, 1614228332, 1000, 0, 0, 0, 0),
(4553, 1636, 415, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.52889, 1614212177, 1000, 0, 0, 0, 0),
(3390, 896, 451, 0, 1, 2487.41, -740.893, 11.795, 0, 'M340PC', 0, 0, 1, 1.55528, 1614096711, 1000, 0, 0, 0, 0),
(2960, 1060, 451, 7, 1, 2477.47, -740.933, 11.795, 0, 'H707HT', 1, 0, 1, 13.125, 1614029366, 1000, 0, 0, 0, 0),
(3247, 1151, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 2.58917, 1614086348, 1000, 0, 0, 0, 0),
(2971, 1077, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.209444, 1614040136, 1000, 0, 0, 0, 0),
(4252, 1590, 415, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.16278, 1614187293, 1000, 0, 0, 0, 0),
(2962, 1069, 404, 3, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.904166, 1614031484, 1000, 0, 0, 0, 0),
(3323, 1203, 404, 2, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614092493, 1000, 0, 0, 0, 0),
(3971, 249, 410, 36, 1, 99.9386, 916.266, 11.2398, 258.801, 'H587AT', 0, 0, 1, 9.15946, 1614176797, 1000, 0, 0, 0, 0),
(4255, 1248, 402, 1, 0, -397.168, 1341.25, 20.586, 358.047, 'K446OT', 0, 0, 1, 141.325, 1614187440, 1000, 0, 0, 0, 0),
(3710, 50, 502, 0, 1, -738.57, 740.677, 11.7884, 261.537, '------', 0, 0, 1, 4.25555, 1614156375, 1000, 0, 0, 0, 0),
(4240, 2021, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.564444, 1614186815, 1000, 0, 0, 0, 0),
(3007, 737, 489, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.91639, 1614058584, 1000, 0, 0, 0, 0),
(3398, 1251, 404, 2, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614097321, 1000, 0, 0, 0, 0),
(3279, 1049, 507, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1614089974, 1000, 0, 0, 0, 0),
(4281, 1765, 541, 114, 1, 819.206, -1412.57, 39.9238, 252.548, 'E843BP', 1, 0, 1, 33.0777, 1614188683, 1000, 0, 0, 0, 0),
(3061, 1100, 587, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1614063685, 1000, 0, 0, 0, 0),
(3082, 1094, 404, 10, 1, -444.033, 997.162, 11.3976, 265.163, '------', 0, 0, 0, 19.4394, 1614065554, 1000, 0, 0, 0, 0),
(3620, 1023, 451, 122, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.05167, 1614142279, 1000, 0, 0, 0, 0),
(3037, 999, 587, 1, 1, -1057.64, 2205.39, 37.3115, 74.227, '------', 1, 0, 0, 3.70111, 1614061366, 1000, 0, 0, 0, 0),
(3065, 1097, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 2.36194, 1614064296, 1000, 0, 0, 0, 0),
(5422, 2298, 502, 125, 1, 1821.54, 2105.43, 15.0822, 84.3444, '------', 1, 0, 1, 7.15945, 1614325505, 1000, 0, 0, 0, 0),
(3042, 1096, 402, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 2.27305, 1614061668, 1000, 0, 0, 0, 0),
(3696, 576, 603, 1, 1, 533.835, -1260.72, 40.0589, 148.236, '------', 0, 0, 0, 5.23, 1614152669, 1000, 0, 0, 0, 0),
(3299, 671, 415, 125, 1, -379.477, 1505.44, 19.8973, 0.975003, '------', 1, 0, 1, 2.71028, 1614091216, 1000, 0, 0, 0, 0),
(3561, 443, 489, 0, 0, -666.017, 747.483, 11.9705, 270.151, 'X999AM', 0, 0, 1, 17.3046, 1614117273, 1000, 0, 0, 0, 0),
(3059, 777, 401, 17, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614063488, 1000, 0, 0, 0, 0),
(3557, 1278, 602, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.001111, 1614115871, 1000, 0, 0, 0, 0),
(5169, 868, 490, 1, 1, 2477.47, -740.933, 11.795, 0, 'B667MM', 0, 0, 0, 5.45971, 1614274564, 1000, 0, 0, 0, 0),
(3064, 966, 402, 0, 1, -2346.3, 80.0269, 20.8633, 262.321, '------', 0, 0, 0, 29.4915, 1614064085, 1000, 0, 0, 0, 0),
(6784, 2946, 411, 6, 1, -451.399, 998.993, 11.3208, 196.714, 'C350MM', 0, 0, 1, 18.6095, 1614457319, 1000, 0, 3, 3, 3),
(3505, 1325, 415, 3, 1, 2481.31, -740.893, 11.795, 0, 'A850HX', 0, 0, 0, 1.72, 1614110899, 1000, 0, 0, 0, 0),
(3113, 1006, 402, 0, 1, -782.5, 850.253, 12.3994, 89.8492, '------', 0, 0, 1, 33.8279, 1614068148, 1000, 0, 0, 0, 0),
(3080, 1045, 411, 6, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 1.11611, 1614065471, 1000, 0, 0, 0, 0),
(3770, 1462, 404, 1, 1, 1835.84, 2220.97, 15.104, 269.287, 'O272BB', 1, 0, 1, 7.4861, 1614162998, 1000, 0, 0, 0, 0),
(3088, 101, 415, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.945833, 1614066019, 1000, 0, 0, 0, 0),
(3196, 1116, 579, 3, 1, 2221.51, -794.35, 13.2611, 197.98, 'K672TP', 0, 0, 0, 4.23277, 1614076613, 1000, 0, 0, 0, 0),
(5156, 2641, 404, 3, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 1, 0, 0, 0, 1614273716, 1000, 0, 0, 0, 0),
(3686, 1393, 541, 85, 1, 2481.31, -740.893, 11.795, 0, 'T826XX', 1, 0, 1, 4.41389, 1614151565, 1000, 0, 0, 0, 0),
(3478, 1265, 581, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 0, 1614107785, 1000, 0, 0, 0, 0),
(3120, 1102, 402, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614069060, 1000, 0, 0, 0, 0),
(4549, 2259, 401, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614211165, 1000, 0, 0, 0, 0),
(3241, 1142, 505, 0, 1, -362.843, 1006.14, 12.2594, 358.554, '------', 0, 0, 0, 17.7682, 1614085645, 1000, 0, 0, 0, 0),
(3141, 680, 505, 0, 0, 2487.41, -740.893, 11.795, 0, 'H675OE', 0, 0, 0, 6.11501, 1614070963, 1000, 0, 0, 0, 0),
(3537, 294, 579, 0, 0, -352.586, 1409.75, 20.0842, 269.354, 'B111OP', 0, 0, 1, 1.06055, 1614114451, 1000, 0, 0, 0, 0),
(3201, 1079, 490, 0, 1, 1762.05, 1510.16, 9.36983, 51.9751, '------', 0, 0, 1, 14.277, 1614079796, 1000, 0, 0, 0, 0),
(3817, 1487, 502, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 1.625, 1614167673, 1000, 0, 0, 0, 0),
(3663, 1392, 521, 3, 1, -2191.85, 192.83, 24.091, 201.698, '------', 0, 0, 0, 3.07805, 1614147123, 1000, 0, 0, 0, 0),
(3394, 1243, 415, 3, 1, 516.649, 1669.42, 11.2761, 271.504, '------', 0, 0, 0, 3.02889, 1614096933, 1000, 0, 0, 0, 0),
(5281, 1070, 411, 119, 1, -2314.63, -141.759, 21.2247, 51.5847, 'B403HB', 0, 0, 1, 8.12916, 1614281692, 1000, 0, 0, 0, 0),
(5071, 1442, 404, 1, 0, 464.066, -1256.98, 39.9761, 158.494, '------', 0, 0, 0, 7.48888, 1614266161, 1000, 0, 0, 0, 0),
(3411, 1271, 461, 1, 1, -2193.75, 195.278, 24.1068, 107.276, '------', 0, 0, 0, 0.123611, 1614099186, 1000, 0, 0, 0, 0),
(4322, 2098, 466, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.66694, 1614190907, 1000, 0, 0, 0, 0),
(3172, 941, 521, 3, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0.121111, 1614074021, 1000, 0, 0, 0, 0),
(4686, 2226, 401, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614235003, 1000, 0, 0, 0, 0),
(3795, 1463, 415, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 8.85223, 1614165786, 300, 0, 3, 3, 3),
(7442, 3400, 562, 0, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 1.08055, 1614515229, 1000, 0, 0, 0, 0),
(3223, 973, 505, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 2.54833, 1614083541, 1000, 0, 0, 0, 0),
(4094, 1464, 451, 119, 1, -401.072, 998.709, 11.339, 274.011, '------', 0, 0, 0, 47.2155, 1614181702, 1000, 0, 0, 0, 0),
(3225, 781, 409, 0, 0, -652.08, 735.618, 12.371, 1.7319, 'M001EP', 0, 0, 1, 4.33, 1614083594, 1000, 0, 0, 0, 0),
(3999, 1880, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 4.18333, 1614178346, 1000, 0, 0, 0, 0),
(3232, 1148, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614084494, 1000, 0, 0, 0, 0),
(5576, 1763, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.253333, 1614343295, 1000, 0, 0, 0, 0),
(3234, 2450, 505, 119, 1, 1910.98, 1073.09, 28.9138, 180.554, '------', 1, 0, 1, 5.5286, 1614084622, 1000, 0, 0, 0, 0),
(3236, 600, 415, 119, 1, 288.765, 491.371, 11.1587, 39.4195, '------', 1, 0, 1, 8.95361, 1614084674, 1000, 0, 0, 0, 0),
(5164, 1869, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614274232, 1000, 0, 0, 0, 0),
(3248, 1147, 409, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.68667, 1614086434, 1000, 0, 0, 0, 0),
(3252, 1149, 415, 119, 1, 2392.36, -781.314, 11.8618, 14.4223, 'A528XH', 1, 0, 1, 0.120277, 1614087639, 1000, 0, 0, 0, 0),
(4057, 1938, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614180738, 1000, 0, 0, 0, 0),
(7388, 3395, 411, 0, 0, 1375.51, 451.079, 12.6476, 146.918, 'O461TM', 0, 0, 1, 5.71306, 1614513221, 1000, 0, 0, 0, 0),
(4628, 1090, 402, 0, 1, -2164.18, 134.34, 25.7394, 176.8, '------', 0, 0, 1, 4.87528, 1614229682, 1000, 0, 0, 0, 0),
(6108, 3009, 466, 0, 1, -2183.1, 183.822, 23.7586, 79.9322, '------', 1, 0, 1, 13.3216, 1614406294, 1000, 0, 0, 0, 0),
(4103, 1950, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, 'P505CX', 1, 0, 1, 7.60139, 1614181938, 1000, 0, 0, 0, 0),
(5268, 2283, 429, 1, 1, 237.472, 1616.48, 11.1916, 351.268, 'B568BH', 0, 0, 1, 17.7756, 1614280858, 1000, 0, 0, 0, 0),
(3266, 30, 506, 3, 1, 1724.18, 1767.45, 15.4279, 272.287, '------', 0, 0, 1, 10.467, 1614088678, 1000, 0, 0, 0, 0),
(4742, 1302, 602, 119, 1, -310.552, 574.724, 11.9274, 352.858, '------', 0, 0, 1, 3.61028, 1614241440, 1000, 0, 0, 0, 0),
(3435, 1254, 415, 6, 1, 1915.92, -2233.05, 10.4051, 178.459, 'A352CB', 1, 0, 1, 67.4443, 1614101274, 1000, 0, 0, 0, 0),
(5893, 2954, 579, 14, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 6.73806, 1614367670, 1000, 0, 0, 0, 0),
(3705, 796, 490, 122, 1, 738.304, -1255.58, 40.0497, 155.341, 'X578XM', 0, 0, 1, 43.9634, 1614155479, 1000, 0, 0, 0, 0),
(3297, 1182, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614091039, 1000, 0, 0, 0, 0),
(5436, 3004, 415, 0, 1, 1822.33, 2106.19, 15.0044, 357.573, 'M186AK', 0, 0, 1, 25.1959, 1614328487, 1000, 0, 0, 0, 0),
(3784, 1202, 415, 10, 1, -470.861, 1156.12, 11.135, 224.538, 'B112BB', 0, 0, 1, 4.3475, 1614164641, 300, 0, 0, 0, 0),
(4231, 2028, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 2.51027, 1614186616, 1000, 0, 0, 0, 0),
(3310, 1526, 451, 0, 1, -236.882, 1085.38, 11.1841, 89.248, 'K185HO', 0, 0, 1, 44.7091, 1614091433, 1000, 0, 0, 0, 0),
(3437, 685, 410, 0, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 1, 0, 1, 1.60667, 1614101419, 1000, 0, 0, 0, 0),
(6412, 2583, 404, 6, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 1.60167, 1614439136, 1000, 0, 0, 0, 0),
(3329, 1173, 602, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 6.41612, 1614092717, 1000, 0, 0, 0, 0),
(3320, 1178, 415, 0, 1, -210.703, 1070.56, 11.1529, 0.820931, 'X836TH', 0, 0, 0, 10.5603, 1614092189, 1000, 0, 0, 0, 0),
(3876, 1651, 404, 2, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614172767, 1000, 0, 0, 0, 0),
(3326, 1155, 579, 0, 1, -2194.1, -127.921, 25.5221, 166.574, 'A747EC', 1, 0, 1, 10.2297, 1614092543, 1000, 0, 0, 0, 0),
(3327, 1179, 415, 3, 1, -267.25, 1033.75, 11.2854, 175.659, 'T468PB', 0, 0, 0, 15.9855, 1614092564, 300, 0, 0, 0, 0),
(3409, 28, 541, 119, 1, 2477.47, -740.933, 11.795, 0, 'H771KK', 0, 0, 1, 6.52778, 1614098467, 1000, 0, 0, 0, 0),
(3396, 399, 411, 119, 1, 1378.71, 448.596, 12.6462, 149.598, 'B303ET', 1, 0, 1, 4.59694, 1614097195, 1000, 0, 0, 0, 0),
(3916, 1669, 502, 122, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 2.68305, 1614174764, 1000, 0, 0, 0, 0),
(3334, 1123, 533, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 3.54556, 1614093265, 300, 0, 0, 0, 0),
(3335, 34, 558, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 0.482777, 1614093433, 1000, 0, 0, 0, 0),
(3426, 814, 579, 0, 1, -254.728, 1358.99, 20.1438, 89.792, '------', 1, 0, 1, 3.15389, 1614100440, 1000, 0, 0, 0, 0),
(3625, 1379, 579, 124, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.473611, 1614143322, 1000, 0, 0, 0, 0),
(3342, 1201, 404, 4, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 1, 0, 1614093776, 1000, 0, 0, 0, 0),
(3608, 1110, 533, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 9.14111, 1614140087, 1000, 0, 0, 0, 0),
(3372, 1162, 411, 3, 14, -261.332, 1496.24, 19.9142, 358.198, '------', 1, 0, 1, 2.32472, 1614095112, 1000, 0, 0, 0, 0),
(3345, 1198, 404, 4, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 3.22833, 1614094140, 1000, 0, 0, 0, 0),
(3417, 874, 541, 85, 0, -774.721, 807.465, 11.7803, 245.091, 'P777PP', 0, 0, 1, 111.409, 1614099632, 1000, 0, 3, 3, 3),
(3883, 1621, 404, 36, 1, 1851.7, -108.48, 14.937, 206.363, '------', 0, 0, 0, 2.82, 1614172957, 1000, 0, 0, 0, 0),
(3365, 1221, 541, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614094869, 1000, 0, 0, 0, 0),
(3379, 1220, 404, 6, 1, 1774.17, 2246.46, 15.107, 0.698733, '------', 0, 0, 1, 0, 1614095813, 1000, 0, 0, 0, 0),
(7456, 3387, 415, 0, 0, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 3.86278, 1614516420, 1000, 0, 0, 0, 0),
(6155, 2694, 436, 19, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 3.2175, 1614412853, 1000, 0, 0, 0, 0),
(3384, 1249, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614096387, 1000, 0, 0, 0, 0),
(3385, 1216, 579, 7, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 5.94195, 1614096441, 1000, 0, 0, 0, 0),
(3386, 1214, 404, 7, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 0.96361, 1614096450, 1000, 0, 0, 0, 0),
(3387, 1224, 521, 126, 1, -2328.68, 273.625, 23.2699, 170.755, '------', 0, 0, 0, 2.75028, 1614096471, 1000, 0, 0, 0, 0),
(5539, 2495, 506, 26, 1, -2308.54, 314.756, 23.3391, 348.131, 'C488MK', 0, 0, 1, 44.4989, 1614339686, 1000, 0, 0, 0, 0),
(7221, 2068, 502, 7, 1, -37.0426, 592.182, 11.6134, 175.657, 'H605EX', 1, 0, 1, 18.1992, 1614505889, 1000, 0, 0, 0, 0),
(4434, 2156, 402, 25, 1, 2019.8, 1336.46, 25.9878, 182.515, '------', 1, 0, 1, 2.5125, 1614198118, 1000, 0, 0, 0, 0),
(3669, 1236, 579, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.49333, 1614148263, 1000, 0, 0, 0, 0),
(3646, 1257, 579, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 0.945555, 1614144612, 1000, 0, 0, 0, 0),
(4282, 2094, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614188719, 1000, 0, 0, 0, 0),
(3406, 1241, 400, 1, 1, 567.08, 1705.05, 12.1096, 356.18, '------', 0, 0, 1, 0.91111, 1614097898, 1000, 0, 0, 0, 0),
(3950, 1779, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614175820, 1000, 0, 0, 0, 0),
(5145, 2551, 402, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.81, 1614272598, 1000, 0, 0, 0, 0),
(4223, 2010, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 3.56111, 1614186241, 1000, 0, 0, 0, 0),
(6425, 2761, 579, 6, 1, -2152.02, 122.446, 25.5144, 199.737, '------', 1, 0, 1, 15.0995, 1614440450, 1000, 0, 0, 0, 0),
(3439, 1277, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614101581, 1000, 0, 0, 0, 0),
(3440, 142, 461, 1, 1, -2318.26, 271.014, 23.5069, 173.445, '------', 0, 0, 0, 3.07278, 1614101620, 1000, 0, 0, 0, 0),
(4539, 2237, 579, 1, 1, 2430.3, -2167.6, 21.358, 273.5, 'B283OX', 0, 0, 0, 5.63111, 1614207288, 1000, 0, 0, 0, 0),
(5566, 2806, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.036388, 1614342441, 1000, 0, 0, 0, 0),
(3738, 627, 402, 0, 1, 472.509, 744.654, 11.8435, 339.598, 'O130PT', 0, 0, 1, 77.2896, 1614160454, 1000, 0, 0, 0, 0),
(3455, 1152, 451, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 6.26861, 1614102521, 1000, 0, 0, 0, 0),
(3662, 851, 502, 1, 1, -361.63, 1408.23, 19.9751, 271.046, 'E111KX', 0, 0, 1, 0.700832, 1614146962, 1000, 0, 0, 0, 0),
(3841, 1217, 502, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.954722, 1614170286, 1000, 0, 0, 0, 0),
(3506, 1323, 404, 3, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614110917, 1000, 0, 0, 0, 0),
(3831, 1520, 471, 1, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0.109444, 1614169669, 1000, 0, 0, 0, 0),
(3483, 1297, 490, 1, 1, 2060.12, 1326.11, 25.6048, 91.239, 'B547AA', 1, 0, 1, 9.11557, 1614108208, 1000, 0, 0, 0, 0),
(6532, 1709, 579, 0, 1, 1816.08, 2133.72, 15.2477, 179.954, 'T211MC', 0, 0, 1, 8.76805, 1614444525, 300, 0, 0, 0, 0),
(3700, 1020, 480, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 1.06444, 1614154186, 1000, 0, 0, 0, 0),
(3480, 1284, 451, 6, 1, 114.775, 918.744, 11.1843, 256.237, 'O277TT', 1, 0, 1, 11.855, 1614108054, 1000, 0, 0, 0, 0),
(6534, 1138, 402, 105, 1, 2481.31, -740.893, 11.795, 0, 'O244KK', 0, 0, 1, 3.8325, 1614444585, 1000, 0, 0, 0, 0),
(3607, 1196, 415, 2, 1, -2329.47, 266.811, 22.8604, 350.762, '------', 0, 0, 1, 8.78804, 1614140028, 300, 0, 0, 0, 0),
(4055, 1943, 404, 0, 1, 1802.46, 2533.34, 14.9061, 123.064, '------', 1, 0, 1, 5.57833, 1614180691, 1000, 0, 0, 0, 0),
(3693, 1298, 579, 0, 1, -250.969, 1003.02, 11.492, 268.495, 'A880TM', 0, 0, 1, 12.9753, 1614152162, 1000, 0, 0, 0, 0),
(3512, 1333, 466, 0, 1, 2477.47, -740.933, 11.795, 0, 'H260AK', 0, 0, 0, 1.41944, 1614111759, 1000, 0, 0, 0, 0),
(3528, 1316, 505, 42, 0, -241.198, 1056.7, 12.1311, 335.468, '------', 0, 0, 1, 2.86945, 1614112942, 1000, 0, 0, 0, 0),
(3509, 82, 451, 0, 1, -982.308, 739.601, 11.7426, 90.6194, '------', 1, 0, 1, 3.20861, 1614111388, 1000, 0, 0, 0, 0),
(3507, 1315, 451, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.56667, 1614110970, 1000, 0, 0, 0, 0),
(3694, 1295, 502, 7, 1, 2477.47, -740.933, 11.795, 0, 'C240CT', 0, 0, 1, 7.58278, 1614152174, 1000, 0, 0, 0, 0),
(3523, 1338, 415, 1, 1, 2477.47, -740.933, 11.795, 0, 'X258KP', 0, 0, 0, 0, 1614112586, 1000, 0, 0, 0, 0),
(3517, 1068, 415, 44, 1, 123.982, 929.055, 11.1519, 251.013, '------', 1, 0, 1, 25.4718, 1614112269, 1000, 0, 0, 0, 0),
(3560, 1564, 579, 0, 0, 308.047, 1160.54, 11.4005, 246.237, 'M111EP', 1, 0, 1, 30.24, 1614116822, 1000, 0, 0, 0, 0),
(5642, 1713, 415, 4, 1, -287.286, 1030.65, 11.2852, 87.0302, '------', 0, 0, 1, 7.08361, 1614349692, 1000, 0, 0, 0, 0),
(3531, 212, 541, 3, 1, -398.711, 1351.54, 19.9825, 6.36759, 'X388PT', 0, 0, 1, 10.3786, 1614113253, 1000, 0, 0, 0, 0),
(3565, 1187, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 6.58556, 1614118309, 300, 0, 0, 0, 0),
(4170, 1712, 415, 25, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 9.09639, 1614184488, 1000, 0, 0, 0, 0),
(3559, 1157, 402, 0, 0, 1922.76, -2233.1, 11.0945, 359.823, 'X222AM', 0, 0, 1, 79.7783, 1614116612, 1000, 0, 0, 0, 0),
(3575, 1334, 451, 14, 1, -287.416, 1011.44, 11.3169, 89.1025, 'X665XE', 0, 0, 1, 11.5628, 1614121270, 300, 0, 0, 0, 0),
(3568, 294, 402, 0, 0, 2481.31, -740.893, 11.795, 0, 'X333AM', 0, 0, 0, 0, 1614118934, 1000, 0, 0, 0, 0),
(3617, 1310, 521, 3, 1, -2234.62, 280.736, 24.012, 207.213, '------', 1, 0, 1, 1.40222, 1614141891, 1000, 0, 0, 0, 0),
(3946, 157, 579, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.091666, 1614175696, 1000, 0, 0, 0, 0),
(3639, 1385, 411, 104, 1, -2322.04, -118.239, 21.5028, 183.961, 'P452BO', 1, 0, 1, 19.5058, 1614144343, 1000, 0, 3, 3, 3),
(3586, 1369, 415, 79, 0, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 9.80445, 1614129011, 1000, 0, 0, 0, 0),
(3783, 1212, 475, 101, 49, 1375.51, 451.079, 12.6476, 146.918, 'K241XH', 1, 0, 1, 3.30666, 1614164518, 1000, 0, 0, 0, 0),
(5547, 2624, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 7.52139, 1614340183, 1000, 0, 0, 0, 0),
(7294, 3393, 471, 125, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 1, 2.40361, 1614508630, 1000, 0, 0, 0, 0),
(3963, 1686, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 1.67417, 1614176592, 1000, 0, 0, 0, 0),
(4868, 2370, 489, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614250081, 1000, 0, 0, 0, 0);
INSERT INTO `ownable_cars` (`id`, `owner_id`, `model_id`, `color_1`, `color_2`, `pos_x`, `pos_y`, `pos_z`, `angle`, `number`, `status`, `alarm`, `key_in`, `mileage`, `create_time`, `health`, `vinilcar`, `pt_engine`, `pt_brake`, `pt_stability`) VALUES
(3635, 1320, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, 'X438BB', 1, 0, 1, 4.08166, 1614144069, 1000, 0, 0, 0, 0),
(4896, 1518, 402, 0, 1, -2301.23, 302.827, 24.0083, 78.5093, '------', 1, 0, 0, 44.7831, 1614251534, 1000, 0, 0, 0, 0),
(3892, 1301, 579, 2, 0, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.97222, 1614173297, 1000, 0, 0, 0, 0),
(3775, 1476, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 4.77888, 1614163489, 1000, 0, 0, 0, 0),
(5295, 2336, 451, 116, 1, 2574.83, -2446.17, 21.1858, 356.212, 'T042TX', 0, 0, 1, 46.4423, 1614286082, 1000, 0, 0, 0, 0),
(3657, 1155, 521, 1, 1, -2197.41, -120.67, 25.9564, 71.8624, '------', 1, 0, 1, 0.50611, 1614145749, 1000, 0, 0, 0, 0),
(3652, 1155, 415, 126, 1, -2193.35, -120.285, 25.28, 168.074, 'X145CC', 0, 0, 1, 2.81333, 1614145038, 1000, 0, 0, 0, 0),
(3711, 1080, 505, 9, 1, 2477.47, -740.933, 11.795, 0, 'M085TX', 0, 0, 1, 8.49445, 1614156490, 1000, 0, 0, 0, 0),
(3656, 1344, 429, 17, 1, -251.291, 998.447, 11.1962, 233.308, '------', 0, 0, 0, 19.2564, 1614145554, 1000, 0, 0, 0, 0),
(4310, 1645, 502, 7, 1, 787.713, -1348.86, 39.6573, 247.519, 'A274KX', 0, 0, 1, 18.9917, 1614190250, 1000, 0, 0, 0, 0),
(3664, 53, 429, 118, 0, 484.874, 747.638, 11.1949, 71.0385, 'A555MP', 0, 0, 1, 68.4057, 1614147610, 1000, 0, 0, 0, 0),
(3676, 1193, 505, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 3.32, 1614149237, 1000, 0, 3, 3, 3),
(3678, 548, 507, 0, 1, 2372.96, -777.452, 13.0518, 94.7125, 'B335AB', 0, 0, 1, 28.4121, 1614149861, 1000, 0, 0, 0, 0),
(3679, 1324, 461, 3, 1, -271.062, 1036.34, 11.6933, 269.533, '------', 0, 0, 0, 10.9542, 1614150315, 1000, 0, 0, 0, 0),
(3680, 1409, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614150365, 1000, 0, 0, 0, 0),
(3684, 1381, 579, 1, 1, 2477.47, -740.933, 11.795, 0, 'H622MO', 0, 0, 0, 0, 1614151454, 1000, 0, 0, 0, 0),
(3701, 1417, 401, 1, 1, -2172.74, 185.709, 23.8374, 221.77, '------', 0, 0, 0, 11.4867, 1614154346, 1000, 0, 0, 0, 0),
(3714, 1356, 505, 0, 1, 2481.31, -740.893, 11.795, 0, 'T746HA', 1, 0, 1, 2.62917, 1614157008, 1000, 0, 0, 0, 0),
(3903, 1516, 415, 6, 1, 2481.31, -740.893, 11.795, 0, 'C886KA', 1, 0, 1, 3.2075, 1614173918, 1000, 0, 0, 0, 0),
(4978, 1999, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.290277, 1614260338, 1000, 0, 0, 0, 0),
(3773, 1109, 490, 3, 1, 807.245, -1364.07, 40.0397, 167.907, '------', 0, 0, 0, 2.84305, 1614163282, 1000, 0, 0, 0, 0),
(7175, 531, 502, 2, 0, -261.505, 1503.63, 19.9749, 356.863, '------', 0, 0, 1, 5.67194, 1614502251, 300, 0, 0, 0, 0),
(3725, 1159, 490, 120, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.95583, 1614158451, 1000, 0, 0, 0, 0),
(3761, 1426, 415, 0, 1, 114.441, 920.628, 11.1551, 243.566, 'T883XT', 1, 0, 1, 35.4892, 1614162345, 1000, 0, 0, 0, 0),
(3801, 1432, 466, 7, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 1.73722, 1614166189, 1000, 0, 0, 0, 0),
(4847, 1734, 402, 119, 1, -2181.73, 194.01, 24.3856, 114.827, '------', 0, 0, 1, 5.74945, 1614249153, 1000, 0, 0, 0, 0),
(3807, 1485, 451, 126, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 14.4475, 1614166920, 300, 0, 0, 0, 0),
(3739, 1038, 402, 125, 1, -358.433, 1408.97, 20.5846, 271.813, 'T811BA', 0, 0, 0, 12.4308, 1614160501, 1000, 0, 0, 0, 0),
(5374, 2553, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614318472, 1000, 0, 0, 0, 0),
(4081, 1811, 404, 36, 8, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 1, 0.282222, 1614181458, 300, 0, 0, 0, 0),
(3839, 1235, 505, 6, 1, 2477.47, -740.933, 11.795, 0, 'K250HA', 0, 0, 0, 3.51861, 1614170039, 1000, 0, 0, 0, 0),
(3798, 1494, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614166038, 1000, 0, 0, 0, 0),
(3779, 830, 603, 118, 0, -313.774, 1019.23, 11.3728, 1.36874, '------', 0, 0, 0, 8.62001, 1614163944, 1000, 0, 0, 0, 0),
(5859, 1620, 506, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1614364906, 1000, 0, 0, 0, 0),
(3794, 1475, 404, 3, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614165693, 1000, 0, 0, 0, 0),
(3806, 1508, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614166721, 1000, 0, 0, 0, 0),
(6337, 727, 402, 0, 1, 2477.47, -740.933, 11.795, 0, 'X417EC', 1, 0, 1, 3.45389, 1614431393, 300, 0, 0, 0, 0),
(6450, 2149, 402, 0, 1, -197.019, 601.852, 12.0232, 260.87, 'B423KP', 1, 0, 1, 16.7864, 1614442416, 1000, 0, 3, 3, 3),
(5058, 2257, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 7.46555, 1614265348, 1000, 0, 0, 0, 0),
(4414, 1958, 521, 1, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 3.18944, 1614197016, 1000, 0, 0, 0, 0),
(3822, 95, 466, 8, 1, 1880.16, -2233.25, 10.4675, 181.848, 'P022OM', 1, 0, 1, 53.0137, 1614167847, 1000, 0, 0, 0, 0),
(3826, 3117, 402, 0, 1, -331.228, 1310.41, 20.5875, 92.1144, 'M644AT', 0, 0, 1, 88.2077, 1614169163, 1000, 0, 3, 3, 3),
(3820, 1510, 451, 119, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 1.93333, 1614167775, 1000, 0, 0, 0, 0),
(3827, 1521, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 1.58555, 1614169219, 1000, 0, 0, 0, 0),
(3843, 1402, 502, 1, 1, 1806.56, 2513.06, 14.8973, 176.268, '------', 1, 0, 1, 6.41167, 1614170457, 1000, 0, 0, 0, 0),
(4136, 1731, 579, 124, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 13.6311, 1614183065, 1000, 0, 0, 0, 0),
(3835, 1228, 602, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 11.4083, 1614169792, 300, 0, 0, 0, 0),
(3869, 1376, 541, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 10.7436, 1614172042, 300, 0, 0, 0, 0),
(3845, 1186, 451, 119, 1, 2477.47, -740.933, 11.795, 0, 'P400XP', 1, 0, 1, 4.68361, 1614170606, 1000, 0, 0, 0, 0),
(3847, 1326, 466, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614170863, 1000, 0, 0, 0, 0),
(3866, 1616, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 2.37194, 1614171960, 1000, 0, 0, 0, 0),
(3849, 937, 480, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 1, 0, 1, 0.404999, 1614170958, 1000, 0, 0, 0, 0),
(3984, 873, 415, 104, 1, -128.542, 931.281, 11.157, 66.3331, 'P128OA', 1, 0, 1, 34.502, 1614177785, 1000, 0, 0, 0, 0),
(3853, 1588, 404, 2, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614171470, 1000, 0, 0, 0, 0),
(3855, 1557, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 3.16027, 1614171630, 1000, 0, 0, 0, 0),
(3856, 1553, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 3.39083, 1614171654, 1000, 0, 0, 0, 0),
(5166, 2394, 436, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 3.12861, 1614274356, 1000, 0, 0, 0, 0),
(3858, 1602, 404, 122, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614171698, 1000, 0, 0, 0, 0),
(3861, 1806, 415, 26, 4, 470.593, 758.759, 11.1517, 156.213, '------', 1, 0, 1, 10.9494, 1614171823, 1000, 0, 0, 0, 0),
(3860, 1558, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 1, 3.83778, 1614171728, 1000, 0, 0, 0, 0),
(6692, 3256, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 3.13916, 1614451834, 1000, 0, 0, 0, 0),
(4785, 2402, 404, 3, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614244811, 1000, 0, 0, 0, 0),
(4934, 2440, 579, 0, 1, -2151.95, 125.685, 25.3505, 198.03, '------', 0, 0, 1, 24.8172, 1614254823, 1000, 0, 0, 0, 0),
(6096, 363, 411, 121, 0, -54.5154, 592.821, 11.5558, 173.166, 'B610XO', 0, 0, 1, 19.133, 1614404689, 1000, 0, 0, 0, 0),
(3902, 1685, 527, 0, 1, -236.262, 1092.67, 11.2594, 88.5507, '------', 1, 0, 1, 9.96141, 1614173774, 1000, 0, 0, 0, 0),
(3875, 1032, 541, 124, 1, 602.566, 1732.1, 11.3022, 343.015, 'K422KH', 0, 0, 1, 9.55333, 1614172429, 300, 0, 0, 0, 0),
(3878, 1663, 401, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.36, 1614172829, 1000, 0, 0, 0, 0),
(7169, 478, 502, 124, 1, 1917.33, -2233.06, 10.4838, 23.1601, 'B217AE', 0, 0, 1, 5.29889, 1614501832, 1000, 0, 0, 0, 0),
(6908, 3280, 415, 86, 1, -2166.48, -197.679, 24.8425, 343.466, 'X052XM', 1, 0, 1, 12.5164, 1614466503, 1000, 0, 3, 3, 1),
(3886, 1666, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614173142, 1000, 0, 0, 0, 0),
(3887, 1311, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 1.29666, 1614173146, 1000, 0, 0, 0, 0),
(3889, 1677, 404, 2, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614173178, 1000, 0, 0, 0, 0),
(3891, 1648, 471, 0, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 0, 1614173256, 1000, 0, 0, 0, 0),
(3894, 1691, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614173329, 1000, 0, 0, 0, 0),
(3951, 507, 421, 25, 1, -2213.07, -88.0024, 25.9447, 102.576, 'O781TT', 1, 0, 1, 13.8031, 1614175849, 1000, 0, 0, 0, 0),
(3896, 1662, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614173333, 1000, 0, 0, 0, 0),
(4689, 2331, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 0.839166, 1614235255, 1000, 0, 0, 0, 0),
(3897, 1654, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 3.77389, 1614173540, 1000, 0, 0, 0, 0),
(3899, 1701, 404, 17, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 1.66111, 1614173646, 1000, 0, 0, 0, 0),
(3907, 1627, 579, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0.019722, 1614173949, 1000, 0, 0, 0, 0),
(3908, 1584, 559, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 2.06583, 1614173950, 300, 0, 0, 0, 0),
(3909, 1260, 415, 2, 1, -2223.29, -196.182, 23.9008, 166.656, '------', 1, 0, 1, 6.18055, 1614174027, 1000, 0, 0, 0, 0),
(3910, 1665, 451, 125, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.53472, 1614174098, 1000, 0, 0, 0, 0),
(4173, 1491, 402, 0, 1, -2150.07, 114.812, 26.1342, 206.019, '------', 1, 0, 0, 5.23695, 1614184632, 1000, 0, 0, 0, 0),
(5913, 2928, 402, 7, 1, -170.447, 990.324, 11.8466, 81.8673, '------', 1, 0, 1, 4.46111, 1614370067, 1000, 0, 0, 0, 0),
(3921, 1624, 426, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 1, 0, 1, 5.44694, 1614174871, 1000, 0, 0, 0, 0),
(4016, 1683, 404, 124, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 3.97222, 1614178813, 1000, 0, 0, 0, 0),
(3927, 1777, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 1, 0, 0, 0, 1614175030, 1000, 0, 0, 0, 0),
(5311, 340, 579, 0, 1, -44.9363, 593.211, 11.764, 180.215, 'C055MH', 0, 0, 1, 4.38722, 1614304320, 1000, 0, 0, 0, 0),
(3930, 1540, 579, 0, 1, 1898.54, -2211.58, 10.6469, 355.562, '------', 1, 0, 0, 1.60444, 1614175097, 1000, 0, 0, 0, 0),
(3931, 1537, 506, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 1.85417, 1614175113, 1000, 0, 0, 0, 0),
(5146, 2421, 541, 3, 1, -304.786, 580.83, 11.3304, 345.998, 'X252EB', 1, 0, 1, 13.7314, 1614272599, 1000, 0, 0, 0, 0),
(7180, 3300, 602, 126, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 5.21139, 1614502874, 1000, 0, 0, 0, 0),
(4506, 2012, 490, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.27, 1614202506, 1000, 0, 0, 0, 0),
(3935, 943, 404, 118, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614175204, 1000, 0, 0, 0, 0),
(5312, 340, 402, 0, 1, -51.6407, 592.637, 12.2262, 138.696, 'K662HC', 1, 0, 1, 12.8605, 1614304338, 300, 0, 0, 0, 0),
(3938, 1670, 401, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0.036388, 1614175234, 1000, 0, 0, 0, 0),
(3939, 1774, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 2.58527, 1614175248, 1000, 0, 0, 0, 0),
(3940, 1758, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 3.19278, 1614175248, 300, 0, 0, 0, 0),
(4056, 1560, 579, 0, 1, -236.231, 1084.52, 11.3951, 84.3672, '------', 0, 0, 1, 21.9275, 1614180736, 1000, 0, 0, 0, 0),
(4183, 1876, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 2.67972, 1614184974, 1000, 0, 0, 0, 0),
(3948, 1684, 401, 1, 1, -2167.32, -197.493, 24.9272, 171.118, '------', 0, 0, 0, 24.2741, 1614175744, 1000, 0, 0, 0, 0),
(3945, 1786, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614175482, 1000, 0, 0, 0, 0),
(3955, 1332, 451, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 9.42361, 1614176012, 300, 0, 0, 0, 0),
(3957, 1715, 404, 122, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 2.08222, 1614176137, 1000, 0, 0, 0, 0),
(3959, 1735, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614176242, 1000, 0, 0, 0, 0),
(3968, 795, 461, 0, 1, -2338.61, 107.65, 20.5875, 270.491, '------', 0, 0, 1, 7.93806, 1614176661, 1000, 0, 0, 0, 0),
(4019, 1530, 579, 0, 1, 2481.31, -740.893, 11.795, 0, 'C471BT', 0, 0, 1, 8.98668, 1614179042, 1000, 0, 0, 0, 0),
(4603, 1065, 502, 1, 0, 623.597, -1315.71, 39.9673, 336.019, 'C133CC', 0, 0, 1, 10.9642, 1614221499, 1000, 0, 1, 3, 1),
(3972, 1845, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614176865, 1000, 0, 0, 0, 0),
(3973, 1752, 404, 124, 1, 1777.92, 2247.33, 15.8137, 1.4248, 'X723OE', 0, 0, 1, 13.8716, 1614176868, 1000, 0, 0, 0, 0),
(6288, 3146, 502, 7, 1, 842.986, -1391.19, 39.9384, 164.665, '------', 1, 0, 1, 1.02472, 1614426071, 1000, 0, 0, 0, 0),
(3977, 1840, 404, 122, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 4.90584, 1614177129, 1000, 0, 0, 0, 0),
(3978, 1818, 451, 3, 1, 2487.41, -740.893, 11.795, 0, 'M466PX', 0, 0, 0, 25.9219, 1614177266, 1000, 0, 0, 0, 0),
(3979, 1750, 602, 1, 1, 2477.47, -740.933, 11.795, 0, 'A733HO', 1, 0, 1, 3.22444, 1614177308, 1000, 0, 0, 0, 0),
(3981, 1808, 404, 1, 1, 2680.9, 2648.77, 14.6864, 256.291, '------', 1, 0, 1, 1.53778, 1614177438, 1000, 0, 0, 0, 0),
(4160, 1994, 404, 0, 1, 1786.41, 2251.54, 14.9668, 353.953, '------', 1, 0, 1, 1.72028, 1614184115, 1000, 0, 0, 0, 0),
(4095, 1969, 521, 3, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 1, 0, 1, 4.02972, 1614181711, 1000, 0, 0, 0, 0),
(4891, 1711, 451, 0, 1, 2487.41, -740.893, 11.795, 0, 'C725CA', 0, 0, 0, 1.94333, 1614251333, 300, 0, 0, 0, 0),
(3994, 1736, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 4.15388, 1614178173, 1000, 0, 3, 3, 3),
(6490, 3221, 415, 7, 1, 2481.31, -740.893, 11.795, 0, 'E566AA', 1, 0, 1, 3.45278, 1614443468, 1000, 0, 0, 0, 0),
(4002, 1804, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 1, 0, 1614178397, 1000, 0, 0, 0, 0),
(4017, 1838, 426, 25, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 1, 0, 1, 2.60139, 1614178873, 1000, 0, 0, 0, 0),
(5284, 1070, 603, 119, 1, -2313.78, -141.825, 21.3057, 48.322, 'B201HO', 0, 0, 1, 6.67944, 1614281872, 1000, 0, 3, 2, 1),
(4840, 2057, 429, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.97222, 1614248652, 1000, 0, 0, 0, 0),
(4171, 1856, 461, 126, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 1, 0, 1, 3.22167, 1614184567, 1000, 0, 0, 0, 0),
(5030, 2545, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614263453, 1000, 0, 0, 0, 0),
(7492, 2062, 405, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 1.0375, 1614517643, 1000, 0, 0, 0, 0),
(4032, 1901, 468, 0, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0, 1614179480, 1000, 0, 0, 0, 0),
(4041, 1932, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614179909, 1000, 0, 0, 0, 0),
(4465, 1982, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614199676, 1000, 0, 0, 0, 0),
(4043, 1919, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 1, 12.9139, 1614179947, 1000, 0, 0, 0, 0),
(5520, 2804, 404, 3, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 3.94111, 1614337629, 1000, 0, 0, 0, 0),
(5051, 2501, 581, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 0.896388, 1614264892, 1000, 0, 0, 0, 0),
(4980, 2383, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 25.3122, 1614260453, 300, 0, 0, 0, 0),
(4052, 1552, 451, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 3.64472, 1614180478, 1000, 0, 0, 0, 0),
(4788, 2136, 415, 1, 1, -2169.84, 191.703, 23.8321, 124.147, 'T780BM', 0, 0, 1, 26.6594, 1614245010, 1000, 0, 0, 0, 0),
(4113, 1915, 404, 11, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614182290, 1000, 0, 0, 0, 0),
(4164, 122, 505, 0, 1, 1899.11, -2233.8, 11.3792, 4.93836, 'T300OO', 0, 0, 1, 9.63779, 1614184254, 1000, 0, 0, 0, 0),
(4087, 1747, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.903333, 1614181597, 1000, 0, 0, 0, 0),
(4068, 1676, 579, 3, 1, -183.202, 1031.9, 11.3935, 0.826744, '------', 0, 0, 1, 7.88389, 1614181173, 1000, 0, 0, 0, 0),
(4083, 199, 402, 122, 1, -325.714, 1310.42, 20.5839, 88.8185, 'T558TB', 0, 0, 1, 19.1703, 1614181519, 1000, 0, 0, 0, 0),
(4064, 994, 602, 118, 1, -666.641, 749.483, 12.2365, 269.627, '------', 1, 0, 1, 10.4292, 1614181013, 1000, 0, 0, 0, 0),
(4536, 1899, 415, 3, 1, -267.213, 1474.76, 19.9319, 174.723, '------', 0, 0, 0, 9.15001, 1614206422, 1000, 0, 0, 0, 0),
(7172, 417, 558, 120, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 11.6622, 1614501957, 1000, 0, 0, 0, 0),
(4105, 1962, 415, 115, 1, -236.069, 1073.74, 11.1531, 58.1056, '------', 1, 0, 1, 3.9211, 1614182081, 1000, 0, 0, 0, 0),
(4270, 2076, 502, 126, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 3.75194, 1614188194, 1000, 0, 0, 0, 0),
(4673, 1210, 451, 119, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.64, 1614233492, 1000, 0, 0, 0, 0),
(4123, 1720, 404, 1, 1, 1897.33, 2103.35, 15.0353, 3.70007, '------', 1, 0, 1, 6.94527, 1614182560, 1000, 0, 0, 0, 0),
(4835, 1547, 602, 6, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 0.182777, 1614247390, 1000, 0, 0, 0, 0),
(6328, 3162, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614430889, 1000, 0, 0, 0, 0),
(4236, 1926, 451, 119, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614186810, 1000, 0, 0, 0, 0),
(4142, 1576, 602, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614183194, 1000, 0, 0, 0, 0),
(4141, 1968, 521, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 2.99306, 1614183137, 1000, 0, 0, 0, 0),
(4718, 1635, 502, 1, 1, 2558.26, 2598.5, 11.5997, 283.516, '------', 1, 0, 1, 4.45806, 1614237582, 1000, 0, 0, 0, 0),
(4146, 550, 402, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 3.22056, 1614183339, 300, 0, 0, 0, 0),
(4149, 1902, 490, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.34111, 1614183424, 1000, 0, 0, 0, 0),
(4192, 1988, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'E353EB', 0, 0, 0, 0, 1614185212, 1000, 0, 0, 0, 0),
(7193, 3092, 490, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 4.67638, 1614504212, 1000, 0, 3, 3, 3),
(4219, 2033, 404, 1, 1, 1774.18, 2246.46, 15.1179, 0.373582, '------', 0, 0, 0, 0.001665, 1614186170, 1000, 0, 0, 0, 0),
(5694, 2588, 463, 1, 1, -2234.62, 280.736, 24.012, 207.213, '------', 1, 0, 0, 3.50889, 1614352520, 1000, 0, 0, 0, 0),
(4182, 2015, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 8.21138, 1614184924, 1000, 0, 0, 0, 0),
(5705, 2812, 429, 1, 1, 1905.33, 1729.42, 15.3793, 158.766, '------', 1, 0, 1, 4.265, 1614353536, 1000, 0, 0, 0, 0),
(5194, 1239, 400, 2, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.33111, 1614276291, 1000, 0, 0, 0, 0),
(5721, 2896, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 0, 0.072777, 1614355139, 1000, 0, 0, 0, 0),
(4308, 1155, 481, 1, 1, -2190.01, -128.758, 25.6362, 152.106, '------', 0, 0, 0, 0, 1614190160, 1000, 0, 0, 0, 0),
(4244, 2002, 490, 1, 1, -2212.81, -205.226, 23.8672, 294.758, 'A456AX', 0, 0, 0, 10.3625, 1614187015, 1000, 0, 0, 0, 0),
(4245, 2038, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, 'T603PP', 1, 0, 1, 12.9722, 1614187033, 1000, 0, 0, 0, 0),
(4249, 1156, 402, 3, 1, -2319.55, -137.807, 21.8462, 228.382, 'M271MO', 0, 0, 1, 23.3801, 1614187136, 1000, 0, 0, 0, 0),
(4254, 1881, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 4.08639, 1614187378, 1000, 0, 0, 0, 0),
(5455, 2271, 541, 114, 1, 2477.47, -740.933, 11.795, 0, 'A716AT', 0, 0, 0, 7.03305, 1614330025, 300, 0, 0, 0, 0),
(4484, 1611, 429, 1, 1, -237.965, 1092.61, 11.1922, 93.2367, 'K738BA', 0, 0, 0, 6.50888, 1614200943, 1000, 0, 0, 0, 0),
(5147, 1279, 466, 125, 1, 119.626, 925.345, 11.2142, 90.5623, '------', 1, 0, 1, 2.51917, 1614272612, 1000, 0, 0, 0, 0),
(4967, 2144, 463, 0, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0, 1614258925, 1000, 0, 0, 0, 0),
(6408, 3166, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614438946, 1000, 0, 0, 0, 0),
(4276, 2050, 533, 125, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 1.51111, 1614188387, 1000, 0, 0, 0, 0),
(6008, 2932, 451, 1, 1, 2477.47, -740.933, 11.795, 0, 'A682ET', 0, 0, 0, 5.78416, 1614378580, 300, 0, 0, 0, 0),
(5827, 2960, 404, 3, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 25.1008, 1614362343, 300, 0, 0, 0, 0),
(5066, 1571, 559, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 3.7886, 1614265898, 1000, 0, 0, 0, 0),
(5390, 2759, 401, 3, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.819722, 1614321080, 1000, 0, 0, 0, 0),
(4313, 1761, 579, 121, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.624444, 1614190331, 1000, 0, 0, 0, 0),
(4328, 1785, 415, 2, 3, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.075833, 1614191217, 1000, 0, 0, 0, 0),
(4302, 1790, 415, 3, 1, 1795.55, -988.948, 12.3666, 291.67, 'C036MO', 0, 0, 0, 3.86139, 1614189851, 1000, 0, 0, 0, 0),
(5015, 1870, 451, 6, 1, 493.66, 754.241, 11.1623, 62.6253, 'P526XX', 1, 0, 1, 28.6295, 1614262935, 1000, 0, 0, 0, 0),
(4316, 2104, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614190691, 1000, 0, 0, 0, 0),
(4649, 1474, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614232145, 1000, 0, 0, 0, 0),
(4306, 1827, 602, 124, 1, 2246.02, -200.731, 1.86859, 177.717, '------', 1, 0, 1, 3.01417, 1614189995, 1000, 0, 0, 0, 0),
(4375, 1172, 541, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 1.06833, 1614194458, 1000, 0, 0, 0, 0),
(4300, 2107, 401, 3, 1, 1777.92, 2247.33, 15.8137, 1.4248, 'O348EK', 1, 0, 0, 10.6367, 1614189764, 1000, 0, 0, 0, 0),
(4433, 2118, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 1, 0, 1, 1.78166, 1614198101, 1000, 0, 0, 0, 0),
(4297, 1337, 481, 1, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0, 1614189680, 1000, 0, 0, 0, 0),
(4467, 2192, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 7.59973, 1614199689, 1000, 0, 0, 0, 0),
(5011, 1924, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 3.63944, 1614262808, 1000, 0, 0, 0, 0),
(4332, 2125, 510, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 0, 0, 1614191485, 1000, 0, 0, 0, 0),
(4314, 2072, 404, 126, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 1, 4.62972, 1614190539, 1000, 0, 0, 0, 0),
(6203, 1283, 411, 3, 1, 1375.51, 451.079, 12.6476, 146.918, 'H704CO', 1, 0, 1, 1.08194, 1614419514, 1000, 0, 0, 0, 0),
(4312, 1995, 415, 3, 1, 2204.31, -257.923, 0.867021, 83.0096, '------', 1, 0, 1, 2.72639, 1614190259, 1000, 0, 0, 0, 0),
(4325, 1925, 502, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 2.05194, 1614191117, 1000, 0, 0, 0, 0),
(5012, 1877, 541, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 4.02833, 1614262825, 1000, 0, 0, 0, 0),
(7000, 58, 562, 2, 1, -963.727, 902.258, 11.7665, 179.824, 'A375HO', 0, 0, 1, 0.301943, 1614480950, 1000, 0, 0, 0, 0),
(4329, 2055, 404, 0, 1, 1773.82, 2249.78, 15.0943, 1.10384, '------', 0, 0, 1, 6.87999, 1614191222, 1000, 0, 0, 0, 0),
(6311, 3035, 581, 0, 1, -2234.62, 280.736, 24.012, 207.213, '------', 1, 0, 0, 10.1103, 1614428217, 1000, 0, 0, 0, 0),
(4358, 2165, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.282499, 1614193220, 1000, 0, 0, 0, 0),
(4947, 1796, 401, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 13.2511, 1614255843, 1000, 0, 0, 0, 0),
(6199, 3121, 505, 0, 1, 762.93, -1363.47, 40.8368, 160.446, '------', 1, 0, 1, 7.06834, 1614419208, 1000, 0, 0, 0, 0),
(4392, 2113, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614195675, 1000, 0, 0, 0, 0),
(5624, 2612, 402, 1, 17, -2280.97, -170.471, 23.4147, 229.712, '------', 0, 0, 1, 22.2573, 1614348510, 1000, 0, 0, 0, 0),
(4349, 2023, 579, 104, 1, 2477.47, -740.933, 11.795, 0, 'M642PB', 1, 0, 1, 2.67778, 1614192821, 1000, 0, 0, 0, 0),
(4363, 1205, 434, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 1, 1.77028, 1614193745, 1000, 0, 0, 0, 0),
(4381, 2158, 466, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614194787, 1000, 0, 0, 0, 0),
(4797, 2376, 471, 8, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 1.52583, 1614245372, 1000, 0, 0, 0, 0),
(4792, 2311, 466, 1, 1, -2158.62, 139.878, 24.7638, 201.028, 'B632AH', 1, 0, 1, 11.0352, 1614245229, 1000, 0, 0, 0, 0),
(4367, 2153, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 1, 10.5986, 1614193956, 1000, 0, 0, 0, 0),
(4527, 2246, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614204632, 1000, 0, 0, 0, 0),
(4636, 2166, 490, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.445, 1614230416, 1000, 0, 0, 0, 0),
(5800, 2037, 541, 0, 1, -261.867, 1493.89, 19.9493, 175.93, 'E060CK', 0, 0, 1, 34.0445, 1614360025, 1000, 0, 0, 0, 0),
(5273, 2472, 521, 1, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0.533611, 1614281269, 1000, 0, 0, 0, 0),
(4481, 853, 429, 3, 0, -787.457, 811.28, 11.7546, 272.032, 'H700MB', 0, 0, 1, 69.3606, 1614200726, 1000, 0, 0, 0, 0),
(7301, 2562, 502, 3, 1, 1237.16, -1670.82, 29.6598, 136.205, 'B267PC', 1, 0, 1, 5.05389, 1614508790, 1000, 0, 0, 0, 0),
(4415, 1907, 466, 6, 1, 2477.47, -740.933, 11.795, 0, 'O302AK', 0, 0, 1, 4.14028, 1614197053, 1000, 0, 0, 0, 0),
(4416, 5, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, 'E111EX', 0, 0, 1, 1.385, 1614197116, 552.846, 0, 3, 3, 3),
(6781, 3283, 533, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 1.53056, 1614457178, 1000, 0, 0, 0, 0),
(5075, 2564, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614266493, 1000, 0, 0, 0, 0),
(4432, 997, 402, 0, 1, -2346.09, 80.7317, 20.8561, 120.286, 'P388KA', 0, 0, 0, 48.6789, 1614197991, 1000, 0, 0, 0, 0),
(7440, 2876, 579, 118, 1, 2477.47, -740.933, 11.795, 0, 'C765AM', 0, 0, 1, 1.56444, 1614515205, 1000, 0, 0, 0, 0),
(4436, 924, 400, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 2.14778, 1614198187, 1000, 0, 0, 0, 0),
(4445, 2189, 579, 1, 1, -187.494, 1091.52, 11.3949, 214.971, '------', 0, 0, 1, 14.4267, 1614198693, 1000, 0, 0, 0, 0),
(5638, 1864, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'T067OH', 0, 0, 0, 1.53694, 1614349376, 1000, 0, 0, 0, 0),
(4439, 2205, 404, 3, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 1.24, 1614198496, 1000, 0, 0, 0, 0),
(4441, 2186, 579, 124, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 1.02083, 1614198584, 1000, 0, 0, 0, 0),
(5085, 2585, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614266964, 1000, 0, 0, 0, 0),
(7315, 2137, 451, 0, 1, -866.351, 738.896, 11.8346, 270.535, '------', 1, 0, 1, 3.83167, 1614509711, 1000, 0, 0, 0, 0),
(4760, 2019, 490, 44, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 9.83334, 1614242253, 300, 0, 0, 0, 0),
(6866, 509, 411, 119, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 1, 0.378055, 1614462275, 300, 0, 0, 0, 0),
(5125, 1087, 502, 79, 1, 2477.47, -740.933, 11.795, 0, 'C371TP', 1, 0, 1, 2.63611, 1614270293, 1000, 0, 0, 0, 0),
(4851, 2264, 579, 0, 1, 1805.03, 2517.44, 15.0502, 83.7914, 'A660CP', 1, 0, 1, 112.588, 1614249216, 1000, 0, 0, 0, 0),
(4732, 2187, 463, 125, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 0.645555, 1614241028, 1000, 0, 0, 0, 0),
(4472, 2213, 402, 122, 1, 2481.31, -740.893, 11.795, 0, 'K738CM', 0, 0, 1, 8.05056, 1614199955, 1000, 0, 0, 0, 0),
(5162, 2475, 502, 16, 1, -2343.87, 83.8171, 20.2362, 46.6058, '------', 0, 0, 1, 22.0712, 1614274118, 1000, 0, 0, 0, 0),
(4867, 1862, 401, 17, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.126388, 1614250022, 1000, 0, 0, 0, 0),
(4648, 2065, 415, 119, 1, -311.581, 1014.59, 11.2851, 180.613, 'B813MA', 0, 0, 0, 4.29528, 1614232137, 1000, 0, 0, 0, 0),
(4476, 2201, 451, 6, 1, 2477.47, -740.933, 11.795, 0, 'H483OC', 0, 0, 1, 3.465, 1614200169, 300, 0, 0, 0, 0),
(4586, 1794, 404, 0, 0, 1783.9, 2252.07, 14.9538, 354.919, '------', 0, 0, 0, 12.2972, 1614217438, 1000, 0, 0, 0, 0),
(4765, 2324, 404, 1, 1, 1767.01, 2226.53, 15.1063, 179.558, 'K850BO', 1, 0, 1, 20.6049, 1614242776, 1000, 0, 0, 0, 0),
(6432, 32, 602, 0, 1, -711.732, 907.926, 12.2326, 179.789, '------', 0, 0, 1, 2.44555, 1614441241, 1000, 0, 0, 0, 0),
(4505, 1546, 505, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 3.14611, 1614202474, 300, 0, 0, 0, 0),
(4743, 8, 579, 36, 1, -810.257, 907.3, 12.0229, 182.11, 'B556OP', 0, 0, 1, 0.268055, 1614241442, 1000, 0, 0, 0, 0),
(7357, 530, 489, 1, 0, 1896.53, -2233.22, 10.6669, 178.737, 'E111EO', 0, 0, 1, 1.54083, 1614512086, 1000, 0, 0, 0, 0),
(4521, 1956, 466, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.491944, 1614203950, 1000, 0, 0, 0, 0),
(4670, 1704, 490, 86, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 9.88111, 1614233414, 1000, 0, 0, 0, 0),
(5076, 1370, 451, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.083055, 1614266525, 1000, 0, 0, 0, 0),
(4943, 2099, 579, 0, 0, 2487.41, -740.893, 11.795, 0, 'T036AO', 0, 0, 0, 1.40111, 1614255503, 1000, 0, 0, 0, 0),
(7037, 1001, 475, 0, 1, 1892.16, -2234.56, 10.9954, 4.50085, '------', 0, 0, 1, 11.5917, 1614490308, 1000, 0, 0, 0, 0),
(4552, 1724, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 1.53722, 1614212092, 1000, 0, 0, 0, 0),
(4579, 2040, 402, 1, 0, 488.806, 744.761, 11.8438, 70.8876, '------', 0, 0, 1, 30.9235, 1614216139, 1000, 0, 0, 0, 0),
(4576, 2263, 415, 125, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 2.54194, 1614215317, 1000, 0, 0, 0, 0),
(4727, 1634, 415, 114, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 7.75278, 1614239892, 300, 0, 0, 0, 0),
(4877, 2361, 481, 3, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0, 1614250685, 1000, 0, 0, 0, 0),
(4637, 2302, 541, 3, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0.180833, 1614230557, 1000, 0, 0, 0, 0),
(4621, 2308, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 0.835832, 1614229086, 1000, 0, 0, 0, 0),
(5842, 2911, 481, 4, 1, -1863.04, 587.898, 26.6369, 343.473, '------', 0, 0, 0, 0, 1614363774, 1000, 0, 0, 0, 0),
(4618, 1488, 404, 4, 1, 1975.77, 1920.99, 13.7667, 265.332, '------', 1, 0, 1, 8.38832, 1614227515, 1000, 0, 0, 0, 0),
(4620, 1940, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 0, 0, 1614228723, 1000, 0, 0, 0, 0),
(5017, 1797, 521, 2, 1, -432.452, 1224.9, 17.1822, 68.8747, '------', 1, 0, 1, 7.52667, 1614262972, 1000, 0, 0, 0, 0),
(4652, 1034, 429, 1, 1, -2337.6, 62.1782, 20.3192, 48.7233, 'X747KX', 0, 0, 1, 35.5477, 1614232553, 1000, 0, 0, 0, 0),
(4841, 1782, 463, 1, 1, 1781.69, 2478.5, 15.2598, 214.611, '------', 0, 0, 0, 3.60778, 1614248779, 1000, 0, 0, 0, 0),
(4730, 1858, 541, 124, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 3.67333, 1614240674, 1000, 0, 0, 0, 0),
(5207, 2408, 404, 120, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614277008, 1000, 0, 0, 0, 0),
(4697, 2325, 603, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 1.71417, 1614235802, 1000, 0, 0, 0, 0),
(4698, 2292, 404, 1, 1, 1726.06, 2260.64, 15.1096, 270.317, '------', 1, 0, 0, 0, 1614236218, 1000, 0, 0, 0, 0),
(5001, 2084, 401, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.552778, 1614262357, 1000, 0, 0, 0, 0),
(4702, 2337, 505, 1, 0, -63.7519, 467.674, 12.129, 350.406, 'O057AK', 0, 0, 1, 28.849, 1614236610, 1000, 0, 0, 0, 0),
(5673, 2872, 404, 14, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 1.50027, 1614351282, 1000, 0, 0, 0, 0),
(4706, 1900, 521, 1, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0.523333, 1614236841, 1000, 0, 0, 0, 0),
(4707, 1604, 404, 124, 1, 1772.14, 2242.1, 15.1484, 348.741, '------', 0, 0, 1, 7.01472, 1614236858, 1000, 0, 0, 0, 0),
(6128, 2834, 471, 0, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0, 1614408544, 1000, 0, 0, 0, 0),
(4752, 2373, 415, 117, 1, -2238.91, -193.255, 23.5613, 170.069, 'K401BA', 0, 0, 1, 11.972, 1614241860, 1000, 0, 0, 0, 0),
(4717, 1346, 404, 13, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 1.17194, 1614237551, 1000, 0, 0, 0, 0),
(5396, 1606, 502, 15, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 0, 3.32389, 1614322103, 1000, 0, 0, 0, 0),
(4721, 2256, 426, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 1, 2.83945, 1614238149, 1000, 0, 0, 0, 0),
(4722, 1550, 505, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614238736, 1000, 0, 0, 0, 0),
(4723, 1679, 404, 1, 1, 1768.42, 2209.11, 15.1976, 181.106, '------', 1, 0, 1, 2.73333, 1614239297, 1000, 0, 0, 0, 0),
(4724, 2247, 404, 2, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 7.06221, 1614239685, 1000, 0, 0, 0, 0),
(4725, 2083, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 4.06417, 1614239745, 1000, 0, 0, 0, 0),
(4749, 882, 415, 1, 1, 540.1, -1298.04, 39.8788, 144.287, '------', 0, 0, 0, 1.96917, 1614241799, 1000, 0, 0, 0, 0),
(4734, 8, 415, 5, 1, -838.14, 898.263, 11.8416, 97.2555, 'B445OP', 0, 0, 0, 0.028611, 1614241169, 1000, 0, 0, 0, 0),
(4738, 1857, 415, 119, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 2.595, 1614241282, 300, 0, 0, 0, 0),
(4755, 2346, 466, 109, 1, 2477.47, -740.933, 11.795, 0, 'C467XB', 0, 0, 1, 27.5434, 1614241909, 1000, 0, 0, 0, 0),
(4767, 2299, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 1, 4.1275, 1614242951, 300, 0, 0, 0, 0),
(5589, 377, 401, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.748055, 1614344492, 1000, 0, 0, 0, 0),
(4769, 2374, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.133333, 1614243099, 1000, 0, 0, 0, 0),
(6815, 3288, 505, 67, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 12.0089, 1614458516, 1000, 0, 0, 0, 0),
(4784, 2389, 521, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 1, 9.01556, 1614244619, 1000, 0, 0, 0, 0),
(5526, 1591, 404, 53, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 0.36861, 1614338536, 1000, 0, 0, 0, 0),
(4829, 1507, 429, 1, 1, 657.033, -1299.3, 39.694, 167.705, '------', 0, 0, 1, 7.46472, 1614247079, 1000, 0, 0, 0, 0),
(4798, 2242, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 1.10306, 1614245406, 1000, 0, 0, 0, 0),
(4802, 2160, 415, 86, 1, 2477.47, -740.933, 11.795, 0, 'K062HM', 0, 0, 1, 1.93778, 1614245623, 300, 0, 0, 0, 0),
(5708, 1492, 429, 0, 1, -433.418, 1443.37, 19.9365, 0, 'A665PP', 1, 0, 1, 30.6686, 1614354029, 1000, 0, 3, 3, 3),
(5473, 92, 415, 6, 1, 1821.35, 1325.94, 9.05332, 269.307, '------', 0, 0, 0, 10.7014, 1614331656, 1000, 0, 0, 0, 0),
(4948, 2074, 401, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 0.25, 1614255909, 1000, 0, 0, 0, 0),
(4907, 682, 411, 0, 2, -282.786, 1353, 19.9143, 3.21845, 'T426CB', 0, 0, 1, 22.3214, 1614252028, 1000, 0, 0, 0, 0),
(7135, 3358, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 3.02166, 1614499667, 1000, 0, 0, 0, 0),
(5354, 1330, 506, 3, 0, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 1.37167, 1614315355, 1000, 0, 0, 0, 0),
(4928, 2326, 461, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 0, 3.98083, 1614254299, 1000, 0, 0, 0, 0),
(4923, 2435, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 1.14, 1614254006, 1000, 0, 0, 0, 0),
(5488, 2397, 490, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.909444, 1614334418, 1000, 0, 0, 0, 0),
(4938, 2034, 521, 1, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 1, 0, 1, 1.72611, 1614255011, 1000, 0, 0, 0, 0),
(5348, 1743, 541, 3, 1, 2481.31, -740.893, 11.795, 0, 'P835BC', 0, 0, 0, 0, 1614314899, 1000, 0, 0, 0, 0),
(4964, 2479, 541, 1, 1, 2670.09, -773.918, 16.7763, 111.848, '------', 0, 0, 1, 3.38194, 1614258168, 300, 0, 0, 0, 0),
(5027, 1664, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614263324, 1000, 0, 0, 0, 0),
(6765, 404, 400, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 2.65499, 1614455913, 1000, 0, 0, 0, 0),
(7316, 2336, 559, 7, 1, 2567.53, -2446.03, 21.8528, 359.344, '------', 0, 0, 1, 2.87861, 1614509927, 1000, 0, 0, 0, 0),
(4955, 1922, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 7.55971, 1614256669, 1000, 0, 0, 0, 0),
(4959, 2483, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614257383, 1000, 0, 0, 0, 0),
(5323, 2727, 415, 125, 1, 217.454, 1572.02, 11.1524, 258.361, 'P282TE', 1, 0, 1, 17.0869, 1614307836, 1000, 0, 0, 0, 0),
(4982, 2260, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 2.31944, 1614260501, 1000, 0, 0, 0, 0),
(5377, 2756, 404, 0, 1, 597.295, 1686.87, 11.3988, 0.524697, '------', 0, 0, 0, 3.8075, 1614318907, 1000, 0, 0, 0, 0),
(4968, 1729, 404, 1, 1, 1821.83, 2495.11, 14.9063, 305.878, '------', 0, 0, 0, 2.07444, 1614258991, 1000, 0, 0, 0, 0),
(5294, 2007, 401, 125, 1, 614.142, 1693.57, 11.3116, 1.40576, '------', 0, 0, 0, 2.03306, 1614286000, 1000, 0, 0, 0, 0),
(5478, 2792, 401, 1, 1, -2225.36, 187.821, 23.7736, 234.704, '------', 1, 0, 1, 12.8444, 1614332332, 1000, 0, 0, 0, 0),
(5573, 2581, 404, 1, 1, 1829.04, 2076.3, 15.1958, 180.485, 'C801HO', 1, 0, 1, 52.8057, 1614343111, 1000, 0, 0, 0, 0),
(6966, 1031, 502, 13, 3, -2342.16, 99.8792, 20.2354, 256.978, 'O887AK', 0, 0, 1, 12.615, 1614473430, 1000, 0, 0, 0, 0),
(6438, 2323, 541, 124, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 0.869166, 1614441884, 1000, 0, 0, 0, 0),
(5542, 1031, 411, 6, 0, -2343.64, 87.9271, 20.1752, 256.369, 'M064CB', 0, 0, 1, 35.9274, 1614339784, 1000, 0, 0, 0, 0),
(5006, 2512, 429, 10, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.31306, 1614262650, 1000, 0, 0, 0, 0),
(5426, 2356, 451, 122, 1, -2156.66, 131.931, 25.0373, 205.34, 'X505PE', 0, 0, 1, 15.4111, 1614326357, 1000, 0, 0, 0, 0),
(5008, 1835, 404, 3, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0.000833, 1614262685, 1000, 0, 0, 0, 0),
(5369, 1694, 502, 1, 1, -294.99, 1011.97, 11.3631, 38.7087, 'M835HA', 0, 0, 0, 25.7595, 1614317581, 300, 0, 0, 0, 0),
(4998, 548, 421, 122, 1, -431.235, 1510.38, 20.6383, 267.926, 'A428OC', 0, 0, 1, 10.9333, 1614261892, 1000, 0, 0, 0, 0),
(5704, 2789, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 1.81305, 1614353480, 1000, 0, 0, 0, 0),
(5050, 749, 490, 85, 0, 995.431, 179.267, 12.861, 246.138, '------', 0, 0, 0, 1.93833, 1614264834, 1000, 0, 0, 0, 0),
(5190, 548, 581, 122, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0.34111, 1614275813, 1000, 0, 0, 0, 0),
(6461, 1197, 466, 1, 1, 2477.47, -740.933, 11.795, 0, 'B474MO', 1, 0, 1, 1.41639, 1614442666, 1000, 0, 0, 0, 0),
(5039, 845, 402, 0, 1, 2617.55, -229.789, 3.81791, 0.273157, 'H544EB', 1, 0, 1, 13.3167, 1614263879, 1000, 0, 0, 0, 0),
(5054, 1386, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 1.39805, 1614265040, 1000, 0, 0, 0, 0),
(6097, 616, 579, 0, 1, -2346.19, 83.4593, 20.3946, 344.134, 'P104AM', 1, 0, 1, 28.1445, 1614404753, 1000, 0, 0, 0, 0),
(5201, 1139, 411, 7, 1, -2299.95, 311.553, 23.3363, 80.1242, '------', 0, 0, 1, 79.1754, 1614276568, 1000, 0, 0, 0, 0),
(5234, 2682, 404, 36, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614279043, 1000, 0, 0, 0, 0),
(5362, 2737, 466, 0, 1, 1888.13, -2207.75, 10.4676, 212.937, 'M036AE', 0, 0, 1, 7.48195, 1614316645, 1000, 0, 0, 0, 0),
(6189, 2949, 602, 121, 1, 2481.31, -740.893, 11.795, 0, 'C766EE', 0, 0, 1, 1.29555, 1614418020, 1000, 0, 0, 0, 0),
(6150, 2353, 521, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 1, 0, 0, 1.55417, 1614410822, 1000, 0, 0, 0, 0),
(5188, 2664, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614275544, 1000, 0, 0, 0, 0),
(5089, 2594, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614267396, 1000, 0, 0, 0, 0),
(5090, 2547, 463, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 1.75472, 1614267488, 1000, 0, 0, 0, 0),
(5909, 2988, 404, 1, 1, 1887.99, 2164.29, 15.1168, 178.977, '------', 1, 0, 1, 0.193888, 1614369436, 1000, 0, 0, 0, 0),
(6738, 3266, 404, 124, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 2.38694, 1614453932, 1000, 0, 0, 0, 0),
(5108, 959, 541, 119, 1, 2477.47, -740.933, 11.795, 0, 'O627BH', 0, 0, 0, 12.1697, 1614269064, 1000, 0, 0, 0, 0),
(5096, 2600, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614268152, 1000, 0, 0, 0, 0),
(5117, 845, 603, 119, 1, 2613.81, -229.539, 3.21775, 2.97653, 'X417BX', 1, 0, 1, 9.10917, 1614269731, 1000, 0, 0, 0, 0),
(5351, 2448, 502, 0, 1, 99.1093, 915.321, 11.2394, 251.881, 'P857MC', 0, 0, 0, 7.51306, 1614315126, 300, 0, 0, 0, 0),
(6522, 1154, 579, 3, 1, -208.106, 1105.38, 11.3841, 94.4638, 'E661ME', 0, 0, 1, 6.24444, 1614444295, 1000, 0, 0, 0, 0),
(5152, 2282, 541, 119, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.10361, 1614273057, 1000, 0, 0, 0, 0),
(5501, 426, 579, 1, 111, 2481.31, -740.893, 11.795, 0, 'T586OO', 0, 0, 0, 5.05944, 1614335705, 1000, 0, 0, 0, 0),
(5157, 962, 445, 0, 1, -183.236, 1027.02, 11.2758, 353.441, '------', 1, 0, 1, 2.40417, 1614273770, 1000, 0, 0, 0, 0),
(5359, 670, 402, 0, 0, 470.597, 755.252, 11.7997, 157.602, 'P547TP', 0, 0, 1, 15.0169, 1614316357, 1000, 0, 0, 0, 0),
(5160, 1283, 415, 6, 1, -335.413, 841.593, 12.2637, 178.058, 'P772PH', 1, 0, 1, 6.10083, 1614273949, 1000, 0, 0, 0, 0),
(6014, 1577, 579, 0, 0, 2477.47, -740.933, 11.795, 0, 'X835PK', 1, 0, 1, 1.11611, 1614379804, 1000, 0, 0, 0, 0),
(7122, 3249, 502, 125, 1, 2221.69, 1918.72, 1.92307, 188.991, 'O426EB', 1, 0, 1, 8.35806, 1614498102, 300, 0, 0, 0, 0),
(5222, 1046, 533, 1, 1, 694.923, -1301.07, 39.9198, 338.756, '------', 1, 0, 1, 8.37111, 1614278048, 1000, 0, 0, 0, 0),
(5533, 2603, 401, 1, 1, 1784.95, 2415.46, 14.5965, 303.347, '------', 0, 0, 1, 0.443054, 1614339192, 1000, 0, 0, 0, 0),
(6261, 743, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 3.855, 1614424104, 1000, 0, 0, 0, 0),
(5231, 2127, 429, 6, 1, 218.869, 1559.21, 11.1921, 170.95, '------', 0, 0, 1, 38.5714, 1614278608, 1000, 0, 0, 0, 0),
(5700, 1048, 541, 74, 0, -2359.25, 95.6033, 20.632, 174.338, '------', 1, 0, 1, 37.7073, 1614353263, 1000, 0, 0, 0, 0),
(5269, 211, 402, 75, 1, 478.231, 764.51, 11.845, 225.788, 'K208BT', 0, 0, 1, 34.1001, 1614280986, 1000, 0, 0, 0, 0),
(5270, 2696, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.009722, 1614281019, 1000, 0, 0, 0, 0),
(5282, 1299, 429, 3, 1, -166.446, 956.184, 11.3456, 71.1737, '------', 1, 0, 1, 21.4217, 1614281728, 1000, 0, 3, 3, 3),
(5278, 2742, 562, 120, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 8.1725, 1614281591, 300, 0, 0, 0, 0),
(7036, 2773, 402, 3, 1, -182.007, 1033.44, 11.8407, 83.0067, 'B682ET', 0, 0, 1, 6.34527, 1614490301, 1000, 0, 0, 0, 0),
(5305, 2516, 581, 1, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0.49, 1614288978, 1000, 0, 0, 0, 0),
(5645, 2777, 451, 1, 1, 1796.37, 2519.28, 14.851, 126.641, '------', 0, 0, 1, 12.6275, 1614349999, 300, 0, 0, 0, 0),
(5314, 2735, 603, 0, 1, -236.133, 1061.19, 11.2346, 88.4126, 'H221PE', 0, 0, 1, 24.7316, 1614305083, 300, 0, 0, 0, 0),
(5315, 340, 505, 0, 1, -40.1318, 591.191, 12.5068, 133.975, 'K584TM', 0, 0, 1, 10.4589, 1614305565, 1000, 0, 0, 0, 0),
(5316, 1867, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614305912, 1000, 0, 0, 0, 0),
(5331, 2540, 404, 122, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 2.37278, 1614312242, 1000, 0, 0, 0, 0),
(5332, 2740, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 2.76083, 1614312320, 1000, 0, 0, 0, 0),
(5361, 2744, 541, 85, 1, 2481.31, -740.893, 11.795, 0, 'E421PO', 0, 0, 1, 6.4025, 1614316639, 300, 0, 0, 0, 0),
(7114, 3336, 579, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 0.168333, 1614497192, 1000, 0, 0, 0, 0),
(5595, 1127, 541, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614345774, 1000, 0, 0, 0, 0),
(5565, 2741, 466, 1, 1, -2302.88, 310.367, 23.3816, 82.2582, 'K883BP', 1, 0, 1, 63.0504, 1614342377, 1000, 0, 0, 0, 0),
(5555, 2815, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 1, 0, 1, 0.253888, 1614341340, 1000, 0, 0, 0, 0),
(5345, 2706, 475, 0, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 0, 3.93417, 1614314622, 1000, 0, 0, 0, 0),
(5408, 2768, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614323839, 1000, 0, 0, 0, 0),
(6163, 3118, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0.675277, 1614415358, 1000, 0, 0, 0, 0),
(6440, 2115, 579, 1, 1, -50.1054, 593.366, 11.782, 172.837, 'O036EA', 0, 0, 1, 7.55723, 1614442016, 1000, 0, 0, 0, 0),
(7068, 3337, 603, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 0.735, 1614494148, 1000, 0, 0, 0, 0),
(5386, 1680, 502, 125, 1, 2556.64, -2446.15, 21.2365, 359.335, 'C346CC', 0, 0, 1, 135.098, 1614319677, 1000, 0, 0, 0, 0),
(5516, 2004, 505, 0, 1, -2175.58, -209.468, 24.6684, 32.5097, '------', 0, 0, 0, 40.0246, 1614337016, 1000, 0, 0, 0, 0),
(5389, 1672, 415, 3, 0, 227.175, 1533.27, 10.9499, 264.98, '------', 0, 0, 1, 11.9478, 1614320414, 300, 0, 0, 0, 0),
(5407, 2381, 466, 0, 1, -239.678, 1094.03, 11.2154, 170.904, 'K132AK', 0, 0, 1, 3.79528, 1614323630, 1000, 0, 0, 0, 0),
(5401, 1647, 579, 6, 1, -2161.61, 123.04, 25.5753, 291.788, 'E032MM', 0, 0, 1, 108.588, 1614322593, 1000, 0, 0, 0, 0),
(5402, 833, 451, 18, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 0, 3.13194, 1614322764, 1000, 0, 0, 0, 0),
(5627, 2817, 603, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 3.76417, 1614348852, 1000, 0, 0, 0, 0),
(6221, 3169, 541, 3, 1, -136.773, 921.169, 11.3642, 339.799, 'T066BT', 1, 0, 1, 30.0972, 1614420814, 300, 0, 0, 0, 0),
(5804, 531, 579, 0, 0, -261.504, 1503.63, 20.1483, 356.858, 'T626BK', 0, 0, 1, 16.1681, 1614360237, 1000, 0, 0, 0, 0),
(6075, 2199, 402, 0, 1, -262.789, 1035.42, 11.9682, 88.9348, '------', 1, 0, 1, 3.70139, 1614397839, 1000, 0, 0, 0, 0),
(5414, 2560, 579, 0, 1, 487.53, 740.658, 11.3975, 68.2485, 'E284XM', 0, 0, 1, 27.4893, 1614324056, 1000, 0, 0, 0, 0),
(5416, 2762, 502, 124, 1, -2150.52, 118.336, 25.4005, 17.0009, '------', 1, 0, 1, 7.87361, 1614324580, 1000, 0, 0, 0, 0),
(6262, 2952, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 1, 7.815, 1614424117, 1000, 0, 0, 0, 0),
(5540, 2739, 541, 3, 1, 2477.47, -740.933, 11.795, 0, 'T106AT', 0, 0, 1, 7.10888, 1614339706, 300, 0, 0, 0, 0),
(5523, 2720, 541, 17, 1, 2595.64, -233.527, 3.18619, 343.904, 'X712XA', 0, 0, 1, 11.1622, 1614338288, 1000, 0, 0, 0, 0),
(6985, 1746, 541, 0, 1, 2481.31, -740.893, 11.795, 0, 'A648AA', 1, 0, 1, 5.79528, 1614477629, 1000, 0, 0, 0, 0),
(6268, 3139, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 0.689722, 1614424499, 1000, 0, 0, 0, 0),
(6251, 1394, 404, 3, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 0.784444, 1614423453, 1000, 0, 0, 0, 0),
(5479, 2461, 451, 6, 1, 1829.39, 2097.9, 15.1433, 180.171, 'M840PP', 1, 0, 1, 16.299, 1614332355, 1000, 0, 0, 0, 0),
(6107, 2947, 541, 1, 1, 1892.42, -2232.15, 10.4573, 179.512, 'P144AA', 0, 0, 1, 31.3237, 1614406030, 1000, 0, 0, 0, 0),
(5529, 2786, 415, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614338736, 1000, 0, 0, 0, 0),
(5489, 1008, 541, 3, 0, 454.252, -1245.24, 39.9321, 163.055, 'X715HH', 0, 0, 0, 13.2503, 1614334486, 1000, 0, 0, 0, 0),
(7166, 3372, 559, 120, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 1.79, 1614501561, 1000, 0, 0, 0, 0),
(5591, 2828, 451, 1, 1, 1895.77, -2232.89, 10.4367, 179.262, 'A840BK', 1, 0, 1, 21.627, 1614344859, 1000, 0, 0, 0, 0),
(5515, 1292, 541, 3, 1, -2234.89, -194.55, 23.6135, 345.402, '------', 0, 0, 1, 12.2664, 1614336944, 1000, 0, 0, 0, 0),
(5953, 2935, 404, 125, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.239722, 1614373659, 1000, 0, 0, 0, 0),
(5558, 1730, 490, 16, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.483333, 1614341621, 1000, 0, 0, 0, 0),
(5567, 2796, 415, 126, 0, -787.295, 793.785, 11.709, 359.002, 'O382BB', 0, 0, 1, 7.87167, 1614342505, 300, 0, 0, 0, 0),
(5711, 2315, 579, 6, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.920277, 1614354303, 1000, 0, 0, 0, 0),
(5584, 1383, 451, 6, 1, 1843.33, 2184.96, 14.8516, 86.8138, 'T607BO', 1, 0, 1, 14.2333, 1614344228, 1000, 0, 0, 0, 0),
(5598, 2879, 541, 1, 1, 2608.89, -194.822, 5.84102, 207.922, 'X808AB', 0, 0, 1, 13.8503, 1614346012, 1000, 0, 0, 0, 0),
(5599, 2829, 401, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614346152, 1000, 0, 0, 0, 0),
(6471, 2450, 490, 0, 1, 1911.01, 1062.61, 28.1191, 0.379254, '------', 1, 0, 1, 3.575, 1614443088, 1000, 0, 0, 0, 0),
(5622, 2173, 506, 86, 0, -402.421, 1431.72, 19.9173, 0.341508, 'A333XM', 0, 0, 1, 20.6528, 1614348321, 1000, 0, 0, 0, 0),
(5814, 2765, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614360901, 1000, 0, 0, 0, 0),
(5616, 2699, 468, 1, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 0, 3.06139, 1614347754, 1000, 0, 0, 0, 0),
(5799, 2916, 521, 0, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 1, 0, 0, 6.93806, 1614359987, 1000, 0, 0, 0, 0),
(5639, 2794, 404, 6, 1, -158.547, 956.597, 11.3881, 65.388, 'A814XH', 0, 0, 1, 12.6364, 1614349388, 1000, 0, 0, 0, 0),
(5647, 2862, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614350015, 1000, 0, 0, 0, 0),
(5696, 2521, 404, 4, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 5.00777, 1614352941, 1000, 0, 0, 0, 0),
(5707, 2372, 409, 0, 1, -2178.45, -213.781, 24.371, 257.975, '------', 0, 0, 1, 19.5968, 1614353826, 1000, 0, 0, 0, 0),
(6426, 2761, 402, 119, 1, 2477.47, -740.933, 11.795, 0, 'H041KB', 1, 0, 1, 1.41, 1614440476, 1000, 0, 0, 0, 0),
(5759, 2861, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 1.05389, 1614357362, 300, 0, 0, 0, 0),
(5730, 151, 505, 0, 1, 459.281, -1244.9, 40.882, 340.921, '------', 0, 0, 0, 3.67139, 1614355486, 1000, 0, 0, 0, 0),
(6680, 3245, 579, 13, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.110833, 1614451149, 1000, 0, 0, 0, 0),
(6281, 1601, 401, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614425170, 1000, 0, 0, 0, 0),
(5720, 623, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 0, 2.08667, 1614355036, 1000, 0, 0, 0, 0),
(5728, 32, 505, 0, 1, -716.652, 907.315, 12.6859, 179.397, '------', 0, 0, 0, 5.24556, 1614355352, 1000, 0, 0, 0, 0);
INSERT INTO `ownable_cars` (`id`, `owner_id`, `model_id`, `color_1`, `color_2`, `pos_x`, `pos_y`, `pos_z`, `angle`, `number`, `status`, `alarm`, `key_in`, `mileage`, `create_time`, `health`, `vinilcar`, `pt_engine`, `pt_brake`, `pt_stability`) VALUES
(5725, 2887, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 3.59083, 1614355277, 1000, 0, 0, 0, 0),
(5729, 2867, 415, 119, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 0.686944, 1614355434, 1000, 0, 0, 0, 0),
(5949, 2713, 521, 3, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 0, 0, 0, 8.93611, 1614373050, 1000, 0, 3, 3, 3),
(5746, 1135, 602, 1, 1, 2481.31, -740.893, 11.795, 0, 'A168EA', 1, 0, 1, 4.50333, 1614356337, 1000, 0, 0, 0, 0),
(5806, 531, 402, 0, 0, -261.504, 1503.63, 20.5649, 356.858, 'X178AE', 0, 0, 1, 2.63249, 1614360336, 1000, 0, 0, 0, 0),
(5741, 702, 505, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0.019999, 1614355870, 1000, 0, 0, 0, 0),
(5743, 2900, 404, 122, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 1.64, 1614356057, 1000, 0, 0, 0, 0),
(6003, 2336, 579, 7, 1, 2570.92, -2446.49, 21.397, 357.786, 'X570PM', 0, 0, 1, 4.34278, 1614378263, 1000, 0, 0, 0, 0),
(6086, 2892, 559, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 1.64361, 1614400933, 1000, 0, 0, 0, 0),
(5777, 2893, 404, 118, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 6.99527, 1614358705, 1000, 0, 0, 0, 0),
(6173, 1070, 402, 117, 1, -2315.65, -140.784, 21.868, 229.022, 'C170AE', 0, 0, 1, 6.7725, 1614415926, 1000, 0, 0, 0, 0),
(6106, 3074, 404, 92, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614405973, 1000, 0, 0, 0, 0),
(5765, 2919, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0.001666, 1614357884, 1000, 0, 0, 0, 0),
(5767, 2918, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614358107, 1000, 0, 0, 0, 0),
(5773, 2908, 401, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0.612777, 1614358487, 1000, 0, 0, 0, 0),
(6215, 3077, 401, 3, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614420329, 1000, 0, 0, 0, 0),
(7389, 2906, 579, 0, 0, 2481.31, -740.893, 11.795, 0, 'K465TA', 0, 0, 1, 2.71611, 1614513240, 1000, 0, 0, 0, 0),
(7405, 1043, 421, 0, 1, 2481.31, -740.893, 11.795, 0, 'P376BO', 1, 0, 1, 6.88472, 1614513938, 1000, 0, 0, 0, 0),
(5807, 2907, 466, 126, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 5.25722, 1614360348, 1000, 0, 0, 0, 0),
(5810, 2938, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 0, 1614360398, 1000, 0, 0, 0, 0),
(5818, 2210, 471, 125, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 0, 0.108888, 1614361121, 1000, 0, 0, 0, 0),
(6715, 924, 436, 4, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.9275, 1614452950, 1000, 0, 0, 0, 0),
(5825, 2944, 415, 124, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 2.46972, 1614362169, 1000, 0, 0, 0, 0),
(6460, 3173, 489, 124, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614442653, 1000, 0, 0, 0, 0),
(6387, 2059, 579, 0, 1, -2311.18, 299.282, 23.5428, 347.784, '------', 0, 0, 1, 13.242, 1614436569, 1000, 0, 0, 0, 0),
(5829, 2769, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, 'P713EP', 0, 0, 0, 3.38583, 1614362403, 1000, 0, 0, 0, 0),
(5832, 2934, 505, 0, 1, 273.069, 1568.54, 12.4535, 353.632, 'E322CB', 0, 0, 0, 9.45251, 1614362522, 300, 0, 0, 0, 0),
(5833, 199, 579, 122, 1, -319.22, 1307.84, 20.1393, 91.511, 'K713XB', 0, 0, 1, 1.17139, 1614362533, 1000, 0, 0, 0, 0),
(5834, 2345, 505, 0, 1, 276.189, 1568.67, 12.4548, 267.079, 'H251CB', 0, 0, 0, 18.4166, 1614362533, 1000, 0, 0, 0, 0),
(5835, 2956, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614363007, 1000, 0, 0, 0, 0),
(5891, 2957, 415, 3, 1, 1642.31, -519.798, 38.7702, 352.865, '------', 0, 0, 0, 6.73472, 1614367604, 1000, 0, 0, 0, 0),
(6492, 247, 402, 105, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 5.83972, 1614443503, 1000, 0, 0, 0, 0),
(5845, 2943, 415, 3, 1, 1894.26, 1192.94, 29.1684, 276.321, 'O762KA', 0, 0, 0, 36.576, 1614363989, 300, 0, 0, 0, 0),
(7191, 731, 411, 4, 6, 2218.08, -206.639, 1.26132, 181.156, '------', 1, 0, 1, 7.48972, 1614504102, 1000, 0, 0, 0, 0),
(7130, 2319, 506, 111, 1, -337.95, 1014.19, 11.3011, 181.933, '------', 0, 0, 1, 10.7222, 1614498989, 1000, 0, 3, 3, 3),
(6263, 2554, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 1.22417, 1614424145, 1000, 0, 0, 0, 0),
(5857, 2966, 471, 0, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0.136388, 1614364590, 1000, 0, 0, 0, 0),
(6193, 3128, 429, 17, 1, 119.087, 838.095, 11.2007, 62.253, 'B542MC', 1, 0, 1, 13.3197, 1614418883, 1000, 0, 0, 0, 0),
(7065, 3243, 502, 85, 1, 2481.31, -740.893, 11.795, 0, 'X225KK', 1, 0, 1, 3.11611, 1614493336, 1000, 0, 0, 0, 0),
(6537, 405, 436, 7, 1, -217.923, 1064.58, 11.2206, 356.145, '------', 0, 0, 1, 6.91583, 1614444674, 1000, 0, 0, 0, 0),
(7434, 2593, 411, 1, 1, 1375.51, 451.079, 12.6476, 146.918, 'B721CP', 0, 0, 1, 10.4511, 1614514786, 1000, 0, 0, 0, 0),
(5888, 670, 579, 1, 0, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 1.21944, 1614367153, 1000, 0, 0, 0, 0),
(6558, 3211, 400, 118, 1, -2311.82, 300.186, 23.4264, 349.146, 'O327TH', 1, 0, 1, 22.065, 1614445240, 1000, 0, 0, 0, 0),
(5887, 2173, 579, 1, 0, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614367104, 1000, 0, 0, 0, 0),
(5889, 924, 521, 3, 1, -2237.48, 286.746, 24.0122, 207.104, '------', 0, 0, 1, 2.60917, 1614367470, 1000, 0, 0, 0, 0),
(5926, 1055, 411, 0, 1, -308.931, 1246.27, 19.9143, 181.381, 'C770XC', 0, 0, 1, 9.60361, 1614370769, 300, 0, 3, 3, 3),
(6478, 1975, 429, 123, 1, 120.507, 926.294, 11.1911, 339.582, '------', 0, 0, 1, 7.14278, 1614443209, 1000, 0, 0, 0, 0),
(6239, 2705, 451, 1, 1, -128.487, 920.143, 11.259, 248.279, 'B383KC', 1, 0, 1, 4.13443, 1614422369, 1000, 0, 0, 0, 0),
(6082, 2477, 461, 1, 1, -2313, -144.578, 21.8047, 88.4348, '------', 1, 0, 0, 1.48028, 1614400089, 1000, 0, 0, 0, 0),
(5968, 3019, 415, 126, 1, -211.262, 1083.94, 11.1531, 184.388, '------', 0, 0, 1, 23.3995, 1614375435, 1000, 0, 0, 0, 0),
(5934, 3008, 404, 2, 126, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614371405, 1000, 0, 0, 0, 0),
(7090, 508, 429, 3, 1, 277.925, 1596.15, 11.5124, 265.13, 'B153EB', 1, 0, 1, 8.78334, 1614495852, 300, 0, 0, 0, 0),
(6556, 2723, 463, 0, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 1, 8.21972, 1614445219, 1000, 0, 0, 0, 0),
(7243, 3301, 502, 0, 1, 538.273, -1269.49, 39.9676, 325.67, '------', 0, 0, 1, 32.7605, 1614506893, 1000, 0, 0, 0, 0),
(6517, 1282, 490, 6, 2, 2487.41, -740.893, 11.795, 0, 'T841MO', 1, 0, 1, 2.73083, 1614444185, 1000, 0, 0, 0, 0),
(5960, 3012, 401, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 0.603889, 1614374142, 1000, 0, 0, 0, 0),
(6081, 2976, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 1.17139, 1614399538, 1000, 0, 0, 0, 0),
(5962, 3028, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 0, 2.19833, 1614374472, 1000, 0, 0, 0, 0),
(5967, 2287, 541, 121, 1, -2162.66, -214.57, 23.6907, 260.057, '------', 0, 0, 1, 5.52556, 1614375415, 1000, 0, 0, 0, 0),
(5981, 3002, 541, 1, 1, 2477.47, -740.933, 11.795, 0, 'K485XK', 0, 0, 0, 1.56944, 1614376367, 1000, 0, 0, 0, 0),
(6346, 2977, 521, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 0, 0, 1614432319, 1000, 0, 0, 0, 0),
(6029, 3048, 451, 114, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 15.742, 1614384416, 1000, 0, 0, 0, 0),
(5998, 32, 579, 0, 1, -726.659, 904.417, 11.9542, 233.226, '------', 0, 0, 0, 9.43723, 1614377598, 1000, 0, 0, 0, 0),
(6023, 3022, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614381266, 1000, 0, 0, 0, 0),
(7104, 2557, 579, 14, 1, 1817.26, 2511.39, 15.0617, 52.3472, 'E784PO', 0, 0, 1, 9.84223, 1614496531, 1000, 0, 1, 1, 1),
(6055, 1813, 415, 6, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 2.44722, 1614389688, 300, 0, 0, 0, 0),
(6057, 2924, 415, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.53083, 1614390090, 1000, 0, 0, 0, 0),
(6875, 2407, 505, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614463860, 1000, 0, 0, 0, 0),
(6070, 874, 579, 1, 0, -789.973, 802.955, 12.2803, 291.188, 'X554KC', 1, 0, 1, 3.7036, 1614392820, 1000, 0, 0, 0, 0),
(6071, 3052, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614393237, 1000, 0, 0, 0, 0),
(6084, 3046, 404, 1, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 1.46944, 1614400851, 1000, 0, 0, 0, 0),
(6184, 2707, 404, 36, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 1.83055, 1614417535, 300, 0, 0, 0, 0),
(6154, 3078, 466, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.634166, 1614411121, 1000, 0, 0, 0, 0),
(6679, 2614, 541, 121, 1, 2481.31, -740.893, 11.795, 0, 'A832HA', 0, 0, 1, 6.41917, 1614451142, 1000, 0, 0, 0, 0),
(6092, 3068, 510, 1, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0, 1614403190, 1000, 0, 0, 0, 0),
(6158, 1156, 505, 1, 1, -2306.06, -139.733, 22.3638, 229.566, 'T367XA', 0, 0, 1, 5.1425, 1614414278, 1000, 0, 0, 0, 0),
(6191, 2424, 436, 119, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614418863, 1000, 0, 0, 0, 0),
(6143, 3076, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 1, 0, 1, 2.64944, 1614409524, 1000, 0, 0, 0, 0),
(6159, 1156, 409, 1, 1, -2303.27, -150.899, 22.3339, 48.2302, 'X031AX', 0, 0, 1, 2.62889, 1614414296, 1000, 0, 0, 0, 0),
(6149, 3054, 404, 1, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614410362, 1000, 0, 0, 0, 0),
(6148, 2155, 451, 126, 1, -2324, -120.934, 21.0761, 51.1765, '------', 1, 0, 1, 7.87611, 1614410261, 1000, 0, 0, 0, 0),
(6981, 3309, 579, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 11.3928, 1614476281, 1000, 0, 0, 0, 0),
(7126, 3326, 602, 2, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 0.896944, 1614498637, 1000, 0, 0, 0, 0),
(6153, 2172, 480, 1, 1, -430.271, 1536.08, 19.9409, 179.821, 'T611KT', 0, 0, 1, 19.2579, 1614411034, 1000, 0, 0, 0, 0),
(6186, 166, 400, 0, 1, -2345.33, 83.9685, 20.2818, 257.389, 'X876HK', 0, 0, 1, 29.9672, 1614417647, 1000, 0, 0, 0, 0),
(6185, 3042, 451, 1, 1, 2481.31, -740.893, 11.795, 0, 'X475MK', 0, 0, 0, 10.5661, 1614417542, 1000, 0, 0, 0, 0),
(6319, 1709, 429, 0, 1, 1806.88, 2133.69, 15.05, 268.305, 'O131HM', 0, 0, 0, 4.90472, 1614428510, 1000, 0, 0, 0, 0),
(6195, 3072, 507, 0, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 2.23222, 1614418912, 1000, 0, 0, 0, 0),
(6248, 1952, 402, 0, 1, 2601.42, -195.142, 6.21089, 270.018, 'K815EE', 0, 0, 1, 23.5725, 1614423144, 300, 0, 0, 0, 0),
(6264, 3127, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 0, 0, 1614424164, 1000, 0, 0, 0, 0),
(6559, 3188, 451, 125, 1, -2159.26, 135.429, 25.0478, 18.1704, '------', 1, 0, 1, 11.3731, 1614445248, 300, 0, 0, 0, 0),
(6375, 773, 466, 114, 1, -63.3499, 915.213, 11.2919, 74.593, '------', 0, 0, 1, 4.96056, 1614435929, 1000, 0, 0, 0, 0),
(6314, 437, 411, 85, 119, -449.127, 998.262, 11.3207, 180.915, 'M806MP', 0, 0, 1, 23.7172, 1614428256, 300, 0, 3, 3, 3),
(6302, 2412, 541, 124, 1, -441.08, 1013.86, 11.2933, 5.92957, 'B472MT', 1, 0, 1, 41.1861, 1614427569, 1000, 0, 0, 0, 0),
(6325, 2597, 541, 124, 1, -437.029, 1014.14, 11.3121, 2.99991, 'K558CH', 1, 0, 1, 19.4264, 1614429228, 1000, 0, 0, 0, 0),
(6293, 3154, 579, 2, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 5.55472, 1614426445, 1000, 0, 0, 0, 0),
(6315, 3263, 533, 0, 1, 2477.47, -740.933, 11.795, 0, 'O455KA', 0, 0, 1, 7.91999, 1614428256, 1000, 0, 0, 0, 0),
(6333, 1971, 404, 1, 1, 2590.11, -241.458, 3.28821, 3.04607, '------', 0, 0, 1, 3.68083, 1614431094, 1000, 0, 0, 0, 0),
(6330, 3147, 404, 121, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 10.0469, 1614430912, 300, 0, 0, 0, 0),
(6338, 1436, 579, 85, 0, -676.441, 735.034, 11.9622, 270.656, 'T444XX', 0, 0, 1, 78.9963, 1614431664, 1000, 0, 0, 0, 0),
(6383, 356, 507, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 1, 1.23139, 1614436358, 1000, 0, 0, 0, 0),
(6340, 2232, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0.700833, 1614431927, 1000, 0, 0, 0, 0),
(6342, 3145, 461, 2, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 0, 0, 1614432160, 1000, 0, 0, 0, 0),
(6361, 122, 502, 3, 1, 1945.45, -2232, 10.4891, 288.644, '------', 0, 0, 1, 1.60889, 1614434277, 1000, 0, 0, 0, 0),
(6362, 3057, 402, 4, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 0.608055, 1614434930, 1000, 0, 0, 0, 0),
(6363, 1647, 505, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 4.495, 1614434978, 1000, 0, 0, 0, 0),
(6396, 3185, 426, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0.210277, 1614438195, 1000, 0, 0, 0, 0),
(6369, 3044, 404, 125, 1, 1726.08, 2268.93, 15.8773, 269.646, 'T562KO', 0, 0, 0, 11.4275, 1614435608, 1000, 0, 0, 0, 0),
(6415, 2860, 404, 121, 1, 2608.86, -190.315, 6.2983, 91.4392, '------', 0, 0, 0, 1.57333, 1614439188, 300, 0, 0, 0, 0),
(6737, 1492, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'O011OC', 0, 0, 0, 0, 1614453913, 1000, 0, 0, 0, 0),
(6491, 2791, 505, 0, 1, 1907.49, 1079.63, 28.8967, 273.394, 'M163XC', 1, 0, 1, 8.44168, 1614443489, 1000, 0, 0, 0, 0),
(6463, 192, 502, 3, 1, 2481.31, -740.893, 11.795, 0, 'H445EH', 0, 0, 1, 4.13722, 1614442698, 1000, 0, 0, 0, 0),
(6457, 492, 533, 6, 1, 2504.64, -195.475, 2.04884, 178.116, '------', 0, 0, 1, 4.80778, 1614442566, 1000, 0, 0, 0, 0),
(6546, 2481, 404, 0, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 0.7475, 1614444919, 1000, 0, 0, 0, 0),
(6465, 3219, 411, 6, 1, 1378.71, 448.596, 12.6462, 149.598, 'M170TH', 0, 0, 1, 10.2984, 1614442744, 1000, 0, 0, 0, 0),
(7133, 572, 603, 6, 0, -227.378, 1002.44, 11.2426, 87.6323, '------', 0, 0, 1, 4.57861, 1614499276, 1000, 0, 0, 0, 0),
(6468, 3220, 402, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 4.47333, 1614443001, 1000, 0, 0, 0, 0),
(6472, 871, 481, 1, 1, -2350.63, 69.8163, 24.3072, 234.883, '------', 0, 0, 0, 0, 1614443094, 1000, 0, 0, 0, 0),
(6474, 3133, 429, 7, 1, 2481.31, -740.893, 11.795, 0, 'A514CH', 1, 0, 1, 12.4783, 1614443124, 1000, 0, 0, 0, 0),
(7004, 3214, 480, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 1, 0, 1, 17.853, 1614482532, 1000, 0, 0, 0, 0),
(6518, 3223, 506, 111, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 1, 2.6825, 1614444201, 1000, 0, 0, 0, 0),
(6542, 3231, 410, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 0, 1614444794, 1000, 0, 0, 0, 0),
(7021, 3101, 404, 116, 1, 1816.08, 2133.79, 15.0925, 178.698, '------', 1, 0, 1, 5.39221, 1614487445, 1000, 0, 0, 0, 0),
(6501, 3212, 579, 118, 1, 1867.15, -124.723, 15.093, 292.567, '------', 1, 0, 1, 11.0867, 1614443768, 1000, 0, 0, 0, 0),
(6523, 3227, 415, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 2.24472, 1614444297, 1000, 0, 0, 0, 0),
(7006, 58, 558, 6, 1, -963.647, 902.053, 11.7946, 179.807, 'A214OO', 0, 0, 1, 1.70722, 1614483025, 1000, 0, 0, 0, 0),
(6527, 1387, 551, 1, 1, 1211.92, 76.151, 17.8545, 55.1039, '------', 0, 0, 1, 0.347777, 1614444343, 1000, 0, 0, 0, 0),
(7270, 3182, 402, 1, 1, 2477.47, -740.933, 11.795, 0, 'H240XX', 0, 0, 1, 21.3484, 1614507588, 1000, 0, 0, 0, 0),
(6674, 2830, 402, 122, 1, -236.275, 1072.66, 11.8398, 56.6807, 'P716HT', 0, 0, 1, 8.16611, 1614450950, 1000, 0, 0, 0, 0),
(6530, 3226, 502, 3, 1, 1834.48, 2522.75, 14.897, 110.195, 'A761XE', 1, 0, 1, 10.243, 1614444449, 1000, 0, 0, 0, 0),
(6581, 2705, 521, 0, 1, -2240.26, 292.26, 24.0131, 205.065, '------', 1, 0, 1, 9.74361, 1614446713, 1000, 0, 0, 0, 0),
(6539, 3224, 461, 3, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 1, 3.18722, 1614444686, 1000, 0, 0, 0, 0),
(7023, 1001, 480, 122, 1, 1895.33, -2234.56, 10.4493, 2.9567, '------', 0, 0, 1, 2.81861, 1614488736, 1000, 0, 0, 0, 0),
(6999, 3320, 602, 121, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 2.81194, 1614480795, 1000, 0, 0, 0, 0),
(7379, 3142, 409, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 5.33556, 1614512744, 1000, 0, 0, 0, 0),
(7226, 3138, 415, 6, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.44944, 1614506054, 1000, 0, 0, 0, 0),
(6569, 2115, 402, 11, 0, -49.7792, 592.946, 12.2295, 173.627, '------', 0, 0, 1, 9.36223, 1614446031, 1000, 0, 0, 0, 0),
(6568, 3213, 415, 6, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.34389, 1614445872, 1000, 0, 0, 0, 0),
(6576, 2054, 402, 0, 1, 1787.91, 1336.5, 9.6002, 355.526, 'X855XX', 0, 0, 1, 15.3385, 1614446336, 1000, 0, 0, 0, 0),
(6580, 3233, 410, 0, 1, 1389.32, 441.975, 12.646, 148.185, '------', 1, 0, 1, 2.17445, 1614446535, 1000, 0, 0, 0, 0),
(6578, 3230, 451, 13, 1, 2481.31, -740.893, 11.795, 0, 'O445CO', 1, 0, 1, 3.00583, 1614446391, 1000, 0, 0, 0, 0),
(6582, 244, 579, 0, 1, -291.196, 1034.53, 11.5273, 82.9681, '------', 0, 0, 1, 9.8314, 1614446852, 1000, 0, 0, 0, 0),
(6579, 3236, 506, 124, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 2.09333, 1614446487, 1000, 0, 0, 0, 0),
(7308, 2039, 402, 86, 0, -338.035, 1012.46, 11.9694, 182.242, '------', 0, 0, 1, 6.06639, 1614509023, 1000, 0, 0, 0, 0),
(7043, 363, 415, 122, 0, -53.7844, 594.28, 11.5372, 172.86, 'B260KB', 1, 0, 1, 14.1353, 1614490866, 1000, 0, 0, 0, 0),
(6701, 3181, 404, 6, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 1, 7.42694, 1614452338, 1000, 0, 0, 0, 0),
(7079, 425, 579, 0, 0, 1821.34, 2083.29, 15.2443, 252.261, '------', 0, 0, 1, 2.87583, 1614495146, 1000, 0, 3, 3, 3),
(6596, 3229, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'C587KM', 0, 0, 1, 2.02944, 1614447523, 1000, 0, 0, 0, 0),
(6662, 3251, 466, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.816388, 1614450619, 1000, 0, 0, 0, 0),
(6683, 3241, 415, 0, 1, 2487.41, -740.893, 11.795, 0, 'P112KT', 1, 0, 1, 2.04, 1614451238, 1000, 0, 0, 0, 0),
(6731, 3260, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 0.265833, 1614453665, 1000, 0, 0, 0, 0),
(6606, 3134, 506, 17, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 1, 0.342499, 1614448197, 300, 0, 0, 0, 0),
(6808, 1923, 533, 1, 1, 2219.16, 1354.27, 10.7585, 94.429, '------', 1, 0, 1, 0.719721, 1614458310, 1000, 0, 0, 0, 0),
(6814, 1939, 402, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.145833, 1614458448, 1000, 0, 0, 0, 0),
(6632, 890, 404, 115, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 2.33666, 1614449017, 1000, 0, 0, 0, 0),
(6637, 3235, 480, 6, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 1.27778, 1614449240, 1000, 0, 0, 0, 0),
(7296, 3397, 401, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614508674, 1000, 0, 0, 0, 0),
(7480, 1436, 429, 0, 0, 2477.47, -740.933, 11.795, 0, 'H664MT', 0, 0, 1, 1.16667, 1614517155, 1000, 0, 0, 0, 0),
(6684, 3255, 421, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 1.53694, 1614451283, 1000, 0, 0, 0, 0),
(7136, 2384, 541, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 1.79722, 1614499733, 1000, 0, 0, 0, 0),
(6901, 2251, 541, 126, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 3.28194, 1614466078, 1000, 0, 0, 0, 0),
(6649, 275, 429, 85, 0, 2487.41, -740.893, 11.795, 0, 'K435HC', 0, 0, 1, 0.023611, 1614450151, 1000, 0, 0, 0, 0),
(7177, 3376, 502, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 5.41556, 1614502545, 1000, 0, 0, 0, 0),
(7118, 1949, 579, 2, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 3.55472, 1614497405, 1000, 0, 0, 0, 0),
(6660, 2953, 490, 114, 1, 2567.73, -2444.7, 21.3382, 182.409, 'C254OT', 0, 0, 1, 1.76333, 1614450607, 1000, 0, 0, 0, 0),
(6851, 3293, 502, 36, 1, 2487.41, -740.893, 11.795, 0, 'E184ET', 0, 0, 1, 4.26278, 1614460445, 1000, 0, 0, 0, 0),
(6668, 2224, 502, 124, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 7.53056, 1614450795, 1000, 0, 0, 0, 0),
(6689, 3238, 589, 9, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1614451667, 1000, 0, 0, 0, 0),
(6690, 53, 490, 0, 125, 479.988, 744.376, 11.3386, 73.7826, 'T102EP', 0, 0, 1, 11.8945, 1614451722, 1000, 0, 0, 0, 0),
(7352, 3406, 429, 1, 0, 2477.47, -740.933, 11.795, 0, 'K008CT', 0, 0, 1, 4.16361, 1614511938, 1000, 0, 0, 0, 0),
(6686, 2426, 400, 114, 1, 1919.42, -2233.02, 10.5123, 357.169, 'O533CO', 1, 0, 0, 1.38917, 1614451420, 1000, 0, 0, 0, 0),
(7519, 255, 415, 6, 1, 2092.69, -719.355, 11.4308, 75.9228, '------', 1, 0, 1, 0.729166, 1614518534, 1000, 0, 0, 0, 0),
(7535, 3403, 402, 0, 1, -859.884, 742.738, 12.3992, 92.8826, 'M833HM', 0, 0, 1, 1.65138, 1614518942, 1000, 0, 0, 0, 0),
(6700, 3257, 466, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.786944, 1614452323, 1000, 0, 0, 0, 0),
(6949, 2459, 429, 4, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 4.94945, 1614470486, 1000, 0, 0, 0, 0),
(6714, 2046, 415, 85, 1, 2575.35, -2444.84, 21.1542, 173.14, 'O477XP', 0, 0, 1, 1.22361, 1614452906, 1000, 0, 0, 0, 0),
(6713, 3262, 461, 1, 1, -2238.8, 289.299, 24.0133, 207.512, '------', 0, 0, 1, 0.738055, 1614452812, 1000, 0, 0, 0, 0),
(6884, 3297, 402, 24, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 7.41305, 1614464383, 1000, 0, 0, 0, 0),
(7012, 3242, 475, 122, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 1, 0, 1, 3.58278, 1614485095, 1000, 0, 0, 0, 0),
(7148, 3366, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614500690, 1000, 0, 0, 0, 0),
(6732, 3234, 451, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.54556, 1614453721, 1000, 0, 0, 0, 0),
(6774, 3194, 404, 86, 1, 1782.85, 2247.14, 15.7239, 359.396, 'B154BP', 0, 0, 1, 9.36972, 1614456679, 1000, 0, 0, 0, 0),
(6852, 2913, 466, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.46, 1614460466, 1000, 0, 0, 0, 0),
(7173, 3246, 475, 122, 1, 1832.43, 2528.29, 15.4108, 124.25, '------', 0, 0, 1, 18.3519, 1614502129, 300, 0, 0, 0, 0),
(6761, 2244, 541, 3, 1, -2169.15, 149.209, 24.7245, 20.2604, 'H104TE', 0, 0, 1, 8.21278, 1614455676, 1000, 0, 0, 0, 0),
(6753, 3247, 451, 1, 1, 2477.47, -740.933, 11.795, 0, 'T545TB', 0, 0, 1, 8.03584, 1614454758, 1000, 0, 0, 0, 0),
(7057, 3330, 466, 6, 1, 2487.41, -740.893, 11.795, 0, 'C268TK', 1, 0, 1, 6.82611, 1614492154, 1000, 0, 0, 0, 0),
(6782, 3179, 451, 15, 19, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 6.54445, 1614457291, 1000, 0, 0, 0, 0),
(6778, 2068, 415, 114, 0, -48.1528, 592.32, 11.5392, 174.289, 'C008EX', 0, 0, 1, 13.2875, 1614456935, 1000, 0, 0, 0, 0),
(6777, 3282, 426, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 0.385555, 1614456764, 1000, 0, 0, 0, 0),
(6787, 3285, 603, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 0, 1614457399, 1000, 0, 0, 0, 0),
(6850, 3261, 579, 1, 1, 1810.47, 2524.53, 15.0614, 196.393, '------', 1, 0, 1, 40.5441, 1614460445, 1000, 0, 0, 0, 0),
(6792, 647, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 0.116388, 1614457637, 1000, 0, 0, 0, 0),
(7199, 3287, 411, 18, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 1.02917, 1614504605, 1000, 0, 0, 0, 0),
(6818, 3102, 415, 114, 0, -55.2758, 654.621, 11.1763, 152.542, 'A426BK', 0, 0, 1, 4.36611, 1614458625, 1000, 0, 0, 0, 0),
(6821, 465, 415, 119, 0, -230.098, 1431.16, 19.897, 87.8335, '------', 0, 0, 1, 4.78889, 1614458679, 1000, 0, 0, 0, 0),
(7056, 2662, 477, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 0.256111, 1614491990, 1000, 0, 0, 0, 0),
(6837, 303, 560, 125, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1614459576, 1000, 0, 0, 0, 0),
(6833, 2041, 579, 0, 1, -2326.85, 279.408, 23.0991, 165.008, 'B353KK', 0, 0, 1, 15.1747, 1614459387, 1000, 0, 0, 0, 0),
(6858, 3292, 579, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 13.4889, 1614460972, 1000, 0, 0, 0, 0),
(6848, 2115, 415, 3, 0, -48.2765, 592.458, 11.5379, 31.8796, 'B244BX', 0, 0, 1, 6.63833, 1614460261, 1000, 0, 0, 0, 0),
(7032, 3321, 477, 3, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 1, 3.14444, 1614489606, 1000, 0, 0, 0, 0),
(7514, 3441, 541, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 3.46861, 1614518374, 1000, 0, 0, 0, 0),
(7134, 3124, 415, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 13.1967, 1614499556, 1000, 0, 0, 0, 0),
(7224, 3380, 541, 1, 1, -2343.84, 92.9456, 20.2403, 257.645, 'A120EH', 0, 0, 1, 9.18555, 1614506006, 1000, 0, 0, 0, 0),
(7072, 3339, 402, 8, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.23667, 1614494543, 1000, 0, 0, 0, 0),
(6872, 3295, 541, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.12139, 1614463245, 1000, 0, 0, 0, 0),
(6964, 1031, 429, 3, 6, 2487.41, -740.893, 11.795, 0, 'O214AM', 0, 0, 0, 0, 1614473018, 1000, 0, 0, 0, 0),
(7008, 3306, 602, 0, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 4.34139, 1614484181, 1000, 0, 0, 0, 0),
(6957, 2268, 402, 0, 124, -331.536, 1277.93, 20.5853, 267.595, 'A140KK', 1, 0, 1, 11.155, 1614471796, 1000, 0, 3, 3, 3),
(7110, 425, 560, 0, 0, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 0.559444, 1614496862, 1000, 0, 0, 0, 0),
(6924, 3305, 415, 2, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614467626, 1000, 0, 0, 0, 0),
(7317, 3304, 415, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614509962, 1000, 0, 3, 3, 3),
(7176, 3063, 415, 2, 1, -80.1439, 925.147, 11.2866, 117.631, 'T081TX', 1, 0, 1, 9.05583, 1614502465, 1000, 0, 0, 0, 0),
(6961, 3313, 603, 119, 1, -208.881, 602.132, 11.4196, 81.731, '------', 0, 0, 1, 1.34944, 1614472032, 1000, 0, 0, 0, 0),
(7361, 2115, 558, 11, 0, -50.9972, 593.644, 11.61, 98.3896, '------', 1, 0, 1, 9.85777, 1614512218, 1000, 0, 0, 0, 0),
(6997, 2261, 451, 0, 1, 2481.31, -740.893, 11.795, 0, 'E164BC', 0, 0, 1, 9.14944, 1614480353, 1000, 0, 0, 0, 0),
(6965, 1165, 541, 6, 1, 1873.31, 2105.45, 15.2831, 5.7066, 'T553BT', 0, 0, 1, 24.9722, 1614473078, 1000, 0, 0, 0, 0),
(6980, 3316, 466, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.32861, 1614475812, 1000, 0, 0, 0, 0),
(6986, 1859, 410, 13, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1614477643, 1000, 0, 0, 0, 0),
(6969, 2710, 402, 1, 1, 1833.4, 2523.18, 15.5074, 131.084, '------', 1, 0, 1, 2.69139, 1614474062, 1000, 0, 0, 0, 0),
(6973, 3319, 404, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, 'K207EB', 0, 0, 1, 3.78138, 1614474684, 1000, 0, 0, 0, 0),
(7502, 3413, 411, 0, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 0.053611, 1614517982, 1000, 0, 0, 0, 0),
(6984, 363, 400, 24, 0, -197.395, 636.208, 11.2613, 261.762, '------', 1, 0, 1, 16.7194, 1614476852, 1000, 0, 0, 0, 0),
(7016, 3328, 502, 7, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614485825, 1000, 0, 0, 0, 0),
(7022, 1001, 411, 114, 1, 1925.32, -2234.25, 10.4221, 357.634, '------', 1, 0, 1, 7.35389, 1614487966, 1000, 0, 0, 0, 0),
(7333, 261, 402, 85, 1, -2228.22, -197.434, 24.3889, 259.63, '------', 1, 0, 1, 0.183333, 1614510680, 1000, 0, 0, 0, 0),
(7038, 3329, 405, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 1.04833, 1614490338, 1000, 0, 0, 0, 0),
(7436, 3259, 466, 125, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 2.71167, 1614514815, 1000, 0, 0, 0, 0),
(7416, 3398, 579, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 6.70112, 1614514213, 300, 0, 0, 0, 0),
(7059, 3332, 415, 7, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 6.93222, 1614492348, 1000, 0, 0, 0, 0),
(7069, 2663, 411, 3, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1614494186, 1000, 0, 0, 0, 0),
(7073, 3342, 421, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614494612, 1000, 0, 0, 0, 0),
(7143, 3352, 466, 119, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 10.242, 1614500260, 1000, 0, 0, 0, 0),
(7108, 3252, 506, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 1.90639, 1614496702, 1000, 0, 0, 0, 0),
(7093, 3343, 579, 13, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 0.056666, 1614496096, 1000, 0, 0, 0, 0),
(7094, 1593, 579, 65, 0, -2232.41, -203.054, 23.9221, 258.552, 'T887MT', 0, 0, 1, 8.80361, 1614496152, 1000, 0, 0, 0, 0),
(7359, 2039, 579, 0, 0, -333.925, 1012.82, 11.5193, 180.024, '------', 1, 0, 1, 2.80111, 1614512185, 1000, 0, 0, 0, 0),
(7247, 3386, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 2.74583, 1614506956, 1000, 0, 0, 0, 0),
(7373, 118, 411, 119, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 1, 5.63583, 1614512643, 1000, 0, 0, 0, 0),
(7116, 1680, 579, 1, 1, 2552.77, -2446.29, 21.4018, 359.847, 'T084AX', 1, 0, 1, 28.4151, 1614497267, 1000, 0, 0, 0, 0),
(7208, 3382, 489, 36, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 4.2675, 1614505215, 1000, 0, 0, 0, 0),
(7137, 1708, 404, 1, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 0, 0, 1, 2.37694, 1614499742, 1000, 0, 0, 0, 0),
(7246, 3345, 502, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 3.74278, 1614506936, 1000, 0, 0, 0, 0),
(7141, 3360, 402, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.733888, 1614500009, 1000, 0, 0, 0, 0),
(7147, 118, 480, 114, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 0.3075, 1614500652, 1000, 0, 0, 0, 0),
(7162, 3248, 451, 6, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.19833, 1614501342, 1000, 0, 0, 0, 0),
(7163, 118, 404, 22, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 1, 0.500555, 1614501422, 1000, 0, 0, 0, 0),
(7215, 3215, 466, 0, 1, -2168.71, -198.747, 24.9237, 346.516, '------', 1, 0, 1, 5.12611, 1614505401, 1000, 0, 0, 0, 0),
(7183, 172, 401, 125, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614502928, 1000, 0, 0, 0, 0),
(7219, 3379, 400, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 3.02888, 1614505776, 1000, 0, 0, 0, 0),
(7196, 437, 505, 85, 116, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 1.05694, 1614504304, 1000, 0, 0, 0, 0),
(7218, 2676, 466, 124, 1, 2583.86, -2427.47, 21.1482, 163.069, 'X704EM', 1, 0, 1, 1.13222, 1614505762, 1000, 0, 0, 0, 0),
(7300, 2984, 415, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 3.93278, 1614508777, 1000, 0, 0, 0, 0),
(7459, 3415, 579, 0, 1, 2477.47, -740.933, 11.795, 0, 'K333XK', 1, 0, 1, 2.50778, 1614516587, 1000, 0, 0, 0, 0),
(7266, 3020, 506, 125, 1, -128.839, 919.901, 11.2479, 245.497, 'M560MA', 1, 0, 1, 11.4961, 1614507491, 1000, 0, 0, 0, 0),
(7230, 3361, 541, 103, 1, 2481.31, -740.893, 11.795, 0, 'T314MA', 0, 0, 1, 4.82, 1614506210, 300, 0, 0, 0, 0),
(7280, 2672, 579, 0, 1, -2311.5, 299.108, 23.5613, 346.901, 'C067HE', 1, 0, 1, 16.0884, 1614508052, 1000, 0, 0, 0, 0),
(7310, 3294, 587, 1, 1, 7.36744, 572.2, 11.2273, 84.7499, '------', 0, 0, 1, 2.40361, 1614509062, 1000, 0, 0, 0, 0),
(7396, 1948, 451, 17, 1, 2487.41, -740.893, 11.795, 0, 'M023PO', 1, 0, 1, 1.45444, 1614513593, 1000, 0, 0, 0, 0),
(7409, 3081, 562, 119, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 1, 1.30083, 1614514036, 1000, 0, 0, 0, 0),
(7253, 2115, 490, 11, 1, -44.9803, 586.823, 11.558, 314.95, '------', 0, 0, 1, 2.53861, 1614507056, 1000, 0, 0, 0, 0),
(7259, 2086, 421, 36, 1, -2332.22, 64.7595, 21.1986, 251.456, '------', 0, 0, 1, 5.61887, 1614507285, 1000, 0, 0, 0, 0),
(7331, 1436, 415, 6, 0, -666.837, 747.098, 11.709, 270.922, 'O040HO', 0, 0, 1, 7.79973, 1614510636, 1000, 0, 0, 0, 0),
(7281, 3385, 541, 6, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 1.83194, 1614508090, 1000, 0, 0, 0, 0),
(7274, 3388, 401, 1, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 0, 0, 0, 0, 1614507719, 1000, 0, 0, 0, 0),
(7446, 2991, 521, 1, 1, -2236.21, 284.062, 24.0128, 206.795, '------', 0, 0, 1, 0.574166, 1614515549, 1000, 0, 0, 0, 0),
(7279, 3237, 481, 3, 1, -2354.9, 76.9001, 20.856, 81.3857, '------', 1, 0, 0, 0, 1614507915, 1000, 0, 0, 0, 0),
(7293, 1732, 502, 6, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614508538, 1000, 0, 0, 0, 0),
(7309, 3331, 415, 3, 1, -856.468, 739.277, 11.7107, 89.3476, 'H871AO', 1, 0, 1, 10.8617, 1614509038, 1000, 0, 3, 3, 3),
(7314, 3364, 410, 1, 1, -857.734, 739.406, 11.8031, 242.877, '------', 0, 0, 1, 6.29667, 1614509507, 1000, 0, 0, 0, 0),
(7448, 2546, 451, 121, 1, 2487.41, -740.893, 11.795, 0, '------', 1, 0, 1, 1.13139, 1614515712, 1000, 0, 0, 0, 0),
(7323, 2831, 400, 1, 1, -208.5, 938.621, 11.2646, 1.70823, 'O044EB', 1, 0, 1, 6.97695, 1614510254, 1000, 0, 0, 0, 0),
(7507, 3447, 404, 1, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 0.716666, 1614518245, 1000, 0, 0, 0, 0),
(7338, 261, 502, 85, 1, -2238.56, -194.768, 23.6388, 258.706, '------', 1, 0, 1, 0.048055, 1614510930, 1000, 0, 0, 0, 0),
(7339, 3396, 415, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 6.54111, 1614511020, 300, 0, 0, 0, 0),
(7344, 3404, 426, 9, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 0, 3.9525, 1614511410, 1000, 0, 0, 0, 0),
(7345, 3405, 445, 3, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 1, 0, 1, 2.51306, 1614511501, 1000, 0, 0, 0, 0),
(7346, 3369, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 1, 6.94195, 1614511549, 1000, 0, 0, 0, 0),
(7450, 3411, 451, 17, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 0.725277, 1614515742, 1000, 0, 0, 0, 0),
(7356, 3177, 502, 3, 1, -2344.51, 85.1707, 20.2357, 76.993, '------', 0, 0, 1, 4.29972, 1614512070, 1000, 0, 0, 0, 0),
(7419, 2106, 562, 1, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 1, 0.873888, 1614514262, 1000, 0, 0, 0, 0),
(7367, 3331, 579, 0, 1, -858.863, 734.452, 12.0728, 359.76, '------', 1, 0, 1, 2.48445, 1614512452, 1000, 0, 0, 0, 0),
(7520, 1581, 410, 0, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1614518558, 1000, 0, 0, 0, 0),
(7384, 585, 502, 126, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614512880, 1000, 0, 0, 0, 0),
(7391, 1089, 579, 65, 0, -2334.86, 78.1776, 20.4, 294.63, '------', 0, 0, 1, 7.34168, 1614513285, 1000, 0, 0, 0, 0),
(7505, 3442, 426, 0, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 0, 0, 1614518137, 1000, 0, 0, 0, 0),
(7447, 2598, 451, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.888611, 1614515659, 1000, 0, 0, 0, 0),
(7454, 3318, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.924166, 1614516282, 1000, 0, 0, 0, 0),
(7423, 3409, 505, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 1, 1.45778, 1614514392, 1000, 0, 0, 0, 0),
(7550, 3483, 410, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 0, 0, 1614519316, 1000, 0, 0, 0, 0),
(7476, 3267, 404, 0, 1, 1726.08, 2268.93, 15.8773, 269.646, '------', 0, 0, 1, 0.938333, 1614517027, 1000, 0, 0, 0, 0),
(7457, 3399, 402, 117, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 1.19278, 1614516432, 1000, 0, 0, 0, 0),
(7445, 3412, 527, 0, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1614515484, 1000, 0, 0, 0, 0),
(7452, 3401, 475, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 0.004166, 1614516000, 1000, 0, 0, 0, 0),
(7477, 3407, 579, 0, 1, 1784.73, 2463.64, 15.3623, 36.694, '------', 0, 0, 1, 5.74666, 1614517046, 1000, 0, 0, 0, 0),
(7461, 3414, 502, 0, 1, -2155.43, -193.241, 24.92, 167.444, '------', 0, 0, 1, 5.48834, 1614516600, 1000, 0, 0, 0, 0),
(7483, 3010, 451, 117, 1, -83.7632, 924.29, 11.3312, 72.5306, '------', 0, 0, 0, 2.93028, 1614517389, 1000, 0, 0, 0, 0),
(7491, 1965, 402, 3, 1, 2477.47, -740.933, 11.795, 0, 'P786XB', 1, 0, 1, 1.10972, 1614517533, 1000, 0, 0, 0, 0),
(7501, 874, 415, 85, 0, -793.629, 785.982, 11.9937, 235.463, 'O511CK', 0, 0, 1, 1.20194, 1614517982, 1000, 0, 0, 0, 0),
(7527, 3451, 410, 1, 1, 1375.51, 451.079, 12.6476, 146.918, '------', 0, 0, 1, 1.02, 1614518688, 1000, 0, 0, 0, 0),
(7484, 3424, 579, 3, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0.000277, 1614517408, 1000, 0, 0, 0, 0),
(7490, 3420, 579, 119, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 1.71305, 1614517532, 1000, 0, 0, 0, 0),
(7495, 1512, 404, 0, 1, 1782.85, 2247.14, 15.7239, 359.396, '------', 1, 0, 1, 4.56166, 1614517800, 1000, 0, 0, 0, 0),
(7496, 3432, 558, 6, 1, 115.599, 930.71, 11.2243, 340.979, '------', 1, 0, 1, 4.275, 1614517818, 1000, 0, 0, 0, 0),
(7503, 2399, 502, 20, 1, -248.137, 998.765, 11.2332, 2.68653, '------', 0, 0, 1, 10.3447, 1614518024, 1000, 0, 0, 0, 0),
(7498, 3378, 415, 3, 1, 2477.47, -740.933, 11.795, 0, '------', 1, 0, 1, 3.02167, 1614517874, 1000, 0, 0, 0, 0),
(7506, 3439, 404, 0, 1, 1777.92, 2247.33, 15.8137, 1.4248, '------', 0, 0, 0, 0, 1614518179, 1000, 0, 0, 0, 0),
(7508, 3435, 409, 0, 1, 1925.95, -2236.32, 11.023, 7.83656, 'K004HP', 1, 0, 1, 1.76361, 1614518259, 1000, 0, 0, 0, 0),
(7510, 3449, 426, 2, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 1, 0.996944, 1614518332, 1000, 0, 0, 0, 0),
(7511, 3455, 558, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 0.621388, 1614518345, 1000, 0, 0, 0, 0),
(7512, 3425, 559, 8, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1614518347, 1000, 0, 0, 0, 0),
(7513, 3460, 404, 0, 1, 1726.16, 2264.93, 15.8775, 269.655, '------', 0, 0, 0, 0, 1614518348, 1000, 0, 0, 0, 0),
(7515, 3448, 579, 0, 1, 2487.41, -740.893, 11.795, 0, 'E666CM', 0, 0, 0, 0, 1614518420, 1000, 0, 0, 0, 0),
(7517, 3453, 558, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 0.050833, 1614518426, 1000, 0, 0, 0, 0),
(7555, 530, 402, 122, 0, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614519389, 1000, 0, 0, 0, 0),
(7523, 3390, 410, 122, 1, 1793.74, 2530.22, 14.9821, 132.371, '------', 1, 0, 1, 4.82111, 1614518628, 1000, 0, 0, 0, 0),
(7522, 3467, 410, 0, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 0, 0, 1, 0.252499, 1614518595, 1000, 0, 0, 0, 0),
(7524, 3475, 404, 4, 1, 1726.08, 2260.7, 15.8772, 269.697, '------', 1, 0, 1, 2.86555, 1614518644, 1000, 0, 0, 0, 0),
(7525, 3469, 490, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 1, 4.41222, 1614518653, 1000, 0, 0, 0, 0),
(7526, 3464, 410, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 0, 0, 1, 0.005555, 1614518655, 1000, 0, 0, 0, 0),
(7551, 3418, 579, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614519324, 1000, 0, 0, 0, 0),
(7531, 3452, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614518759, 1000, 0, 0, 0, 0),
(7530, 3468, 551, 1, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1614518736, 1000, 0, 0, 0, 0),
(7532, 3443, 506, 1, 1, 1382.34, 446.25, 12.6481, 148.528, '------', 1, 0, 1, 1.23139, 1614518765, 1000, 0, 0, 0, 0),
(7553, 3457, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614519349, 1000, 0, 0, 0, 0),
(7537, 3488, 558, 1, 1, 1371.47, 452.445, 12.6497, 149.09, '------', 1, 0, 1, 1.16889, 1614519038, 1000, 0, 0, 0, 0),
(7543, 3494, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 2.05472, 1614519198, 1000, 0, 0, 0, 0),
(7539, 3485, 560, 2, 1, 1378.71, 448.596, 12.6462, 149.598, '------', 0, 0, 0, 0, 1614519107, 1000, 0, 0, 0, 0),
(7540, 3471, 466, 4, 1, 2388.74, -751.181, 13.2407, 127.675, '------', 0, 0, 1, 0.098055, 1614519114, 1000, 0, 0, 0, 0),
(7560, 3427, 451, 1, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614519473, 1000, 0, 0, 0, 0),
(7552, 3419, 579, 0, 1, 2481.31, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614519332, 1000, 0, 0, 0, 0),
(7545, 3493, 579, 0, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614519231, 1000, 0, 0, 0, 0),
(7546, 3476, 579, 0, 0, 2481.31, -740.893, 11.795, 0, '------', 1, 0, 1, 0.634999, 1614519255, 1000, 0, 0, 0, 0),
(7549, 3478, 402, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614519291, 1000, 0, 0, 0, 0),
(7554, 3389, 521, 1, 1, -2234.62, 280.736, 24.012, 207.213, '------', 0, 0, 0, 0, 1614519379, 1000, 0, 0, 0, 0),
(7556, 3480, 411, 0, 1, 1389.32, 441.975, 12.646, 148.185, '------', 0, 0, 0, 0, 1614519398, 1000, 0, 0, 0, 0),
(7557, 3423, 490, 1, 1, 2487.41, -740.893, 11.795, 0, '------', 0, 0, 0, 0, 1614519417, 1000, 0, 0, 0, 0),
(7559, 3487, 466, 1, 1, 2477.47, -740.933, 11.795, 0, '------', 0, 0, 0, 0, 1614519434, 1000, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `payments`
--

CREATE TABLE `payments` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `sum` int(11) NOT NULL,
  `status` int(11) NOT NULL,
  `name` varchar(24) COLLATE utf8mb4_unicode_ci NOT NULL,
  `billID` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `data_create` datetime NOT NULL,
  `data_accept` datetime NOT NULL DEFAULT current_timestamp(),
  `server_id` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `payments`
--

INSERT INTO `payments` (`id`, `user_id`, `sum`, `status`, `name`, `billID`, `data_create`, `data_accept`, `server_id`) VALUES
(1, 1515, 20, 0, 'Gena_Lazurkin', 'a714ea56-956b-4a82-9de0-aa54640f59e1', '2021-02-25 13:36:54', '2021-02-25 16:36:54', 1),
(2, 65, 25, 2, 'Tiago_King', 'e3f4902d-3742-4eb7-a858-d241f955e494', '2021-02-25 14:02:35', '2021-02-25 14:06:22', 1),
(3, 2232, 200000000, 0, 'Robert_Versachi', 'f9df68e8-e13c-4b63-a9d7-a61f9f8731a6', '2021-02-25 14:03:38', '2021-02-25 17:03:38', 1),
(4, 65, 10, 2, 'Tiago_King', 'f303d6fc-0212-46cf-aee7-6093cac0ea69', '2021-02-25 14:08:11', '2021-02-25 14:10:33', 1),
(5, 2450, 499, 0, 'Demyan_Medrodore', '6b59e4d7-17c8-4b77-9818-fca65e6e4e5d', '2021-02-25 14:16:57', '2021-02-25 17:16:57', 1),
(6, 425, 25, 0, 'Maxim_Kaipan', 'd626b83d-332d-4631-93d0-cf1acd1a54c1', '2021-02-25 14:17:22', '2021-02-25 17:17:22', 1),
(7, 425, 40, 0, 'Maxim_Kaipan', '89b4068e-f499-41bb-9362-efb5fc79cf0e', '2021-02-25 14:17:58', '2021-02-25 17:17:58', 1),
(8, 2450, 490, 2, 'Demyan_Medrodore', 'd7c7d500-01bc-4c2f-b67f-d18b407baf0c', '2021-02-25 14:29:39', '2021-02-25 14:40:38', 1),
(9, 1952, 50, 0, 'Richard_Squezze', '17e04970-ef38-4e10-be53-1de59cdae20f', '2021-02-25 14:38:22', '2021-02-25 17:38:22', 1),
(10, 1577, 100, 2, 'Ivan_Traiple', 'a2e7ab09-ad6e-4ed9-8618-ea7222e95dc4', '2021-02-25 15:50:15', '2021-02-25 15:52:58', 1),
(11, 1577, 50, 2, 'Ivan_Traiple', 'feba1b5f-45a0-4667-a106-0c8d5a2e9070', '2021-02-25 16:52:49', '2021-02-25 16:54:58', 1),
(12, 1782, 300, 2, 'Tomas_Shelby', '70c8b164-18fd-447d-b411-c255d7f7a2bb', '2021-02-25 20:02:19', '2021-02-25 20:04:31', 1),
(13, 2336, 30, 0, 'Stefan_Perederii', '28ec20b4-4ba1-4760-92e9-1d49af998071', '2021-02-25 20:03:20', '2021-02-25 23:03:20', 1),
(14, 2336, 30, 0, 'Stefan_Perederii', '97803b04-632a-47b6-893e-aeb96c5205c1', '2021-02-25 20:03:36', '2021-02-25 23:03:36', 1),
(15, 2336, 30, 0, 'Stefan_Perederii', '7910eb07-271d-4d23-9854-8c4ba637d4db', '2021-02-25 20:08:31', '2021-02-25 23:08:31', 1),
(16, 2336, 30, 2, 'Stefan_Perederii', 'e696a0af-2858-4549-98c9-c4464590eab1', '2021-02-25 20:13:10', '2021-02-25 20:22:09', 1),
(17, 2705, 300, 0, 'Zahar_Supreme', '8cd91a19-ccbc-42c3-903d-c4a236740fe7', '2021-02-25 20:13:58', '2021-02-25 23:13:58', 1),
(18, 2705, 300, 0, 'Zahar_Supreme', '9ab5f3f7-ff2a-4ae1-8f9f-8199f4c62820', '2021-02-25 20:14:18', '2021-02-25 23:14:18', 1),
(19, 2672, 1000, 0, 'Maksim_Sizov', '389b243b-7e48-4f7b-9064-43bdc2c49d28', '2021-02-25 20:28:41', '2021-02-25 23:28:41', 1),
(20, 2705, 250, 0, 'Zahar_Supreme', '9cee5647-350e-4d6f-8ac0-0ebd98bd420f', '2021-02-25 20:42:53', '2021-02-25 23:42:53', 1),
(21, 2705, 250, 0, 'Zahar_Supreme', 'cf87236f-ce3d-4339-a9b0-112964bfe0e7', '2021-02-25 20:49:48', '2021-02-25 23:49:48', 1),
(22, 2705, 250, 2, 'Zahar_Supreme', 'a304ce10-c7e9-41da-9aa3-f102c7e67ad9', '2021-02-25 21:02:41', '2021-02-25 21:05:27', 1),
(23, 2265, 100, 0, 'Nazar_Tsilinskyi', '06bfb450-903e-4476-b933-2e56580d02b9', '2021-02-25 23:54:35', '2021-02-26 02:54:35', 1),
(24, 2614, 10, 0, 'Under_Graund', '9e8f937c-f896-4155-8298-b6fc2ac61154', '2021-02-26 05:24:00', '2021-02-26 08:24:00', 1),
(25, 2614, 100, 0, 'Under_Graund', '9f30b046-af85-4bb3-8929-eda04c8acd46', '2021-02-26 05:27:33', '2021-02-26 08:27:33', 1),
(26, 1056, 50, 0, 'Ray_Versetty', 'f558b7b9-6598-49aa-9420-5c3af1634d4a', '2021-02-26 07:23:05', '2021-02-26 10:23:05', 1),
(27, 536, 100, 0, 'Alexey_Filatov', '51a62836-8173-4b7f-998f-9827f5f55154', '2021-02-26 08:19:55', '2021-02-26 11:19:55', 1),
(28, 536, 99, 2, 'Alexey_Filatov', 'd1183cbd-f6eb-4ae3-bc81-488ae87fb97b', '2021-02-26 08:24:35', '2021-02-26 08:26:05', 1),
(29, 1056, 48, 2, 'Ray_Versetty', '92f3445f-097f-4f83-a9b1-7b73da9258b9', '2021-02-26 12:00:56', '2021-02-26 12:18:13', 1),
(30, 118, 67, 2, 'Sergey_Emerald', '22058d58-46f3-4d66-93e6-f9e3f69726b9', '2021-02-26 13:51:44', '2021-02-26 13:54:07', 1),
(31, 2830, 50, 0, 'Diaz_Rosenberg', 'abb85466-8189-441a-b014-e60a69312465', '2021-02-26 14:12:44', '2021-02-26 17:12:44', 1),
(32, 2705, 400, 0, 'Zahar_Supreme', '799206f9-b385-47a3-abdf-74db6cc8a45c', '2021-02-26 14:13:38', '2021-02-26 17:13:38', 1),
(33, 2705, 400, 0, 'Zahar_Supreme', '387a8ad8-037e-42d0-866d-d2c47b8780df', '2021-02-26 14:14:28', '2021-02-26 17:14:28', 1),
(34, 2830, 50, 2, 'Diaz_Rosenberg', '1a3c85ad-5d96-4da5-9ba7-3e56e4af07e1', '2021-02-26 14:17:04', '2021-02-26 14:19:22', 1),
(35, 2830, 17, 0, 'Diaz_Rosenberg', '9ec6dc3d-c684-481b-a0b3-b0b173c32482', '2021-02-26 14:23:20', '2021-02-26 17:23:20', 1),
(36, 2898, 100, 0, 'Denis_Sanda', '33f0102c-9ee2-482c-bd8a-ad3be5df4fa8', '2021-02-26 16:37:16', '2021-02-26 19:37:16', 1),
(37, 2898, 100, 0, 'Denis_Sanda', '97fc0e96-1998-4ca5-a96a-21b527e09c93', '2021-02-26 16:38:23', '2021-02-26 19:38:23', 1),
(38, 2495, 100, 0, 'Misha_Shkvarok', 'e51d9ce6-37dd-4e49-87e5-29bdc5155c06', '2021-02-26 18:39:40', '2021-02-26 21:39:40', 1),
(39, 118, 10, 2, 'Sergey_Emerald', '03384209-1415-4cbd-bf33-85d5f34c2b21', '2021-02-26 19:00:16', '2021-02-26 19:03:09', 1),
(40, 3022, 150, 2, 'Vlad_Bichevich', 'b63a34e7-cc35-4e20-afb6-83517c8e63d9', '2021-02-26 22:46:12', '2021-02-26 22:51:32', 1),
(41, 340, 100, 0, 'Timofey_Shavkun', 'f6f6cc53-4ce7-4d81-808c-16e244ee2cd6', '2021-02-26 22:49:25', '2021-02-27 01:49:25', 1),
(42, 2265, 1449, 0, 'Nazar_Tsilinskyi', 'e56e6f90-b850-4e0a-8cf9-896e6336a07c', '2021-02-27 00:26:09', '2021-02-27 03:26:09', 1),
(43, 2265, 100, 0, 'Nazar_Tsilinskyi', 'a7798ec0-01cc-41d3-bc33-e17f45484248', '2021-02-27 00:38:33', '2021-02-27 03:38:33', 1),
(44, 2265, 100, 0, 'Nazar_Tsilinskyi', '4f69ef38-4f5c-4a73-a49f-65887504b4d6', '2021-02-27 00:38:46', '2021-02-27 03:38:46', 1),
(45, 2265, 900, 0, 'Nazar_Tsilinskyi', '6000b122-4fe9-4a2b-8df5-ef1e5a64e8d9', '2021-02-27 00:43:11', '2021-02-27 03:43:11', 1),
(46, 2265, 900, 0, 'Nazar_Tsilinskyi', '5275c8fa-e6f6-4d8f-8f62-3d972178e743', '2021-02-27 00:59:54', '2021-02-27 03:59:54', 1),
(47, 2265, 100, 0, 'Nazar_Tsilinskyi', 'af4f4ff9-f76f-49a5-aaa5-ae482d1208ac', '2021-02-27 01:01:55', '2021-02-27 04:01:55', 1),
(48, 1708, 15, 2, 'Semen_Orlov', '32d3f568-b9f5-4b8e-bdde-6b46b85b7b6b', '2021-02-27 08:54:34', '2021-02-27 08:56:41', 1),
(49, 1708, 10, 2, 'Semen_Orlov', '7b044f21-2bfd-495a-b529-e886e907459f', '2021-02-27 08:58:20', '2021-02-27 09:00:39', 1),
(50, 536, 130, 0, 'Alexey_Filatov', '19e07893-e4c9-46e3-a9f2-b33c27c4159f', '2021-02-27 09:19:28', '2021-02-27 12:19:28', 1),
(51, 536, 129, 2, 'Alexey_Filatov', 'ab4c0ece-47ac-4aa2-ad8d-c971d0405899', '2021-02-27 09:19:59', '2021-02-27 09:20:45', 1),
(52, 536, 16, 2, 'Alexey_Filatov', '9c9e86a1-864b-41fc-b6c3-58d713189f37', '2021-02-27 09:28:30', '2021-02-27 09:29:21', 1),
(53, 1056, 15, 2, 'Ray_Versetty', '5a0b8c58-a652-45f8-85a4-a6593a59400a', '2021-02-27 10:32:59', '2021-02-27 10:46:03', 1),
(54, 1056, 300, 0, 'Ray_Versetty', 'aeb72db3-6232-45fb-bb5b-ce8c7b3ffa02', '2021-02-27 12:01:28', '2021-02-27 15:01:28', 1),
(55, 3102, 100, 0, 'Ramazan_Versace', 'febeb1b7-821d-4bea-aa86-768c484edc96', '2021-02-27 12:24:22', '2021-02-27 15:24:22', 1),
(56, 3102, 500, 2, 'Ramazan_Versace', 'b308cc7a-cb66-48cd-8539-ad4cdb397671', '2021-02-27 12:40:09', '2021-02-27 12:46:57', 1),
(57, 1952, 25, 0, 'Richard_Squezze', '7ff1923b-9e38-43e2-b902-7aad85a10b3e', '2021-02-27 15:43:01', '2021-02-27 18:43:01', 1),
(58, 118, 500, 0, 'Sergey_Emerald', 'dddafd59-fc66-4626-99f9-3da3722817c0', '2021-02-27 16:05:00', '2021-02-27 19:05:00', 1),
(59, 118, 500, 2, 'Sergey_Emerald', 'a96586f3-fdda-4339-9566-2c819ae023f6', '2021-02-27 16:09:48', '2021-02-27 16:13:35', 1),
(60, 590, 50, 0, 'Nikita_Molodd', '3548787d-490e-45f8-ab8f-23bfc3c2d818', '2021-02-28 03:48:07', '2021-02-28 06:48:07', 1),
(61, 590, 50, 0, 'Nikita_Molodd', '8697e75d-b13f-42f4-b9e5-3c129d5592d5', '2021-02-28 03:49:33', '2021-02-28 06:49:33', 1),
(62, 590, 50, 0, 'Nikita_Molodd', '9c5635d3-dcb4-45b1-af70-4ef7b517bff2', '2021-02-28 03:51:34', '2021-02-28 06:51:34', 1),
(63, 590, 50, 0, 'Nikita_Molodd', '5cb44618-6a74-47bf-928f-bdff6908de7c', '2021-02-28 03:53:36', '2021-02-28 06:53:36', 1),
(64, 590, 50, 0, 'Nikita_Molodd', 'f1aeea25-1168-4b9f-98db-aa2a7def42c0', '2021-02-28 03:54:22', '2021-02-28 06:54:22', 1),
(65, 590, 55, 0, 'Nikita_Molodd', '8ec9f986-fa66-4716-951f-2bcb1ca6b5e9', '2021-02-28 05:55:05', '2021-02-28 08:55:05', 1),
(66, 590, 55, 0, 'Nikita_Molodd', 'bd7389a0-c95b-48c4-9102-633463b87a19', '2021-02-28 05:55:47', '2021-02-28 08:55:47', 1),
(67, 590, 100, 0, 'Nikita_Molodd', 'a1225fcd-ead8-4295-a489-ea63525b45dd', '2021-02-28 05:56:23', '2021-02-28 08:56:23', 1),
(68, 590, 50, 0, 'Nikita_Molodd', '54ae838c-4b77-4b48-86f9-c8418de3c71b', '2021-02-28 05:56:37', '2021-02-28 08:56:37', 1),
(69, 590, 50, 0, 'Nikita_Molodd', 'be081ab4-b488-49dd-8c52-ccb69961382d', '2021-02-28 05:56:57', '2021-02-28 08:56:57', 1),
(70, 590, 50, 0, 'Nikita_Molodd', 'd79b89b4-23d1-4c91-82bb-32d69668e331', '2021-02-28 06:05:26', '2021-02-28 09:05:26', 1),
(71, 2791, 400, 0, 'Erzhan_Tenisov', 'c7818f8b-25fe-47fb-a9d8-5cc1ea240e2a', '2021-02-28 06:22:38', '2021-02-28 09:22:38', 1),
(72, 2791, 400, 0, 'Erzhan_Tenisov', 'd0fd7839-54be-47df-bca9-20ffeaf8664f', '2021-02-28 06:44:18', '2021-02-28 09:44:18', 1),
(73, 2791, 395, 0, 'Erzhan_Tenisov', '06efae75-040b-4cb5-bb55-1a751e2e77a6', '2021-02-28 06:45:12', '2021-02-28 09:45:12', 1),
(74, 2791, 393, 0, 'Erzhan_Tenisov', '5dfb2762-0764-4815-b680-be409ed7416a', '2021-02-28 06:45:31', '2021-02-28 09:45:31', 1),
(75, 2791, 390, 0, 'Erzhan_Tenisov', 'c1cbaaaf-7b4b-47aa-ae38-bf38e3f9836b', '2021-02-28 06:47:11', '2021-02-28 09:47:11', 1),
(76, 2791, 398, 0, 'Erzhan_Tenisov', '54153fa8-d04c-47b3-b6fe-5c17f64c1072', '2021-02-28 06:50:28', '2021-02-28 09:50:28', 1),
(77, 2791, 400, 0, 'Erzhan_Tenisov', '0229b32d-7bbb-4686-8974-ec38f3497803', '2021-02-28 06:52:18', '2021-02-28 09:52:18', 1),
(78, 2791, 400, 0, 'Erzhan_Tenisov', '21586e9a-95cd-4d65-93c7-f14574c9bd27', '2021-02-28 06:52:18', '2021-02-28 09:52:18', 1),
(79, 2791, 400, 0, 'Erzhan_Tenisov', '6de7af24-3174-4579-9d02-e725807a2619', '2021-02-28 06:52:30', '2021-02-28 09:52:30', 1),
(80, 261, 100, 0, 'Carlos_Lastro', '5b64d261-7cc5-478e-92c5-3d8d42b05e4b', '2021-02-28 09:20:24', '2021-02-28 12:20:24', 1),
(81, 261, 144, 0, 'Carlos_Lastro', 'd4f86e12-b50c-4284-b549-0c56d526d906', '2021-02-28 09:21:11', '2021-02-28 12:21:11', 1),
(82, 261, 145, 2, 'Carlos_Lastro', '8eaac77d-a7ee-4976-bbc0-15e024e9c0d6', '2021-02-28 09:21:30', '2021-02-28 09:23:18', 1),
(83, 3331, 100, 0, 'Sasha_Nelasov', 'f26b3606-c385-42be-9bb8-94e1b100fc76', '2021-02-28 09:27:17', '2021-02-28 12:27:17', 1),
(84, 1056, 50, 0, 'Ray_Versetty', '2da502af-8301-4d27-9401-30eef514156f', '2021-02-28 10:41:07', '2021-02-28 13:41:07', 1),
(85, 1056, 47, 2, 'Ray_Versetty', 'ad9fa056-bf57-49bb-94dc-262264d10ccd', '2021-02-28 10:41:29', '2021-02-28 11:17:47', 1),
(86, 3331, 180, 0, 'Sasha_Nelasov', '13d87fda-4c74-452d-a529-8b811d8e8a86', '2021-02-28 11:28:13', '2021-02-28 14:28:13', 1),
(87, 3331, 100, 0, 'Sasha_Nelasov', 'c577d819-bf72-4eac-8cbc-f8c6cdeaa009', '2021-02-28 11:30:22', '2021-02-28 14:30:22', 1),
(88, 3331, 150, 2, 'Sasha_Nelasov', '888375cf-4490-45dd-beb9-3b4c03eece45', '2021-02-28 11:30:52', '2021-02-28 11:32:18', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `phone_books`
--

CREATE TABLE `phone_books` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(21) DEFAULT NULL,
  `number` varchar(9) DEFAULT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `promocode`
--

CREATE TABLE `promocode` (
  `id` int(11) NOT NULL,
  `code` varchar(32) CHARACTER SET utf8 NOT NULL,
  `type` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `usings` int(11) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `promocode`
--

INSERT INTO `promocode` (`id`, `code`, `type`, `amount`, `usings`, `paydays`) VALUES
(1, 'Kitayanka', 0, 200000, 2, 5);

-- --------------------------------------------------------

--
-- Структура таблицы `promocode_activations`
--

CREATE TABLE `promocode_activations` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `code` varchar(32) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `quick_message`
--

CREATE TABLE `quick_message` (
  `name` varchar(64) COLLATE utf8_bin NOT NULL,
  `text_1` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №1',
  `text_2` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №2',
  `text_3` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №3',
  `text_4` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №4',
  `text_5` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №5',
  `text_6` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №6',
  `text_7` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №7',
  `text_8` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №8',
  `text_9` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №9',
  `text_10` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №10',
  `text_11` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №11',
  `text_12` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №12',
  `text_13` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №13',
  `text_14` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №14',
  `text_15` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №15',
  `text_16` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №16',
  `text_17` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №17',
  `text_18` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №18',
  `text_19` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №19',
  `text_20` varchar(128) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `quick_message`
--

INSERT INTO `quick_message` (`name`, `text_1`, `text_2`, `text_3`, `text_4`, `text_5`, `text_6`, `text_7`, `text_8`, `text_9`, `text_10`, `text_11`, `text_12`, `text_13`, `text_14`, `text_15`, `text_16`, `text_17`, `text_18`, `text_19`, `text_20`) VALUES
('oscar_dev', 'Я @name состаю в организации @frac', 'Я смотрю порно', 'Я гей', '/do срет', '/me пахнет', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', '');

-- --------------------------------------------------------

--
-- Структура таблицы `repositories`
--

CREATE TABLE `repositories` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `action_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `description` varchar(64) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `repositories`
--

INSERT INTO `repositories` (`id`, `type`, `action_id`, `amount`, `description`) VALUES
(1, 0, 0, 40192, 'Шахта, металл'),
(2, 0, 1, 0, 'Шахта, руда'),
(3, 1, 0, 153, 'Завод, металл'),
(4, 1, 1, 8091, 'Завод, топливо'),
(5, 1, 2, 59913, 'Завод, продукты'),
(6, 3, 0, 98393, 'Склад армии, металл'),
(7, 3, 1, 153749, 'Склад армии, патроны'),
(8, 4, 0, 2000, 'Лесопилка, дерево');

-- --------------------------------------------------------

--
-- Структура таблицы `return_money`
--

CREATE TABLE `return_money` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `description` varchar(64) CHARACTER SET utf8 NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `server_settings`
--

CREATE TABLE `server_settings` (
  `admin_price` int(11) NOT NULL DEFAULT 80,
  `helper_price` int(11) NOT NULL DEFAULT 40,
  `distrub` int(11) NOT NULL DEFAULT 1,
  `donpower` int(11) NOT NULL DEFAULT 1,
  `GiveCoins` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `server_settings`
--

INSERT INTO `server_settings` (`admin_price`, `helper_price`, `distrub`, `donpower`, `GiveCoins`) VALUES
(100, 40, 2, 2, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `tickets`
--

CREATE TABLE `tickets` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `description` varchar(64) NOT NULL,
  `issuer` varchar(32) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `trunks`
--

CREATE TABLE `trunks` (
  `id` int(11) NOT NULL,
  `oc_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `value` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `trunks`
--

INSERT INTO `trunks` (`id`, `oc_id`, `item_id`, `amount`, `value`) VALUES
(16, 6425, 5, 600, 0),
(6, 4851, 3, 2, 0),
(7, 4851, 2, 15, 0),
(8, 4851, 2, 15, 0),
(9, 4851, 2, 15, 0),
(10, 4851, 2, 15, 0),
(18, 6774, 1, 1000000, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `unitpay_payments`
--

CREATE TABLE `unitpay_payments` (
  `id` int(10) NOT NULL,
  `unitpayId` varchar(255) NOT NULL,
  `account` varchar(255) NOT NULL,
  `sum` float NOT NULL,
  `itemsCount` int(11) NOT NULL DEFAULT 1,
  `dateCreate` datetime NOT NULL,
  `dateComplete` datetime DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `whitelist`
--

CREATE TABLE `whitelist` (
  `id` int(11) NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `ytpromocode`
--

CREATE TABLE `ytpromocode` (
  `id` int(11) NOT NULL,
  `code` varchar(32) CHARACTER SET utf8 NOT NULL,
  `type` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `usings` int(11) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `accounts`
--
ALTER TABLE `accounts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `name` (`name`),
  ADD KEY `email` (`email`),
  ADD KEY `phone` (`phone`),
  ADD KEY `house` (`house`);

--
-- Индексы таблицы `aclogs`
--
ALTER TABLE `aclogs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `action_log`
--
ALTER TABLE `action_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `bank_accounts_log`
--
ALTER TABLE `bank_accounts_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ban_list`
--
ALTER TABLE `ban_list`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `business`
--
ALTER TABLE `business`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `business_gps`
--
ALTER TABLE `business_gps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `bid` (`bid`);

--
-- Индексы таблицы `business_profit`
--
ALTER TABLE `business_profit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`bid`),
  ADD KEY `view` (`view`);

--
-- Индексы таблицы `car_obmen`
--
ALTER TABLE `car_obmen`
  ADD UNIQUE KEY `car_1` (`car_1`,`car_2`,`car_3`,`car_4`,`car_5`);

--
-- Индексы таблицы `change_names`
--
ALTER TABLE `change_names`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Индексы таблицы `charity`
--
ALTER TABLE `charity`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uid` (`uid`);

--
-- Индексы таблицы `debug`
--
ALTER TABLE `debug`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `donate_log`
--
ALTER TABLE `donate_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `donations`
--
ALTER TABLE `donations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `entrances`
--
ALTER TABLE `entrances`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `family_cars`
--
ALTER TABLE `family_cars`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`owner_id`,`model_id`,`color_1`,`color_2`,`rang`,`pos_x`,`pos_y`,`pos_z`,`angle`,`fuel`);

--
-- Индексы таблицы `fuel_stations`
--
ALTER TABLE `fuel_stations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `fuel_stations_profit`
--
ALTER TABLE `fuel_stations_profit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`fid`),
  ADD KEY `view` (`view`);

--
-- Индексы таблицы `full_dostup`
--
ALTER TABLE `full_dostup`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gang_repositories`
--
ALTER TABLE `gang_repositories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gang_zones`
--
ALTER TABLE `gang_zones`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gift`
--
ALTER TABLE `gift`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gift_lose`
--
ALTER TABLE `gift_lose`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `hotels`
--
ALTER TABLE `hotels`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `houses`
--
ALTER TABLE `houses`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `houses_renters`
--
ALTER TABLE `houses_renters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`),
  ADD KEY `house_id` (`house_id`);

--
-- Индексы таблицы `leaders`
--
ALTER TABLE `leaders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `money_log`
--
ALTER TABLE `money_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ownable_cars`
--
ALTER TABLE `ownable_cars`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `phone_books`
--
ALTER TABLE `phone_books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Индексы таблицы `promocode`
--
ALTER TABLE `promocode`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `promocode_activations`
--
ALTER TABLE `promocode_activations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `repositories`
--
ALTER TABLE `repositories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `type` (`type`,`action_id`);

--
-- Индексы таблицы `return_money`
--
ALTER TABLE `return_money`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tickets`
--
ALTER TABLE `tickets`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `trunks`
--
ALTER TABLE `trunks`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `whitelist`
--
ALTER TABLE `whitelist`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ytpromocode`
--
ALTER TABLE `ytpromocode`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `accounts`
--
ALTER TABLE `accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `aclogs`
--
ALTER TABLE `aclogs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `action_log`
--
ALTER TABLE `action_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=141;

--
-- AUTO_INCREMENT для таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `bank_accounts_log`
--
ALTER TABLE `bank_accounts_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `ban_list`
--
ALTER TABLE `ban_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `business`
--
ALTER TABLE `business`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT для таблицы `business_gps`
--
ALTER TABLE `business_gps`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=104;

--
-- AUTO_INCREMENT для таблицы `business_profit`
--
ALTER TABLE `business_profit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `change_names`
--
ALTER TABLE `change_names`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `charity`
--
ALTER TABLE `charity`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT для таблицы `debug`
--
ALTER TABLE `debug`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `donate_log`
--
ALTER TABLE `donate_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `donations`
--
ALTER TABLE `donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `entrances`
--
ALTER TABLE `entrances`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT для таблицы `family`
--
ALTER TABLE `family`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `family_cars`
--
ALTER TABLE `family_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `fuel_stations`
--
ALTER TABLE `fuel_stations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `fuel_stations_profit`
--
ALTER TABLE `fuel_stations_profit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `full_dostup`
--
ALTER TABLE `full_dostup`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `gang_repositories`
--
ALTER TABLE `gang_repositories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `gang_zones`
--
ALTER TABLE `gang_zones`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT для таблицы `gift`
--
ALTER TABLE `gift`
  MODIFY `id` int(16) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT для таблицы `gift_lose`
--
ALTER TABLE `gift_lose`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=505;

--
-- AUTO_INCREMENT для таблицы `hotels`
--
ALTER TABLE `hotels`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT для таблицы `houses`
--
ALTER TABLE `houses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=572;

--
-- AUTO_INCREMENT для таблицы `houses_renters`
--
ALTER TABLE `houses_renters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=229;

--
-- AUTO_INCREMENT для таблицы `leaders`
--
ALTER TABLE `leaders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `money_log`
--
ALTER TABLE `money_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `ownable_cars`
--
ALTER TABLE `ownable_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7561;

--
-- AUTO_INCREMENT для таблицы `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT для таблицы `phone_books`
--
ALTER TABLE `phone_books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `promocode`
--
ALTER TABLE `promocode`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `promocode_activations`
--
ALTER TABLE `promocode_activations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `repositories`
--
ALTER TABLE `repositories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `return_money`
--
ALTER TABLE `return_money`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `tickets`
--
ALTER TABLE `tickets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `trunks`
--
ALTER TABLE `trunks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `whitelist`
--
ALTER TABLE `whitelist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `ytpromocode`
--
ALTER TABLE `ytpromocode`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
