#include <a_samp>
#if defined _SYSTEM_VEHICLE
	#endinput
#endif
#define _SYSTEM_VEHICLE

#define GetVehicleInfo(%0,%1)		g_vehicle_info[%0][%1]
#define GetVehicleName(%0)			GetVehicleInfo(GetVehicleData(%0, V_MODELID)-400, VI_NAME)

#define GetVehicleData(%0,%1)		g_vehicle_data[%0][%1]
#define SetVehicleData(%0,%1,%2)	g_vehicle_data[%0][%1] = %2
#define ClearVehicleData(%0)		g_vehicle_data[%0] = g_vehicle_default_values
#define IsValidVehicleID(%0)		(1 <= %0 < MAX_VEHICLES)

#define GetVehicleParamEx(%0,%1) g_vehicle_params[%0][%1]

#define VEHICLE_ACTION_TYPE_NONE 	-1
#define VEHICLE_ACTION_ID_NONE 		-1

#define VEHICLE_PARAM_ON	(1)
#define VEHICLE_PARAM_OFF	(0)

native IsValidVehicle(vehicleid);

enum E_VEHICLE_STRUCT
{
	V_MODELID,
	Float: V_SPAWN_X,
	Float: V_SPAWN_Y,
	Float: V_SPAWN_Z,
	Float: V_SPAWN_ANGLE,
	V_COLOR_1,
	V_COLOR_2,
	V_RESPAWN_DELAY,
	V_ADDSIREN,
	V_ACTION_TYPE,
	V_ACTION_ID,
	V_DRIVER_ID,
	V_LIMIT,
	V_ALARM,
	Float: V_FUEL,
	Float: V_MILEAGE,
	Text3D: V_LABEL,
	Float: V_HEALTH,
	V_LAST_LOAD_TIME,
	V_ACTION_OWNER,
};

// ------------------------------------
enum E_VEHICLE_PARAMS_STRUCT
{
	V_ENGINE, 	// двигатель
	V_LIGHTS, 	// фары
	V_ALARM,	// сигнализация
	V_LOCK, 	// двери
	V_BONNET, 	// капот
	V_BOOT, 	// багажник
	V_OBJECTIVE // отображене стрелки
};

// ------------------------------------
enum E_VEHICE_INFO_STRUCT
{
	VI_NAME[99],	// название
 	VI_PRICE,		// гос. стоимость
	VT_RENT_PRICE,	// стоимость аренды
	VI_TYPE,		// тип
	VI_MAXSP,       //макс скорость
 	VI_USCOR        //ускорение 0-100
};

// ------------------------------------
new g_vehicle_data[MAX_VEHICLES][E_VEHICLE_STRUCT];
new 
	g_vehicle_default_values[E_VEHICLE_STRUCT] = 
{
	0,
	0.0,
	0.0,
	0.0,
	0.0,
	0,
	0,
	0,
	0,
	VEHICLE_ACTION_TYPE_NONE,
	VEHICLE_ACTION_ID_NONE,
	INVALID_PLAYER_ID,
	false,
	false,
	150.9,
	0.0,
	Text3D:-1,
	1000.0,
	0
};
new g_vehicle_params[MAX_VEHICLES][E_VEHICLE_PARAMS_STRUCT];

new const
    g_vehicle_info[2234][E_VEHICE_INFO_STRUCT] = 
{
    {"BMW X6M F16",              16000000,     8500, 2, 284, 4},     // 400
    {"VAZ 2101",             600000,      500,    0, 142, 22},     // 401
    {"Mersedes-Benz GT63s",          20000000,     6000,   2, 313, 3},     // 402
    {"Renault Premium",           25000000,          0,      0, 150, 15},     // 403
    {"VAZ 2107",            890000,      800,    0, 158, 17},     // 404
    {"Audi RS6 C7",   30000000,     8000,   1, 310, 4},     // 405
    {"ЗИЛ 131 Самосвал",    70000000,          0,      0},     // 406
    {"Пожарная машина 227",             70000000,          0,      0},     // 407
    {"Мусоровоз 21",           19000000,          0,      0},     // 408
    {"Limuzin Agado",              45000000,   50000, 2},     // 409
    {"Mercedes-Benz CLS63 AMG",  35300000,     7800,   1, 305, 4},     // 410
    {"Aston Martin DB11",         43500000,     3800,   0, 322, 4},     // 411
    {"VAZ 2106",            830000,      600,    0, 160, 17},     // 412
    {"Gazelle 3221",             2500000,          0,      0, 130, 11},     // 413
    {"Автобус",           70000000,          0,      0},     // 414
    {"Lamborghini Aventador S",             46000000,    15000,  2, 351, 3},     // 415
    {"Скорая",              200000000,          0,      0},     // 416
    {"Leviathn",            20000000,          0,      0},     // 417
    {"Volkswagen Multivan T6",            11000000,     6400,   0, 183, 9},     // 418
    {"Mercedes-Benz E420 W210",           5000000,     5000,   1, 250, 6},     // 419
    {"Audi RS6 C7 Рестайлинг",               0,          0,      0},     // 420
    {"Mercedes-Benz  S600 W140",          900000,     8000,   2, 250, 6},     // 421
    {"УАЗ Буханка",         30000000,     1000,   0},     // 422
    {"MrWhoop",             30000000,          0,      0},     // 423
    {"CMЗ",                 0,      100,    0},     // 424
    {"Hunter",              0,          0,      0},     // 425
    {"BMW M5 E39",            2900000,    38000,  2, 246, 5},     // 426
    {"Gazelle 3221",            48000000,          0,      0},     // 427
    {"Gazelle",           58000000,          0,      0},     // 428
    {"Mercedes-Benz GT-R",              36500000,    18000,  0, 319, 4},     // 429
    {"Speddy Predator",            30000000,          0,      0},     // 430
    {"Лиаз 677",            0,          0,      0},     // 431
    {"Танк",                500000000,          0,      0},     // 432
    {"Kamaz 2448",        29000000,          0,      0},     // 433
    {"Hotknife",            70000000,     7000,   1},     // 434
    {"Прицеп Kamaz",              0,          0,      0},     // 435
    {"Mitsubishi Lancer Evo X",         6000000,    16500,  1, 239, 5},     // 436
    {"Икарус",              0,          0,      0},     // 437
    {"Gazz 3481",               56000000,          0,      0},     // 438
    {"VAZ 2108",         1100000,      350,    0, 160, 14},     // 439
    {"Mercedes-Benz V-Class W447",               1300000,     0,      0, 205, 9},     // 440
    {"RCcar",               0,          0,      0},     // 441
    {"Volvo V60",              12000000,      100,    0, 235, 6},     // 442
    {"Автовоз",             0,          0,      0},     // 443
    {"Монстр",              0,          0,      0},     // 444
    {"Acura TSX",              7950000,     2400,   0, 256, 6},     // 445
    {"Speddy Squalo",              10000000,          0,      0},     // 446
    {"Водный верт",         0,          0,      0},     // 447
    {"Racer Pizzaboy",            5000000,          0,      0},     // 448
    {"Прицеп",            0,          0,      0},     // 449
    {"краш",              0,          0,      0},     // 450
    {"McLaren 600LT",             34000000,    22000,  2, 329, 3},     // 451
    {"Speeder Yacht 212",             150000000,          0,      0},     // 452
    {"Speeder Reefer",              150000000,          0,      0},     // 453
    {"Speeder",                120000000,          0,      0},     // 454
    {"Грейдер",             0,          0,      0},     // 455
    {"Gazzele 2011",            40000000,          0,      0},     // 456
    {"Гольф кар",           0,          0,      0},     // 457
    {"VAZ 2114",           1455000,     2400,   0, 160, 13},     // 458
    {"Gazzele 2901",              34000000,          0,      0},     // 459
    {"Водн самолет",        0,          0,      0},     // 460
    {"Ducati SuperSport S",            18300000,      700,    0, 240, 4},     // 461
    {"Racer Sport",          200000,      200,    0, 130, 10},     // 462
    {"Ducati XDiavel S",              30000000,     1200,   1, 260, 3},     // 463
    {"RCplane",             0,          0,      0},     // 464
    {"RCheli",              0,          0,      0},     // 465
    {"Bommer M5 F90",             24500000,    28000,  2, 312, 3},     // 466
    {"Mercedes-Benz  S600 W140",              4200000,      350,    0, 250, 6},     // 467
    {"Aprilla MXV 450",              900000,      400,    0, 200, 4},     // 468
    {"Gazzele Sparrow",             24500000,          0,      0},     // 469
    {"Gaz Tigr",               98000000,          0,      0},     // 470
    {"Квадроцикл",          1200000,     1200,   1},     // 471
    {"Моторная лодка",              900000,          0,      0},     // 472
    {"Гидроцикл",              0,          0,      0},     // 473
    {"самповкая",              0,      600,    0},     // 474
    {"Audi Q8",   17000000,    14500,  1, 238, 6},     // 475
    {"Истребитель",         0,          0,      0},     // 476
    {"Mazda RX-7",              14000000,     9000,   2, 249, 5},     // 477
    {"самп",            0,      450,    0},     // 478
    {"GAZ Volga 2410",           800000,     2400,   0, 170, 17},     // 479
    {"BMW Z4 M40i",               11900000,    28000,  2, 259, 5},     // 480
    {"Велосипед Аист",      0,       100,    0},     // 481
    {"Mercedes-Benz V-Class",             46000000,     520000, 0},     // 482
    {"Mercedes-Benz Sprinter 319CDL",            5000000,          0,      0, 182, 10},     // 483
    {"Теплоход",            34000000,          0,      0},     // 484
    {"Газ Аэро",            34000000,          0,      0},     // 485
    {"Бульдозер",           39000000,          0,      0},     // 486
    {"Вертолет",                0,          0,      0},     // 487
    {"News Верт",           0,          0,      0},     // 488
    {"Volvo XC90",      12200000,    19000,  1, 248, 6},     // 489
    {"Range Rover SVR",  16000000,    59000,  0, 262, 5},     // 490
    {"VAZ 2110",               1560000,     8000,   1, 160, 13},     // 491
    {"VAZ 2109",            1420000,     1800,   0, 162, 14},     // 492
    {"Speedy Yacht",              14260000,          0,      0},     // 493
    {"BMW I8 EDrive",             34600000,    56000,  0, 320, 4},     // 494
    {"Ford Raptor F-150",          15757000,    15000,  1, 211, 6},     // 495
    {"Volkswagen Golf GTI2",              1400000,      700,    0, 197, 8},     // 496
    {"Пол Верт",            0,          0,      0},     // 497
    {"Mercedes-Benz Sprinter",             3000000,          0,      0, 137, 12},     // 498
    {"ГАЗ 53",              40000000,          0,      0},     // 499
    {"ГАЗ 69",              70000000,      400,    0},     // 500
    {"RCgobl",              40000000,          0,      0},     // 501
    {"Nissan GT-R R35",             17900000,    56000,  0, 319, 3},     // 502
    {"Dodge Demon SRT",             16100000,    56000,  0, 322, 3},     // 503
    {"Bloodra",             0,          0,      0},     // 504
    {"Cadillac Escalade",            17200000,    42000,  2, 248, 6},     // 505
    {"Porsche 911 Carrera S",            16790000,    29000,  2, 309, 4},     // 506
    {"Audi A4",              1750000,     2400,   0, 238, 7},     // 507
    {"УАЗ Буханка",         1450000,     1000,   0},     // 508
    {"Велосипед 'Урал'",    0,       150,    0},     // 509
    {"Горный Велосипед",    0,      300,    0},     // 510
    {"Beagle",              0,          0,      0},     // 511
    {"Cropdast",            0,          0,      0},     // 512
    {"Stunt",               0,          0,      0},     // 513
    {"DAF XF16 Euro 6",         11500000,          0,      0},     // 514
    {"КАЗ",                 175000000,          0,      0},     // 515
    {"Volkswagen Polo",           2850000,     1800,   0, 238, 8},     // 516
    {"РАФ Латвия",          25850000,     1500,   0},     // 517
    {"ЕРАЗ 977",            2850000,     1000,   0},     // 518
    {"Shamal",              21850000,          0,      0},     // 519
    {"Истребитель",         0,          0,      0},     // 520
    {"BMW S 1000 RR",        17000000,      350,    0, 295, 3},     // 521
    {"Kawasaki Ninja H2R",             39000000,     6000,   2, 340, 3},     // 522
    {"Yamaha FZ-10",            14500000,      320,    0, 257, 3},     // 523
    {"Цементовоз",          0,          0,      0},     // 524
    {"Эвакуатор",           0,          0,      0},     // 525
    {"Infiniti Q60S",             13200000,     1600,   0, 266, 5},     // 526
    {"BMW M3 E46",             11050000,     2400,   0, 246, 5},     // 527
    {"Труповоз",            0,          0,      0},     // 528
    {"VAZ 2172",             300000,     2500,   0, 183, 11},     // 529
    {"Погрузщик",           0,          0,      0},     // 530
    {"Трактор",             0,          0,      0},     // 531
    {"Комбайн",             0,          0,      0},     // 532
    {"Audi R8 V10",             23000000,    15000,  1, 322, 3},     // 533
    {"BMW M3 E30",           1300000,     4000,   1, 239, 7},     // 534
    {"Slamvan",             0,     4000,   1},     // 535
    {"Volvo 242DL",               1250000,     3500,   1, 176, 11},     // 536
    {"Поезд",               0,          0,      0},     // 537
    {"Поезд",               0,          0,      0},     // 538
    {"Возд Подушка",        0,          0,      0},     // 539
    {"Mazda Sedan 3",            1380000,     1800,   0, 218, 8},     // 540
    {"Ferrari 488 GTB",              27500000,    42000,  2, 336, 3},     // 541
    {"Niva Urban",            1350000,     1300,   0, 140, 17},     // 542
    {"Chevrolette Camaro ZL1",              14600000,    48000,  0, 315, 4},     // 543
    {"Пожарка",             70500000,          0,      0},     // 544
    {"Москвич 400",         7500000,      100,    0},     // 545
    {"Hyundai Solaris 2021",            2830000,      600,    0, 200, 9},     // 546
    {"Vaz 2110",           1420000,      600,    0, 223, 9},     // 547
    {"Воен Верт",           0,          0,      0},     // 548
    {"VAZ 1111",             130000,      35,     0, 120, 24},     // 549
    {"Toyota Camry 3.5",             3400000,     1400,   0, 247, 6},     // 550
    {"Alfa Romeo Gullia",           4000000,     110,    0, 306, 4},     // 551
    {"Фургон уборщ",        0,     2100,   0},     // 552
    {"Кукурузник",          0,          0,      0},     // 553
    {"УАЗ 3303",            0,          0,      0},     // 554
    {"ZAZ 968",             120000,      50,     0, 118, 32},     // 555
    {"Монстр",              0,          0,      0},     // 556
    {"Монстр",              0,          0,      0},     // 557
    {"BMW M4 F84",              6500000,     4500,   1, 261, 4},     // 558
    {"Vaz 2110",       0,    16000,  1},     // 559
    {"Subaru WRX STI",              3200000,    26500,  1, 246, 6},     // 560
    {"Москвич 427",         3200000,      600,    0},     // 561
    {"Nissan Skyline R34",               1680000,    25000,  2, 250, 5},     // 562
    {"Спас верт",           0,          0,      0},     // 563
    {"RCtank",              0,          0,      0},     // 564
    {"Mercedes-Benz A45 AMG",            3800000,     1700,   0, 250, 5},     // 565
    {"ВАЗ 2104",            1950000,     1000,   0},     // 566
    {"Savana",              0,     2000,   0},     // 567
    {"Bandito",             0,      500,    0},     // 568
    {"Вагон",               0,          0,      0},     // 569
    {"Вагон",               0,          0,      0},     // 570
    {"Карт",                0,          0,      0},     // 571
    {"Газонокосилка",       0,          0,      0},     // 572 
    {"Ралли Грузовки",      0,    20000,  0},     // 573
    {"Уборш улиц",          0,          0,      0},     // 574
    {"ГАЗ 20",              40000000,      600,    0},     // 575
    {"АЗЛК 408",            0,      600,    0},     // 576
    {"AT 400",              0,          0,      0},     // 577
    {"ЗИЛ Борт",            0,          0,      0},     // 578
    {"Mercedes-Benz G65 AMG",             17050000,    48000,  0, 223, 5},     // 579
    {"ГАЗ 13",              0,    15000,  0},     // 580
    {"Suzuki GSX-R750",              11000000,      700,    0, 276, 3},     // 581
    {"Ford Transit",          45000000,          0,      0},     // 582
    {"Tug",                 32000000,          0,      0},     // 583
    {"Цистерна",            0,          0,      0},     // 584
    {"VAZ 2115",             1210000,     2800,   0, 160, 13},     // 585
    {"Yamaha YZF-R6",   6000000,      400,    0, 260, 3},     // 586
    {"Ford Focus RS",               2800000,    24000,  0, 265, 5},     // 587
    {"Лиаз Кафе",           0,          0,      0},     // 588
    {"Volkswagen Golf GTI",                2400000,    12400,  0, 250, 7},     // 589
    {"Вагон",               0,          0,      0},     // 590
    {"Прицеп",              0,          0,      0},     // 591
    {"Androm",              0,          0,      0},     // 592
    {"Dodo",                0,          0,      0},     // 593
    {"RCcam",               0,          0,      0},     // 594
    {"Launch",              0,          0,      0},     // 595
    {"BMW M5 F90",             120000000,          0,      0},     // 596
    {"VAZ 2170",             76000000,          0,      0},     // 597
    {"Volkswagen Jetta",             95000000,          0,      0},     // 598
    {"samp мил",             0,          0,      0},     // 599
    {"АЗЛК 2335",           0,      800,    0},     // 600
    {"БДРМ",                0,          0,      0},     // 601
    {"Аlpha",               0,    34000,  0},     // 602
    {"Ford Mustang GT",             3600000,    17000,  0, 277, 4},     // 603
    {"Porsche Panamera S",            18400000,          0,      0, 310, 4},     // 604
    {"Космоа вто",          0,          0,      0},     // 605
    {"Прицеп ",             0,          0,      0},     // 606
    {"Прицеп ",             0,          0,      0},     // 607
    {"Лестница",            0,          0,      0},     // 608
    {"Авиа",                0,          0,      0},     // 609
    {"Плуг",                0,          0,      0},     // 610
    {"Ford Crown Victoria",        12000000,          0,      0},      // 611
    {"Lincoln Navigator",        12000000,          0,      0},      // 612
    {"ZIL 4104",        12000000,          0,      0},      // 613
    {"Mercedes-Benz CLK GTR",        12000000,          0,      0},      // 614
    {"Chevrolet Silverado 6x6",        14000000,          0,      0},      // 615
    {"BMW M4 GT3",        12000000,          0,      0},      // 616
    {"Ford Torino",        12000000,          0,      0},      // 617
    {"Lada Kalina Sport",        7000000,          0,      0},      // 618
    {"Mercedes-Benz AMG Project One",        12000000,          0,      0},      // 619
    {"Hudson Hornet",        12000000,          0,      0},      // 620
    {"Chevrolet 3100 Tow Truck",        14000000,          0,      0},      // 621
    {"Ferrari Daytona",        14000000,          0,      0},      // 622
    {"Lamborghini Murcielago",        14000000,          0,      0},      // 623
    {"Dodge Ice Charger",        14000000,          0,      0},      // 624
    {"FORD FALCON XBщ",        14000000,          0,      0},      // 625
    {"Hot-Road F132",        74000000,          0,      0},      // 626
    {"SCG 003",        74000000,          0,      0},      // 627
    {"Mitsubishi Eclipse",        14000000,          0,      0},      // 628
    {"Smart Fortwo 2",        14000000,          0,      0},      // 629
    {"Chevrolet Bel Air",        14000000,          0,      0},      // 630
    {"Mercedes 280SL Pagoda",        14000000,          0,      0},      // 631
    {"Chevrolet Camaro SS",        34000000,          0,      0},      // 632
    {"Honda CB 650R",        14000000,          0,      0},      // 633
    {"Ford Bronco",        14000000,          0,      0},      // 634
    {"Boomer G3",        14000000,          0,      0},      // 635
    {"Porsche 911 Dakar",        14000000,          0,      0},      // 636
    {"Punker",        14000000,          0,      0},      // 637
    {"Ferrari 812 Superfast",        0,          0,      0},      // 638
    {"Renault R5 Turbo 3E",        0,          0,      0},      // 639
    {"Boss 302 Mustang",        0,          0,      0},      // 640
    {"Nissan 240SX",        0,          0,      0},      // 641
    {"Pagani Zonda",        0,          0,      0},      // 642
    {"KIA Carnival",        0,          0,      0},      // 643
    {"Bugatti W16 Mistral",        0,          0,      0},      // 644
    {"Koenigsegg Regera",        0,          0,      0},      // 645
    {"Неизвестное авто",        0,          0,      0},      // 646
    {"Неизвестное авто",        0,          0,      0},      // 647
    {"Неизвестное авто",        0,          0,      0},      // 648
    {"Неизвестное авто",        0,          0,      0},      // 649
    {"Неизвестное авто",        0,          0,      0},      // 650
    {"Неизвестное авто",        0,          0,      0},      // 651
    {"Неизвестное авто",        0,          0,      0},      // 652
    {"Неизвестное авто",        0,          0,      0},      // 653
    {"Неизвестное авто",        0,          0,      0},      // 654
    {"Неизвестное авто",        0,          0,      0},      // 655
    {"Неизвестное авто",        0,          0,      0},      // 656
    {"Неизвестное авто",        0,          0,      0},      // 657
    {"Неизвестное авто",        0,          0,      0},      // 658
    {"Неизвестное авто",        0,          0,      0},      // 659
    {"Неизвестное авто",        0,          0,      0},      // 660
    {"Неизвестное авто",        0,          0,      0},      // 661
    {"Неизвестное авто",        0,          0,      0},      // 662
    {"Неизвестное авто",        0,          0,      0},      // 663
    {"Неизвестное авто",        0,          0,      0},      // 664
    {"Неизвестное авто",        0,          0,      0},      // 665
    {"Неизвестное авто",        0,          0,      0},      // 666
    {"Неизвестное авто",        0,          0,      0},      // 667
    {"Неизвестное авто",        0,          0,      0},      // 668
    {"Неизвестное авто",        0,          0,      0},      // 669
    {"Неизвестное авто",        0,          0,      0},      // 670
    {"Неизвестное авто",        0,          0,      0},      // 671
    {"Неизвестное авто",        0,          0,      0},      // 672
    {"Неизвестное авто",        0,          0,      0},      // 673
    {"Неизвестное авто",        0,          0,      0},      // 674
    {"Неизвестное авто",        0,          0,      0},      // 675
    {"Неизвестное авто",        0,          0,      0},      // 676
    {"Неизвестное авто",        0,          0,      0},      // 677
    {"Неизвестное авто",        0,          0,      0},      // 678
    {"Неизвестное авто",        0,          0,      0},      // 679
    {"Неизвестное авто",        0,          0,      0},      // 680
    {"Неизвестное авто",        0,          0,      0},      // 681
    {"Неизвестное авто",        0,          0,      0},      // 682
    {"Неизвестное авто",        0,          0,      0},      // 683
    {"Неизвестное авто",        0,          0,      0},      // 684
    {"Неизвестное авто",        0,          0,      0},      // 685
    {"Неизвестное авто",        0,          0,      0},      // 686
    {"Неизвестное авто",        0,          0,      0},      // 687
    {"Неизвестное авто",        0,          0,      0},      // 688
    {"Неизвестное авто",        0,          0,      0},      // 689
    {"Неизвестное авто",        0,          0,      0},      // 690
    {"Неизвестное авто",        0,          0,      0},      // 691
    {"Неизвестное авто",        0,          0,      0},      // 692
    {"Неизвестное авто",        0,          0,      0},      // 693
    {"Неизвестное авто",        0,          0,      0},      // 694
    {"Неизвестное авто",        0,          0,      0},      // 695
    {"Неизвестное авто",        0,          0,      0},      // 696
    {"Неизвестное авто",        0,          0,      0},      // 697
    {"Неизвестное авто",        0,          0,      0},      // 698
    {"Неизвестное авто",        0,          0,      0},      // 699
    {"Неизвестное авто",        0,          0,      0},      // 700
    {"Неизвестное авто",        0,          0,      0},      // 701
    {"Неизвестное авто",        0,          0,      0},      // 702
    {"Неизвестное авто",        0,          0,      0},      // 703
    {"Неизвестное авто",        0,          0,      0},      // 704
    {"Неизвестное авто",        0,          0,      0},      // 705
    {"Неизвестное авто",        0,          0,      0},      // 706
    {"Неизвестное авто",        0,          0,      0},      // 707
    {"Неизвестное авто",        0,          0,      0},      // 708
    {"Неизвестное авто",        0,          0,      0},      // 709
    {"Неизвестное авто",        0,          0,      0},      // 710
    {"Неизвестное авто",        0,          0,      0},      // 711
    {"Неизвестное авто",        0,          0,      0},      // 712
    {"Неизвестное авто",        0,          0,      0},      // 713
    {"Неизвестное авто",        0,          0,      0},      // 714
    {"Неизвестное авто",        0,          0,      0},      // 715
    {"Неизвестное авто",        0,          0,      0},      // 716
    {"Неизвестное авто",        0,          0,      0},      // 717
    {"Неизвестное авто",        0,          0,      0},      // 718
    {"Неизвестное авто",        0,          0,      0},      // 719
    {"Неизвестное авто",        0,          0,      0},      // 720
    {"Неизвестное авто",        0,          0,      0},      // 721
    {"Неизвестное авто",        0,          0,      0},      // 722
    {"Неизвестное авто",        0,          0,      0},      // 723
    {"Неизвестное авто",        0,          0,      0},      // 724
    {"Неизвестное авто",        0,          0,      0},      // 725
    {"Неизвестное авто",        0,          0,      0},      // 726
    {"Неизвестное авто",        0,          0,      0},      // 727
    {"Неизвестное авто",        0,          0,      0},      // 728
    {"Неизвестное авто",        0,          0,      0},      // 729
    {"Неизвестное авто",        0,          0,      0},      // 730
    {"Неизвестное авто",        0,          0,      0},      // 731
    {"Неизвестное авто",        0,          0,      0},      // 732
    {"Неизвестное авто",        0,          0,      0},      // 733
    {"Неизвестное авто",        0,          0,      0},      // 734
    {"Неизвестное авто",        0,          0,      0},      // 735
    {"Неизвестное авто",        0,          0,      0},      // 736
    {"Неизвестное авто",        0,          0,      0},      // 737
    {"Неизвестное авто",        0,          0,      0},      // 738
    {"Неизвестное авто",        0,          0,      0},      // 739
    {"Неизвестное авто",        0,          0,      0},      // 740
    {"Неизвестное авто",        0,          0,      0},      // 741
    {"Неизвестное авто",        0,          0,      0},      // 742
    {"Неизвестное авто",        0,          0,      0},      // 743
    {"Неизвестное авто",        0,          0,      0},      // 744
    {"Неизвестное авто",        0,          0,      0},      // 745
    {"Неизвестное авто",        0,          0,      0},      // 746
    {"Неизвестное авто",        0,          0,      0},      // 747
    {"Неизвестное авто",        0,          0,      0},      // 748
    {"Неизвестное авто",        0,          0,      0},      // 749
    {"Неизвестное авто",        0,          0,      0},      // 750
    {"Неизвестное авто",        0,          0,      0},      // 751
    {"Неизвестное авто",        0,          0,      0},      // 752
    {"Неизвестное авто",        0,          0,      0},      // 753
    {"Неизвестное авто",        0,          0,      0},      // 754
    {"Неизвестное авто",        0,          0,      0},      // 755
    {"Неизвестное авто",        0,          0,      0},      // 756
    {"Неизвестное авто",        0,          0,      0},      // 757
    {"Неизвестное авто",        0,          0,      0},      // 758
    {"Неизвестное авто",        0,          0,      0},      // 759
    {"Неизвестное авто",        0,          0,      0},      // 760
    {"Неизвестное авто",        0,          0,      0},      // 761
    {"Неизвестное авто",        0,          0,      0},      // 762
    {"Неизвестное авто",        0,          0,      0},      // 763
    {"Неизвестное авто",        0,          0,      0},      // 764
    {"Неизвестное авто",        0,          0,      0},      // 765
    {"Неизвестное авто",        0,          0,      0},      // 766
    {"Неизвестное авто",        0,          0,      0},      // 767
    {"Неизвестное авто",        0,          0,      0},      // 768
    {"Неизвестное авто",        0,          0,      0},      // 769
    {"Неизвестное авто",        0,          0,      0},      // 770
    {"Неизвестное авто",        0,          0,      0},      // 771
    {"Неизвестное авто",        0,          0,      0},      // 772
    {"Неизвестное авто",        0,          0,      0},      // 773
    {"Неизвестное авто",        0,          0,      0},      // 774
    {"Неизвестное авто",        0,          0,      0},      // 775
    {"Неизвестное авто",        0,          0,      0},      // 776
    {"Неизвестное авто",        0,          0,      0},      // 777
    {"Неизвестное авто",        0,          0,      0},      // 778
    {"Неизвестное авто",        0,          0,      0},      // 779
    {"Неизвестное авто",        0,          0,      0},      // 780
    {"Неизвестное авто",        0,          0,      0},      // 781
    {"Неизвестное авто",        0,          0,      0},      // 782
    {"Неизвестное авто",        0,          0,      0},      // 783
    {"Неизвестное авто",        0,          0,      0},      // 784
    {"Неизвестное авто",        0,          0,      0},      // 785
    {"Неизвестное авто",        0,          0,      0},      // 786
    {"Неизвестное авто",        0,          0,      0},      // 787
    {"Неизвестное авто",        0,          0,      0},      // 788
    {"Неизвестное авто",        0,          0,      0},      // 789
    {"Неизвестное авто",        0,          0,      0},      // 790
    {"Неизвестное авто",        0,          0,      0},      // 791
    {"Неизвестное авто",        0,          0,      0},      // 792
    {"Неизвестное авто",        0,          0,      0},      // 793
    {"Неизвестное авто",        0,          0,      0},      // 794
    {"Неизвестное авто",        0,          0,      0},      // 795
    {"Неизвестное авто",        0,          0,      0},      // 796
    {"Неизвестное авто",        0,          0,      0},      // 797
    {"Неизвестное авто",        0,          0,      0},      // 798
    {"Неизвестное авто",        0,          0,      0},      // 799
    {"Неизвестное авто",        0,          0,      0},      // 800
    {"Неизвестное авто",        0,          0,      0},      // 801
    {"Неизвестное авто",        0,          0,      0},      // 802
    {"Неизвестное авто",        0,          0,      0},      // 803
    {"Неизвестное авто",        0,          0,      0},      // 804
    {"Неизвестное авто",        0,          0,      0},      // 805
    {"Неизвестное авто",        0,          0,      0},      // 806
    {"Неизвестное авто",        0,          0,      0},      // 807
    {"Неизвестное авто",        0,          0,      0},      // 808
    {"Неизвестное авто",        0,          0,      0},      // 809
    {"Неизвестное авто",        0,          0,      0},      // 810
    {"Неизвестное авто",        0,          0,      0},      // 811
    {"Неизвестное авто",        0,          0,      0},      // 812
    {"Неизвестное авто",        0,          0,      0},      // 813
    {"Неизвестное авто",        0,          0,      0},      // 814
    {"Неизвестное авто",        0,          0,      0},      // 815
    {"Неизвестное авто",        0,          0,      0},      // 816
    {"Неизвестное авто",        0,          0,      0},      // 817
    {"Неизвестное авто",        0,          0,      0},      // 818
    {"Неизвестное авто",        0,          0,      0},      // 819
    {"Неизвестное авто",        0,          0,      0},      // 820
    {"Неизвестное авто",        0,          0,      0},      // 821
    {"Неизвестное авто",        0,          0,      0},      // 822
    {"Неизвестное авто",        0,          0,      0},      // 823
    {"Неизвестное авто",        0,          0,      0},      // 824
    {"Неизвестное авто",        0,          0,      0},      // 825
    {"Неизвестное авто",        0,          0,      0},      // 826
    {"Неизвестное авто",        0,          0,      0},      // 827
    {"Неизвестное авто",        0,          0,      0},      // 828
    {"Неизвестное авто",        0,          0,      0},      // 829
    {"Неизвестное авто",        0,          0,      0},      // 830
    {"Неизвестное авто",        0,          0,      0},      // 831
    {"Неизвестное авто",        0,          0,      0},      // 832
    {"Неизвестное авто",        0,          0,      0},      // 833
    {"Неизвестное авто",        0,          0,      0},      // 834
    {"Неизвестное авто",        0,          0,      0},      // 835
    {"Неизвестное авто",        0,          0,      0},      // 836
    {"Неизвестное авто",        0,          0,      0},      // 837
    {"Неизвестное авто",        0,          0,      0},      // 838
    {"Неизвестное авто",        0,          0,      0},      // 839
    {"Неизвестное авто",        0,          0,      0},      // 840
    {"Неизвестное авто",        0,          0,      0},      // 841
    {"Неизвестное авто",        0,          0,      0},      // 842
    {"Неизвестное авто",        0,          0,      0},      // 843
    {"Неизвестное авто",        0,          0,      0},      // 844
    {"Неизвестное авто",        0,          0,      0},      // 845
    {"Неизвестное авто",        0,          0,      0},      // 846
    {"Неизвестное авто",        0,          0,      0},      // 847
    {"Неизвестное авто",        0,          0,      0},      // 848
    {"Неизвестное авто",        0,          0,      0},      // 849
    {"Неизвестное авто",        0,          0,      0},      // 850
    {"Неизвестное авто",        0,          0,      0},      // 851
    {"Неизвестное авто",        0,          0,      0},      // 852
    {"Неизвестное авто",        0,          0,      0},      // 853
    {"Неизвестное авто",        0,          0,      0},      // 854
    {"Неизвестное авто",        0,          0,      0},      // 855
    {"Неизвестное авто",        0,          0,      0},      // 856
    {"Неизвестное авто",        0,          0,      0},      // 857
    {"Неизвестное авто",        0,          0,      0},      // 858
    {"Неизвестное авто",        0,          0,      0},      // 859
    {"Неизвестное авто",        0,          0,      0},      // 860
    {"Неизвестное авто",        0,          0,      0},      // 861
    {"Неизвестное авто",        0,          0,      0},      // 862
    {"Неизвестное авто",        0,          0,      0},      // 863
    {"Неизвестное авто",        0,          0,      0},      // 864
    {"Неизвестное авто",        0,          0,      0},      // 865
    {"Неизвестное авто",        0,          0,      0},      // 866
    {"Неизвестное авто",        0,          0,      0},      // 867
    {"Неизвестное авто",        0,          0,      0},      // 868
    {"Неизвестное авто",        0,          0,      0},      // 869
    {"Неизвестное авто",        0,          0,      0},      // 870
    {"Неизвестное авто",        0,          0,      0},      // 871
    {"Неизвестное авто",        0,          0,      0},      // 872
    {"Неизвестное авто",        0,          0,      0},      // 873
    {"Неизвестное авто",        0,          0,      0},      // 874
    {"Неизвестное авто",        0,          0,      0},      // 875
    {"Неизвестное авто",        0,          0,      0},      // 876
    {"Неизвестное авто",        0,          0,      0},      // 877
    {"Неизвестное авто",        0,          0,      0},      // 878
    {"Неизвестное авто",        0,          0,      0},      // 879
    {"Неизвестное авто",        0,          0,      0},      // 880
    {"Неизвестное авто",        0,          0,      0},      // 881
    {"Неизвестное авто",        0,          0,      0},      // 882
    {"Неизвестное авто",        0,          0,      0},      // 883
    {"Неизвестное авто",        0,          0,      0},      // 884
    {"Неизвестное авто",        0,          0,      0},      // 885
    {"Неизвестное авто",        0,          0,      0},      // 886
    {"Неизвестное авто",        0,          0,      0},      // 887
    {"Неизвестное авто",        0,          0,      0},      // 888
    {"Неизвестное авто",        0,          0,      0},      // 889
    {"Неизвестное авто",        0,          0,      0},      // 890
    {"Неизвестное авто",        0,          0,      0},      // 891
    {"Неизвестное авто",        0,          0,      0},      // 892
    {"Неизвестное авто",        0,          0,      0},      // 893
    {"Неизвестное авто",        0,          0,      0},      // 894
    {"Неизвестное авто",        0,          0,      0},      // 895
    {"Неизвестное авто",        0,          0,      0},      // 896
    {"Неизвестное авто",        0,          0,      0},      // 897
    {"Неизвестное авто",        0,          0,      0},      // 898
    {"Неизвестное авто",        0,          0,      0},      // 899
    {"Неизвестное авто",        0,          0,      0},      // 900
    {"Неизвестное авто",        0,          0,      0},      // 901
    {"Неизвестное авто",        0,          0,      0},      // 902
    {"Неизвестное авто",        0,          0,      0},      // 903
    {"Неизвестное авто",        0,          0,      0},      // 904
    {"Неизвестное авто",        0,          0,      0},      // 905
    {"Неизвестное авто",        0,          0,      0},      // 906
    {"Неизвестное авто",        0,          0,      0},      // 907
    {"Неизвестное авто",        0,          0,      0},      // 908
    {"Неизвестное авто",        0,          0,      0},      // 909
    {"Неизвестное авто",        0,          0,      0},      // 910
    {"Неизвестное авто",        0,          0,      0},      // 911
    {"Неизвестное авто",        0,          0,      0},      // 912
    {"Неизвестное авто",        0,          0,      0},      // 913
    {"Неизвестное авто",        0,          0,      0},      // 914
    {"Неизвестное авто",        0,          0,      0},      // 915
    {"Неизвестное авто",        0,          0,      0},      // 916
    {"Неизвестное авто",        0,          0,      0},      // 917
    {"Неизвестное авто",        0,          0,      0},      // 918
    {"Неизвестное авто",        0,          0,      0},      // 919
    {"Неизвестное авто",        0,          0,      0},      // 920
    {"Неизвестное авто",        0,          0,      0},      // 921
    {"Неизвестное авто",        0,          0,      0},      // 922
    {"Неизвестное авто",        0,          0,      0},      // 923
    {"Неизвестное авто",        0,          0,      0},      // 924
    {"Неизвестное авто",        0,          0,      0},      // 925
    {"Неизвестное авто",        0,          0,      0},      // 926
    {"Неизвестное авто",        0,          0,      0},      // 927
    {"Неизвестное авто",        0,          0,      0},      // 928
    {"Неизвестное авто",        0,          0,      0},      // 929
    {"Неизвестное авто",        0,          0,      0},      // 930
    {"Неизвестное авто",        0,          0,      0},      // 931
    {"Неизвестное авто",        0,          0,      0},      // 932
    {"Неизвестное авто",        0,          0,      0},      // 933
    {"Неизвестное авто",        0,          0,      0},      // 934
    {"Неизвестное авто",        0,          0,      0},      // 935
    {"Неизвестное авто",        0,          0,      0},      // 936
    {"Неизвестное авто",        0,          0,      0},      // 937
    {"Неизвестное авто",        0,          0,      0},      // 938
    {"Неизвестное авто",        0,          0,      0},      // 939
    {"Неизвестное авто",        0,          0,      0},      // 940
    {"Неизвестное авто",        0,          0,      0},      // 941
    {"Неизвестное авто",        0,          0,      0},      // 942
    {"Неизвестное авто",        0,          0,      0},      // 943
    {"Неизвестное авто",        0,          0,      0},      // 944
    {"Неизвестное авто",        0,          0,      0},      // 945
    {"Неизвестное авто",        0,          0,      0},      // 946
    {"Неизвестное авто",        0,          0,      0},      // 947
    {"Неизвестное авто",        0,          0,      0},      // 948
    {"Неизвестное авто",        0,          0,      0},      // 949
    {"Неизвестное авто",        0,          0,      0},      // 950
    {"Неизвестное авто",        0,          0,      0},      // 951
    {"Неизвестное авто",        0,          0,      0},      // 952
    {"Неизвестное авто",        0,          0,      0},      // 953
    {"Неизвестное авто",        0,          0,      0},      // 954
    {"Неизвестное авто",        0,          0,      0},      // 955
    {"Неизвестное авто",        0,          0,      0},      // 956
    {"Неизвестное авто",        0,          0,      0},      // 957
    {"Неизвестное авто",        0,          0,      0},      // 958
    {"Неизвестное авто",        0,          0,      0},      // 959
    {"Неизвестное авто",        0,          0,      0},      // 960
    {"Неизвестное авто",        0,          0,      0},      // 961
    {"Неизвестное авто",        0,          0,      0},      // 962
    {"Неизвестное авто",        0,          0,      0},      // 963
    {"Неизвестное авто",        0,          0,      0},      // 964
    {"Неизвестное авто",        0,          0,      0},      // 965
    {"Неизвестное авто",        0,          0,      0},      // 966
    {"Неизвестное авто",        0,          0,      0},      // 967
    {"Неизвестное авто",        0,          0,      0},      // 968
    {"Неизвестное авто",        0,          0,      0},      // 969
    {"Неизвестное авто",        0,          0,      0},      // 970
    {"Неизвестное авто",        0,          0,      0},      // 971
    {"Неизвестное авто",        0,          0,      0},      // 972
    {"Неизвестное авто",        0,          0,      0},      // 973
    {"Неизвестное авто",        0,          0,      0},      // 974
    {"Неизвестное авто",        0,          0,      0},      // 975
    {"Неизвестное авто",        0,          0,      0},      // 976
    {"Неизвестное авто",        0,          0,      0},      // 977
    {"Неизвестное авто",        0,          0,      0},      // 978
    {"Неизвестное авто",        0,          0,      0},      // 979
    {"Неизвестное авто",        0,          0,      0},      // 980
    {"Неизвестное авто",        0,          0,      0},      // 981
    {"Неизвестное авто",        0,          0,      0},      // 982
    {"Неизвестное авто",        0,          0,      0},      // 983
    {"Неизвестное авто",        0,          0,      0},      // 984
    {"Неизвестное авто",        0,          0,      0},      // 985
    {"Неизвестное авто",        0,          0,      0},      // 986
    {"Неизвестное авто",        0,          0,      0},      // 987
    {"Неизвестное авто",        0,          0,      0},      // 988
    {"Неизвестное авто",        0,          0,      0},      // 989
    {"Неизвестное авто",        0,          0,      0},      // 990
    {"Неизвестное авто",        0,          0,      0},      // 991
    {"Неизвестное авто",        0,          0,      0},      // 992
    {"Неизвестное авто",        0,          0,      0},      // 993
    {"Неизвестное авто",        0,          0,      0},      // 994
    {"Неизвестное авто",        0,          0,      0},      // 995
    {"Неизвестное авто",        0,          0,      0},      // 996
    {"Неизвестное авто",        0,          0,      0},      // 997
    {"Неизвестное авто",        0,          0,      0},      // 998
    {"Неизвестное авто",        0,          0,      0},      // 999
    {"Неизвестное авто",        0,          0,      0},      // 1000
    {"Неизвестное авто",        0,          0,      0},      // 1001
    {"Неизвестное авто",        0,          0,      0},      // 1002
    {"Неизвестное авто",        0,          0,      0},      // 1003
    {"Неизвестное авто",        0,          0,      0},      // 1004
    {"Неизвестное авто",        0,          0,      0},      // 1005
    {"Неизвестное авто",        0,          0,      0},      // 1006
    {"Неизвестное авто",        0,          0,      0},      // 1007
    {"Неизвестное авто",        0,          0,      0},      // 1008
    {"Неизвестное авто",        0,          0,      0},      // 1009
    {"Неизвестное авто",        0,          0,      0},      // 1010
    {"Неизвестное авто",        0,          0,      0},      // 1011
    {"Неизвестное авто",        0,          0,      0},      // 1012
    {"Неизвестное авто",        0,          0,      0},      // 1013
    {"Неизвестное авто",        0,          0,      0},      // 1014
    {"Неизвестное авто",        0,          0,      0},      // 1015
    {"Неизвестное авто",        0,          0,      0},      // 1016
    {"Неизвестное авто",        0,          0,      0},      // 1017
    {"Неизвестное авто",        0,          0,      0},      // 1018
    {"Неизвестное авто",        0,          0,      0},      // 1019
    {"Неизвестное авто",        0,          0,      0},      // 1020
    {"Неизвестное авто",        0,          0,      0},      // 1021
    {"Неизвестное авто",        0,          0,      0},      // 1022
    {"Неизвестное авто",        0,          0,      0},      // 1023
    {"Неизвестное авто",        0,          0,      0},      // 1024
    {"Неизвестное авто",        0,          0,      0},      // 1025
    {"Неизвестное авто",        0,          0,      0},      // 1026
    {"Неизвестное авто",        0,          0,      0},      // 1027
    {"Неизвестное авто",        0,          0,      0},      // 1028
    {"Неизвестное авто",        0,          0,      0},      // 1029
    {"Неизвестное авто",        0,          0,      0},      // 1030
    {"Неизвестное авто",        0,          0,      0},      // 1031
    {"Неизвестное авто",        0,          0,      0},      // 1032
    {"Неизвестное авто",        0,          0,      0},      // 1033
    {"Неизвестное авто",        0,          0,      0},      // 1034
    {"Неизвестное авто",        0,          0,      0},      // 1035
    {"Неизвестное авто",        0,          0,      0},      // 1036
    {"Неизвестное авто",        0,          0,      0},      // 1037
    {"Неизвестное авто",        0,          0,      0},      // 1038
    {"Неизвестное авто",        0,          0,      0},      // 1039
    {"Неизвестное авто",        0,          0,      0},      // 1040
    {"Неизвестное авто",        0,          0,      0},      // 1041
    {"Неизвестное авто",        0,          0,      0},      // 1042
    {"Неизвестное авто",        0,          0,      0},      // 1043
    {"Неизвестное авто",        0,          0,      0},      // 1044
    {"Неизвестное авто",        0,          0,      0},      // 1045
    {"Неизвестное авто",        0,          0,      0},      // 1046
    {"Неизвестное авто",        0,          0,      0},      // 1047
    {"Неизвестное авто",        0,          0,      0},      // 1048
    {"Неизвестное авто",        0,          0,      0},      // 1049
    {"Неизвестное авто",        0,          0,      0},      // 1050
    {"Неизвестное авто",        0,          0,      0},      // 1051
    {"Неизвестное авто",        0,          0,      0},      // 1052
    {"Неизвестное авто",        0,          0,      0},      // 1053
    {"Неизвестное авто",        0,          0,      0},      // 1054
    {"Неизвестное авто",        0,          0,      0},      // 1055
    {"Неизвестное авто",        0,          0,      0},      // 1056
    {"Неизвестное авто",        0,          0,      0},      // 1057
    {"Неизвестное авто",        0,          0,      0},      // 1058
    {"Неизвестное авто",        0,          0,      0},      // 1059
    {"Неизвестное авто",        0,          0,      0},      // 1060
    {"Неизвестное авто",        0,          0,      0},      // 1061
    {"Неизвестное авто",        0,          0,      0},      // 1062
    {"Неизвестное авто",        0,          0,      0},      // 1063
    {"Неизвестное авто",        0,          0,      0},      // 1064
    {"Неизвестное авто",        0,          0,      0},      // 1065
    {"Неизвестное авто",        0,          0,      0},      // 1066
    {"Неизвестное авто",        0,          0,      0},      // 1067
    {"Неизвестное авто",        0,          0,      0},      // 1068
    {"Неизвестное авто",        0,          0,      0},      // 1069
    {"Неизвестное авто",        0,          0,      0},      // 1070
    {"Неизвестное авто",        0,          0,      0},      // 1071
    {"Неизвестное авто",        0,          0,      0},      // 1072
    {"Неизвестное авто",        0,          0,      0},      // 1073
    {"Неизвестное авто",        0,          0,      0},      // 1074
    {"Неизвестное авто",        0,          0,      0},      // 1075
    {"Неизвестное авто",        0,          0,      0},      // 1076
    {"Неизвестное авто",        0,          0,      0},      // 1077
    {"Неизвестное авто",        0,          0,      0},      // 1078
    {"Неизвестное авто",        0,          0,      0},      // 1079
    {"Неизвестное авто",        0,          0,      0},      // 1080
    {"Неизвестное авто",        0,          0,      0},      // 1081
    {"Неизвестное авто",        0,          0,      0},      // 1082
    {"Неизвестное авто",        0,          0,      0},      // 1083
    {"Неизвестное авто",        0,          0,      0},      // 1084
    {"Неизвестное авто",        0,          0,      0},      // 1085
    {"Неизвестное авто",        0,          0,      0},      // 1086
    {"Неизвестное авто",        0,          0,      0},      // 1087
    {"Неизвестное авто",        0,          0,      0},      // 1088
    {"Неизвестное авто",        0,          0,      0},      // 1089
    {"Неизвестное авто",        0,          0,      0},      // 1090
    {"Неизвестное авто",        0,          0,      0},      // 1091
    {"Неизвестное авто",        0,          0,      0},      // 1092
    {"Неизвестное авто",        0,          0,      0},      // 1093
    {"Неизвестное авто",        0,          0,      0},      // 1094
    {"Неизвестное авто",        0,          0,      0},      // 1095
    {"Неизвестное авто",        0,          0,      0},      // 1096
    {"Неизвестное авто",        0,          0,      0},      // 1097
    {"Неизвестное авто",        0,          0,      0},      // 1098
    {"Неизвестное авто",        0,          0,      0},      // 1099
    {"Неизвестное авто",        0,          0,      0},      // 1100
    {"Неизвестное авто",        0,          0,      0},      // 1101
    {"Неизвестное авто",        0,          0,      0},      // 1102
    {"Неизвестное авто",        0,          0,      0},      // 1103
    {"Неизвестное авто",        0,          0,      0},      // 1104
    {"Неизвестное авто",        0,          0,      0},      // 1105
    {"Неизвестное авто",        0,          0,      0},      // 1106
    {"Неизвестное авто",        0,          0,      0},      // 1107
    {"Неизвестное авто",        0,          0,      0},      // 1108
    {"Неизвестное авто",        0,          0,      0},      // 1109
    {"Неизвестное авто",        0,          0,      0},      // 1110
    {"Неизвестное авто",        0,          0,      0},      // 1111
    {"Неизвестное авто",        0,          0,      0},      // 1112
    {"Неизвестное авто",        0,          0,      0},      // 1113
    {"Неизвестное авто",        0,          0,      0},      // 1114
    {"Неизвестное авто",        0,          0,      0},      // 1115
    {"Неизвестное авто",        0,          0,      0},      // 1116
    {"Неизвестное авто",        0,          0,      0},      // 1117
    {"Неизвестное авто",        0,          0,      0},      // 1118
    {"Неизвестное авто",        0,          0,      0},      // 1119
    {"Неизвестное авто",        0,          0,      0},      // 1120
    {"Неизвестное авто",        0,          0,      0},      // 1121
    {"Неизвестное авто",        0,          0,      0},      // 1122
    {"Неизвестное авто",        0,          0,      0},      // 1123
    {"Неизвестное авто",        0,          0,      0},      // 1124
    {"Неизвестное авто",        0,          0,      0},      // 1125
    {"Неизвестное авто",        0,          0,      0},      // 1126
    {"Неизвестное авто",        0,          0,      0},      // 1127
    {"Неизвестное авто",        0,          0,      0},      // 1128
    {"Неизвестное авто",        0,          0,      0},      // 1129
    {"Неизвестное авто",        0,          0,      0},      // 1130
    {"Неизвестное авто",        0,          0,      0},      // 1131
    {"Неизвестное авто",        0,          0,      0},      // 1132
    {"Неизвестное авто",        0,          0,      0},      // 1133
    {"Неизвестное авто",        0,          0,      0},      // 1134
    {"Неизвестное авто",        0,          0,      0},      // 1135
    {"Неизвестное авто",        0,          0,      0},      // 1136
    {"Неизвестное авто",        0,          0,      0},      // 1137
    {"Неизвестное авто",        0,          0,      0},      // 1138
    {"Неизвестное авто",        0,          0,      0},      // 1139
    {"Неизвестное авто",        0,          0,      0},      // 1140
    {"Неизвестное авто",        0,          0,      0},      // 1141
    {"Неизвестное авто",        0,          0,      0},      // 1142
    {"Неизвестное авто",        0,          0,      0},      // 1143
    {"Неизвестное авто",        0,          0,      0},      // 1144
    {"Неизвестное авто",        0,          0,      0},      // 1145
    {"Неизвестное авто",        0,          0,      0},      // 1146
    {"Неизвестное авто",        0,          0,      0},      // 1147
    {"Неизвестное авто",        0,          0,      0},      // 1148
    {"Неизвестное авто",        0,          0,      0},      // 1149
    {"Неизвестное авто",        0,          0,      0},      // 1150
    {"Неизвестное авто",        0,          0,      0},      // 1151
    {"Неизвестное авто",        0,          0,      0},      // 1152
    {"Неизвестное авто",        0,          0,      0},      // 1153
    {"Неизвестное авто",        0,          0,      0},      // 1154
    {"Неизвестное авто",        0,          0,      0},      // 1155
    {"Неизвестное авто",        0,          0,      0},      // 1156
    {"Неизвестное авто",        0,          0,      0},      // 1157
    {"Неизвестное авто",        0,          0,      0},      // 1158
    {"Неизвестное авто",        0,          0,      0},      // 1159
    {"Неизвестное авто",        0,          0,      0},      // 1160
    {"Неизвестное авто",        0,          0,      0},      // 1161
    {"Неизвестное авто",        0,          0,      0},      // 1162
    {"Неизвестное авто",        0,          0,      0},      // 1163
    {"Неизвестное авто",        0,          0,      0},      // 1164
    {"Неизвестное авто",        0,          0,      0},      // 1165
    {"Неизвестное авто",        0,          0,      0},      // 1166
    {"Неизвестное авто",        0,          0,      0},      // 1167
    {"Неизвестное авто",        0,          0,      0},      // 1168
    {"Неизвестное авто",        0,          0,      0},      // 1169
    {"Неизвестное авто",        0,          0,      0},      // 1170
    {"Неизвестное авто",        0,          0,      0},      // 1171
    {"Неизвестное авто",        0,          0,      0},      // 1172
    {"Неизвестное авто",        0,          0,      0},      // 1173
    {"Неизвестное авто",        0,          0,      0},      // 1174
    {"Неизвестное авто",        0,          0,      0},      // 1175
    {"Неизвестное авто",        0,          0,      0},      // 1176
    {"Неизвестное авто",        0,          0,      0},      // 1177
    {"Неизвестное авто",        0,          0,      0},      // 1178
    {"Неизвестное авто",        0,          0,      0},      // 1179
    {"Неизвестное авто",        0,          0,      0},      // 1180
    {"Неизвестное авто",        0,          0,      0},      // 1181
    {"Неизвестное авто",        0,          0,      0},      // 1182
    {"Неизвестное авто",        0,          0,      0},      // 1183
    {"Неизвестное авто",        0,          0,      0},      // 1184
    {"Неизвестное авто",        0,          0,      0},      // 1185
    {"Неизвестное авто",        0,          0,      0},      // 1186
    {"Неизвестное авто",        0,          0,      0},      // 1187
    {"Неизвестное авто",        0,          0,      0},      // 1188
    {"Неизвестное авто",        0,          0,      0},      // 1189
    {"Неизвестное авто",        0,          0,      0},      // 1190
    {"Неизвестное авто",        0,          0,      0},      // 1191
    {"Неизвестное авто",        0,          0,      0},      // 1192
    {"Неизвестное авто",        0,          0,      0},      // 1193
    {"Неизвестное авто",        0,          0,      0},      // 1194
    {"Неизвестное авто",        0,          0,      0},      // 1195
    {"Неизвестное авто",        0,          0,      0},      // 1196
    {"Неизвестное авто",        0,          0,      0},      // 1197
    {"Неизвестное авто",        0,          0,      0},      // 1198
    {"Неизвестное авто",        0,          0,      0},      // 1199
    {"Неизвестное авто",        0,          0,      0},      // 1200
    {"Неизвестное авто",        0,          0,      0},      // 1201
    {"Неизвестное авто",        0,          0,      0},      // 1202
    {"Неизвестное авто",        0,          0,      0},      // 1203
    {"Неизвестное авто",        0,          0,      0},      // 1204
    {"Неизвестное авто",        0,          0,      0},      // 1205
    {"Неизвестное авто",        0,          0,      0},      // 1206
    {"Неизвестное авто",        0,          0,      0},      // 1207
    {"Неизвестное авто",        0,          0,      0},      // 1208
    {"Неизвестное авто",        0,          0,      0},      // 1209
    {"Неизвестное авто",        0,          0,      0},      // 1210
    {"Неизвестное авто",        0,          0,      0},      // 1211
    {"Неизвестное авто",        0,          0,      0},      // 1212
    {"Неизвестное авто",        0,          0,      0},      // 1213
    {"Неизвестное авто",        0,          0,      0},      // 1214
    {"Неизвестное авто",        0,          0,      0},      // 1215
    {"Неизвестное авто",        0,          0,      0},      // 1216
    {"Неизвестное авто",        0,          0,      0},      // 1217
    {"Неизвестное авто",        0,          0,      0},      // 1218
    {"Неизвестное авто",        0,          0,      0},      // 1219
    {"Неизвестное авто",        0,          0,      0},      // 1220
    {"Неизвестное авто",        0,          0,      0},      // 1221
    {"Неизвестное авто",        0,          0,      0},      // 1222
    {"Неизвестное авто",        0,          0,      0},      // 1223
    {"Неизвестное авто",        0,          0,      0},      // 1224
    {"Неизвестное авто",        0,          0,      0},      // 1225
    {"Неизвестное авто",        0,          0,      0},      // 1226
    {"Неизвестное авто",        0,          0,      0},      // 1227
    {"Неизвестное авто",        0,          0,      0},      // 1228
    {"Неизвестное авто",        0,          0,      0},      // 1229
    {"Неизвестное авто",        0,          0,      0},      // 1230
    {"Неизвестное авто",        0,          0,      0},      // 1231
    {"Неизвестное авто",        0,          0,      0},      // 1232
    {"Неизвестное авто",        0,          0,      0},      // 1233
    {"Неизвестное авто",        0,          0,      0},      // 1234
    {"Неизвестное авто",        0,          0,      0},      // 1235
    {"Неизвестное авто",        0,          0,      0},      // 1236
    {"Неизвестное авто",        0,          0,      0},      // 1237
    {"Неизвестное авто",        0,          0,      0},      // 1238
    {"Неизвестное авто",        0,          0,      0},      // 1239
    {"Неизвестное авто",        0,          0,      0},      // 1240
    {"Неизвестное авто",        0,          0,      0},      // 1241
    {"Неизвестное авто",        0,          0,      0},      // 1242
    {"Неизвестное авто",        0,          0,      0},      // 1243
    {"Неизвестное авто",        0,          0,      0},      // 1244
    {"Неизвестное авто",        0,          0,      0},      // 1245
    {"Неизвестное авто",        0,          0,      0},      // 1246
    {"Неизвестное авто",        0,          0,      0},      // 1247
    {"Неизвестное авто",        0,          0,      0},      // 1248
    {"Неизвестное авто",        0,          0,      0},      // 1249
    {"Неизвестное авто",        0,          0,      0},      // 1250
    {"Неизвестное авто",        0,          0,      0},      // 1251
    {"Неизвестное авто",        0,          0,      0},      // 1252
    {"Неизвестное авто",        0,          0,      0},      // 1253
    {"Неизвестное авто",        0,          0,      0},      // 1254
    {"Неизвестное авто",        0,          0,      0},      // 1255
    {"Неизвестное авто",        0,          0,      0},      // 1256
    {"Неизвестное авто",        0,          0,      0},      // 1257
    {"Неизвестное авто",        0,          0,      0},      // 1258
    {"Неизвестное авто",        0,          0,      0},      // 1259
    {"Неизвестное авто",        0,          0,      0},      // 1260
    {"Неизвестное авто",        0,          0,      0},      // 1261
    {"Неизвестное авто",        0,          0,      0},      // 1262
    {"Неизвестное авто",        0,          0,      0},      // 1263
    {"Неизвестное авто",        0,          0,      0},      // 1264
    {"Неизвестное авто",        0,          0,      0},      // 1265
    {"Неизвестное авто",        0,          0,      0},      // 1266
    {"Неизвестное авто",        0,          0,      0},      // 1267
    {"Неизвестное авто",        0,          0,      0},      // 1268
    {"Неизвестное авто",        0,          0,      0},      // 1269
    {"Неизвестное авто",        0,          0,      0},      // 1270
    {"Неизвестное авто",        0,          0,      0},      // 1271
    {"Неизвестное авто",        0,          0,      0},      // 1272
    {"Неизвестное авто",        0,          0,      0},      // 1273
    {"Неизвестное авто",        0,          0,      0},      // 1274
    {"Неизвестное авто",        0,          0,      0},      // 1275
    {"Неизвестное авто",        0,          0,      0},      // 1276
    {"Неизвестное авто",        0,          0,      0},      // 1277
    {"Неизвестное авто",        0,          0,      0},      // 1278
    {"Неизвестное авто",        0,          0,      0},      // 1279
    {"Неизвестное авто",        0,          0,      0},      // 1280
    {"Неизвестное авто",        0,          0,      0},      // 1281
    {"Неизвестное авто",        0,          0,      0},      // 1282
    {"Неизвестное авто",        0,          0,      0},      // 1283
    {"Неизвестное авто",        0,          0,      0},      // 1284
    {"Неизвестное авто",        0,          0,      0},      // 1285
    {"Неизвестное авто",        0,          0,      0},      // 1286
    {"Неизвестное авто",        0,          0,      0},      // 1287
    {"Неизвестное авто",        0,          0,      0},      // 1288
    {"Неизвестное авто",        0,          0,      0},      // 1289
    {"Неизвестное авто",        0,          0,      0},      // 1290
    {"Неизвестное авто",        0,          0,      0},      // 1291
    {"Неизвестное авто",        0,          0,      0},      // 1292
    {"Неизвестное авто",        0,          0,      0},      // 1293
    {"Неизвестное авто",        0,          0,      0},      // 1294
    {"Неизвестное авто",        0,          0,      0},      // 1295
    {"Неизвестное авто",        0,          0,      0},      // 1296
    {"Неизвестное авто",        0,          0,      0},      // 1297
    {"Неизвестное авто",        0,          0,      0},      // 1298
    {"Неизвестное авто",        0,          0,      0},      // 1299
    {"Неизвестное авто",        0,          0,      0},      // 1300
    {"Неизвестное авто",        0,          0,      0},      // 1301
    {"Неизвестное авто",        0,          0,      0},      // 1302
    {"Неизвестное авто",        0,          0,      0},      // 1303
    {"Неизвестное авто",        0,          0,      0},      // 1304
    {"Неизвестное авто",        0,          0,      0},      // 1305
    {"Неизвестное авто",        0,          0,      0},      // 1306
    {"Неизвестное авто",        0,          0,      0},      // 1307
    {"Неизвестное авто",        0,          0,      0},      // 1308
    {"Неизвестное авто",        0,          0,      0},      // 1309
    {"Неизвестное авто",        0,          0,      0},      // 1310
    {"Неизвестное авто",        0,          0,      0},      // 1311
    {"Неизвестное авто",        0,          0,      0},      // 1312
    {"Неизвестное авто",        0,          0,      0},      // 1313
    {"Неизвестное авто",        0,          0,      0},      // 1314
    {"Неизвестное авто",        0,          0,      0},      // 1315
    {"Неизвестное авто",        0,          0,      0},      // 1316
    {"Неизвестное авто",        0,          0,      0},      // 1317
    {"Неизвестное авто",        0,          0,      0},      // 1318
    {"Неизвестное авто",        0,          0,      0},      // 1319
    {"Неизвестное авто",        0,          0,      0},      // 1320
    {"Неизвестное авто",        0,          0,      0},      // 1321
    {"Неизвестное авто",        0,          0,      0},      // 1322
    {"Неизвестное авто",        0,          0,      0},      // 1323
    {"Неизвестное авто",        0,          0,      0},      // 1324
    {"Неизвестное авто",        0,          0,      0},      // 1325
    {"Неизвестное авто",        0,          0,      0},      // 1326
    {"Неизвестное авто",        0,          0,      0},      // 1327
    {"Неизвестное авто",        0,          0,      0},      // 1328
    {"Неизвестное авто",        0,          0,      0},      // 1329
    {"Неизвестное авто",        0,          0,      0},      // 1330
    {"Неизвестное авто",        0,          0,      0},      // 1331
    {"Неизвестное авто",        0,          0,      0},      // 1332
    {"Неизвестное авто",        0,          0,      0},      // 1333
    {"Неизвестное авто",        0,          0,      0},      // 1334
    {"Неизвестное авто",        0,          0,      0},      // 1335
    {"Неизвестное авто",        0,          0,      0},      // 1336
    {"Неизвестное авто",        0,          0,      0},      // 1337
    {"Неизвестное авто",        0,          0,      0},      // 1338
    {"Неизвестное авто",        0,          0,      0},      // 1339
    {"Неизвестное авто",        0,          0,      0},      // 1340
    {"Неизвестное авто",        0,          0,      0},      // 1341
    {"Неизвестное авто",        0,          0,      0},      // 1342
    {"Неизвестное авто",        0,          0,      0},      // 1343
    {"Неизвестное авто",        0,          0,      0},      // 1344
    {"Неизвестное авто",        0,          0,      0},      // 1345
    {"Неизвестное авто",        0,          0,      0},      // 1346
    {"Неизвестное авто",        0,          0,      0},      // 1347
    {"Неизвестное авто",        0,          0,      0},      // 1348
    {"Неизвестное авто",        0,          0,      0},      // 1349
    {"Неизвестное авто",        0,          0,      0},      // 1350
    {"Неизвестное авто",        0,          0,      0},      // 1351
    {"Неизвестное авто",        0,          0,      0},      // 1352
    {"Неизвестное авто",        0,          0,      0},      // 1353
    {"Неизвестное авто",        0,          0,      0},      // 1354
    {"Неизвестное авто",        0,          0,      0},      // 1355
    {"Неизвестное авто",        0,          0,      0},      // 1356
    {"Неизвестное авто",        0,          0,      0},      // 1357
    {"Неизвестное авто",        0,          0,      0},      // 1358
    {"Неизвестное авто",        0,          0,      0},      // 1359
    {"Неизвестное авто",        0,          0,      0},      // 1360
    {"Неизвестное авто",        0,          0,      0},      // 1361
    {"Неизвестное авто",        0,          0,      0},      // 1362
    {"Неизвестное авто",        0,          0,      0},      // 1363
    {"Неизвестное авто",        0,          0,      0},      // 1364
    {"Неизвестное авто",        0,          0,      0},      // 1365
    {"Неизвестное авто",        0,          0,      0},      // 1366
    {"Неизвестное авто",        0,          0,      0},      // 1367
    {"Неизвестное авто",        0,          0,      0},      // 1368
    {"Неизвестное авто",        0,          0,      0},      // 1369
    {"Неизвестное авто",        0,          0,      0},      // 1370
    {"Неизвестное авто",        0,          0,      0},      // 1371
    {"Неизвестное авто",        0,          0,      0},      // 1372
    {"Неизвестное авто",        0,          0,      0},      // 1373
    {"Неизвестное авто",        0,          0,      0},      // 1374
    {"Неизвестное авто",        0,          0,      0},      // 1375
    {"Неизвестное авто",        0,          0,      0},      // 1376
    {"Неизвестное авто",        0,          0,      0},      // 1377
    {"Неизвестное авто",        0,          0,      0},      // 1378
    {"Неизвестное авто",        0,          0,      0},      // 1379
    {"Неизвестное авто",        0,          0,      0},      // 1380
    {"Неизвестное авто",        0,          0,      0},      // 1381
    {"Неизвестное авто",        0,          0,      0},      // 1382
    {"Неизвестное авто",        0,          0,      0},      // 1383
    {"Неизвестное авто",        0,          0,      0},      // 1384
    {"Неизвестное авто",        0,          0,      0},      // 1385
    {"Неизвестное авто",        0,          0,      0},      // 1386
    {"Неизвестное авто",        0,          0,      0},      // 1387
    {"Неизвестное авто",        0,          0,      0},      // 1388
    {"Неизвестное авто",        0,          0,      0},      // 1389
    {"Неизвестное авто",        0,          0,      0},      // 1390
    {"Неизвестное авто",        0,          0,      0},      // 1391
    {"Неизвестное авто",        0,          0,      0},      // 1392
    {"Неизвестное авто",        0,          0,      0},      // 1393
    {"Неизвестное авто",        0,          0,      0},      // 1394
    {"Неизвестное авто",        0,          0,      0},      // 1395
    {"Неизвестное авто",        0,          0,      0},      // 1396
    {"Неизвестное авто",        0,          0,      0},      // 1397
    {"Неизвестное авто",        0,          0,      0},      // 1398
    {"Неизвестное авто",        0,          0,      0},      // 1399
    {"Неизвестное авто",        0,          0,      0},      // 1400
    {"Неизвестное авто",        0,          0,      0},      // 1401
    {"Неизвестное авто",        0,          0,      0},      // 1402
    {"Неизвестное авто",        0,          0,      0},      // 1403
    {"Неизвестное авто",        0,          0,      0},      // 1404
    {"Неизвестное авто",        0,          0,      0},      // 1405
    {"Неизвестное авто",        0,          0,      0},      // 1406
    {"Неизвестное авто",        0,          0,      0},      // 1407
    {"Неизвестное авто",        0,          0,      0},      // 1408
    {"Неизвестное авто",        0,          0,      0},      // 1409
    {"Неизвестное авто",        0,          0,      0},      // 1410
    {"Неизвестное авто",        0,          0,      0},      // 1411
    {"Неизвестное авто",        0,          0,      0},      // 1412
    {"Неизвестное авто",        0,          0,      0},      // 1413
    {"Неизвестное авто",        0,          0,      0},      // 1414
    {"Неизвестное авто",        0,          0,      0},      // 1415
    {"Неизвестное авто",        0,          0,      0},      // 1416
    {"Неизвестное авто",        0,          0,      0},      // 1417
    {"Неизвестное авто",        0,          0,      0},      // 1418
    {"Неизвестное авто",        0,          0,      0},      // 1419
    {"Неизвестное авто",        0,          0,      0},      // 1420
    {"Неизвестное авто",        0,          0,      0},      // 1421
    {"Неизвестное авто",        0,          0,      0},      // 1422
    {"Неизвестное авто",        0,          0,      0},      // 1423
    {"Неизвестное авто",        0,          0,      0},      // 1424
    {"Неизвестное авто",        0,          0,      0},      // 1425
    {"Неизвестное авто",        0,          0,      0},      // 1426
    {"Неизвестное авто",        0,          0,      0},      // 1427
    {"Неизвестное авто",        0,          0,      0},      // 1428
    {"Неизвестное авто",        0,          0,      0},      // 1429
    {"Неизвестное авто",        0,          0,      0},      // 1430
    {"Неизвестное авто",        0,          0,      0},      // 1431
    {"Неизвестное авто",        0,          0,      0},      // 1432
    {"Неизвестное авто",        0,          0,      0},      // 1433
    {"Неизвестное авто",        0,          0,      0},      // 1434
    {"Неизвестное авто",        0,          0,      0},      // 1435
    {"Неизвестное авто",        0,          0,      0},      // 1436
    {"Неизвестное авто",        0,          0,      0},      // 1437
    {"Неизвестное авто",        0,          0,      0},      // 1438
    {"Неизвестное авто",        0,          0,      0},      // 1439
    {"Неизвестное авто",        0,          0,      0},      // 1440
    {"Неизвестное авто",        0,          0,      0},      // 1441
    {"Неизвестное авто",        0,          0,      0},      // 1442
    {"Неизвестное авто",        0,          0,      0},      // 1443
    {"Неизвестное авто",        0,          0,      0},      // 1444
    {"Неизвестное авто",        0,          0,      0},      // 1445
    {"Неизвестное авто",        0,          0,      0},      // 1446
    {"Неизвестное авто",        0,          0,      0},      // 1447
    {"Неизвестное авто",        0,          0,      0},      // 1448
    {"Неизвестное авто",        0,          0,      0},      // 1449
    {"Неизвестное авто",        0,          0,      0},      // 1450
    {"Неизвестное авто",        0,          0,      0},      // 1451
    {"Неизвестное авто",        0,          0,      0},      // 1452
    {"Неизвестное авто",        0,          0,      0},      // 1453
    {"Неизвестное авто",        0,          0,      0},      // 1454
    {"Неизвестное авто",        0,          0,      0},      // 1455
    {"Неизвестное авто",        0,          0,      0},      // 1456
    {"Неизвестное авто",        0,          0,      0},      // 1457
    {"Неизвестное авто",        0,          0,      0},      // 1458
    {"Неизвестное авто",        0,          0,      0},      // 1459
    {"Неизвестное авто",        0,          0,      0},      // 1460
    {"Неизвестное авто",        0,          0,      0},      // 1461
    {"Неизвестное авто",        0,          0,      0},      // 1462
    {"Неизвестное авто",        0,          0,      0},      // 1463
    {"Неизвестное авто",        0,          0,      0},      // 1464
    {"Неизвестное авто",        0,          0,      0},      // 1465
    {"Неизвестное авто",        0,          0,      0},      // 1466
    {"Неизвестное авто",        0,          0,      0},      // 1467
    {"Неизвестное авто",        0,          0,      0},      // 1468
    {"Неизвестное авто",        0,          0,      0},      // 1469
    {"Неизвестное авто",        0,          0,      0},      // 1470
    {"Неизвестное авто",        0,          0,      0},      // 1471
    {"Неизвестное авто",        0,          0,      0},      // 1472
    {"Неизвестное авто",        0,          0,      0},      // 1473
    {"Неизвестное авто",        0,          0,      0},      // 1474
    {"Неизвестное авто",        0,          0,      0},      // 1475
    {"Неизвестное авто",        0,          0,      0},      // 1476
    {"Неизвестное авто",        0,          0,      0},      // 1477
    {"Неизвестное авто",        0,          0,      0},      // 1478
    {"Неизвестное авто",        0,          0,      0},      // 1479
    {"Неизвестное авто",        0,          0,      0},      // 1480
    {"Неизвестное авто",        0,          0,      0},      // 1481
    {"Неизвестное авто",        0,          0,      0},      // 1482
    {"Неизвестное авто",        0,          0,      0},      // 1483
    {"Неизвестное авто",        0,          0,      0},      // 1484
    {"Неизвестное авто",        0,          0,      0},      // 1485
    {"Неизвестное авто",        0,          0,      0},      // 1486
    {"Неизвестное авто",        0,          0,      0},      // 1487
    {"Неизвестное авто",        0,          0,      0},      // 1488
    {"Неизвестное авто",        0,          0,      0},      // 1489
    {"Неизвестное авто",        0,          0,      0},      // 1490
    {"Неизвестное авто",        0,          0,      0},      // 1491
    {"Неизвестное авто",        0,          0,      0},      // 1492
    {"Неизвестное авто",        0,          0,      0},      // 1493
    {"Неизвестное авто",        0,          0,      0},      // 1494
    {"Неизвестное авто",        0,          0,      0},      // 1495
    {"Неизвестное авто",        0,          0,      0},      // 1496
    {"Неизвестное авто",        0,          0,      0},      // 1497
    {"Неизвестное авто",        0,          0,      0},      // 1498
    {"Неизвестное авто",        0,          0,      0},      // 1499
    {"Неизвестное авто",        0,          0,      0},      // 1500
    {"Неизвестное авто",        0,          0,      0},      // 1501
    {"Неизвестное авто",        0,          0,      0},      // 1502
    {"Неизвестное авто",        0,          0,      0},      // 1503
    {"Неизвестное авто",        0,          0,      0},      // 1504
    {"Неизвестное авто",        0,          0,      0},      // 1505
    {"Неизвестное авто",        0,          0,      0},      // 1506
    {"Неизвестное авто",        0,          0,      0},      // 1507
    {"Неизвестное авто",        0,          0,      0},      // 1508
    {"Неизвестное авто",        0,          0,      0},      // 1509
    {"Неизвестное авто",        0,          0,      0},      // 1510
    {"Неизвестное авто",        0,          0,      0},      // 1511
    {"Неизвестное авто",        0,          0,      0},      // 1512
    {"Неизвестное авто",        0,          0,      0},      // 1513
    {"Неизвестное авто",        0,          0,      0},      // 1514
    {"Неизвестное авто",        0,          0,      0},      // 1515
    {"Неизвестное авто",        0,          0,      0},      // 1516
    {"Неизвестное авто",        0,          0,      0},      // 1517
    {"Неизвестное авто",        0,          0,      0},      // 1518
    {"Неизвестное авто",        0,          0,      0},      // 1519
    {"Неизвестное авто",        0,          0,      0},      // 1520
    {"Неизвестное авто",        0,          0,      0},      // 1521
    {"Неизвестное авто",        0,          0,      0},      // 1522
    {"Неизвестное авто",        0,          0,      0},      // 1523
    {"Неизвестное авто",        0,          0,      0},      // 1524
    {"Неизвестное авто",        0,          0,      0},      // 1525
    {"Неизвестное авто",        0,          0,      0},      // 1526
    {"Неизвестное авто",        0,          0,      0},      // 1527
    {"Неизвестное авто",        0,          0,      0},      // 1528
    {"Неизвестное авто",        0,          0,      0},      // 1529
    {"Неизвестное авто",        0,          0,      0},      // 1530
    {"Неизвестное авто",        0,          0,      0},      // 1531
    {"Неизвестное авто",        0,          0,      0},      // 1532
    {"Неизвестное авто",        0,          0,      0},      // 1533
    {"Неизвестное авто",        0,          0,      0},      // 1534
    {"Неизвестное авто",        0,          0,      0},      // 1535
    {"Неизвестное авто",        0,          0,      0},      // 1536
    {"Неизвестное авто",        0,          0,      0},      // 1537
    {"Неизвестное авто",        0,          0,      0},      // 1538
    {"Неизвестное авто",        0,          0,      0},      // 1539
    {"Неизвестное авто",        0,          0,      0},      // 1540
    {"Неизвестное авто",        0,          0,      0},      // 1541
    {"Неизвестное авто",        0,          0,      0},      // 1542
    {"Неизвестное авто",        0,          0,      0},      // 1543
    {"Неизвестное авто",        0,          0,      0},      // 1544
    {"Неизвестное авто",        0,          0,      0},      // 1545
    {"Неизвестное авто",        0,          0,      0},      // 1546
    {"Неизвестное авто",        0,          0,      0},      // 1547
    {"Неизвестное авто",        0,          0,      0},      // 1548
    {"Неизвестное авто",        0,          0,      0},      // 1549
    {"Неизвестное авто",        0,          0,      0},      // 1550
    {"Неизвестное авто",        0,          0,      0},      // 1551
    {"Неизвестное авто",        0,          0,      0},      // 1552
    {"Неизвестное авто",        0,          0,      0},      // 1553
    {"Неизвестное авто",        0,          0,      0},      // 1554
    {"Неизвестное авто",        0,          0,      0},      // 1555
    {"Неизвестное авто",        0,          0,      0},      // 1556
    {"Неизвестное авто",        0,          0,      0},      // 1557
    {"Неизвестное авто",        0,          0,      0},      // 1558
    {"Неизвестное авто",        0,          0,      0},      // 1559
    {"Неизвестное авто",        0,          0,      0},      // 1560
    {"Неизвестное авто",        0,          0,      0},      // 1561
    {"Неизвестное авто",        0,          0,      0},      // 1562
    {"Неизвестное авто",        0,          0,      0},      // 1563
    {"Неизвестное авто",        0,          0,      0},      // 1564
    {"Неизвестное авто",        0,          0,      0},      // 1565
    {"Неизвестное авто",        0,          0,      0},      // 1566
    {"Неизвестное авто",        0,          0,      0},      // 1567
    {"Неизвестное авто",        0,          0,      0},      // 1568
    {"Неизвестное авто",        0,          0,      0},      // 1569
    {"Неизвестное авто",        0,          0,      0},      // 1570
    {"Неизвестное авто",        0,          0,      0},      // 1571
    {"Неизвестное авто",        0,          0,      0},      // 1572
    {"Неизвестное авто",        0,          0,      0},      // 1573
    {"Неизвестное авто",        0,          0,      0},      // 1574
    {"Неизвестное авто",        0,          0,      0},      // 1575
    {"Неизвестное авто",        0,          0,      0},      // 1576
    {"Неизвестное авто",        0,          0,      0},      // 1577
    {"Неизвестное авто",        0,          0,      0},      // 1578
    {"Неизвестное авто",        0,          0,      0},      // 1579
    {"Неизвестное авто",        0,          0,      0},      // 1580
    {"Неизвестное авто",        0,          0,      0},      // 1581
    {"Неизвестное авто",        0,          0,      0},      // 1582
    {"Неизвестное авто",        0,          0,      0},      // 1583
    {"Неизвестное авто",        0,          0,      0},      // 1584
    {"Неизвестное авто",        0,          0,      0},      // 1585
    {"Неизвестное авто",        0,          0,      0},      // 1586
    {"Неизвестное авто",        0,          0,      0},      // 1587
    {"Неизвестное авто",        0,          0,      0},      // 1588
    {"Неизвестное авто",        0,          0,      0},      // 1589
    {"Неизвестное авто",        0,          0,      0},      // 1590
    {"Неизвестное авто",        0,          0,      0},      // 1591
    {"Неизвестное авто",        0,          0,      0},      // 1592
    {"Неизвестное авто",        0,          0,      0},      // 1593
    {"Неизвестное авто",        0,          0,      0},      // 1594
    {"Неизвестное авто",        0,          0,      0},      // 1595
    {"Неизвестное авто",        0,          0,      0},      // 1596
    {"Неизвестное авто",        0,          0,      0},      // 1597
    {"Неизвестное авто",        0,          0,      0},      // 1598
    {"Неизвестное авто",        0,          0,      0},      // 1599
    {"Неизвестное авто",        0,          0,      0},      // 1600
    {"Неизвестное авто",        0,          0,      0},      // 1601
    {"Неизвестное авто",        0,          0,      0},      // 1602
    {"Неизвестное авто",        0,          0,      0},      // 1603
    {"Неизвестное авто",        0,          0,      0},      // 1604
    {"Неизвестное авто",        0,          0,      0},      // 1605
    {"Неизвестное авто",        0,          0,      0},      // 1606
    {"Неизвестное авто",        0,          0,      0},      // 1607
    {"Неизвестное авто",        0,          0,      0},      // 1608
    {"Неизвестное авто",        0,          0,      0},      // 1609
    {"Неизвестное авто",        0,          0,      0},      // 1610
    {"Неизвестное авто",        0,          0,      0},      // 1611
    {"Неизвестное авто",        0,          0,      0},      // 1612
    {"Неизвестное авто",        0,          0,      0},      // 1613
    {"Неизвестное авто",        0,          0,      0},      // 1614
    {"Неизвестное авто",        0,          0,      0},      // 1615
    {"Неизвестное авто",        0,          0,      0},      // 1616
    {"Неизвестное авто",        0,          0,      0},      // 1617
    {"Неизвестное авто",        0,          0,      0},      // 1618
    {"Неизвестное авто",        0,          0,      0},      // 1619
    {"Неизвестное авто",        0,          0,      0},      // 1620
    {"Неизвестное авто",        0,          0,      0},      // 1621
    {"Неизвестное авто",        0,          0,      0},      // 1622
    {"Неизвестное авто",        0,          0,      0},      // 1623
    {"Неизвестное авто",        0,          0,      0},      // 1624
    {"Неизвестное авто",        0,          0,      0},      // 1625
    {"Неизвестное авто",        0,          0,      0},      // 1626
    {"Неизвестное авто",        0,          0,      0},      // 1627
    {"Неизвестное авто",        0,          0,      0},      // 1628
    {"Неизвестное авто",        0,          0,      0},      // 1629
    {"Неизвестное авто",        0,          0,      0},      // 1630
    {"Неизвестное авто",        0,          0,      0},      // 1631
    {"Неизвестное авто",        0,          0,      0},      // 1632
    {"Неизвестное авто",        0,          0,      0},      // 1633
    {"Неизвестное авто",        0,          0,      0},      // 1634
    {"Неизвестное авто",        0,          0,      0},      // 1635
    {"Неизвестное авто",        0,          0,      0},      // 1636
    {"Неизвестное авто",        0,          0,      0},      // 1637
    {"Неизвестное авто",        0,          0,      0},      // 1638
    {"Неизвестное авто",        0,          0,      0},      // 1639
    {"Неизвестное авто",        0,          0,      0},      // 1640
    {"Неизвестное авто",        0,          0,      0},      // 1641
    {"Неизвестное авто",        0,          0,      0},      // 1642
    {"Неизвестное авто",        0,          0,      0},      // 1643
    {"Неизвестное авто",        0,          0,      0},      // 1644
    {"Неизвестное авто",        0,          0,      0},      // 1645
    {"Неизвестное авто",        0,          0,      0},      // 1646
    {"Неизвестное авто",        0,          0,      0},      // 1647
    {"Неизвестное авто",        0,          0,      0},      // 1648
    {"Неизвестное авто",        0,          0,      0},      // 1649
    {"Неизвестное авто",        0,          0,      0},      // 1650
    {"Неизвестное авто",        0,          0,      0},      // 1651
    {"Неизвестное авто",        0,          0,      0},      // 1652
    {"Неизвестное авто",        0,          0,      0},      // 1653
    {"Неизвестное авто",        0,          0,      0},      // 1654
    {"Неизвестное авто",        0,          0,      0},      // 1655
    {"Неизвестное авто",        0,          0,      0},      // 1656
    {"Неизвестное авто",        0,          0,      0},      // 1657
    {"Неизвестное авто",        0,          0,      0},      // 1658
    {"Неизвестное авто",        0,          0,      0},      // 1659
    {"Неизвестное авто",        0,          0,      0},      // 1660
    {"Неизвестное авто",        0,          0,      0},      // 1661
    {"Неизвестное авто",        0,          0,      0},      // 1662
    {"Неизвестное авто",        0,          0,      0},      // 1663
    {"Неизвестное авто",        0,          0,      0},      // 1664
    {"Неизвестное авто",        0,          0,      0},      // 1665
    {"Неизвестное авто",        0,          0,      0},      // 1666
    {"Неизвестное авто",        0,          0,      0},      // 1667
    {"Неизвестное авто",        0,          0,      0},      // 1668
    {"Неизвестное авто",        0,          0,      0},      // 1669
    {"Неизвестное авто",        0,          0,      0},      // 1670
    {"Неизвестное авто",        0,          0,      0},      // 1671
    {"Неизвестное авто",        0,          0,      0},      // 1672
    {"Неизвестное авто",        0,          0,      0},      // 1673
    {"Неизвестное авто",        0,          0,      0},      // 1674
    {"Неизвестное авто",        0,          0,      0},      // 1675
    {"Неизвестное авто",        0,          0,      0},      // 1676
    {"Неизвестное авто",        0,          0,      0},      // 1677
    {"Неизвестное авто",        0,          0,      0},      // 1678
    {"Неизвестное авто",        0,          0,      0},      // 1679
    {"Неизвестное авто",        0,          0,      0},      // 1680
    {"Неизвестное авто",        0,          0,      0},      // 1681
    {"Неизвестное авто",        0,          0,      0},      // 1682
    {"Неизвестное авто",        0,          0,      0},      // 1683
    {"Неизвестное авто",        0,          0,      0},      // 1684
    {"Неизвестное авто",        0,          0,      0},      // 1685
    {"Неизвестное авто",        0,          0,      0},      // 1686
    {"Неизвестное авто",        0,          0,      0},      // 1687
    {"Неизвестное авто",        0,          0,      0},      // 1688
    {"Неизвестное авто",        0,          0,      0},      // 1689
    {"Неизвестное авто",        0,          0,      0},      // 1690
    {"Неизвестное авто",        0,          0,      0},      // 1691
    {"Неизвестное авто",        0,          0,      0},      // 1692
    {"Неизвестное авто",        0,          0,      0},      // 1693
    {"Неизвестное авто",        0,          0,      0},      // 1694
    {"Неизвестное авто",        0,          0,      0},      // 1695
    {"Неизвестное авто",        0,          0,      0},      // 1696
    {"Неизвестное авто",        0,          0,      0},      // 1697
    {"Неизвестное авто",        0,          0,      0},      // 1698
    {"Неизвестное авто",        0,          0,      0},      // 1699
    {"Неизвестное авто",        0,          0,      0},      // 1700
    {"Неизвестное авто",        0,          0,      0},      // 1701
    {"Неизвестное авто",        0,          0,      0},      // 1702
    {"Неизвестное авто",        0,          0,      0},      // 1703
    {"Неизвестное авто",        0,          0,      0},      // 1704
    {"Неизвестное авто",        0,          0,      0},      // 1705
    {"Неизвестное авто",        0,          0,      0},      // 1706
    {"Неизвестное авто",        0,          0,      0},      // 1707
    {"Неизвестное авто",        0,          0,      0},      // 1708
    {"Неизвестное авто",        0,          0,      0},      // 1709
    {"Неизвестное авто",        0,          0,      0},      // 1710
    {"Неизвестное авто",        0,          0,      0},      // 1711
    {"Неизвестное авто",        0,          0,      0},      // 1712
    {"Неизвестное авто",        0,          0,      0},      // 1713
    {"Неизвестное авто",        0,          0,      0},      // 1714
    {"Неизвестное авто",        0,          0,      0},      // 1715
    {"Неизвестное авто",        0,          0,      0},      // 1716
    {"Неизвестное авто",        0,          0,      0},      // 1717
    {"Неизвестное авто",        0,          0,      0},      // 1718
    {"Неизвестное авто",        0,          0,      0},      // 1719
    {"Неизвестное авто",        0,          0,      0},      // 1720
    {"Неизвестное авто",        0,          0,      0},      // 1721
    {"Неизвестное авто",        0,          0,      0},      // 1722
    {"Неизвестное авто",        0,          0,      0},      // 1723
    {"Неизвестное авто",        0,          0,      0},      // 1724
    {"Неизвестное авто",        0,          0,      0},      // 1725
    {"Неизвестное авто",        0,          0,      0},      // 1726
    {"Неизвестное авто",        0,          0,      0},      // 1727
    {"Неизвестное авто",        0,          0,      0},      // 1728
    {"Неизвестное авто",        0,          0,      0},      // 1729
    {"Неизвестное авто",        0,          0,      0},      // 1730
    {"Неизвестное авто",        0,          0,      0},      // 1731
    {"Неизвестное авто",        0,          0,      0},      // 1732
    {"Неизвестное авто",        0,          0,      0},      // 1733
    {"Неизвестное авто",        0,          0,      0},      // 1734
    {"Неизвестное авто",        0,          0,      0},      // 1735
    {"Неизвестное авто",        0,          0,      0},      // 1736
    {"Неизвестное авто",        0,          0,      0},      // 1737
    {"Неизвестное авто",        0,          0,      0},      // 1738
    {"Неизвестное авто",        0,          0,      0},      // 1739
    {"Неизвестное авто",        0,          0,      0},      // 1740
    {"Неизвестное авто",        0,          0,      0},      // 1741
    {"Неизвестное авто",        0,          0,      0},      // 1742
    {"Неизвестное авто",        0,          0,      0},      // 1743
    {"Неизвестное авто",        0,          0,      0},      // 1744
    {"Неизвестное авто",        0,          0,      0},      // 1745
    {"Неизвестное авто",        0,          0,      0},      // 1746
    {"Неизвестное авто",        0,          0,      0},      // 1747
    {"Неизвестное авто",        0,          0,      0},      // 1748
    {"Неизвестное авто",        0,          0,      0},      // 1749
    {"Неизвестное авто",        0,          0,      0},      // 1750
    {"Неизвестное авто",        0,          0,      0},      // 1751
    {"Неизвестное авто",        0,          0,      0},      // 1752
    {"Неизвестное авто",        0,          0,      0},      // 1753
    {"Неизвестное авто",        0,          0,      0},      // 1754
    {"Неизвестное авто",        0,          0,      0},      // 1755
    {"Неизвестное авто",        0,          0,      0},      // 1756
    {"Неизвестное авто",        0,          0,      0},      // 1757
    {"Неизвестное авто",        0,          0,      0},      // 1758
    {"Неизвестное авто",        0,          0,      0},      // 1759
    {"Неизвестное авто",        0,          0,      0},      // 1760
    {"Неизвестное авто",        0,          0,      0},      // 1761
    {"Неизвестное авто",        0,          0,      0},      // 1762
    {"Неизвестное авто",        0,          0,      0},      // 1763
    {"Неизвестное авто",        0,          0,      0},      // 1764
    {"Неизвестное авто",        0,          0,      0},      // 1765
    {"Неизвестное авто",        0,          0,      0},      // 1766
    {"Неизвестное авто",        0,          0,      0},      // 1767
    {"Неизвестное авто",        0,          0,      0},      // 1768
    {"Неизвестное авто",        0,          0,      0},      // 1769
    {"Неизвестное авто",        0,          0,      0},      // 1770
    {"Неизвестное авто",        0,          0,      0},      // 1771
    {"Неизвестное авто",        0,          0,      0},      // 1772
    {"Неизвестное авто",        0,          0,      0},      // 1773
    {"Неизвестное авто",        0,          0,      0},      // 1774
    {"Неизвестное авто",        0,          0,      0},      // 1775
    {"Неизвестное авто",        0,          0,      0},      // 1776
    {"Неизвестное авто",        0,          0,      0},      // 1777
    {"Неизвестное авто",        0,          0,      0},      // 1778
    {"Неизвестное авто",        0,          0,      0},      // 1779
    {"Неизвестное авто",        0,          0,      0},      // 1780
    {"Неизвестное авто",        0,          0,      0},      // 1781
    {"Неизвестное авто",        0,          0,      0},      // 1782
    {"Неизвестное авто",        0,          0,      0},      // 1783
    {"Неизвестное авто",        0,          0,      0},      // 1784
    {"Неизвестное авто",        0,          0,      0},      // 1785
    {"Неизвестное авто",        0,          0,      0},      // 1786
    {"Неизвестное авто",        0,          0,      0},      // 1787
    {"Неизвестное авто",        0,          0,      0},      // 1788
    {"Неизвестное авто",        0,          0,      0},      // 1789
    {"Неизвестное авто",        0,          0,      0},      // 1790
    {"Неизвестное авто",        0,          0,      0},      // 1791
    {"Неизвестное авто",        0,          0,      0},      // 1792
    {"Неизвестное авто",        0,          0,      0},      // 1793
    {"Неизвестное авто",        0,          0,      0},      // 1794
    {"Неизвестное авто",        0,          0,      0},      // 1795
    {"Неизвестное авто",        0,          0,      0},      // 1796
    {"Неизвестное авто",        0,          0,      0},      // 1797
    {"Неизвестное авто",        0,          0,      0},      // 1798
    {"Неизвестное авто",        0,          0,      0},      // 1799
    {"Неизвестное авто",        0,          0,      0},      // 1800
    {"Неизвестное авто",        0,          0,      0},      // 1801
    {"Неизвестное авто",        0,          0,      0},      // 1802
    {"Неизвестное авто",        0,          0,      0},      // 1803
    {"Неизвестное авто",        0,          0,      0},      // 1804
    {"Неизвестное авто",        0,          0,      0},      // 1805
    {"Неизвестное авто",        0,          0,      0},      // 1806
    {"Неизвестное авто",        0,          0,      0},      // 1807
    {"Неизвестное авто",        0,          0,      0},      // 1808
    {"Неизвестное авто",        0,          0,      0},      // 1809
    {"Неизвестное авто",        0,          0,      0},      // 1810
    {"Неизвестное авто",        0,          0,      0},      // 1811
    {"Неизвестное авто",        0,          0,      0},      // 1812
    {"Неизвестное авто",        0,          0,      0},      // 1813
    {"Неизвестное авто",        0,          0,      0},      // 1814
    {"Неизвестное авто",        0,          0,      0},      // 1815
    {"Неизвестное авто",        0,          0,      0},      // 1816
    {"Неизвестное авто",        0,          0,      0},      // 1817
    {"Неизвестное авто",        0,          0,      0},      // 1818
    {"Неизвестное авто",        0,          0,      0},      // 1819
    {"Неизвестное авто",        0,          0,      0},      // 1820
    {"Неизвестное авто",        0,          0,      0},      // 1821
    {"Неизвестное авто",        0,          0,      0},      // 1822
    {"Неизвестное авто",        0,          0,      0},      // 1823
    {"Неизвестное авто",        0,          0,      0},      // 1824
    {"Неизвестное авто",        0,          0,      0},      // 1825
    {"Неизвестное авто",        0,          0,      0},      // 1826
    {"Неизвестное авто",        0,          0,      0},      // 1827
    {"Неизвестное авто",        0,          0,      0},      // 1828
    {"Неизвестное авто",        0,          0,      0},      // 1829
    {"Неизвестное авто",        0,          0,      0},      // 1830
    {"Неизвестное авто",        0,          0,      0},      // 1831
    {"Неизвестное авто",        0,          0,      0},      // 1832
    {"Неизвестное авто",        0,          0,      0},      // 1833
    {"Неизвестное авто",        0,          0,      0},      // 1834
    {"Неизвестное авто",        0,          0,      0},      // 1835
    {"Неизвестное авто",        0,          0,      0},      // 1836
    {"Неизвестное авто",        0,          0,      0},      // 1837
    {"Неизвестное авто",        0,          0,      0},      // 1838
    {"Неизвестное авто",        0,          0,      0},      // 1839
    {"Неизвестное авто",        0,          0,      0},      // 1840
    {"Неизвестное авто",        0,          0,      0},      // 1841
    {"Неизвестное авто",        0,          0,      0},      // 1842
    {"Неизвестное авто",        0,          0,      0},      // 1843
    {"Неизвестное авто",        0,          0,      0},      // 1844
    {"Неизвестное авто",        0,          0,      0},      // 1845
    {"Неизвестное авто",        0,          0,      0},      // 1846
    {"Неизвестное авто",        0,          0,      0},      // 1847
    {"Неизвестное авто",        0,          0,      0},      // 1848
    {"Неизвестное авто",        0,          0,      0},      // 1849
    {"Неизвестное авто",        0,          0,      0},      // 1850
    {"Неизвестное авто",        0,          0,      0},      // 1851
    {"Неизвестное авто",        0,          0,      0},      // 1852
    {"Неизвестное авто",        0,          0,      0},      // 1853
    {"Неизвестное авто",        0,          0,      0},      // 1854
    {"Неизвестное авто",        0,          0,      0},      // 1855
    {"Неизвестное авто",        0,          0,      0},      // 1856
    {"Неизвестное авто",        0,          0,      0},      // 1857
    {"Неизвестное авто",        0,          0,      0},      // 1858
    {"Неизвестное авто",        0,          0,      0},      // 1859
    {"Неизвестное авто",        0,          0,      0},      // 1860
    {"Неизвестное авто",        0,          0,      0},      // 1861
    {"Неизвестное авто",        0,          0,      0},      // 1862
    {"Неизвестное авто",        0,          0,      0},      // 1863
    {"Неизвестное авто",        0,          0,      0},      // 1864
    {"Неизвестное авто",        0,          0,      0},      // 1865
    {"Неизвестное авто",        0,          0,      0},      // 1866
    {"Неизвестное авто",        0,          0,      0},      // 1867
    {"Неизвестное авто",        0,          0,      0},      // 1868
    {"Неизвестное авто",        0,          0,      0},      // 1869
    {"Неизвестное авто",        0,          0,      0},      // 1870
    {"Неизвестное авто",        0,          0,      0},      // 1871
    {"Неизвестное авто",        0,          0,      0},      // 1872
    {"Неизвестное авто",        0,          0,      0},      // 1873
    {"Неизвестное авто",        0,          0,      0},      // 1874
    {"Неизвестное авто",        0,          0,      0},      // 1875
    {"Неизвестное авто",        0,          0,      0},      // 1876
    {"Неизвестное авто",        0,          0,      0},      // 1877
    {"Неизвестное авто",        0,          0,      0},      // 1878
    {"Неизвестное авто",        0,          0,      0},      // 1879
    {"Неизвестное авто",        0,          0,      0},      // 1880
    {"Неизвестное авто",        0,          0,      0},      // 1881
    {"Неизвестное авто",        0,          0,      0},      // 1882
    {"Неизвестное авто",        0,          0,      0},      // 1883
    {"Неизвестное авто",        0,          0,      0},      // 1884
    {"Неизвестное авто",        0,          0,      0},      // 1885
    {"Неизвестное авто",        0,          0,      0},      // 1886
    {"Неизвестное авто",        0,          0,      0},      // 1887
    {"Неизвестное авто",        0,          0,      0},      // 1888
    {"Неизвестное авто",        0,          0,      0},      // 1889
    {"Неизвестное авто",        0,          0,      0},      // 1890
    {"Неизвестное авто",        0,          0,      0},      // 1891
    {"Неизвестное авто",        0,          0,      0},      // 1892
    {"Неизвестное авто",        0,          0,      0},      // 1893
    {"Неизвестное авто",        0,          0,      0},      // 1894
    {"Неизвестное авто",        0,          0,      0},      // 1895
    {"Неизвестное авто",        0,          0,      0},      // 1896
    {"Неизвестное авто",        0,          0,      0},      // 1897
    {"Неизвестное авто",        0,          0,      0},      // 1898
    {"Неизвестное авто",        0,          0,      0},      // 1899
    {"Неизвестное авто",        0,          0,      0},      // 1900
    {"Неизвестное авто",        0,          0,      0},      // 1901
    {"Неизвестное авто",        0,          0,      0},      // 1902
    {"Неизвестное авто",        0,          0,      0},      // 1903
    {"Неизвестное авто",        0,          0,      0},      // 1904
    {"Неизвестное авто",        0,          0,      0},      // 1905
    {"Неизвестное авто",        0,          0,      0},      // 1906
    {"Неизвестное авто",        0,          0,      0},      // 1907
    {"Неизвестное авто",        0,          0,      0},      // 1908
    {"Неизвестное авто",        0,          0,      0},      // 1909
    {"Неизвестное авто",        0,          0,      0},      // 1910
    {"Неизвестное авто",        0,          0,      0},      // 1911
    {"Неизвестное авто",        0,          0,      0},      // 1912
    {"Неизвестное авто",        0,          0,      0},      // 1913
    {"Неизвестное авто",        0,          0,      0},      // 1914
    {"Неизвестное авто",        0,          0,      0},      // 1915
    {"Неизвестное авто",        0,          0,      0},      // 1916
    {"Неизвестное авто",        0,          0,      0},      // 1917
    {"Неизвестное авто",        0,          0,      0},      // 1918
    {"Неизвестное авто",        0,          0,      0},      // 1919
    {"Неизвестное авто",        0,          0,      0},      // 1920
    {"Неизвестное авто",        0,          0,      0},      // 1921
    {"Неизвестное авто",        0,          0,      0},      // 1922
    {"Неизвестное авто",        0,          0,      0},      // 1923
    {"Неизвестное авто",        0,          0,      0},      // 1924
    {"Неизвестное авто",        0,          0,      0},      // 1925
    {"Неизвестное авто",        0,          0,      0},      // 1926
    {"Неизвестное авто",        0,          0,      0},      // 1927
    {"Неизвестное авто",        0,          0,      0},      // 1928
    {"Неизвестное авто",        0,          0,      0},      // 1929
    {"Неизвестное авто",        0,          0,      0},      // 1930
    {"Неизвестное авто",        0,          0,      0},      // 1931
    {"Неизвестное авто",        0,          0,      0},      // 1932
    {"Неизвестное авто",        0,          0,      0},      // 1933
    {"Неизвестное авто",        0,          0,      0},      // 1934
    {"Неизвестное авто",        0,          0,      0},      // 1935
    {"Неизвестное авто",        0,          0,      0},      // 1936
    {"Неизвестное авто",        0,          0,      0},      // 1937
    {"Неизвестное авто",        0,          0,      0},      // 1938
    {"Неизвестное авто",        0,          0,      0},      // 1939
    {"Неизвестное авто",        0,          0,      0},      // 1940
    {"Неизвестное авто",        0,          0,      0},      // 1941
    {"Неизвестное авто",        0,          0,      0},      // 1942
    {"Неизвестное авто",        0,          0,      0},      // 1943
    {"Неизвестное авто",        0,          0,      0},      // 1944
    {"Неизвестное авто",        0,          0,      0},      // 1945
    {"Неизвестное авто",        0,          0,      0},      // 1946
    {"Неизвестное авто",        0,          0,      0},      // 1947
    {"Неизвестное авто",        0,          0,      0},      // 1948
    {"Неизвестное авто",        0,          0,      0},      // 1949
    {"Неизвестное авто",        0,          0,      0},      // 1950
    {"Неизвестное авто",        0,          0,      0},      // 1951
    {"Неизвестное авто",        0,          0,      0},      // 1952
    {"Неизвестное авто",        0,          0,      0},      // 1953
    {"Неизвестное авто",        0,          0,      0},      // 1954
    {"Неизвестное авто",        0,          0,      0},      // 1955
    {"Неизвестное авто",        0,          0,      0},      // 1956
    {"Неизвестное авто",        0,          0,      0},      // 1957
    {"Неизвестное авто",        0,          0,      0},      // 1958
    {"Неизвестное авто",        0,          0,      0},      // 1959
    {"Неизвестное авто",        0,          0,      0},      // 1960
    {"Неизвестное авто",        0,          0,      0},      // 1961
    {"Неизвестное авто",        0,          0,      0},      // 1962
    {"Неизвестное авто",        0,          0,      0},      // 1963
    {"Неизвестное авто",        0,          0,      0},      // 1964
    {"Неизвестное авто",        0,          0,      0},      // 1965
    {"Неизвестное авто",        0,          0,      0},      // 1966
    {"Неизвестное авто",        0,          0,      0},      // 1967
    {"Неизвестное авто",        0,          0,      0},      // 1968
    {"Неизвестное авто",        0,          0,      0},      // 1969
    {"Неизвестное авто",        0,          0,      0},      // 1970
    {"Неизвестное авто",        0,          0,      0},      // 1971
    {"Неизвестное авто",        0,          0,      0},      // 1972
    {"Неизвестное авто",        0,          0,      0},      // 1973
    {"Неизвестное авто",        0,          0,      0},      // 1974
    {"Неизвестное авто",        0,          0,      0},      // 1975
    {"Неизвестное авто",        0,          0,      0},      // 1976
    {"Неизвестное авто",        0,          0,      0},      // 1977
    {"Неизвестное авто",        0,          0,      0},      // 1978
    {"Неизвестное авто",        0,          0,      0},      // 1979
    {"Неизвестное авто",        0,          0,      0},      // 1980
    {"Неизвестное авто",        0,          0,      0},      // 1981
    {"Неизвестное авто",        0,          0,      0},      // 1982
    {"Неизвестное авто",        0,          0,      0},      // 1983
    {"Неизвестное авто",        0,          0,      0},      // 1984
    {"Неизвестное авто",        0,          0,      0},      // 1985
    {"Неизвестное авто",        0,          0,      0},      // 1986
    {"Неизвестное авто",        0,          0,      0},      // 1987
    {"Неизвестное авто",        0,          0,      0},      // 1988
    {"Неизвестное авто",        0,          0,      0},      // 1989
    {"Неизвестное авто",        0,          0,      0},      // 1990
    {"Неизвестное авто",        0,          0,      0},      // 1991
    {"Неизвестное авто",        0,          0,      0},      // 1992
    {"Неизвестное авто",        0,          0,      0},      // 1993
    {"Неизвестное авто",        0,          0,      0},      // 1994
    {"Неизвестное авто",        0,          0,      0},      // 1995
    {"Неизвестное авто",        0,          0,      0},      // 1996
    {"Неизвестное авто",        0,          0,      0},      // 1997
    {"Неизвестное авто",        0,          0,      0},      // 1998
    {"Неизвестное авто",        0,          0,      0},      // 1999
    {"Неизвестное авто",        0,          0,      0},      // 2000
    {"Неизвестное авто",        0,          0,      0},      // 2001
    {"Неизвестное авто",        0,          0,      0},      // 2002
    {"Неизвестное авто",        0,          0,      0},      // 2003
    {"Неизвестное авто",        0,          0,      0},      // 2004
    {"Неизвестное авто",        0,          0,      0},      // 2005
    {"Неизвестное авто",        0,          0,      0},      // 2006
    {"Неизвестное авто",        0,          0,      0},      // 2007
    {"Неизвестное авто",        0,          0,      0},      // 2008
    {"Неизвестное авто",        0,          0,      0},      // 2009
    {"Неизвестное авто",        0,          0,      0},      // 2010
    {"Неизвестное авто",        0,          0,      0},      // 2011
    {"Неизвестное авто",        0,          0,      0},      // 2012
    {"Неизвестное авто",        0,          0,      0},      // 2013
    {"Неизвестное авто",        0,          0,      0},      // 2014
    {"Неизвестное авто",        0,          0,      0},      // 2015
    {"Неизвестное авто",        0,          0,      0},      // 2016
    {"Неизвестное авто",        0,          0,      0},      // 2017
    {"Неизвестное авто",        0,          0,      0},      // 2018
    {"Неизвестное авто",        0,          0,      0},      // 2019
    {"Неизвестное авто",        0,          0,      0},      // 2020
    {"Неизвестное авто",        0,          0,      0},      // 2021
    {"Неизвестное авто",        0,          0,      0},      // 2022
    {"Неизвестное авто",        0,          0,      0},      // 2023
    {"Неизвестное авто",        0,          0,      0},      // 2024
    {"Неизвестное авто",        0,          0,      0},      // 2025
    {"Неизвестное авто",        0,          0,      0},      // 2026
    {"Неизвестное авто",        0,          0,      0},      // 2027
    {"Неизвестное авто",        0,          0,      0},      // 2028
    {"Неизвестное авто",        0,          0,      0},      // 2029
    {"Неизвестное авто",        0,          0,      0},      // 2030
    {"Неизвестное авто",        0,          0,      0},      // 2031
    {"Неизвестное авто",        0,          0,      0},      // 2032
    {"Неизвестное авто",        0,          0,      0},      // 2033
    {"Неизвестное авто",        0,          0,      0},      // 2034
    {"Неизвестное авто",        0,          0,      0},      // 2035
    {"Неизвестное авто",        0,          0,      0},      // 2036
    {"Неизвестное авто",        0,          0,      0},      // 2037
    {"Неизвестное авто",        0,          0,      0},      // 2038
    {"Неизвестное авто",        0,          0,      0},      // 2039
    {"Неизвестное авто",        0,          0,      0},      // 2040
    {"Неизвестное авто",        0,          0,      0},      // 2041
    {"Неизвестное авто",        0,          0,      0},      // 2042
    {"Неизвестное авто",        0,          0,      0},      // 2043
    {"Неизвестное авто",        0,          0,      0},      // 2044
    {"Неизвестное авто",        0,          0,      0},      // 2045
    {"Неизвестное авто",        0,          0,      0},      // 2046
    {"Неизвестное авто",        0,          0,      0},      // 2047
    {"Неизвестное авто",        0,          0,      0},      // 2048
    {"Неизвестное авто",        0,          0,      0},      // 2049
    {"Неизвестное авто",        0,          0,      0},      // 2050
    {"Неизвестное авто",        0,          0,      0},      // 2051
    {"Неизвестное авто",        0,          0,      0},      // 2052
    {"Неизвестное авто",        0,          0,      0},      // 2053
    {"Неизвестное авто",        0,          0,      0},      // 2054
    {"Неизвестное авто",        0,          0,      0},      // 2055
    {"Неизвестное авто",        0,          0,      0},      // 2056
    {"Неизвестное авто",        0,          0,      0},      // 2057
    {"Неизвестное авто",        0,          0,      0},      // 2058
    {"Неизвестное авто",        0,          0,      0},      // 2059
    {"Неизвестное авто",        0,          0,      0},      // 2060
    {"Неизвестное авто",        0,          0,      0},      // 2061
    {"Неизвестное авто",        0,          0,      0},      // 2062
    {"Неизвестное авто",        0,          0,      0},      // 2063
    {"Неизвестное авто",        0,          0,      0},      // 2064
    {"Неизвестное авто",        0,          0,      0},      // 2065
    {"Неизвестное авто",        0,          0,      0},      // 2066
    {"Неизвестное авто",        0,          0,      0},      // 2067
    {"Неизвестное авто",        0,          0,      0},      // 2068
    {"Неизвестное авто",        0,          0,      0},      // 2069
    {"Неизвестное авто",        0,          0,      0},      // 2070
    {"Неизвестное авто",        0,          0,      0},      // 2071
    {"Неизвестное авто",        0,          0,      0},      // 2072
    {"Неизвестное авто",        0,          0,      0},      // 2073
    {"Неизвестное авто",        0,          0,      0},      // 2074
    {"Неизвестное авто",        0,          0,      0},      // 2075
    {"Неизвестное авто",        0,          0,      0},      // 2076
    {"Неизвестное авто",        0,          0,      0},      // 2077
    {"Неизвестное авто",        0,          0,      0},      // 2078
    {"Неизвестное авто",        0,          0,      0},      // 2079
    {"Неизвестное авто",        0,          0,      0},      // 2080
    {"Неизвестное авто",        0,          0,      0},      // 2081
    {"Неизвестное авто",        0,          0,      0},      // 2082
    {"Неизвестное авто",        0,          0,      0},      // 2083
    {"Неизвестное авто",        0,          0,      0},      // 2084
    {"Неизвестное авто",        0,          0,      0},      // 2085
    {"Неизвестное авто",        0,          0,      0},      // 2086
    {"Неизвестное авто",        0,          0,      0},      // 2087
    {"Неизвестное авто",        0,          0,      0},      // 2088
    {"Неизвестное авто",        0,          0,      0},      // 2089
    {"Неизвестное авто",        0,          0,      0},      // 2090
    {"Неизвестное авто",        0,          0,      0},      // 2091
    {"Неизвестное авто",        0,          0,      0},      // 2092
    {"Неизвестное авто",        0,          0,      0},      // 2093
    {"Неизвестное авто",        0,          0,      0},      // 2094
    {"Неизвестное авто",        0,          0,      0},      // 2095
    {"Неизвестное авто",        0,          0,      0},      // 2096
    {"Неизвестное авто",        0,          0,      0},      // 2097
    {"Неизвестное авто",        0,          0,      0},      // 2098
    {"Неизвестное авто",        0,          0,      0},      // 2099
    {"Неизвестное авто",        0,          0,      0},      // 2100
    {"Неизвестное авто",        0,          0,      0},      // 2101
    {"Неизвестное авто",        0,          0,      0},      // 2102
    {"Неизвестное авто",        0,          0,      0},      // 2103
    {"Неизвестное авто",        0,          0,      0},      // 2104
    {"Неизвестное авто",        0,          0,      0},      // 2105
    {"Неизвестное авто",        0,          0,      0},      // 2106
    {"Неизвестное авто",        0,          0,      0},      // 2107
    {"Неизвестное авто",        0,          0,      0},      // 2108
    {"Неизвестное авто",        0,          0,      0},      // 2109
    {"Неизвестное авто",        0,          0,      0},      // 2110
    {"Неизвестное авто",        0,          0,      0},      // 2111
    {"Неизвестное авто",        0,          0,      0},      // 2112
    {"Неизвестное авто",        0,          0,      0},      // 2113
    {"Неизвестное авто",        0,          0,      0},      // 2114
    {"Неизвестное авто",        0,          0,      0},      // 2115
    {"Неизвестное авто",        0,          0,      0},      // 2116
    {"Неизвестное авто",        0,          0,      0},      // 2117
    {"Неизвестное авто",        0,          0,      0},      // 2118
    {"Неизвестное авто",        0,          0,      0},      // 2119
    {"Неизвестное авто",        0,          0,      0},      // 2120
    {"Неизвестное авто",        0,          0,      0},      // 2121
    {"Неизвестное авто",        0,          0,      0},      // 2122
    {"Неизвестное авто",        0,          0,      0},      // 2123
    {"Неизвестное авто",        0,          0,      0},      // 2124
    {"Неизвестное авто",        0,          0,      0},      // 2125
    {"Неизвестное авто",        0,          0,      0},      // 2126
    {"Неизвестное авто",        0,          0,      0},      // 2127
    {"Неизвестное авто",        0,          0,      0},      // 2128
    {"Неизвестное авто",        0,          0,      0},      // 2129
    {"Неизвестное авто",        0,          0,      0},      // 2130
    {"Неизвестное авто",        0,          0,      0},      // 2131
    {"Неизвестное авто",        0,          0,      0},      // 2132
    {"Неизвестное авто",        0,          0,      0},      // 2133
    {"Неизвестное авто",        0,          0,      0},      // 2134
    {"Неизвестное авто",        0,          0,      0},      // 2135
    {"Неизвестное авто",        0,          0,      0},      // 2136
    {"Неизвестное авто",        0,          0,      0},      // 2137
    {"Неизвестное авто",        0,          0,      0},      // 2138
    {"Неизвестное авто",        0,          0,      0},      // 2139
    {"Неизвестное авто",        0,          0,      0},      // 2140
    {"Неизвестное авто",        0,          0,      0},      // 2141
    {"Неизвестное авто",        0,          0,      0},      // 2142
    {"Неизвестное авто",        0,          0,      0},      // 2143
    {"Неизвестное авто",        0,          0,      0},      // 2144
    {"Неизвестное авто",        0,          0,      0},      // 2145
    {"Неизвестное авто",        0,          0,      0},      // 2146
    {"Неизвестное авто",        0,          0,      0},      // 2147
    {"Неизвестное авто",        0,          0,      0},      // 2148
    {"Неизвестное авто",        0,          0,      0},      // 2149
    {"Неизвестное авто",        0,          0,      0},      // 2150
    {"Неизвестное авто",        0,          0,      0},      // 2151
    {"Неизвестное авто",        0,          0,      0},      // 2152
    {"Неизвестное авто",        0,          0,      0},      // 2153
    {"Неизвестное авто",        0,          0,      0},      // 2154
    {"Неизвестное авто",        0,          0,      0},      // 2155
    {"Неизвестное авто",        0,          0,      0},      // 2156
    {"Неизвестное авто",        0,          0,      0},      // 2157
    {"Неизвестное авто",        0,          0,      0},      // 2158
    {"Неизвестное авто",        0,          0,      0},      // 2159
    {"Неизвестное авто",        0,          0,      0},      // 2160
    {"Неизвестное авто",        0,          0,      0},      // 2161
    {"Неизвестное авто",        0,          0,      0},      // 2162
    {"Неизвестное авто",        0,          0,      0},      // 2163
    {"Неизвестное авто",        0,          0,      0},      // 2164
    {"Неизвестное авто",        0,          0,      0},      // 2165
    {"Неизвестное авто",        0,          0,      0},      // 2166
    {"Неизвестное авто",        0,          0,      0},      // 2167
    {"Неизвестное авто",        0,          0,      0},      // 2168
    {"Неизвестное авто",        0,          0,      0},      // 2169
    {"Неизвестное авто",        0,          0,      0},      // 2170
    {"Неизвестное авто",        0,          0,      0},      // 2171
    {"Неизвестное авто",        0,          0,      0},      // 2172
    {"Неизвестное авто",        0,          0,      0},      // 2173
    {"Неизвестное авто",        0,          0,      0},      // 2174
    {"Неизвестное авто",        0,          0,      0},      // 2175
    {"Неизвестное авто",        0,          0,      0},      // 2176
    {"Неизвестное авто",        0,          0,      0},      // 2177
    {"Неизвестное авто",        0,          0,      0},      // 2178
    {"Неизвестное авто",        0,          0,      0},      // 2179
    {"Неизвестное авто",        0,          0,      0},      // 2180
    {"Неизвестное авто",        0,          0,      0},      // 2181
    {"Неизвестное авто",        0,          0,      0},      // 2182
    {"Неизвестное авто",        0,          0,      0},      // 2183
    {"Неизвестное авто",        0,          0,      0},      // 2184
    {"Неизвестное авто",        0,          0,      0},      // 2185
    {"Неизвестное авто",        0,          0,      0},      // 2186
    {"Неизвестное авто",        0,          0,      0},      // 2187
    {"Неизвестное авто",        0,          0,      0},      // 2188
    {"Неизвестное авто",        0,          0,      0},      // 2189
    {"Неизвестное авто",        0,          0,      0},      // 2190
    {"Неизвестное авто",        0,          0,      0},      // 2191
    {"Неизвестное авто",        0,          0,      0},      // 2192
    {"Неизвестное авто",        0,          0,      0},      // 2193
    {"Неизвестное авто",        0,          0,      0},      // 2194
    {"Неизвестное авто",        0,          0,      0},      // 2195
    {"Неизвестное авто",        0,          0,      0},      // 2196
    {"Неизвестное авто",        0,          0,      0},      // 2197
    {"Неизвестное авто",        0,          0,      0},      // 2198
    {"Неизвестное авто",        0,          0,      0},      // 2199
    {"Неизвестное авто",        0,          0,      0},      // 2200
    {"Неизвестное авто",        0,          0,      0},      // 2201
    {"Неизвестное авто",        0,          0,      0},      // 2202
    {"Неизвестное авто",        0,          0,      0},      // 2203
    {"Неизвестное авто",        0,          0,      0},      // 2204
    {"Неизвестное авто",        0,          0,      0},      // 2205
    {"Неизвестное авто",        0,          0,      0},      // 2206
    {"Неизвестное авто",        0,          0,      0},      // 2207
    {"Неизвестное авто",        0,          0,      0},      // 2208
    {"Неизвестное авто",        0,          0,      0},      // 2209
    {"Неизвестное авто",        0,          0,      0},      // 2210
    {"Неизвестное авто",        0,          0,      0},      // 2211
    {"Неизвестное авто",        0,          0,      0},      // 2212
    {"Неизвестное авто",        0,          0,      0},      // 2213
    {"Неизвестное авто",        0,          0,      0},      // 2214
    {"Неизвестное авто",        0,          0,      0},      // 2215
    {"Неизвестное авто",        0,          0,      0},      // 2216
    {"Неизвестное авто",        0,          0,      0},      // 2217
    {"Неизвестное авто",        0,          0,      0},      // 2218
    {"Неизвестное авто",        0,          0,      0},      // 2219
    {"Неизвестное авто",        0,          0,      0},      // 2220
    {"Неизвестное авто",        0,          0,      0},      // 2221
    {"Неизвестное авто",        0,          0,      0},      // 2222
    {"Неизвестное авто",        0,          0,      0},      // 2223
    {"Неизвестное авто",        0,          0,      0},      // 2224
    {"Неизвестное авто",        0,          0,      0},      // 2225
    {"Неизвестное авто",        0,          0,      0},      // 2226
    {"Неизвестное авто",        0,          0,      0},      // 2227
    {"Неизвестное авто",        0,          0,      0},      // 2228
    {"Неизвестное авто",        0,          0,      0},      // 2229
    {"Неизвестное авто",        0,          0,      0},      // 2230
    {"Неизвестное авто",        0,          0,      0},      // 2231
    {"Неизвестное авто",        0,          0,      0},      // 2232
    {"Неизвестное авто",        0,          0,      0},      // 2233
    {"Неизвестное авто",        0,          0,      0},      // 2234
    {"Неизвестное авто",        0,          0,      0},      // 2235
    {"Неизвестное авто",        0,          0,      0},      // 2236
    {"Неизвестное авто",        0,          0,      0},      // 2237
    {"Неизвестное авто",        0,          0,      0},      // 2238
    {"Неизвестное авто",        0,          0,      0},      // 2239
    {"Неизвестное авто",        0,          0,      0},      // 2240
    {"Неизвестное авто",        0,          0,      0},      // 2241
    {"Неизвестное авто",        0,          0,      0},      // 2242
    {"Неизвестное авто",        0,          0,      0},      // 2243
    {"Неизвестное авто",        0,          0,      0},      // 2244
    {"Неизвестное авто",        0,          0,      0},      // 2245
    {"Неизвестное авто",        0,          0,      0},      // 2246
    {"Неизвестное авто",        0,          0,      0},      // 2247
    {"Неизвестное авто",        0,          0,      0},      // 2248
    {"Неизвестное авто",        0,          0,      0},      // 2249
    {"Неизвестное авто",        0,          0,      0},      // 2250
    {"Неизвестное авто",        0,          0,      0},      // 2251
    {"Неизвестное авто",        0,          0,      0},      // 2252
    {"Неизвестное авто",        0,          0,      0},      // 2253
    {"Неизвестное авто",        0,          0,      0},      // 2254
    {"Неизвестное авто",        0,          0,      0},      // 2255
    {"Неизвестное авто",        0,          0,      0},      // 2256
    {"Неизвестное авто",        0,          0,      0},      // 2257
    {"Неизвестное авто",        0,          0,      0},      // 2258
    {"Неизвестное авто",        0,          0,      0},      // 2259
    {"Неизвестное авто",        0,          0,      0},      // 2260
    {"Неизвестное авто",        0,          0,      0},      // 2261
    {"Неизвестное авто",        0,          0,      0},      // 2262
    {"Неизвестное авто",        0,          0,      0},      // 2263
    {"Неизвестное авто",        0,          0,      0},      // 2264
    {"Неизвестное авто",        0,          0,      0},      // 2265
    {"Неизвестное авто",        0,          0,      0},      // 2266
    {"Неизвестное авто",        0,          0,      0},      // 2267
    {"Неизвестное авто",        0,          0,      0},      // 2268
    {"Неизвестное авто",        0,          0,      0},      // 2269
    {"Неизвестное авто",        0,          0,      0},      // 2270
    {"Неизвестное авто",        0,          0,      0},      // 2271
    {"Неизвестное авто",        0,          0,      0},      // 2272
    {"Неизвестное авто",        0,          0,      0},      // 2273
    {"Неизвестное авто",        0,          0,      0},      // 2274
    {"Неизвестное авто",        0,          0,      0},      // 2275
    {"Неизвестное авто",        0,          0,      0},      // 2276
    {"Неизвестное авто",        0,          0,      0},      // 2277
    {"Неизвестное авто",        0,          0,      0},      // 2278
    {"Неизвестное авто",        0,          0,      0},      // 2279
    {"Неизвестное авто",        0,          0,      0},      // 2280
    {"Неизвестное авто",        0,          0,      0},      // 2281
    {"Неизвестное авто",        0,          0,      0},      // 2282
    {"Неизвестное авто",        0,          0,      0},      // 2283
    {"Неизвестное авто",        0,          0,      0},      // 2284
    {"Неизвестное авто",        0,          0,      0},      // 2285
    {"Неизвестное авто",        0,          0,      0},      // 2286
    {"Неизвестное авто",        0,          0,      0},      // 2287
    {"Неизвестное авто",        0,          0,      0},      // 2288
    {"Неизвестное авто",        0,          0,      0},      // 2289
    {"Неизвестное авто",        0,          0,      0},      // 2290
    {"Неизвестное авто",        0,          0,      0},      // 2291
    {"Неизвестное авто",        0,          0,      0},      // 2292
    {"Неизвестное авто",        0,          0,      0},      // 2293
    {"Неизвестное авто",        0,          0,      0},      // 2294
    {"Неизвестное авто",        0,          0,      0},      // 2295
    {"Неизвестное авто",        0,          0,      0},      // 2296
    {"Неизвестное авто",        0,          0,      0},      // 2297
    {"Неизвестное авто",        0,          0,      0},      // 2298
    {"Неизвестное авто",        0,          0,      0},      // 2299
    {"Неизвестное авто",        0,          0,      0},      // 2300
    {"Неизвестное авто",        0,          0,      0},      // 2301
    {"Неизвестное авто",        0,          0,      0},      // 2302
    {"Неизвестное авто",        0,          0,      0},      // 2303
    {"Неизвестное авто",        0,          0,      0},      // 2304
    {"Неизвестное авто",        0,          0,      0},      // 2305
    {"Неизвестное авто",        0,          0,      0},      // 2306
    {"Неизвестное авто",        0,          0,      0},      // 2307
    {"Неизвестное авто",        0,          0,      0},      // 2308
    {"Неизвестное авто",        0,          0,      0},      // 2309
    {"Неизвестное авто",        0,          0,      0},      // 2310
    {"Неизвестное авто",        0,          0,      0},      // 2311
    {"Неизвестное авто",        0,          0,      0},      // 2312
    {"Неизвестное авто",        0,          0,      0},      // 2313
    {"Неизвестное авто",        0,          0,      0},      // 2314
    {"Неизвестное авто",        0,          0,      0},      // 2315
    {"Неизвестное авто",        0,          0,      0},      // 2316
    {"Неизвестное авто",        0,          0,      0},      // 2317
    {"Неизвестное авто",        0,          0,      0},      // 2318
    {"Неизвестное авто",        0,          0,      0},      // 2319
    {"Неизвестное авто",        0,          0,      0},      // 2320
    {"Неизвестное авто",        0,          0,      0},      // 2321
    {"Неизвестное авто",        0,          0,      0},      // 2322
    {"Неизвестное авто",        0,          0,      0},      // 2323
    {"Неизвестное авто",        0,          0,      0},      // 2324
    {"Неизвестное авто",        0,          0,      0},      // 2325
    {"Неизвестное авто",        0,          0,      0},      // 2326
    {"Неизвестное авто",        0,          0,      0},      // 2327
    {"Неизвестное авто",        0,          0,      0},      // 2328
    {"Неизвестное авто",        0,          0,      0},      // 2329
    {"Неизвестное авто",        0,          0,      0},      // 2330
    {"Неизвестное авто",        0,          0,      0},      // 2331
    {"Неизвестное авто",        0,          0,      0},      // 2332
    {"Неизвестное авто",        0,          0,      0},      // 2333
    {"Неизвестное авто",        0,          0,      0},      // 2334
    {"Неизвестное авто",        0,          0,      0},      // 2335
    {"Неизвестное авто",        0,          0,      0},      // 2336
    {"Неизвестное авто",        0,          0,      0},      // 2337
    {"Неизвестное авто",        0,          0,      0},      // 2338
    {"Неизвестное авто",        0,          0,      0},      // 2339
    {"Неизвестное авто",        0,          0,      0},      // 2340
    {"Неизвестное авто",        0,          0,      0},      // 2341
    {"Неизвестное авто",        0,          0,      0},      // 2342
    {"Неизвестное авто",        0,          0,      0},      // 2343
    {"Неизвестное авто",        0,          0,      0},      // 2344
    {"Неизвестное авто",        0,          0,      0},      // 2345
    {"Неизвестное авто",        0,          0,      0},      // 2346
    {"Неизвестное авто",        0,          0,      0},      // 2347
    {"Неизвестное авто",        0,          0,      0},      // 2348
    {"Неизвестное авто",        0,          0,      0},      // 2349
    {"Неизвестное авто",        0,          0,      0},      // 2350
    {"Неизвестное авто",        0,          0,      0},      // 2351
    {"Неизвестное авто",        0,          0,      0},      // 2352
    {"Неизвестное авто",        0,          0,      0},      // 2353
    {"Неизвестное авто",        0,          0,      0},      // 2354
    {"Неизвестное авто",        0,          0,      0},      // 2355
    {"Неизвестное авто",        0,          0,      0},      // 2356
    {"Неизвестное авто",        0,          0,      0},      // 2357
    {"Неизвестное авто",        0,          0,      0},      // 2358
    {"Неизвестное авто",        0,          0,      0},      // 2359
    {"Неизвестное авто",        0,          0,      0},      // 2360
    {"Неизвестное авто",        0,          0,      0},      // 2361
    {"Неизвестное авто",        0,          0,      0},      // 2362
    {"Неизвестное авто",        0,          0,      0},      // 2363
    {"Неизвестное авто",        0,          0,      0},      // 2364
    {"Неизвестное авто",        0,          0,      0},      // 2365
    {"Неизвестное авто",        0,          0,      0},      // 2366
    {"Неизвестное авто",        0,          0,      0},      // 2367
    {"Неизвестное авто",        0,          0,      0},      // 2368
    {"Неизвестное авто",        0,          0,      0},      // 2369
    {"Неизвестное авто",        0,          0,      0},      // 2370
    {"Неизвестное авто",        0,          0,      0},      // 2371
    {"Неизвестное авто",        0,          0,      0},      // 2372
    {"Неизвестное авто",        0,          0,      0},      // 2373
    {"Неизвестное авто",        0,          0,      0},      // 2374
    {"Неизвестное авто",        0,          0,      0},      // 2375
    {"Неизвестное авто",        0,          0,      0},      // 2376
    {"Неизвестное авто",        0,          0,      0},      // 2377
    {"Неизвестное авто",        0,          0,      0},      // 2378
    {"Неизвестное авто",        0,          0,      0},      // 2379
    {"Неизвестное авто",        0,          0,      0},      // 2380
    {"Неизвестное авто",        0,          0,      0},      // 2381
    {"Неизвестное авто",        0,          0,      0},      // 2382
    {"Неизвестное авто",        0,          0,      0},      // 2383
    {"Неизвестное авто",        0,          0,      0},      // 2384
    {"Неизвестное авто",        0,          0,      0},      // 2385
    {"Неизвестное авто",        0,          0,      0},      // 2386
    {"Неизвестное авто",        0,          0,      0},      // 2387
    {"Неизвестное авто",        0,          0,      0},      // 2388
    {"Неизвестное авто",        0,          0,      0},      // 2389
    {"Неизвестное авто",        0,          0,      0},      // 2390
    {"Неизвестное авто",        0,          0,      0},      // 2391
    {"Неизвестное авто",        0,          0,      0},      // 2392
    {"Неизвестное авто",        0,          0,      0},      // 2393
    {"Неизвестное авто",        0,          0,      0},      // 2394
    {"Неизвестное авто",        0,          0,      0},      // 2395
    {"Неизвестное авто",        0,          0,      0},      // 2396
    {"Неизвестное авто",        0,          0,      0},      // 2397
    {"Неизвестное авто",        0,          0,      0},      // 2398
    {"Неизвестное авто",        0,          0,      0},      // 2399
    {"Неизвестное авто",        0,          0,      0},      // 2400
    {"Неизвестное авто",        0,          0,      0},      // 2401
    {"Неизвестное авто",        0,          0,      0},      // 2402
    {"Неизвестное авто",        0,          0,      0},      // 2403
    {"Неизвестное авто",        0,          0,      0},      // 2404
    {"Неизвестное авто",        0,          0,      0},      // 2405
    {"Неизвестное авто",        0,          0,      0},      // 2406
    {"Неизвестное авто",        0,          0,      0},      // 2407
    {"Неизвестное авто",        0,          0,      0},      // 2408
    {"Неизвестное авто",        0,          0,      0},      // 2409
    {"Неизвестное авто",        0,          0,      0},      // 2410
    {"Неизвестное авто",        0,          0,      0},      // 2411
    {"Неизвестное авто",        0,          0,      0},      // 2412
    {"Неизвестное авто",        0,          0,      0},      // 2413
    {"Неизвестное авто",        0,          0,      0},      // 2414
    {"Неизвестное авто",        0,          0,      0},      // 2415
    {"Неизвестное авто",        0,          0,      0},      // 2416
    {"Неизвестное авто",        0,          0,      0},      // 2417
    {"Неизвестное авто",        0,          0,      0},      // 2418
    {"Неизвестное авто",        0,          0,      0},      // 2419
    {"Неизвестное авто",        0,          0,      0},      // 2420
    {"Неизвестное авто",        0,          0,      0},      // 2421
    {"Неизвестное авто",        0,          0,      0},      // 2422
    {"Неизвестное авто",        0,          0,      0},      // 2423
    {"Неизвестное авто",        0,          0,      0},      // 2424
    {"Неизвестное авто",        0,          0,      0},      // 2425
    {"Неизвестное авто",        0,          0,      0},      // 2426
    {"Неизвестное авто",        0,          0,      0},      // 2427
    {"Неизвестное авто",        0,          0,      0},      // 2428
    {"Неизвестное авто",        0,          0,      0},      // 2429
    {"Неизвестное авто",        0,          0,      0},      // 2430
    {"Неизвестное авто",        0,          0,      0},      // 2431
    {"Неизвестное авто",        0,          0,      0},      // 2432
    {"Неизвестное авто",        0,          0,      0},      // 2433
    {"Неизвестное авто",        0,          0,      0},      // 2434
    {"Неизвестное авто",        0,          0,      0},      // 2435
    {"Неизвестное авто",        0,          0,      0},      // 2436
    {"Неизвестное авто",        0,          0,      0},      // 2437
    {"Неизвестное авто",        0,          0,      0},      // 2438
    {"Неизвестное авто",        0,          0,      0},      // 2439
    {"Неизвестное авто",        0,          0,      0},      // 2440
    {"Неизвестное авто",        0,          0,      0},      // 2441
    {"Неизвестное авто",        0,          0,      0},      // 2442
    {"Неизвестное авто",        0,          0,      0},      // 2443
    {"Неизвестное авто",        0,          0,      0},      // 2444
    {"Неизвестное авто",        0,          0,      0},      // 2445
    {"Неизвестное авто",        0,          0,      0},      // 2446
    {"Неизвестное авто",        0,          0,      0},      // 2447
    {"Неизвестное авто",        0,          0,      0},      // 2448
    {"Неизвестное авто",        0,          0,      0},      // 2449
    {"Неизвестное авто",        0,          0,      0},      // 2450
    {"Неизвестное авто",        0,          0,      0},      // 2451
    {"Неизвестное авто",        0,          0,      0},      // 2452
    {"Неизвестное авто",        0,          0,      0},      // 2453
    {"Неизвестное авто",        0,          0,      0},      // 2454
    {"Неизвестное авто",        0,          0,      0},      // 2455
    {"Неизвестное авто",        0,          0,      0},      // 2456
    {"Неизвестное авто",        0,          0,      0},      // 2457
    {"Неизвестное авто",        0,          0,      0},      // 2458
    {"Неизвестное авто",        0,          0,      0},      // 2459
    {"Неизвестное авто",        0,          0,      0},      // 2460
    {"Неизвестное авто",        0,          0,      0},      // 2461
    {"Неизвестное авто",        0,          0,      0},      // 2462
    {"Неизвестное авто",        0,          0,      0},      // 2463
    {"Неизвестное авто",        0,          0,      0},      // 2464
    {"Неизвестное авто",        0,          0,      0},      // 2465
    {"Неизвестное авто",        0,          0,      0},      // 2466
    {"Неизвестное авто",        0,          0,      0},      // 2467
    {"Неизвестное авто",        0,          0,      0},      // 2468
    {"Неизвестное авто",        0,          0,      0},      // 2469
    {"Неизвестное авто",        0,          0,      0},      // 2470
    {"Неизвестное авто",        0,          0,      0},      // 2471
    {"Неизвестное авто",        0,          0,      0},      // 2472
    {"Неизвестное авто",        0,          0,      0},      // 2473
    {"Неизвестное авто",        0,          0,      0},      // 2474
    {"Неизвестное авто",        0,          0,      0},      // 2475
    {"Неизвестное авто",        0,          0,      0},      // 2476
    {"Неизвестное авто",        0,          0,      0},      // 2477
    {"Неизвестное авто",        0,          0,      0},      // 2478
    {"Неизвестное авто",        0,          0,      0},      // 2479
    {"Неизвестное авто",        0,          0,      0},      // 2480
    {"Неизвестное авто",        0,          0,      0},      // 2481
    {"Неизвестное авто",        0,          0,      0},      // 2482
    {"Неизвестное авто",        0,          0,      0},      // 2483
    {"Неизвестное авто",        0,          0,      0},      // 2484
    {"Неизвестное авто",        0,          0,      0},      // 2485
    {"Неизвестное авто",        0,          0,      0},      // 2486
    {"Неизвестное авто",        0,          0,      0},      // 2487
    {"Неизвестное авто",        0,          0,      0},      // 2488
    {"Неизвестное авто",        0,          0,      0},      // 2489
    {"Неизвестное авто",        0,          0,      0},      // 2490
    {"Неизвестное авто",        0,          0,      0},      // 2491
    {"Неизвестное авто",        0,          0,      0},      // 2492
    {"Неизвестное авто",        0,          0,      0},      // 2493
    {"Неизвестное авто",        0,          0,      0},      // 2494
    {"Неизвестное авто",        0,          0,      0},      // 2495
    {"Неизвестное авто",        0,          0,      0},      // 2496
    {"Неизвестное авто",        0,          0,      0},      // 2497
    {"Неизвестное авто",        0,          0,      0},      // 2498
    {"Неизвестное авто",        0,          0,      0},      // 2499
    {"Неизвестное авто",        0,          0,      0},      // 2500
    {"Неизвестное авто",        0,          0,      0},      // 2501
    {"Неизвестное авто",        0,          0,      0},      // 2502
    {"Неизвестное авто",        0,          0,      0},      // 2503
    {"Неизвестное авто",        0,          0,      0},      // 2504
    {"Неизвестное авто",        0,          0,      0},      // 2505
    {"Неизвестное авто",        0,          0,      0},      // 2506
    {"Неизвестное авто",        0,          0,      0},      // 2507
    {"Неизвестное авто",        0,          0,      0},      // 2508
    {"Неизвестное авто",        0,          0,      0},      // 2509
    {"Неизвестное авто",        0,          0,      0},      // 2510
    {"Неизвестное авто",        0,          0,      0},      // 2511
    {"Неизвестное авто",        0,          0,      0},      // 2512
    {"Неизвестное авто",        0,          0,      0},      // 2513
    {"Неизвестное авто",        0,          0,      0},      // 2514
    {"Неизвестное авто",        0,          0,      0},      // 2515
    {"Неизвестное авто",        0,          0,      0},      // 2516
    {"Неизвестное авто",        0,          0,      0},      // 2517
    {"Неизвестное авто",        0,          0,      0},      // 2518
    {"Неизвестное авто",        0,          0,      0},      // 2519
    {"Неизвестное авто",        0,          0,      0},      // 2520
    {"Неизвестное авто",        0,          0,      0},      // 2521
    {"Неизвестное авто",        0,          0,      0},      // 2522
    {"Неизвестное авто",        0,          0,      0},      // 2523
    {"Неизвестное авто",        0,          0,      0},      // 2524
    {"Неизвестное авто",        0,          0,      0},      // 2525
    {"Неизвестное авто",        0,          0,      0},      // 2526
    {"Неизвестное авто",        0,          0,      0},      // 2527
    {"Неизвестное авто",        0,          0,      0},      // 2528
    {"Неизвестное авто",        0,          0,      0},      // 2529
    {"Неизвестное авто",        0,          0,      0},      // 2530
    {"Неизвестное авто",        0,          0,      0},      // 2531
    {"Неизвестное авто",        0,          0,      0},      // 2532
    {"Неизвестное авто",        0,          0,      0},      // 2533
    {"Неизвестное авто",        0,          0,      0},      // 2534
    {"Неизвестное авто",        0,          0,      0},      // 2535
    {"Неизвестное авто",        0,          0,      0},      // 2536
    {"Неизвестное авто",        0,          0,      0},      // 2537
    {"Неизвестное авто",        0,          0,      0},      // 2538
    {"Неизвестное авто",        0,          0,      0},      // 2539
    {"Неизвестное авто",        0,          0,      0},      // 2540
    {"Неизвестное авто",        0,          0,      0},      // 2541
    {"Неизвестное авто",        0,          0,      0},      // 2542
    // Начало тачек
    {"Tesla Model X",        21000000,      12500,      2,      256,    3.4},      // 2543
    {"Tesla Model S",        15000000,      12500,      2,      252,    3.3},      // 2544
    {"Audi RS7 Sport",        9500000,      12500,      2,      252,    3.3},      // 2545
    {"Mercedes-Benz E63S",        11500000,      12500,      2,      314,    3.2},      // 2546
    {"Toyota Land Cruiser 200",        7800000,      12500,      2,      220,    8.6},      // 2547
    {"Lada Vesta Sedan",        700000,      7500,      1,      184,    9.4},      // 2548
    {"Lamborghini Huracan",        16500000,      12500,      2,      330,    2.9},      // 2549
    {"Mercedes-Benz GLS 400",        9150000,      12500,      2,      240,    6.4},      // 2550
    {"Lamborghini Urus",        15300000,      12500,      2,      305,    3.6},      // 2551
    {"Toyota Supra A80",        2700000,      7500,      1,      259,    5.4},      // 2552
    {"Audi Q7",        7000000,      12500,      2,      238,    6.2},      // 2553
    {"Jeep Grand Cherokee",        450000,      7500,      1,      185,    9.7},      // 2554
    {"Lada Granta",        370000,      2500,      0,      176,    11.5},      // 2555
    {"Lada Granta (ФСИН)",        0,      0,      0,      176,    11.5},      // 2556
    {"Lada Vesta SW Cross",        700000,      7500,      1,      184,    9.6},      // 2557
    {"Mercedes-Benz MB S650",        25000000,      12500,      2,      248,    5.0},      // 2558
    {"Cadillac Escalade",        11500000,      12500,      2,      210,    6.4},      // 2559
    {"UAZ Patriot",        1200000,      7500,      1,      163,    12.0},      // 2560
    {"UAZ Patriot Pickup",        1250000,      7500,      1,      163,    12.0},      // 2561
    {"UAZ Патриот (ФСИН)",        0,      0,      0,      163,    12.0},      // 2562
    {"Rolls-Royce Phantom",        50000000,      12500,      2,      265,    5.3},      // 2563
    {"Rolls-Royce Cullinan",        40000000,      12500,      2,      260,    5.2},      // 2564
    {"Renault Logan",        715000,      7500,      1,      173,    10.2},      // 2565
    {"Kia Rio",        800000,      7500,      1,      193,    9.7},      // 2566
    {"BMW M5 E60",        2100000,      7500,      1,      240,    4.7},      // 2567
    {"BMW X5 E53",        1500000,      7500,      1,      215,    6.4},      // 2568
    {"Bugatti La Noire",        1000000000,      12500,      2,      400,    2.2},      // 2569
    {"Bugatti Divo",        380000000,      12500,      2,      380,    2.4},      // 2570
    {"Volkswagen Station Delux",        7000000,      12500,      2,      150,    10.4},      // 2571
    {"Raesr Tachyon 2019",        12000000,      12500,      2,      150,    10.4},      // 2572
    {"Mercedes-Benz G63 AMG",        23000000,      12500,      2,      223,    5.0},      // 2573
    {"BMW X7 M50i",        10500000,      12500,      2,      250,    4.7},      // 2574
    {"Lexus LX570",        11455000,      12500,      2,      230,    6.9},      // 2575
    {"Mercury Coupe",        10000000,      12500,      2,      240,    4.7},      // 2576
    {"Morris Minor",        5000000,      12500,      2,      215,    6.4},      // 2577
    {"BMW M8 F92",        17200000,      12500,      2,      312,    3.4},      // 2578
    {"BMW M8 F93 Gran Coupe",        19000000,      12500,      2,      312,    3.2},      // 2579
    {"BMW 7-Series E38",        950000,      7500,      1,      246,    5.6},      // 2580
    {"Porsche Taycan Turbo S", 18300000, 12500, 2, 254, 3.2},      // 2581
    {"Mercedes-Benz CLS63 AMG", 10300000, 12500, 2, 305, 3.6},     // 2582
    {"Rolls-Royce Wraith", 35000000, 12500, 2, 264, 4.6},          // 2583
    {"KIA K5", 2500000, 7500, 1, 249, 5.8},                        // 2584
    {"Mercedes-Benz 300SL Coupe", 7000000, 12500, 2, 265, 4.6},    // 2585
    {"Jaguar XK120 Roadster", 7000000, 12500, 2, 265, 4.6},        // 2586
    {"Ford Transit 2020", 2500000, 7500, 1, 168, 11.3},            // 2587
    {"Ford Focus 3 Sedan", 930000, 7500, 1, 220, 8.5},             // 2588
    {"Skoda Rapid 2020", 870000, 7500, 1, 209, 9.0},               // 2589
    {"Mercedes-Benz EQS580", 24000000, 12500, 2, 270, 3.2},        // 2590
    {"Bentley Continental GT", 55000000, 12500, 2, 333, 3.6},      // 2591
    {"Lotus Exige Halloween", 5000000, 12500, 2, 260, 4.0},        // 2592
    {"Lamborghini Gallardo", 8000000, 12500, 2, 310, 3.1},         // 2593
    {"Subaru BRZ", 2000000, 12500, 2, 251, 5.5},                   // 2594
    {"Porsche 911 Singer", 6000000, 12500, 2, 300, 3.8},           // 2595
    {"Dodge RAM TRX", 4000000, 12500, 2, 215, 5.2},                 // 2596
    {"Aurus Senat",        30000000,          12500,      2, 260, 5.8},      // 2597
    {"BMW M4 G82",        7700000,          12500,      2, 265, 3.4},      // 2598
    {"BMW 7-Series 750Li",        14300000,          12500,      2, 260, 4.4},      // 2599
    {"Bentley Mulliner Bacalar",        125000000,          12500,      2, 333, 3.5},      // 2600
    {"Bugatti Chiron",       210000000,          12500,      2, 370, 2.5},      // 2601
    {"Chevrolet Tahoe RST",        8900000,          12500,      2, 200, 6.8},      // 2602
    {"Mercedes-Benz E63 W212",        7500000,          12500,      2, 278, 3.5},      // 2603
    {"Volkswagen Passat 2021",        2900000,          7500,      1, 246, 5.5},      // 2604
    {"Ferrari California T",       1690000,          12500,      2, 310, 3.6},      // 2605
    {"AC Shelby Cobra",        5000000,          12500,      2, 271, 4.2},      // 2606
    {"BMW M1",        70000000,          12500,      2, 275, 3.9},      // 2607
    {"Jeep Wrangler",        5300000,          12500,      2, 240, 5},      // 2608
    {"Mini Cooper",        2850000,          7500,      1, 246, 4.9},      // 2609
    {"BMW M5 E34",        600000,          7500,      1, 245, 5.5},      // 2610
    {"Audi 100 C4",        520000,          2500,      0, 242, 5.6},      // 2611
    {"Ford Mustang Hoonigan",        5000000,          12500,      2, 295, 3.1},      // 2612
    {"Hummer H2 6X6",        5500000,          12500,      2, 220, 5.2},      // 2613
    {"Ferrari 250GT California",        1699000,          12500,      2, 275, 4.4},      // 2614
    {"ИЖ Юпитер 5",        1000000,          5000,      2, 210, 4},      // 2615
    {"UAZ Hunter",        360000,          2500,      0, 140, 13},      // 2616
    {"Hummer Humvee",        7000000,          15000,      2, 155, 13},      // 2617
    {"BMW M3 E36",              600000,     2400,   0, 247, 5},     // 2618
    {"Ferrari 488 Pista",              26000000,    42000,  2, 340, 2.7},     // 2619
    {"Lexus RCF",              3400000,     2400,   0, 263, 4.1},     // 2620
    {"XPENG P7",        4000000,          7500,      1, 235, 4.4},      // 2621
    {"Ford Mustang Mach E",        5200000,          7500,      1, 240, 4.1},      // 2622
    {"Toyota Camry XV55",        1600000,          7500,      1, 242, 5.5},      // 2623
    {"Audi A6 C5",        1000000,          7500,      1, 248, 5.8},      // 2624
    {"Infiniti FX50S",        3700000,          7500,      1, 252, 5.5},      // 2625
    {"Porsche Cayenne S",        14700000,          7500,      1, 282, 4},      // 2626
    {"Nissan Silvia S15",         1700000,          7500,      1, 252, 5},      // 2627
    {"BRF Outlander 6x6",        3500000,      12500,      2,      100,    7},      // 2628
    {"Урал ИМЗ 8.103",        300000,      12500,      2,      175,    3},      // 2629
    {"Москвич 412",        1000000,      12500,      2,      215,    8},      // 2630
    {"Subaru WRX STI (Rally)",     2200000,      12500,      2,      250,    5.5},      // 2631
    {"Toyota Hilux Dakar",        2500000,      12500,      2,      180,    8},      // 2632
    {"Ford GT Sport",        2000000,      12500,      2,      333,    3.8}    // 2633
};

stock SetVehicleDataAll(vehicleid, modelid, Float:x, Float:y, Float:z, Float:angle, color1, color2, respawn_delay, addsiren=0, action_type, action_id)
{
	if(IsValidVehicleID(vehicleid))
	{
		SetVehicleData(vehicleid, V_MODELID, modelid);
		
		SetVehicleData(vehicleid, V_SPAWN_X, 		x);
		SetVehicleData(vehicleid, V_SPAWN_Y, 		y);
		SetVehicleData(vehicleid, V_SPAWN_Z, 		z);
		SetVehicleData(vehicleid, V_SPAWN_ANGLE, 	angle);
		
		SetVehicleData(vehicleid, V_COLOR_1, 	color1);
		SetVehicleData(vehicleid, V_COLOR_2, 	color2);
		
		SetVehicleData(vehicleid, V_RESPAWN_DELAY, 	respawn_delay);
		SetVehicleData(vehicleid, V_ADDSIREN, 		addsiren);
		
		SetVehicleData(vehicleid, V_ACTION_TYPE, 	action_type);
		SetVehicleData(vehicleid, V_ACTION_ID, 		action_id);
		SetVehicleData(vehicleid, V_DRIVER_ID, 		INVALID_PLAYER_ID);
		
		SetVehicleData(vehicleid, V_FUEL, 150.9);
		SetVehicleData(vehicleid, V_MILEAGE, 0.0);
		SetVehicleData(vehicleid, V_LIMIT, true);

		SetVehicleData(vehicleid, V_HEALTH, 1000.0);
	    DeleteVehicleTuning(vehicleid, color1, color2);
		SetVehicleParamsEx(vehicleid, IsABike(vehicleid) ? VEHICLE_PARAM_ON : VEHICLE_PARAM_OFF, VEHICLE_PARAM_OFF, VEHICLE_PARAM_OFF, VEHICLE_PARAM_OFF, VEHICLE_PARAM_OFF, VEHICLE_PARAM_OFF, VEHICLE_PARAM_OFF);		
	}
}

stock n_veh_AddStaticVehicleEx(modelid, Float:x, Float:y, Float:z, Float:angle, color1, color2, respawn_delay, addsiren=0, action_type=VEHICLE_ACTION_TYPE_NONE, action_id=VEHICLE_ACTION_ID_NONE)
{
	static n_veh_vehicleid = INVALID_VEHICLE_ID;
	
	n_veh_vehicleid = AddStaticVehicleEx(modelid, x, y, z, angle, color1, color2, respawn_delay);
	SetVehicleDataAll(n_veh_vehicleid, modelid, x, y, z, angle, color1, color2, respawn_delay, addsiren, action_type, action_id);

	return n_veh_vehicleid;
	
	// The vehicle ID of the vehicle created (1 - MAX_VEHICLES).
	// INVALID_VEHICLE_ID (65535) if vehicle was not created (vehicle limit reached or invalid vehicle model ID passed).
}
#if defined _ALS_AddStaticVehicleEx
    #undef AddStaticVehicleEx
#else
    #define _ALS_AddStaticVehicleEx
#endif
#define AddStaticVehicleEx n_veh_AddStaticVehicleEx

stock n_veh_AddStaticVehicle(modelid, Float:x, Float:y, Float:z, Float:angle, color1, color2, action_type=VEHICLE_ACTION_TYPE_NONE, action_id=VEHICLE_ACTION_ID_NONE)
{
	static n_veh_vehicleid = INVALID_VEHICLE_ID;
	
	n_veh_vehicleid = AddStaticVehicle(modelid, x, y, z, angle, color1, color2);
	SetVehicleDataAll(n_veh_vehicleid, modelid, x, y, z, angle, color1, color2, 0, 0, action_type, action_id);

	return n_veh_vehicleid;
	
	// The vehicle ID of the vehicle created (1 - MAX_VEHICLES).
	// INVALID_VEHICLE_ID (65535) if vehicle was not created (vehicle limit reached or invalid vehicle model ID passed).
}
#if defined _ALS_AddStaticVehicle
    #undef AddStaticVehicle
#else
    #define _ALS_AddStaticVehicle
#endif
#define AddStaticVehicle n_veh_AddStaticVehicle

stock n_veh_CreateVehicle(modelid, Float:x, Float:y, Float:z, Float:angle, color1, color2, respawn_delay, addsiren=0, action_type=VEHICLE_ACTION_TYPE_NONE, action_id=VEHICLE_ACTION_ID_NONE)
{
	static n_veh_vehicleid = INVALID_VEHICLE_ID;
	
	n_veh_vehicleid = CreateVehicle(modelid, x, y, z, angle, color1, color2, respawn_delay);
	SetVehicleDataAll(n_veh_vehicleid, modelid, x, y, z, angle, color1, color2, respawn_delay, addsiren, action_type, action_id);    
    
	return n_veh_vehicleid;
	
	// The vehicle ID of the vehicle created (1 - MAX_VEHICLES).
	// INVALID_VEHICLE_ID (65535) if vehicle was not created (vehicle limit reached or invalid vehicle model ID passed).
}
#if defined _ALS_CreateVehicle
    #undef CreateVehicle
#else
    #define _ALS_CreateVehicle
#endif
#define CreateVehicle n_veh_CreateVehicle

stock n_veh_DestroyVehicle(vehicleid)
{
	if(IsValidVehicleID(vehicleid))
	{
		ClearVehicleData(vehicleid);
		DestroyVehicleLabel(vehicleid);
	}
	return DestroyVehicle(vehicleid);
}
#if defined _ALS_DestroyVehicle
    #undef DestroyVehicle
#else
    #define _ALS_DestroyVehicle
#endif
#define DestroyVehicle n_veh_DestroyVehicle

public OnGameModeInit()
{
    for(new idx = 0; idx < MAX_VEHICLES; idx ++)
	{
		ClearVehicleData(idx);
	}
	
#if defined n_veh_OnGameModeInit
    n_veh_OnGameModeInit();
#endif
    return 1;
}
#if defined _ALS_OnGameModeInit
    #undef OnGameModeInit
#else
    #define _ALS_OnGameModeInit
#endif
#define OnGameModeInit n_veh_OnGameModeInit
#if defined n_veh_OnGameModeInit
forward n_veh_OnGameModeInit();
#endif  

// ---------------------------------------------------
stock SetVehicleParamsInit(vehicleid)
{	
	GetVehicleParamsEx
	(
		vehicleid, 
		g_vehicle_params[vehicleid][V_ENGINE],
		g_vehicle_params[vehicleid][V_LIGHTS],
		g_vehicle_params[vehicleid][V_ALARM],
		g_vehicle_params[vehicleid][V_LOCK],
		g_vehicle_params[vehicleid][V_BONNET],
		g_vehicle_params[vehicleid][V_BOOT],
		g_vehicle_params[vehicleid][V_OBJECTIVE]
	);
}

stock GetVehicleParam(vehicleid, E_VEHICLE_PARAMS_STRUCT:paramid)
{
	SetVehicleParamsInit(vehicleid);
	return g_vehicle_params[vehicleid][paramid];
}

stock SetVehicleParam(vehicleid, E_VEHICLE_PARAMS_STRUCT:paramid, set_value)
{
	SetVehicleParamsInit(vehicleid);
	g_vehicle_params[vehicleid][paramid] = bool: set_value;
	
	SetVehicleParamsEx
	(
		vehicleid,
		g_vehicle_params[vehicleid][V_ENGINE],
		g_vehicle_params[vehicleid][V_LIGHTS],
		g_vehicle_params[vehicleid][V_ALARM],
		g_vehicle_params[vehicleid][V_LOCK],
		g_vehicle_params[vehicleid][V_BONNET],
		g_vehicle_params[vehicleid][V_BOOT],
		g_vehicle_params[vehicleid][V_OBJECTIVE]
	);
}

stock CreateVehicleLabel(vehicleid, text[], color, Float:x, Float:y, Float:z, Float:drawdistance, testlos = 0, worldid = -1, interiorid = -1, playerid = -1, Float:streamdistance = STREAMER_3D_TEXT_LABEL_SD)
{
	if(IsValidVehicle(vehicleid))
	{
		SetVehicleData(vehicleid, V_LABEL, CreateDynamic3DTextLabel(text, color, x, y, z, drawdistance, INVALID_PLAYER_ID, vehicleid, testlos, worldid, interiorid, playerid, streamdistance));
	}
	return 1;
}

stock UpdateVehicleLabel(vehicleid, color, text[])
{
	if(IsValidVehicleID(vehicleid))
	{
		if(IsValidDynamic3DTextLabel(GetVehicleData(vehicleid, V_LABEL)))
		{
			UpdateDynamic3DTextLabelText(GetVehicleData(vehicleid, V_LABEL), color, text);
		}
	}
	return 1;
}

stock DestroyVehicleLabel(vehicleid)
{
	if(IsValidVehicleID(vehicleid))
	{
		if(IsValidDynamic3DTextLabel(GetVehicleData(vehicleid, V_LABEL)))
		{
			DestroyDynamic3DTextLabel(GetVehicleData(vehicleid, V_LABEL));
			SetVehicleData(vehicleid, V_LABEL, Text3D: -1);
		}
	}
	return 1;
}
