-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Авг 13 2026 г., 17:04
-- Версия сервера: 10.5.29-MariaDB-0+deb11u1
-- Версия PHP: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gs348142`
--

-- --------------------------------------------------------

--
-- Структура таблицы `accessories`
--

CREATE TABLE `accessories` (
  `account_id` int(11) NOT NULL,
  `slot` tinyint(4) NOT NULL,
  `modelid` int(11) NOT NULL,
  `bone` tinyint(4) NOT NULL,
  `pos_x` float DEFAULT NULL,
  `pos_y` float DEFAULT NULL,
  `pos_z` float DEFAULT NULL,
  `rot_x` float DEFAULT NULL,
  `rot_y` float DEFAULT NULL,
  `rot_z` float DEFAULT NULL,
  `scale_x` float DEFAULT NULL,
  `scale_y` float DEFAULT NULL,
  `scale_z` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `accessories_players`
--

CREATE TABLE `accessories_players` (
  `id` int(11) NOT NULL,
  `player_id` int(11) NOT NULL,
  `slot` int(11) NOT NULL,
  `bone` int(11) NOT NULL,
  `acs_id` int(11) NOT NULL,
  `x` float NOT NULL DEFAULT 0.01,
  `y` float NOT NULL DEFAULT 0.01,
  `z` float NOT NULL DEFAULT 0.01,
  `rX` float NOT NULL DEFAULT 0.01,
  `rY` float NOT NULL DEFAULT 0.01,
  `rZ` float NOT NULL DEFAULT 0.01,
  `scale` float NOT NULL DEFAULT 1.01
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `accessories_players`
--

INSERT INTO `accessories_players` (`id`, `player_id`, `slot`, `bone`, `acs_id`, `x`, `y`, `z`, `rX`, `rY`, `rZ`, `scale`) VALUES
(42, 6, 2, 1, 944, 0.115, -0.225, 0.025, 176, 92, 0, 0.88),
(59, 7, 1, 1, 999, 0.435, 0.03, 0, 10, 90, -192, 0.9),
(69, 5, 2, 1, 656, 0.05, -0.28, 0, 214, 86, 0, 0.6),
(72, 15, 1, 1, 507, 0.63, 0.07, -0.025, 28, 108, 6, 1.08),
(76, 15, 2, 1, 142, -0.56, 0.085, -0.2, -98, 4, -90, 1.9),
(80, 5, 1, 2, 490, 0.105, 0.03, 0, 0, 82, 0, 1.04),
(86, 12, 1, 2, 964, 0, 0, 0, 0, 0, 0, 0.9),
(88, 21, 1, 1, 516, -0.055, -0.11, 0, 10, 90, 0, 0.52),
(99, 20, 1, 2, 288, 0.04, 0.045, 0, 0, 84, 0, 0.96),
(101, 20, 2, 1, 516, 0.05, -0.1, 0.01, 2, 88, 0, 0.44);

-- --------------------------------------------------------

--
-- Структура таблицы `accessory_inventory`
--

CREATE TABLE `accessory_inventory` (
  `id` int(11) NOT NULL,
  `player_id` int(11) NOT NULL,
  `acs_id` int(11) NOT NULL,
  `use` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

CREATE TABLE `accounts` (
  `id` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `password` varchar(65) NOT NULL,
  `salt` varchar(10) CHARACTER SET cp1251 COLLATE cp1251_general_ci NOT NULL,
  `email` varchar(61) NOT NULL DEFAULT 'None',
  `confirm_email` int(11) NOT NULL,
  `level` int(11) NOT NULL DEFAULT 1,
  `weekly_prizes` text NOT NULL DEFAULT '0,0,0,0,0,0,0',
  `weekly_day` int(11) NOT NULL DEFAULT 0,
  `exp` int(11) NOT NULL,
  `refer` int(11) NOT NULL,
  `sex` int(11) NOT NULL,
  `skin` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `roulette_auto` int(11) NOT NULL DEFAULT 0,
  `roulette_silver` int(11) NOT NULL DEFAULT 0,
  `roulette_gold` int(11) NOT NULL DEFAULT 0,
  `roulette_bronz` int(11) NOT NULL DEFAULT 0,
  `bank` int(11) NOT NULL,
  `admin` int(11) NOT NULL,
  `family_id` int(11) NOT NULL DEFAULT -1,
  `family_rang` int(11) NOT NULL DEFAULT 1,
  `family_mute` int(11) NOT NULL,
  `family_vig` int(11) NOT NULL DEFAULT 0,
  `family_access` varchar(24) NOT NULL DEFAULT '0,0,0,0,0,0,0',
  `a_secret` int(11) NOT NULL,
  `prefix` varchar(15) CHARACTER SET cp1251 COLLATE cp1251_general_ci NOT NULL DEFAULT '[A]',
  `a_3d_prefix` int(11) NOT NULL,
  `admin_warn` int(11) NOT NULL,
  `AdminPass` int(11) NOT NULL,
  `driving_lic` int(11) NOT NULL,
  `weapon_lic` int(11) NOT NULL,
  `suspect` int(11) NOT NULL,
  `phone` int(11) NOT NULL,
  `sim` int(11) NOT NULL DEFAULT 0,
  `phone_balance` int(11) NOT NULL,
  `phone_color` int(11) NOT NULL DEFAULT 9,
  `law_abiding` int(11) NOT NULL,
  `improvements` int(11) NOT NULL,
  `power` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `metall` int(11) NOT NULL,
  `wife` int(11) NOT NULL,
  `team` int(11) NOT NULL,
  `subdivison` int(11) NOT NULL,
  `wage` int(11) NOT NULL,
  `job` int(11) NOT NULL,
  `house_type` int(11) NOT NULL DEFAULT -1,
  `house_room` int(11) NOT NULL DEFAULT -1,
  `house` int(11) NOT NULL DEFAULT -1,
  `business` int(11) NOT NULL DEFAULT -1,
  `fuel_st` int(11) NOT NULL DEFAULT -1,
  `reg_time` int(11) NOT NULL,
  `reg_ip` varchar(16) NOT NULL,
  `last_ip` varchar(16) NOT NULL,
  `last_login` int(11) NOT NULL,
  `game_for_hour` int(11) NOT NULL,
  `game_for_day` int(11) NOT NULL,
  `game_for_day_prev` int(11) NOT NULL,
  `setting_phone` varchar(13) NOT NULL DEFAULT 'None',
  `setting_pin_code` varchar(5) NOT NULL DEFAULT 'None',
  `request_phone` int(11) NOT NULL,
  `request_pin` int(11) NOT NULL,
  `setting1` int(11) NOT NULL DEFAULT 2,
  `setting2` int(11) NOT NULL DEFAULT 1,
  `setting4` int(11) NOT NULL DEFAULT 1,
  `setting5` int(11) NOT NULL DEFAULT 0,
  `setting6` int(11) NOT NULL DEFAULT 1,
  `warn` int(11) NOT NULL,
  `warn_time` int(11) NOT NULL,
  `mute` int(11) NOT NULL,
  `skill_colt` int(11) NOT NULL,
  `skill_sdpistol` int(11) NOT NULL,
  `skill_deagle` int(11) NOT NULL,
  `skill_shotgun` int(11) NOT NULL,
  `skill_mp5` int(11) NOT NULL,
  `skill_ak47` int(11) NOT NULL,
  `skill_m4` int(11) NOT NULL,
  `skill_sniper_rifle` int(11) NOT NULL,
  `skill_sawnoff` int(11) NOT NULL,
  `skill_combat_sg` int(11) NOT NULL,
  `skill_micro_uzi` int(11) NOT NULL,
  `donate_current` int(11) NOT NULL,
  `donate_total` int(11) NOT NULL,
  `org_skin` int(11) NOT NULL,
  `setting_spawn` int(11) NOT NULL,
  `hospital` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT 100,
  `car_slots` int(11) NOT NULL DEFAULT 1,
  `jail` int(11) NOT NULL,
  `premium` int(11) NOT NULL,
  `premium_date` int(11) NOT NULL,
  `rub` int(11) NOT NULL,
  `player` int(11) NOT NULL,
  `gifts` int(11) NOT NULL,
  `cmdaccess` varchar(32) NOT NULL DEFAULT '000000000000000',
  `family` int(11) NOT NULL,
  `family_rank` int(11) NOT NULL,
  `test` int(11) NOT NULL,
  `quest_1` int(11) NOT NULL,
  `quest_2` int(11) NOT NULL,
  `quest_3` int(11) NOT NULL,
  `quest_4` int(11) NOT NULL,
  `quest_5` int(11) NOT NULL,
  `quest_6` int(11) NOT NULL,
  `quest_7` int(11) NOT NULL,
  `quest_8` int(11) NOT NULL,
  `quest_exp_1` int(11) NOT NULL,
  `quest_exp_2` int(11) NOT NULL,
  `quest_exp_3` int(11) NOT NULL,
  `quest_exp_4` int(11) NOT NULL,
  `quest_exp_5` int(11) NOT NULL,
  `quest_exp_6` int(11) NOT NULL,
  `quest_exp_7` int(11) NOT NULL,
  `quest_exp_8` int(11) NOT NULL,
  `youtube` int(11) NOT NULL,
  `AntiBh` int(11) NOT NULL,
  `get_adm_status` int(11) NOT NULL DEFAULT 0,
  `get_adm_hour` int(11) NOT NULL DEFAULT 0,
  `online` int(11) NOT NULL DEFAULT 0,
  `totalhour` int(11) DEFAULT NULL,
  `quest231` int(11) NOT NULL DEFAULT 0,
  `quest232` int(11) NOT NULL DEFAULT 0,
  `quest233` int(11) NOT NULL,
  `postcard` int(11) NOT NULL,
  `repcarid` int(11) NOT NULL,
  `helper` int(11) NOT NULL,
  `healme` int(11) NOT NULL,
  `QuestBox1` int(11) NOT NULL,
  `QuestBox2` int(11) NOT NULL,
  `QuestBox3` int(11) NOT NULL,
  `QuestBox4` int(11) NOT NULL,
  `QuestBox5` int(11) NOT NULL,
  `QuestBox6` int(11) NOT NULL,
  `repair` int(11) NOT NULL,
  `fmute` int(11) NOT NULL,
  `fwarn` int(11) NOT NULL,
  `owarn` int(11) NOT NULL,
  `dmz_kills` int(11) NOT NULL,
  `Progress1` int(11) NOT NULL,
  `Progress2` int(11) NOT NULL,
  `Progress3` int(11) NOT NULL,
  `Progress4` int(11) NOT NULL,
  `Progress5` int(11) NOT NULL,
  `Progress6` int(11) NOT NULL,
  `ProgressExp1` int(11) NOT NULL,
  `ProgressExp2` int(11) NOT NULL,
  `ProgressExp3` int(11) NOT NULL,
  `ProgressExp4` int(11) NOT NULL,
  `ProgressExp5` int(11) NOT NULL,
  `ProgressExp6` int(11) NOT NULL,
  `capt_kills` int(11) NOT NULL,
  `coins` int(11) NOT NULL,
  `moneti` int(11) NOT NULL DEFAULT 0,
  `family_notif_seen` int(11) NOT NULL DEFAULT 0,
  `family_notif_seen_family` int(11) NOT NULL DEFAULT 0,
  `ytpromo_activate` int(11) NOT NULL,
  `3d_prefix` int(11) NOT NULL,
  `loader_skill` int(11) NOT NULL,
  `premium_time` int(11) NOT NULL,
  `antisliv` int(11) NOT NULL,
  `QuestBox` int(11) NOT NULL,
  `flower1` int(11) NOT NULL,
  `flower2` int(11) NOT NULL,
  `flower3` int(11) NOT NULL,
  `TakeFlower` int(11) NOT NULL,
  `CongratulateWomen` int(11) NOT NULL,
  `BuyPerfume` int(11) NOT NULL,
  `GivePerfume` int(11) NOT NULL,
  `BuyCake` int(11) NOT NULL,
  `BuyProducts` int(11) NOT NULL,
  `BuyCandle` int(11) NOT NULL,
  `EndQuest8marta` int(11) NOT NULL,
  `score` int(11) NOT NULL,
  `case` text CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL DEFAULT '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0',
  `rewards` text DEFAULT '[]',
  `case_bonus` text CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL DEFAULT '0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0|0,0,0,0,0',
  `case_rewards` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL DEFAULT '\'0,0,0,0,0,0,0,0,0,0,0,0,0,0,0\'',
  `case_bonus_rewards` text CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL DEFAULT '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0',
  `start_dialog_shows` tinyint(3) UNSIGNED NOT NULL DEFAULT 0,
  `house_slots` int(11) NOT NULL,
  `house_selected` int(11) NOT NULL,
  `garage` int(11) NOT NULL DEFAULT -1,
  `fam_token` int(11) NOT NULL DEFAULT 0,
  `garbage` int(11) NOT NULL DEFAULT 0,
  `rabota` int(11) NOT NULL DEFAULT 0,
  `jail_fsin` int(11) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `accounts`
--

INSERT INTO `accounts` (`id`, `name`, `password`, `salt`, `email`, `confirm_email`, `level`, `weekly_prizes`, `weekly_day`, `exp`, `refer`, `sex`, `skin`, `money`, `roulette_auto`, `roulette_silver`, `roulette_gold`, `roulette_bronz`, `bank`, `admin`, `family_id`, `family_rang`, `family_mute`, `family_vig`, `family_access`, `a_secret`, `prefix`, `a_3d_prefix`, `admin_warn`, `AdminPass`, `driving_lic`, `weapon_lic`, `suspect`, `phone`, `sim`, `phone_balance`, `phone_color`, `law_abiding`, `improvements`, `power`, `drugs`, `ammo`, `metall`, `wife`, `team`, `subdivison`, `wage`, `job`, `house_type`, `house_room`, `house`, `business`, `fuel_st`, `reg_time`, `reg_ip`, `last_ip`, `last_login`, `game_for_hour`, `game_for_day`, `game_for_day_prev`, `setting_phone`, `setting_pin_code`, `request_phone`, `request_pin`, `setting1`, `setting2`, `setting4`, `setting5`, `setting6`, `warn`, `warn_time`, `mute`, `skill_colt`, `skill_sdpistol`, `skill_deagle`, `skill_shotgun`, `skill_mp5`, `skill_ak47`, `skill_m4`, `skill_sniper_rifle`, `skill_sawnoff`, `skill_combat_sg`, `skill_micro_uzi`, `donate_current`, `donate_total`, `org_skin`, `setting_spawn`, `hospital`, `health`, `car_slots`, `jail`, `premium`, `premium_date`, `rub`, `player`, `gifts`, `cmdaccess`, `family`, `family_rank`, `test`, `quest_1`, `quest_2`, `quest_3`, `quest_4`, `quest_5`, `quest_6`, `quest_7`, `quest_8`, `quest_exp_1`, `quest_exp_2`, `quest_exp_3`, `quest_exp_4`, `quest_exp_5`, `quest_exp_6`, `quest_exp_7`, `quest_exp_8`, `youtube`, `AntiBh`, `get_adm_status`, `get_adm_hour`, `online`, `totalhour`, `quest231`, `quest232`, `quest233`, `postcard`, `repcarid`, `helper`, `healme`, `QuestBox1`, `QuestBox2`, `QuestBox3`, `QuestBox4`, `QuestBox5`, `QuestBox6`, `repair`, `fmute`, `fwarn`, `owarn`, `dmz_kills`, `Progress1`, `Progress2`, `Progress3`, `Progress4`, `Progress5`, `Progress6`, `ProgressExp1`, `ProgressExp2`, `ProgressExp3`, `ProgressExp4`, `ProgressExp5`, `ProgressExp6`, `capt_kills`, `coins`, `moneti`, `family_notif_seen`, `family_notif_seen_family`, `ytpromo_activate`, `3d_prefix`, `loader_skill`, `premium_time`, `antisliv`, `QuestBox`, `flower1`, `flower2`, `flower3`, `TakeFlower`, `CongratulateWomen`, `BuyPerfume`, `GivePerfume`, `BuyCake`, `BuyProducts`, `BuyCandle`, `EndQuest8marta`, `score`, `case`, `rewards`, `case_bonus`, `case_rewards`, `case_bonus_rewards`, `start_dialog_shows`, `house_slots`, `house_selected`, `garage`, `fam_token`, `garbage`, `rabota`, `jail_fsin`) VALUES
(1, 'Lonexs_Studio', 'C0CE96AB490E57F0E8631384ED25C619F07A24E22732FD9CE593E8EBD5291D50', 'Lonexs2026', 'None', 0, 10, '0,0,0,0,0,0,0', 0, 0, 0, 1, 98, 2000000000, 0, 0, 0, 0, 0, 13, -1, 1, 0, 0, '0', 0, '[A]', 0, 0, 1234, 1, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, 1785864837, '127.0.0.1', '127.0.0.1', 1785864837, 338, 4486, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1180, 1010, 1000, 0, 0, 0, 100, 10, 0, 0, 0, 1000000, 0, 0, '000000000000000', 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1000000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,30,0,10,0,20,0,0,0,0,0,40,40,0,0,0,20,0,0,0,0,0,0,0,0,0,0', '', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,2,2,2,2|6:1,1,1,1,1|7:1,1,1,2,2|8:1,1,1,1,1|9:1,1,2,2,2|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:3,2,2,2,2|16:2,2,2,2,2|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,1,1|20:1,1,2,2,2|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '', '', 255, 3, 0, -1, 0, 0, 0, 0),
(16, 'Pepel_izBlood', 'BF966456A009082CAF352CDC156259EBF87053000EB9F81848535D606F6D63EE', 'kEQkGUd`8A', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 89, 979451658, 0, 0, 0, 0, 0, 14, -1, 0, 0, 0, '0,0,0,0,0,0,0', 0, 'Основатель', 0, 0, 8888, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786533525, '216.227.144.162', '216.227.144.162', 1786613105, 3, 4, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 52, 0, 0, 1190, 10, 0, 0, 0, 0, 100, 7, 0, 0, 0, 50278, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 254, 0, 0, 0, 0, 0, 0, 0, 1786535393, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,0,10,0,0,20,0,0,30,0,0,0,0,0,40,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,2,2|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,2,2,2|10:1,1,1,1,1|11:1,1,1,1,1|12:1,2,2,2,2|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:2,2,2,2,2|19:1,1,1,1,1|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '9:6,9:5,9:6,9:6,6:4,6:7,6:4,6:7,6:7,18:13,18:6,18:6,18:15,18:15,18:6,18:21,18:6,18:1:1,18:3:1,18:5:1,18:13,18:5,18:6,18:6,18:13,18:6,18:5,18:5,18:6,18:6,18:13,18:13,18:1:1,18:3:1,18:5:1,18:15,18:15,18:6,18:6,18:15,18:15,18:6,18:1:1,18:3:1,18:5:1,18:5,18:5,18:5,18:6,18:6,18:5,18:15,18:5,18:1:1,18:3:1,18:5:1,18:5,18:5,18:6,18:6,12:6,12:9,12:17,12:17,12:9,12:20,12:20,12:9,12:9,12:9,12:7,12:7,12:6,12:3:1,12:5:1,12:15,12:9,12:7,12:15,12:7,12:15,12:7,12:7,12:6,12:7', '', 3, 0, 0, 9, 0, 0, 0, 0),
(22, 'Dranik_izBlood', '2A1F30C14DCEAC37B473A0E4308857D6904D9BD36EB5F70C2FF47371CAD80306', ':W=za;Y\\KC', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 161, 76430200, 0, 0, 0, 0, 0, 12, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, 'Заместитель осн', 0, 0, 8888, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786616560, '216.227.144.162', '216.227.144.162', 1786617151, 387, 388, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1610, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 758, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 250, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,3,0,0,0,0,0,10,20,0,0,0,0,0,0,10,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,1,1|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,2,2|12:1,1,2,2,2|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,2,2|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '11:2,19:12,12:17,12:15', '', 1, 0, 0, -1, 0, 0, 0, 0),
(8, 'Mr_Beast', 'EA28340A98D01685DD4DBAFF00E4971F9C147328AF8CFB0EE1FAE383E09AFB23', 'c;v^GkPU8k', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 266, 70000000, 0, 0, 0, 0, 0, 14, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, 'Основатель', 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786138746, '89.124.71.181', '31.76.39.45', 1786309771, 183, 2391, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 930, 5, 0, 0, 0, 0, 100, 1, 0, 0, 0, 30202, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,10,10,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,1,1|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,2,2|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,1,1|20:1,1,1,2,2|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '20:14,20:2,20:9,20:8,20:15,20:12,20:16,20:19,20:6,20:4,15:6,15:14', '', 3, 0, 0, -1, 0, 0, 0, 0),
(9, 'Shadow_Fiend', 'B8E9788BEA6B01608E88740B0A22CEFA4A42CDEED2B1DD91F22B880AEE691796', '4=XMXOMZqg', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 2, 0, 0, 266, 77124440, 0, 0, 0, 0, 0, 14, 3, 5, 0, 0, '1,1,1,1,1,1,1', 0, 'Директор игры', 0, 0, 1488, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786139368, '95.32.85.4', '95.32.85.4', 1786148681, 1747, 5069, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 0, 0, 260, 5, 0, 0, 0, 0, 0, 1, 0, 0, 0, 150945, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,30,20,10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,2,2,2,2|5:1,1,2,2,2|6:1,1,1,1,1|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,1,1|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '5:12,5:12,5:15,5:10,5:9,5:3,5:4,5:4,5:9,5:1,5:11,5:11,5:8', '', 3, 0, 0, -1, 0, 0, 0, 0),
(10, 'Max_LoveOlesya', '1F660F289301FA96B240F84A94D85DDFAC1C33E16B404ABDEFFFFA9199BE6B4B', 'J[\\nwbu`@:', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 78, 80000000, 0, 0, 0, 0, 0, 0, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, '[A]', 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786142405, '95.32.83.212', '216.227.144.162', 1786143309, 209, 209, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 3, 1786402611, 30, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '', '', '', 2, 0, 0, -1, 0, 0, 0, 0),
(11, 'Angelina_Browns', 'D3ACDC9118ED9C051BA8A939E5626B2ABF14D42872002AA5732233237EB5276B', '4?o|:?H8XR', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 1, 135, 80000000, 0, 0, 0, 0, 0, 0, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, '[A]', 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786226719, '84.32.176.22', '84.32.176.22', 1786226721, 3, 4, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 200, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,1,1|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,1,1|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '', '', 0, 0, 0, -1, 0, 0, 0, 0),
(14, 'Olesya_Ektazzy', 'EB6CDE64C13F4DA5A1A883308E9CC12DC249D202FBFCB29C4AD26636AAAEE9D7', 'KiFz0hYXA>', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 1, 137, 200, 0, 0, 0, 0, 0, 0, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, '[A]', 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786309700, '216.227.144.162', '216.227.144.162', 1786309809, 64, 63, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 0, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 250, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '', '', '', 1, 0, 0, -1, 0, 0, 0, 0),
(13, 'Dmitriy_Morozo', '1E5857EE91ACF05791EC142072C432F0D348BD376841377DCC4B3292DCAD1574', '2=OSQYZ[`|', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 1, 12293, 750200, 0, 0, 0, 0, 0, 0, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, '[A]', 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786290582, '94.41.210.121', '94.41.210.121', 1786290584, 305, 304, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 1040, 0, 0, 0, 0, 0, 100, 1, 0, 0, 0, 4900, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 250, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,10,20,30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,2,2|6:1,1,2,2,2|7:1,2,2,2,2|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,1,1|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '7:9,7:7,7:9,7:9,7:7,7:20,7:7,7:7,7:15,7:3:1,7:5:1,7:9,7:9,7:9,7:7,6:4,6:9,6:9,6:13,6:9', '', 0, 0, 0, -1, 0, 0, 0, 0),
(20, 'Dev_RTF', 'CCD0BE054E393C0490843F859E99AC1D0AA585A9424B33F3CC146AC0D53D1788', 'uuPPA5:Lai', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 6864, 597977048, 0, 0, 0, 0, 0, 14, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, 'Основатель', 0, 0, 2410, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786544376, '179.237.84.43', '5.181.201.9', 1786617001, 1556, 1553, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0, 330, 5, 0, 0, 0, 0, 0, 6, 0, 0, 0, 294556, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 252, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,1,10,0,40,0,0,0,0,0,0,0,0,0,0,0,10,30,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,2,2|7:1,1,1,1,1|8:2,2,2,2,2|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,1,1|19:1,1,1,1,1|20:1,1,1,2,2|21:1,2,2,3,3|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '21:15,21:6,21:16,21:15,21:11,21:5:1,21:14,21:16,21:23,21:14,21:5,6:11,6:7,6:9,6:11,6:9,6:7,6:7,6:9,6:7,6:11,6:11,6:4,6:11,6:4,6:7,6:9,6:4,6:1:1,6:3:1,6:5:1,6:9,6:4,6:9,6:19,6:11,6:19,6:4,6:11,6:18,6:1:1,6:3:1,6:5:1,6:7,6:7,6:13,6:9,6:4,6:11,6:11,6:11,6:7,6:9,6:4,6:11,6:9,6:11,6:13,6:11,6:7,6:7,6:13,6:11,6:1:1,6:3:1,6:5:1,6:9,6:4,6:9,8:7,8:7,8:7,8:6,8:7,8:7,8:9,8:3:1,8:5:1,8:7,8:9,8:7,5:16,8:9,8:7,8:6,8:6,8:7,8:7,8:7,8:1:1,8:3:1,8:5:1,8:6,8:9,8:7,8:9,8:15,8:7,8:6,8:17,8:6,8:7,8:1:1,8:3:1,8:5:1,8:7,8:9,8:9,8:9,8:6,8:9,8:6,8:17,8:9,8:6,8:9,8:6,8:6,8:6,20:5', '', 3, 0, 0, -1, 0, 0, 0, 0),
(21, 'Ray_Amigo', 'E2D824A71BCE268C25A4FF4C6E90F55AFBE3D7EE98BD31C3459D7F7B3F3B946A', 'arZn_s@/_J', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 5500071, 293221882, 0, 0, 0, 0, 13183288, 14, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, '[A]', 0, 0, 8989, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 1786559620, '95.56.250.183', '178.94.13.178', 1786620574, 3, 4, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 2, 0, 0, 0, 18307, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, NULL, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 250, 0, 0, 0, 0, 0, 0, 0, 1786567074, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,1,1,1,1|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,1,1|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,2,2|19:1,1,1,1,1|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '18:7,18:3,18:8,18:2,18:8,18:7,18:5,18:10,18:14', '', 3, 0, 0, -1, 0, 0, 0, 0),
(18, 'Andrei_Mellstroy', 'D01CA5E00E5B126C7FD07FF3A5C1DFE92F9445A4E781774FCC523F449F4EB662', 't2e/4Uv4ki', 'None', 0, 1, '0,0,0,0,0,0,0', 0, 0, 0, 0, 7770, 1502917126, 0, 0, 0, 0, 0, 1, -1, 1, 0, 0, '0,0,0,0,0,0,0', 0, 'Младший модерат', 0, 0, 8888, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, 55, -1, 1786533963, '2.26.144.6', '2.26.144.6', 1786600424, 170, 171, 0, 'None', 'None', 0, 0, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 0, 0, 1480, 10, 0, 0, 0, 0, 100, 1, 0, 0, 0, 108253, 0, 0, '000000000000000', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 254, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '30,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,10,0,0,0,0,0,0,0,0,0,0,0,0', '[]', '1:1,2,2,2,2|2:1,1,1,1,1|3:1,1,1,1,1|4:1,1,1,1,1|5:1,1,1,1,1|6:1,1,1,1,1|7:1,1,1,1,1|8:1,1,1,1,1|9:1,1,1,1,1|10:1,1,1,1,1|11:1,1,1,1,1|12:1,1,1,1,1|13:1,1,1,1,1|14:1,1,1,1,1|15:1,1,1,1,1|16:1,1,1,1,1|17:1,1,1,1,1|18:1,1,1,2,2|19:1,1,1,1,1|20:1,1,1,1,1|21:1,1,1,1,1|22:1,1,1,1,1|23:1,1,1,1,1|24:1,1,1,1,1|25:1,1,1,1,1|26:1,1,1,1,1|27:1,1,1,1,1|28:1,1,1,1,1|29:1,1,1,1,1|30:1,1,1,1,1', '18:13,18:15,18:13,18:13,18:3:1,18:15,18:3:1,1:19,1:19,1:8,1:6,1:7,1:11,1:8,1:8,1:14,1:11,1:8,1:1:1,1:3:1,1:4:1,1:5:1,1:11,1:8,1:18,1:14,1:11,1:18,1:6,1:14,1:7,1:8,1:19,1:8,1:5,1:13,1:18,1:14,1:15', '', 3, 0, 0, -1, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `aclogs`
--

CREATE TABLE `aclogs` (
  `id` int(11) NOT NULL,
  `type` varchar(16) NOT NULL,
  `date` varchar(24) NOT NULL,
  `name` varchar(24) NOT NULL,
  `reason` varchar(32) NOT NULL,
  `data` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci ROW_FORMAT=COMPRESSED;

-- --------------------------------------------------------

--
-- Структура таблицы `action_log`
--

CREATE TABLE `action_log` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `type` int(11) NOT NULL,
  `description` varchar(128) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `action_log`
--

INSERT INTO `action_log` (`id`, `acc_id`, `uip`, `type`, `description`, `time`) VALUES
(1, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462716),
(2, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462744),
(3, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462746),
(4, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462749),
(5, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462789),
(6, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462792),
(7, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462794),
(8, 6, '216.227.144.162', 3, 'Выдал Pepel_Ghost[acc:6] Снайперская винтовка[500 патр]', 1786462797),
(9, 6, '216.227.144.162', 3, 'Использует меню телепортов', 1786467186),
(10, 5, '95.59.247.15', 3, 'Очистил чат', 1786470750),
(11, 6, '216.227.144.162', 3, 'Использует меню телепортов', 1786476051),
(12, 6, '216.227.144.162', 3, 'Использует меню телепортов', 1786476200),
(13, 5, '89.218.71.183', 3, 'Создал транспорт (597, 1, 1, топливо: 55.2, номер:  21)', 1786476298),
(14, 5, '89.218.71.183', 3, 'Создал транспорт (598, 1, 1, топливо: 80.8, номер: H185TA 925)', 1786476314),
(15, 5, '89.218.71.183', 3, 'Создал транспорт (599, 1, 1, топливо: 68.8, номер: K858BB 275)', 1786476331),
(16, 5, '89.218.71.183', 3, 'Создал транспорт (595, 1, 1, топливо: 66.4, номер: K734OK 93)', 1786476336),
(17, 5, '89.218.71.183', 3, 'Создал транспорт (596, 1, 1, топливо: 28.2, номер: B625PC 130)', 1786476339),
(18, 5, '89.218.71.183', 3, 'Использует меню телепортов', 1786476433),
(19, 5, '89.218.71.183', 9, 'Покинул организацию Отдел полиции №2 (УМВД) по собственному желанию', 1786476441),
(20, 5, '89.218.71.183', 3, 'Использует меню телепортов', 1786476493),
(21, 12, '179.237.84.43', 3, 'Использует меню телепортов', 1786476634),
(22, 12, '179.237.84.43', 3, 'Использует меню телепортов', 1786476724),
(23, 12, '179.237.84.43', 3, 'Использует меню телепортов', 1786476875),
(24, 6, '216.227.144.162', 3, 'Использует меню телепортов', 1786477598),
(25, 5, '89.218.71.183', 3, 'Установил Ray_Amigo[acc:5] интерьер 0', 1786477806),
(26, 5, '89.218.71.183', 3, 'Установил Ray_Amigo[acc:5] интерьер 0', 1786477810),
(27, 5, '89.218.71.183', 3, 'Установил Ray_Amigo[acc:5] интерьер 0', 1786477818),
(28, 5, '89.218.71.183', 3, 'Выдал Ray_Amigo[acc:5] Пустынный орёл[50 патр]', 1786477837),
(29, 5, '89.218.71.183', 3, 'Выдал Ray_Amigo[acc:5] Пустынный орёл[50 патр]', 1786477861),
(30, 5, '89.218.71.183', 3, 'Создал транспорт (596, 1, 1, топливо: 42.7, номер: H039XY 759)', 1786477877),
(31, 5, '89.218.71.183', 3, 'Очистил чат', 1786477904),
(32, 5, '89.218.71.183', 3, 'Создал транспорт (466, 1, 1, топливо: 95.3, номер: B003MO 511)', 1786481797),
(33, 5, '89.218.71.183', 3, 'Создал транспорт (466, 0, 1, топливо: 51.2, номер: E636TE 500)', 1786481946),
(34, 5, '89.218.71.183', 3, 'Посадил в тюрьму Ray_Amigo[acc:5] на 30 мин. Причина: !', 1786487425),
(35, 5, '89.218.71.183', 3, 'Выпустил из деморгана Ray_Amigo[acc:5]. Причина: !', 1786487433),
(36, 12, '51.83.187.4', 1, 'q', 1786489173),
(37, 5, '89.218.71.183', 9, 'Покинул организацию СМИ по собственному желанию', 1786489178),
(38, 5, '89.218.71.183', 1, 'q', 1786489181),
(39, 12, '51.83.187.4', 3, 'Очистил чат', 1786489389),
(40, 12, '51.83.187.4', 3, 'Очистил чат', 1786489618),
(41, 6, '216.227.144.162', 6, 'Для Pepel_Ghost[acc:6]: ку', 1786489847),
(42, 6, '216.227.144.162', 6, 'Для Pepel_Ghost[acc:6]: ку братан', 1786489853),
(43, 5, '89.218.71.183', 10, 'Выдал Ray_Amigo[acc:5] 9999 доната', 1786490106),
(44, 5, '89.218.71.183', 3, 'Использует меню телепортов', 1786492063),
(45, 5, '89.218.71.183', 9, 'Покинул организацию Отдел полиции №1 (ГИБДД) по собственному желанию', 1786492088),
(46, 5, '89.218.71.183', 3, 'Использует меню телепортов', 1786492129),
(47, 6, '216.227.144.162', 3, 'Установил себе [acc:6] скин 2', 1786492673),
(48, 6, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:15] 1 доната', 1786492862),
(49, 6, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:15] 10000 доната', 1786492868),
(50, 6, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:15] 10000 доната', 1786492873),
(51, 6, '216.227.144.162', 3, 'Следит за Andrei_Mellstroy[acc:15]', 1786493026),
(52, 5, '89.218.71.183', 1, '!', 1786495278),
(53, 5, '89.218.71.183', 3, 'Очистил чат', 1786495333),
(54, 5, '89.218.71.183', 3, 'Очистил чат', 1786495344),
(55, 5, '89.218.71.183', 3, 'Очистил чат', 1786495355),
(56, 5, '89.218.71.183', 3, 'Очистил чат', 1786495365),
(57, 5, '89.218.71.183', 3, 'Очистил чат', 1786495372),
(58, 5, '89.218.71.183', 3, 'Очистил чат', 1786519552),
(59, 12, '51.83.187.4', 3, 'Очистил чат', 1786521905),
(60, 12, '51.83.187.4', 3, 'Очистил чат', 1786531296),
(61, 12, '51.83.187.4', 3, 'Очистил чат', 1786531307),
(62, 12, '51.83.187.4', 3, 'Очистил чат', 1786531392),
(63, 12, '51.83.187.4', 3, 'Использует меню телепортов', 1786531687),
(64, 12, '51.83.187.4', 1, 'q', 1786531720),
(65, 12, '51.83.187.4', 3, 'Следит за Dev_RTF[acc:12]', 1786531843),
(66, 5, '89.218.71.183', 3, 'Очистил чат', 1786531866),
(67, 12, '51.83.187.4', 3, 'Очистил чат', 1786531870),
(68, 12, '51.83.187.4', 3, 'Следит за Dev_RTF[acc:12]', 1786531924),
(69, 12, '51.83.187.4', 3, 'Очистил чат', 1786531953),
(70, 12, '51.83.187.4', 3, 'Очистил чат', 1786531968),
(71, 12, '51.83.187.4', 3, 'Следит за Dev_RTF[acc:12]', 1786532009),
(72, 12, '51.83.187.4', 3, 'Очистил чат', 1786532211),
(73, 12, '51.83.187.4', 3, 'Следит за Andrei_Mellstroy[acc:15]', 1786532366),
(74, 12, '51.83.187.4', 3, 'Очистил чат', 1786532419),
(75, 12, '51.83.187.4', 3, 'Очистил чат', 1786532517),
(76, 12, '51.83.187.4', 3, 'Очистил чат', 1786532651),
(77, 12, '51.83.187.4', 3, 'Использует меню телепортов', 1786532733),
(78, 12, '51.83.187.4', 3, 'Очистил чат', 1786532923),
(79, 12, '51.83.187.4', 3, 'Следит за Andrei_Mellstroy[acc:15]', 1786533041),
(80, 5, '89.218.71.183', 3, 'Очистил чат', 1786533675),
(81, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 500000000 руб', 1786533761),
(82, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 500000000 руб', 1786533765),
(83, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 48299202 руб', 1786533773),
(84, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533805),
(85, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533807),
(86, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533809),
(87, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533810),
(88, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533812),
(89, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533813),
(90, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533815),
(91, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533815),
(92, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533816),
(93, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533819),
(94, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533820),
(95, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533820),
(96, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533821),
(97, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533822),
(98, 16, '216.227.144.162', 10, 'Выдал Oleg_Mellstroy[acc:17] 10000 доната', 1786533823),
(99, 16, '216.227.144.162', 10, 'Удалил аккаунт Andrei_Mellstroy. Причина: очсп', 1786533864),
(100, 16, '216.227.144.162', 3, 'Установил себе [acc:16] скин 2', 1786533929),
(101, 16, '216.227.144.162', 3, 'Установил себе [acc:16] скин 89', 1786533934),
(102, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534069),
(103, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534071),
(104, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534076),
(105, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534079),
(106, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534081),
(107, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534082),
(108, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534085),
(109, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 10000 доната', 1786534086),
(110, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 500000000 руб', 1786534097),
(111, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 500000000 руб', 1786534109),
(112, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 500000000 руб', 1786534110),
(113, 16, '216.227.144.162', 10, 'Выдал Pepel_izBlood[acc:16] 382829929 руб', 1786534115),
(114, 16, '216.227.144.162', 10, 'Удалил аккаунт Oleg_Mellstroy. Причина: гей', 1786534143),
(115, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 500000000 руб', 1786534158),
(116, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 500000000 руб', 1786534159),
(117, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 500000000 руб', 1786534205),
(118, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 39392929 руб', 1786534210),
(119, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534223),
(120, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534224),
(121, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534226),
(122, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534227),
(123, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534228),
(124, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534229),
(125, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534230),
(126, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534231),
(127, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534232),
(128, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534233),
(129, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534234),
(130, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534235),
(131, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534236),
(132, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534237),
(133, 16, '216.227.144.162', 10, 'Выдал Andrei_Mellstroy[acc:18] 10000 доната', 1786534237),
(134, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786534252),
(135, 16, '216.227.144.162', 10, 'Удалил аккаунт Pepel_Ghost. Причина: взлом', 1786534630),
(136, 16, '216.227.144.162', 10, 'Удалил аккаунт Olesya_Ekztazzy. Причина: взлом', 1786534645),
(137, 12, '51.83.187.4', 3, 'Следит за Ray_Amigo[acc:5]', 1786534758),
(138, 12, '51.83.187.4', 1, 'слыш', 1786534764),
(139, 5, '89.218.71.183', 1, 'а', 1786534767),
(140, 12, '51.83.187.4', 1, 'щас сек еслим енч крашент оо я попробую с другого ака зазйти?', 1786534785),
(141, 5, '89.218.71.183', 1, 'ага', 1786534789),
(142, 12, '51.83.187.4', 1, 'будт в сети', 1786534797),
(143, 5, '89.218.71.183', 1, 'ok', 1786534802),
(144, 19, '51.83.187.4', 10, 'Выдал Danya_Feel[acc:19] 10000 доната', 1786535004),
(145, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Снайперская винтовка[500 патр]', 1786535056),
(146, 19, '51.83.187.4', 1, 'крашыт пздц', 1786535103),
(147, 19, '51.83.187.4', 1, 'я неебуу у меря аксы киаш', 1786535117),
(148, 16, '216.227.144.162', 3, 'Следит за Danya_Feel[acc:19]', 1786535156),
(149, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786535231),
(150, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786535234),
(151, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786535238),
(152, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786535317),
(153, 16, '216.227.144.162', 3, 'Установил 50.0 топлива в авто №1', 1786535535),
(154, 16, '216.227.144.162', 3, 'Установил 50.0 топлива в авто №2', 1786535576),
(155, 12, '179.237.84.43', 3, 'Выдал Dev_RTF[acc:12] Пустынный орёл[100 патр]', 1786542630),
(156, 12, '179.237.84.43', 3, 'Выдал Dev_RTF[acc:12] Пустынный орёл[100 патр]', 1786542701),
(157, 12, '179.237.84.43', 10, 'Выдал Dev_RTF[acc:12] 100000000 руб', 1786542789),
(158, 12, '179.237.84.43', 3, 'Очистил чат', 1786542792),
(159, 12, '179.237.84.43', 3, 'Использует меню телепортов', 1786542850),
(160, 12, '179.237.84.43', 10, 'Выдал Dev_RTF[acc:12] 100000000 руб', 1786542884),
(161, 12, '179.237.84.43', 3, 'Очистил чат', 1786542956),
(162, 12, '179.237.84.43', 3, 'Очистил чат', 1786542987),
(163, 16, '216.227.144.162', 10, 'Удалил аккаунт Ray_Amigo. Причина: очсп', 1786543759),
(164, 16, '216.227.144.162', 10, 'Удалил аккаунт Danya_Feel. Причина: очсп', 1786543801),
(165, 16, '216.227.144.162', 10, 'Удалил аккаунт Dev_RTF. Причина: очсп', 1786543842),
(166, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Пустынный орёл[500 патр]', 1786550105),
(167, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786550160),
(168, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Пустынный орёл[500 патр]', 1786550182),
(169, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Пустынный орёл[500 патр]', 1786550195),
(170, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Пустынный орёл[500 патр]', 1786550292),
(171, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Пустынный орёл[500 патр]', 1786550432),
(172, 16, '216.227.144.162', 3, 'Выдал Andrei_Mellstroy[acc:18] Пустынный орёл[500 патр]', 1786550513),
(173, 21, '95.56.250.183', 10, 'Выдал Ray_Amigo[acc:21] 282882882 руб', 1786559948),
(174, 21, '95.56.250.183', 10, 'Выдал Ray_Amigo[acc:21] 28288288 руб', 1786559951),
(175, 21, '95.56.250.183', 10, 'Выдал Ray_Amigo[acc:21] 9999 доната', 1786559963),
(176, 21, '95.56.250.183', 10, 'Выдал Ray_Amigo[acc:21] 9999 доната', 1786559965),
(177, 21, '95.56.250.183', 10, 'Выдал Ray_Amigo[acc:21] 9999 доната', 1786559966),
(178, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563545),
(179, 21, '95.56.250.183', 3, 'Установил Ray_Amigo[acc:21] интерьер 0', 1786563686),
(180, 20, '51.83.187.4', 3, 'Использует меню телепортов', 1786563708),
(181, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563800),
(182, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563802),
(183, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563803),
(184, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563805),
(185, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563805),
(186, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563807),
(187, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563808),
(188, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563809),
(189, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563810),
(190, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563811),
(191, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563813),
(192, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563814),
(193, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563815),
(194, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563816),
(195, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563818),
(196, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563819),
(197, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563820),
(198, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563821),
(199, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563822),
(200, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563823),
(201, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563824),
(202, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563826),
(203, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563827),
(204, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563828),
(205, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563829),
(206, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563830),
(207, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563832),
(208, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563834),
(209, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563836),
(210, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563837),
(211, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563838),
(212, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563839),
(213, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563840),
(214, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563841),
(215, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563843),
(216, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563844),
(217, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563845),
(218, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563846),
(219, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563847),
(220, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563848),
(221, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563849),
(222, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563850),
(223, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563851),
(224, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563852),
(225, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563853),
(226, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563854),
(227, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563855),
(228, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563871),
(229, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563873),
(230, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 10000 доната', 1786563874),
(231, 20, '51.83.187.4', 3, 'Очистил чат', 1786563877),
(232, 20, '51.83.187.4', 3, 'Очистил чат', 1786564892),
(233, 20, '51.83.187.4', 3, 'Очистил чат', 1786564947),
(234, 20, '51.83.187.4', 1, 'ты тту', 1786565161),
(235, 20, '51.83.187.4', 1, 'у нас трейд отмениллся', 1786565315),
(236, 21, '95.56.250.183', 1, 'в курсе', 1786565323),
(237, 20, '51.83.187.4', 1, 'тепнись ко мне', 1786565333),
(238, 20, '51.83.187.4', 1, 'трецд крашыт илм что?', 1786565340),
(239, 21, '95.56.250.183', 1, '+', 1786565344),
(240, 20, '51.83.187.4', 1, 'обидно', 1786565351),
(241, 20, '51.83.187.4', 10, 'Выдал Dev_RTF[acc:20] 500000000 руб', 1786565362),
(242, 20, '51.83.187.4', 3, 'Очистил чат', 1786565375),
(243, 20, '51.83.187.4', 3, 'Использует меню телепортов', 1786565610),
(244, 20, '51.83.187.4', 3, 'Очистил чат', 1786565652),
(245, 21, '95.56.250.183', 3, 'Посадил в тюрьму Ray_Amigo[acc:21] на 30 мин. Причина: !', 1786567059),
(246, 21, '95.56.250.183', 3, 'Выпустил из деморгана Ray_Amigo[acc:21]. Причина: !', 1786567064),
(247, 16, '216.227.144.162', 3, 'Выдал Pepel_izBlood[acc:16] Снайперская винтовка[500 патр]', 1786579616),
(248, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786579916),
(249, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786580100),
(250, 16, '216.227.144.162', 3, 'Использует меню телепортов', 1786598052),
(251, 18, '2.26.144.6', 3, 'Использует меню телепортов', 1786600458),
(252, 21, '178.94.13.178', 3, 'Использует меню телепортов', 1786615903),
(253, 21, '178.94.13.178', 3, 'Использует меню телепортов', 1786615951),
(254, 21, '178.94.13.178', 3, 'Очистил чат', 1786615977),
(255, 21, '178.94.13.178', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617019),
(256, 21, '178.94.13.178', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617026),
(257, 21, '178.94.13.178', 3, 'Телепортировал к себе Dev_RTF[acc:20]', 1786617032),
(258, 21, '178.94.13.178', 3, 'Использует меню телепортов', 1786617053),
(259, 20, '5.181.201.9', 3, 'Телепортировал к себе Ray_Amigo[acc:21]', 1786617062),
(260, 21, '178.94.13.178', 3, 'Использует меню телепортов', 1786617066),
(261, 20, '5.181.201.9', 3, 'Телепортировался к Ray_Amigo[acc:21]', 1786617077),
(262, 20, '5.181.201.9', 3, 'Использует меню телепортов', 1786617095),
(263, 21, '178.94.13.178', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617098),
(264, 21, '178.94.13.178', 3, 'Очистил чат', 1786617123),
(265, 20, '5.181.201.9', 3, 'Телепортировался к Ray_Amigo[acc:21]', 1786617127),
(266, 20, '5.181.201.9', 3, 'Телепортировал к себе Dranik_izBlood[acc:22]', 1786617186),
(267, 22, '216.227.144.162', 1, 'ес чо основателя надо', 1786617246),
(268, 20, '5.181.201.9', 3, 'Использует меню телепортов', 1786617248),
(269, 20, '5.181.201.9', 1, 'разницы нету', 1786617255),
(270, 22, '216.227.144.162', 1, 'пох', 1786617260),
(271, 22, '216.227.144.162', 3, 'Использует меню телепортов', 1786617269),
(272, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617280),
(273, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617282),
(274, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617284),
(275, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617287),
(276, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617293),
(277, 20, '5.181.201.9', 1, '?', 1786617298),
(278, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Снайперская винтовка[500 патр]', 1786617315),
(279, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617333),
(280, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617378),
(281, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617389),
(282, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617394),
(283, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617400),
(284, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617404),
(285, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617407),
(286, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617409),
(287, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617412),
(288, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617418),
(289, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617422),
(290, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617469),
(291, 20, '5.181.201.9', 3, 'Выдал Dev_RTF[acc:20] Пустынный орёл[100 патр]', 1786617478),
(292, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617484),
(293, 20, '5.181.201.9', 3, 'Выдал Dev_RTF[acc:20] Пустынный орёл[100 патр]', 1786617495),
(294, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617499),
(295, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617513),
(296, 22, '216.227.144.162', 3, 'Выдал Dranik_izBlood[acc:22] Пустынный орёл[500 патр]', 1786617524),
(297, 22, '216.227.144.162', 3, 'Телепортировался к Dev_RTF[acc:20]', 1786617539),
(298, 20, '5.181.201.9', 3, 'Очистил чат', 1786617553),
(299, 20, '5.181.201.9', 3, 'Использует меню телепортов', 1786617623),
(300, 20, '5.181.201.9', 3, 'Очистил чат', 1786617879),
(301, 21, '178.94.13.178', 3, 'Использует меню телепортов', 1786620580);

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts`
--

CREATE TABLE `bank_accounts` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `name` varchar(21) NOT NULL DEFAULT 'None',
  `balance` int(11) NOT NULL,
  `pin` varchar(9) NOT NULL DEFAULT '0000',
  `reg_time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts_log`
--

CREATE TABLE `bank_accounts_log` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `description` varchar(64) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `ban_list`
--

CREATE TABLE `ban_list` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `time` int(11) NOT NULL,
  `ban_time` int(11) NOT NULL,
  `ip` varchar(16) NOT NULL,
  `description` varchar(32) NOT NULL,
  `admin` varchar(24) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `blackpass_logs`
--

CREATE TABLE `blackpass_logs` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `season_number` int(11) NOT NULL,
  `action` varchar(32) NOT NULL,
  `reward_id` int(11) NOT NULL DEFAULT 0,
  `reward_type` int(11) NOT NULL DEFAULT 0,
  `reward_value` int(11) NOT NULL DEFAULT 0,
  `amount` int(11) NOT NULL DEFAULT 0,
  `extra` int(11) NOT NULL DEFAULT 0,
  `created_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `blackpass_logs`
--

INSERT INTO `blackpass_logs` (`id`, `account_id`, `season_number`, `action`, `reward_id`, `reward_type`, `reward_value`, `amount`, `extra`, `created_at`) VALUES
(1, 15, 28, 'reward_claim', 1, 0, 0, 1, 0, 1786492203),
(2, 15, 28, 'reward_claim', 41, 0, 0, 1, 0, 1786495522),
(3, 15, 28, 'buy_pass', 0, 0, 2, 1, 1690, 1786496434),
(4, 17, 28, 'reward_claim', 1, 0, 0, 1, 0, 1786533769),
(5, 18, 28, 'reward_claim', 1, 0, 0, 1, 0, 1786533972),
(6, 21, 28, 'reward_claim', 1, 0, 0, 1, 0, 1786565048),
(7, 18, 28, 'reward_claim', 14, 0, 0, 1, 0, 1786598187);

-- --------------------------------------------------------

--
-- Структура таблицы `blackpass_players`
--

CREATE TABLE `blackpass_players` (
  `account_id` int(11) NOT NULL,
  `season_number` int(11) NOT NULL,
  `experience` int(11) NOT NULL DEFAULT 0,
  `level` int(11) NOT NULL DEFAULT 1,
  `premium_status` int(11) NOT NULL DEFAULT 0,
  `dust` int(11) NOT NULL DEFAULT 0,
  `selected_layout` int(11) NOT NULL DEFAULT 0,
  `deluxe_rewards_claimed` tinyint(1) NOT NULL DEFAULT 0,
  `claimed_standard` varchar(80) NOT NULL DEFAULT '',
  `claimed_premium` varchar(80) NOT NULL DEFAULT '',
  `created_at` int(11) NOT NULL DEFAULT 0,
  `updated_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `blackpass_players`
--

INSERT INTO `blackpass_players` (`account_id`, `season_number`, `experience`, `level`, `premium_status`, `dust`, `selected_layout`, `deluxe_rewards_claimed`, `claimed_standard`, `claimed_premium`, `created_at`, `updated_at`) VALUES
(5, 28, 60000, 61, 2, 0, 0, 1, '1000000000000000000000000000000000000000000000000000000000001', '0000000000000000000000000000000000000000000000000000000000001', 1786030092, 1786359133),
(6, 28, 60000, 61, 2, 0, 0, 1, '1111111111111111111111111111111111111111111111111111111111111', '1111111111111111111111111111111111111111111111111111111111111', 1786125067, 1786453683),
(7, 28, 60000, 61, 2, 0, 0, 1, '1111111111111111111111111111111111111111111111111111111111111', '1111111111111111111111111111111111111111111111111111111111111', 1786137064, 1786137549),
(8, 28, 0, 1, 0, 0, 0, 0, '1000000000000000000000000000000000000000000000000000000000000', '0000000000000000000000000000000000000000000000000000000000000', 1786138752, 1786138762),
(9, 28, 60000, 61, 2, 0, 0, 1, '1111111111111111111111111111111111111111111111111111111111111', '1111111111111111111111111111111111111111111111111111111111111', 1786139370, 1786148706),
(10, 28, 0, 1, 0, 0, 0, 0, '', '', 1786142406, 1786142406),
(11, 28, 0, 1, 0, 0, 0, 0, '', '', 1786226721, 1786226721),
(12, 28, 40000, 41, 0, 0, 0, 0, '1000000000000000000000000000000000000000000000000000000000000', '0000000000000000000000000000000000000000000000000000000000000', 1786227973, 1786263657),
(13, 28, 0, 1, 0, 0, 0, 0, '', '', 1786290584, 1786290584),
(14, 28, 0, 1, 0, 0, 0, 0, '', '', 1786309703, 1786309703),
(15, 28, 60000, 61, 2, 0, 0, 1, '1111111111111111111111111111111111111111111111111110000000000', '1111111111111111111111111111111111111111111111111110000000000', 1786492194, 1786496886),
(16, 28, 0, 1, 0, 0, 0, 0, '', '', 1786533527, 1786533527),
(17, 28, 0, 1, 0, 0, 0, 0, '1000000000000000000000000000000000000000000000000000000000000', '0000000000000000000000000000000000000000000000000000000000000', 1786533692, 1786533769),
(18, 28, 13000, 14, 0, 0, 0, 0, '1000000000000100000000000000000000000000000000000000000000000', '0000000000000000000000000000000000000000000000000000000000000', 1786533964, 1786598187),
(19, 28, 0, 1, 0, 0, 0, 0, '', '', 1786534940, 1786534940),
(20, 28, 0, 1, 0, 0, 0, 0, '', '', 1786544376, 1786544376),
(21, 28, 0, 1, 0, 0, 0, 0, '1000000000000000000000000000000000000000000000000000000000000', '0000000000000000000000000000000000000000000000000000000000000', 1786559621, 1786565048),
(22, 28, 0, 1, 0, 0, 0, 0, '', '', 1786616566, 1786616566);

-- --------------------------------------------------------

--
-- Структура таблицы `blackpass_tasks`
--

CREATE TABLE `blackpass_tasks` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `season_number` int(11) NOT NULL,
  `task_id` int(11) NOT NULL,
  `task_group` int(11) NOT NULL,
  `period_key` int(11) NOT NULL,
  `target_count` int(11) NOT NULL DEFAULT 0,
  `reward_exp` int(11) NOT NULL DEFAULT 0,
  `reward_money` int(11) NOT NULL DEFAULT 0,
  `route_id` int(11) NOT NULL DEFAULT 0,
  `button_type` int(11) NOT NULL DEFAULT 0,
  `premium_only` tinyint(1) NOT NULL DEFAULT 0,
  `progress` int(11) NOT NULL DEFAULT 0,
  `status` int(11) NOT NULL DEFAULT 0,
  `tracked` tinyint(1) NOT NULL DEFAULT 0,
  `complete_notified` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` int(11) NOT NULL DEFAULT 0,
  `updated_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `blackpass_tasks`
--

INSERT INTO `blackpass_tasks` (`id`, `account_id`, `season_number`, `task_id`, `task_group`, `period_key`, `target_count`, `reward_exp`, `reward_money`, `route_id`, `button_type`, `premium_only`, `progress`, `status`, `tracked`, `complete_notified`, `created_at`, `updated_at`) VALUES
(51, 5, 28, 254, 1, 20671, 1, 200, 1000, 0, 1, 0, 1, 6, 0, 1, 1786030092, 1786030097),
(52, 5, 28, 52, 1, 20671, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(53, 5, 28, 124, 1, 20671, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(54, 5, 28, 108, 1, 20671, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(55, 5, 28, 96, 1, 20671, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(56, 5, 28, 97, 1, 20671, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(57, 5, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(58, 5, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(59, 5, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786030092, 1786481983),
(60, 5, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(61, 5, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786030092, 1786030092),
(62, 5, 28, 254, 1, 20672, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786120501, 1786143259),
(63, 5, 28, 52, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 3, 1, 0, 1786120501, 1786120507),
(64, 5, 28, 124, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786120501, 1786120501),
(65, 5, 28, 108, 1, 20672, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786120501, 1786120501),
(66, 5, 28, 96, 1, 20672, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786120501, 1786120501),
(67, 5, 28, 97, 1, 20672, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786120501, 1786120501),
(68, 6, 28, 254, 1, 20672, 1, 200, 1000, 0, 1, 0, 1, 6, 0, 1, 1786125067, 1786125982),
(69, 6, 28, 52, 1, 20672, 1, 200, 1000, 0, 6, 0, 1, 6, 0, 1, 1786125067, 1786136474),
(70, 6, 28, 124, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(71, 6, 28, 108, 1, 20672, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(72, 6, 28, 96, 1, 20672, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(73, 6, 28, 97, 1, 20672, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(74, 6, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(75, 6, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(76, 6, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 6, 0, 1, 1786125067, 1786453580),
(77, 6, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(78, 6, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786125067, 1786125067),
(79, 7, 28, 254, 1, 20672, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786137064, 1786142921),
(80, 7, 28, 52, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(81, 7, 28, 124, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(82, 7, 28, 108, 1, 20672, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(83, 7, 28, 96, 1, 20672, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(84, 7, 28, 97, 1, 20672, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(85, 7, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(86, 7, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(87, 7, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786137064, 1786468594),
(88, 7, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(89, 7, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786137064, 1786137064),
(90, 8, 28, 254, 1, 20672, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786138752, 1786142125),
(91, 8, 28, 52, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(92, 8, 28, 124, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(93, 8, 28, 108, 1, 20672, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(94, 8, 28, 96, 1, 20672, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(95, 8, 28, 97, 1, 20672, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(96, 8, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(97, 8, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(98, 8, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(99, 8, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(100, 8, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786138752, 1786138752),
(101, 9, 28, 254, 1, 20672, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786139370, 1786146094),
(102, 9, 28, 52, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(103, 9, 28, 124, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(104, 9, 28, 108, 1, 20672, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(105, 9, 28, 96, 1, 20672, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(106, 9, 28, 97, 1, 20672, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(107, 9, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(108, 9, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(109, 9, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 66400, 0, 0, 0, 1786139370, 1786148633),
(110, 9, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(111, 9, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786139370, 1786139370),
(112, 10, 28, 254, 1, 20672, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786142406, 1786143309),
(113, 10, 28, 52, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(114, 10, 28, 124, 1, 20672, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(115, 10, 28, 108, 1, 20672, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(116, 10, 28, 96, 1, 20672, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(117, 10, 28, 97, 1, 20672, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(118, 10, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(119, 10, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(120, 10, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(121, 10, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(122, 10, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786142406, 1786142406),
(123, 9, 28, 254, 1, 20673, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786147260, 1786148681),
(124, 9, 28, 52, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(125, 9, 28, 124, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(126, 9, 28, 108, 1, 20673, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(127, 9, 28, 96, 1, 20673, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(128, 9, 28, 97, 1, 20673, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(129, 6, 28, 254, 1, 20673, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786147260, 1786229259),
(130, 6, 28, 52, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(131, 6, 28, 124, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(132, 6, 28, 108, 1, 20673, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(133, 6, 28, 96, 1, 20673, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(134, 6, 28, 97, 1, 20673, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786147260, 1786147260),
(135, 5, 28, 254, 1, 20673, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786177502, 1786215506),
(136, 5, 28, 52, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786177502, 1786177502),
(137, 5, 28, 124, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786177502, 1786177502),
(138, 5, 28, 108, 1, 20673, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786177502, 1786177502),
(139, 5, 28, 96, 1, 20673, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786177502, 1786177502),
(140, 5, 28, 97, 1, 20673, 1, 200, 1000, 157, 6, 0, 1, 1, 0, 1, 1786177502, 1786215567),
(141, 11, 28, 254, 1, 20673, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786226721, 1786226721),
(142, 11, 28, 52, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(143, 11, 28, 124, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(144, 11, 28, 108, 1, 20673, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(145, 11, 28, 96, 1, 20673, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(146, 11, 28, 97, 1, 20673, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(147, 11, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(148, 11, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(149, 11, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(150, 11, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(151, 11, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786226721, 1786226721),
(152, 12, 28, 254, 1, 20673, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786227973, 1786227973),
(153, 12, 28, 52, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(154, 12, 28, 124, 1, 20673, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(155, 12, 28, 108, 1, 20673, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(156, 12, 28, 96, 1, 20673, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(157, 12, 28, 97, 1, 20673, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(158, 12, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(159, 12, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(160, 12, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786227973, 1786542884),
(161, 12, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(162, 12, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786227973, 1786227973),
(163, 12, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786261984, 1786303299),
(164, 12, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786261984, 1786261984),
(165, 12, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786261984, 1786261984),
(166, 12, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786261984, 1786261984),
(167, 12, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786261984, 1786261984),
(168, 12, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 1, 1, 0, 1, 1786261984, 1786278450),
(169, 6, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 6, 0, 1, 1786262083, 1786295411),
(170, 6, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786262083, 1786262083),
(171, 6, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786262083, 1786262083),
(172, 6, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786262083, 1786262083),
(173, 6, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786262083, 1786262083),
(174, 6, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 1, 1, 0, 1, 1786262083, 1786307051),
(175, 5, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 6, 0, 1, 1786276411, 1786278643),
(176, 5, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786276411, 1786276411),
(177, 5, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786276411, 1786276411),
(178, 5, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786276411, 1786276411),
(179, 5, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786276411, 1786276411),
(180, 5, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786276411, 1786276411),
(181, 8, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786284982, 1786309771),
(182, 8, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786284982, 1786284982),
(183, 8, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786284982, 1786284982),
(184, 8, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786284982, 1786284982),
(185, 8, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786284982, 1786284982),
(186, 8, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786284982, 1786284982),
(187, 13, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786290584, 1786290584),
(188, 13, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(189, 13, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(190, 13, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(191, 13, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(192, 13, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(193, 13, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(194, 13, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(195, 13, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(196, 13, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(197, 13, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786290584, 1786290584),
(198, 7, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786309286, 1786309488),
(199, 7, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786309286, 1786309286),
(200, 7, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786309286, 1786309286),
(201, 7, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786309286, 1786309286),
(202, 7, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786309286, 1786309286),
(203, 7, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786309286, 1786309286),
(204, 14, 28, 254, 1, 20674, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786309703, 1786309809),
(205, 14, 28, 52, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(206, 14, 28, 124, 1, 20674, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(207, 14, 28, 108, 1, 20674, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(208, 14, 28, 96, 1, 20674, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(209, 14, 28, 97, 1, 20674, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(210, 14, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(211, 14, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(212, 14, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(213, 14, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(214, 14, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786309703, 1786309703),
(215, 5, 28, 254, 1, 20675, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786350527, 1786403771),
(216, 5, 28, 52, 1, 20675, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786350527, 1786350527),
(217, 5, 28, 124, 1, 20675, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786350527, 1786350527),
(218, 5, 28, 108, 1, 20675, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786350527, 1786350527),
(219, 5, 28, 96, 1, 20675, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786350527, 1786350527),
(220, 5, 28, 97, 1, 20675, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786350527, 1786350527),
(221, 6, 28, 254, 1, 20675, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786352689, 1786396095),
(222, 6, 28, 52, 1, 20675, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786352689, 1786352689),
(223, 6, 28, 124, 1, 20675, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786352689, 1786352689),
(224, 6, 28, 108, 1, 20675, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786352689, 1786352689),
(225, 6, 28, 96, 1, 20675, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786352689, 1786352689),
(226, 6, 28, 97, 1, 20675, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786352689, 1786352689),
(227, 12, 28, 254, 1, 20675, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786353042, 1786389287),
(228, 12, 28, 52, 1, 20675, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786353042, 1786353042),
(229, 12, 28, 124, 1, 20675, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786353042, 1786353042),
(230, 12, 28, 108, 1, 20675, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786353042, 1786353042),
(231, 12, 28, 96, 1, 20675, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786353042, 1786353042),
(232, 12, 28, 97, 1, 20675, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786353042, 1786353042),
(233, 6, 28, 254, 1, 20676, 1, 200, 1000, 0, 1, 0, 1, 6, 0, 1, 1786407009, 1786453570),
(234, 6, 28, 52, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786407009, 1786407009),
(235, 6, 28, 124, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 3, 1, 0, 1786407009, 1786453703),
(236, 6, 28, 108, 1, 20676, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786407009, 1786453673),
(237, 6, 28, 96, 1, 20676, 1, 200, 1000, 32, 6, 0, 1, 6, 0, 1, 1786407009, 1786453683),
(238, 6, 28, 97, 1, 20676, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786407009, 1786407009),
(239, 5, 28, 254, 1, 20676, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786435386, 1786492284),
(240, 5, 28, 52, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786435386, 1786435386),
(241, 5, 28, 124, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786435386, 1786435386),
(242, 5, 28, 108, 1, 20676, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786435386, 1786435386),
(243, 5, 28, 96, 1, 20676, 1, 200, 1000, 32, 6, 0, 1, 1, 0, 1, 1786435386, 1786481877),
(244, 5, 28, 97, 1, 20676, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786435386, 1786435386),
(245, 12, 28, 254, 1, 20676, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786444899, 1786489156),
(246, 12, 28, 52, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786444899, 1786444899),
(247, 12, 28, 124, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786444899, 1786444899),
(248, 12, 28, 108, 1, 20676, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786444899, 1786444899),
(249, 12, 28, 96, 1, 20676, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786444899, 1786444899),
(250, 12, 28, 97, 1, 20676, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786444899, 1786444899),
(251, 7, 28, 254, 1, 20676, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786467560, 1786467560),
(252, 7, 28, 52, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786467560, 1786467560),
(253, 7, 28, 124, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786467560, 1786467560),
(254, 7, 28, 108, 1, 20676, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786467560, 1786467560),
(255, 7, 28, 96, 1, 20676, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786467560, 1786467560),
(256, 7, 28, 97, 1, 20676, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786467560, 1786467560),
(257, 15, 28, 254, 1, 20676, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786492194, 1786492194),
(258, 15, 28, 52, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(259, 15, 28, 124, 1, 20676, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(260, 15, 28, 108, 1, 20676, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(261, 15, 28, 96, 1, 20676, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(262, 15, 28, 97, 1, 20676, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(263, 15, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(264, 15, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(265, 15, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786492194, 1786492950),
(266, 15, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(267, 15, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786492194, 1786492194),
(268, 15, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786492851, 1786532251),
(269, 15, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786492851, 1786492851),
(270, 15, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786492851, 1786492851),
(271, 15, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786492851, 1786492851),
(272, 15, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786492851, 1786492851),
(273, 15, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 1, 1, 0, 1, 1786492851, 1786533179),
(274, 6, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 0, 0, 0, 0, 1786493281, 1786493281),
(275, 6, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786493281, 1786493281),
(276, 6, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786493281, 1786493281),
(277, 6, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786493281, 1786493281),
(278, 6, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786493281, 1786493281),
(279, 6, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786493281, 1786493281),
(280, 5, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786495272, 1786542079),
(281, 5, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786495272, 1786495272),
(282, 5, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786495272, 1786495272),
(283, 5, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786495272, 1786495272),
(284, 5, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786495272, 1786495272),
(285, 5, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786495272, 1786495272),
(286, 12, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786521895, 1786542512),
(287, 12, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786521895, 1786521895),
(288, 12, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786521895, 1786521895),
(289, 12, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786521895, 1786521895),
(290, 12, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786521895, 1786521895),
(291, 12, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786521895, 1786521895),
(292, 16, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786533527, 1786550397),
(293, 16, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(294, 16, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(295, 16, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(296, 16, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(297, 16, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(298, 16, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(299, 16, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(300, 16, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786533527, 1786534115),
(301, 16, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(302, 16, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786533527, 1786533527),
(303, 17, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786533692, 1786533692),
(304, 17, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(305, 17, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(306, 17, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(307, 17, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(308, 17, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(309, 17, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(310, 17, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(311, 17, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786533692, 1786533773),
(312, 17, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(313, 17, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786533692, 1786533692),
(314, 18, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786533964, 1786566836),
(315, 18, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(316, 18, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(317, 18, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(318, 18, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(319, 18, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(320, 18, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(321, 18, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(322, 18, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786533964, 1786534210),
(323, 18, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(324, 18, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786533964, 1786533964),
(325, 19, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786534940, 1786542357),
(326, 19, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(327, 19, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(328, 19, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(329, 19, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(330, 19, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(331, 19, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(332, 19, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(333, 19, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(334, 19, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(335, 19, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786534940, 1786534940),
(336, 20, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786544376, 1786570614),
(337, 20, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(338, 20, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(339, 20, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(340, 20, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(341, 20, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(342, 20, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(343, 20, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(344, 20, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786544376, 1786570457),
(345, 20, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(346, 20, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786544376, 1786544376),
(347, 21, 28, 254, 1, 20677, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786559621, 1786566880),
(348, 21, 28, 52, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(349, 21, 28, 124, 1, 20677, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(350, 21, 28, 108, 1, 20677, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(351, 21, 28, 96, 1, 20677, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(352, 21, 28, 97, 1, 20677, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(353, 21, 28, 99, 2, 2953, 15000, 800, 5000, 144, 1, 0, 15000, 1, 0, 1, 1786559621, 1786563629),
(354, 21, 28, 256, 2, 2953, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(355, 21, 28, 257, 2, 2953, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786559621, 1786559951),
(356, 21, 28, 6, 2, 2953, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(357, 21, 28, 255, 2, 2953, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786559621, 1786559621),
(358, 16, 28, 254, 1, 20678, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786579553, 1786613105),
(359, 16, 28, 52, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(360, 16, 28, 124, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(361, 16, 28, 108, 1, 20678, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(362, 16, 28, 96, 1, 20678, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(363, 16, 28, 97, 1, 20678, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(364, 16, 28, 99, 2, 2954, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(365, 16, 28, 256, 2, 2954, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(366, 16, 28, 257, 2, 2954, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(367, 16, 28, 6, 2, 2954, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(368, 16, 28, 255, 2, 2954, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786579553, 1786579553),
(369, 18, 28, 254, 1, 20678, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786598179, 1786600424),
(370, 18, 28, 52, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(371, 18, 28, 124, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(372, 18, 28, 108, 1, 20678, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(373, 18, 28, 96, 1, 20678, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(374, 18, 28, 97, 1, 20678, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(375, 18, 28, 99, 2, 2954, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(376, 18, 28, 256, 2, 2954, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(377, 18, 28, 257, 2, 2954, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(378, 18, 28, 6, 2, 2954, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(379, 18, 28, 255, 2, 2954, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786598179, 1786598179),
(380, 21, 28, 254, 1, 20678, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786612200, 1786620574),
(381, 21, 28, 52, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(382, 21, 28, 124, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(383, 21, 28, 108, 1, 20678, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(384, 21, 28, 96, 1, 20678, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(385, 21, 28, 97, 1, 20678, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(386, 21, 28, 99, 2, 2954, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(387, 21, 28, 256, 2, 2954, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(388, 21, 28, 257, 2, 2954, 100000, 800, 5000, 0, 6, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(389, 21, 28, 6, 2, 2954, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(390, 21, 28, 255, 2, 2954, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786612200, 1786612200),
(391, 22, 28, 254, 1, 20678, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786616566, 1786617151),
(392, 22, 28, 52, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(393, 22, 28, 124, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(394, 22, 28, 108, 1, 20678, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(395, 22, 28, 96, 1, 20678, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(396, 22, 28, 97, 1, 20678, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(397, 22, 28, 99, 2, 2954, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(398, 22, 28, 256, 2, 2954, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(399, 22, 28, 257, 2, 2954, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786616566, 1786616902),
(400, 22, 28, 6, 2, 2954, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(401, 22, 28, 255, 2, 2954, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786616566, 1786616566),
(402, 20, 28, 254, 1, 20678, 1, 200, 1000, 0, 1, 0, 1, 1, 0, 1, 1786617001, 1786617001),
(403, 20, 28, 52, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(404, 20, 28, 124, 1, 20678, 1, 200, 1000, 0, 6, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(405, 20, 28, 108, 1, 20678, 1, 200, 1000, 126, 6, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(406, 20, 28, 96, 1, 20678, 1, 200, 1000, 32, 6, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(407, 20, 28, 97, 1, 20678, 1, 200, 1000, 157, 6, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(408, 20, 28, 99, 2, 2954, 15000, 800, 5000, 144, 1, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(409, 20, 28, 256, 2, 2954, 8, 800, 5000, 49, 6, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(410, 20, 28, 257, 2, 2954, 100000, 800, 5000, 0, 6, 0, 100000, 1, 0, 1, 1786617001, 1786617891),
(411, 20, 28, 6, 2, 2954, 1, 800, 5000, 69, 1, 0, 0, 0, 0, 0, 1786617001, 1786617001),
(412, 20, 28, 255, 2, 2954, 5, 800, 5000, 0, 4, 0, 0, 0, 0, 0, 1786617001, 1786617001);

-- --------------------------------------------------------

--
-- Структура таблицы `bought_houses`
--

CREATE TABLE `bought_houses` (
  `house_id` int(11) NOT NULL,
  `account_id` int(11) DEFAULT NULL,
  `owner_name` varchar(24) DEFAULT NULL,
  `is_open` tinyint(1) NOT NULL,
  `apt` int(11) NOT NULL,
  `remont` int(11) NOT NULL,
  `shkaf` int(11) NOT NULL,
  `kv` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `business`
--

CREATE TABLE `business` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `kriha` varchar(24) NOT NULL,
  `improvements` int(11) NOT NULL,
  `products` int(11) NOT NULL,
  `prod_price` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `interior` int(11) NOT NULL,
  `enter_price` int(11) NOT NULL,
  `enter_music` int(11) NOT NULL,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL,
  `eviction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `business`
--

INSERT INTO `business` (`id`, `owner_id`, `name`, `kriha`, `improvements`, `products`, `prod_price`, `balance`, `rent_time`, `price`, `rent_price`, `type`, `interior`, `enter_price`, `enter_music`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `eviction`) VALUES
(1, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2310.72, -1911.69, 21.968, 2310.72, -1911.69, 21.968, 0, 0),
(2, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 1921.68, 2092.98, 16.199, 1921.68, 2092.98, 16.199, 0, 0),
(3, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 13.039, 911.113, 12.307, 13.039, 911.113, 12.307, 0, 0),
(4, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 1786320000, 500000, 5000, 1, 0, 0, 0, 0, 150.424, 776.249, 12.154, 150.424, 776.249, 12.154, 0, 0),
(5, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 405.642, 1960.66, 8.164, 405.642, 1960.66, 8.164, 0, 0),
(6, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 1851.05, 2245.89, 15.617, 1851.05, 2245.89, 15.617, 0, 0),
(7, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2764.55, 745.323, 31.189, 2764.55, 745.323, 31.189, 0, 0),
(8, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2260.8, -2106.81, 21.98, 2260.8, -2106.81, 21.98, 0, 0),
(9, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2578.37, -2377.69, 22.947, 2578.37, -2377.69, 22.947, 0, 0),
(10, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2450.67, -1903.48, 21.963, 2450.67, -1903.48, 21.963, 0, 0),
(11, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2252.27, -887.57, 26.54, 2252.27, -887.57, 26.54, 0, 0),
(12, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -360.702, 1024.97, 13.245, -360.702, 1024.97, 13.245, 0, 0),
(13, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2310.42, -318.798, 30.651, -2310.42, -318.798, 30.651, 0, 0),
(14, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 1019.39, -791.196, 41.09, 1019.39, -791.196, 41.09, 0, 0),
(15, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2629.75, 2584.59, 16.595, 2629.75, 2584.59, 16.595, 0, 0),
(16, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -541.487, 1303.5, 20.891, -541.487, 1303.5, 20.891, 0, 0),
(17, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 2241.7, -1796.5, 21.7, 2241.7, -1796.5, 21.7, 0, 0),
(18, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 1598.27, 2884.64, 12.198, 1598.27, 2884.64, 12.198, 0, 0),
(19, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 39.05, 513.922, 13.164, 39.05, 513.922, 13.164, 0, 0),
(20, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 398.195, 554.202, 12.152, 398.195, 554.202, 12.152, 0, 0),
(21, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -506.326, -1551.81, 41.731, -506.326, -1551.81, 41.731, 0, 0),
(22, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2525.15, -695.42, 29.777, -2525.15, -695.42, 29.777, 0, 0),
(23, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2379.93, 4.164, 27.03, -2379.93, 4.164, 27.03, 0, 0),
(24, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -1752.23, 774.745, 35.815, -1752.23, 774.745, 35.815, 0, 0),
(25, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, 550.564, -1221.8, 41.285, 550.564, -1221.8, 41.285, 0, 0),
(26, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2352.22, 2596.98, 58.334, -2352.22, 2596.98, 58.334, 0, 0),
(27, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2584.95, 1208.45, 9.92, -2584.95, 1208.45, 9.92, 0, 0),
(28, 0, 'Магазин 24/7', '', 6, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2574.16, 1598.49, 9.92, -2574.16, 1598.49, 9.92, 0, 0),
(29, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2120.2, 2658.17, 58.178, -2120.2, 2658.17, 58.178, 0, 0),
(30, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -1848.03, 2787.13, 58.17, -1848.03, 2787.13, 58.17, 0, 0),
(31, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2299.55, 2460.78, 58.088, -2299.55, 2460.78, 58.088, 0, 0),
(32, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2211.93, 1441.11, 9.9, -2211.93, 1441.11, 9.9, 0, 0),
(33, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2154.9, 2052.25, 9.66, -2154.9, 2052.25, 9.66, 0, 0),
(34, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -1683.59, 2334.94, 58.363, -1683.59, 2334.94, 58.363, 0, 0),
(35, 0, 'Магазин 24/7', '', 0, 0, 0, 0, 0, 500000, 5000, 1, 0, 0, 0, 0, -2070.65, 2477.42, 57.86, -2070.65, 2477.42, 57.86, 0, 0),
(36, 0, 'СТО', '', 0, 0, 0, 0, 0, 5000000, 5000, 10, 0, 0, 0, 0, -426.235, 1005.41, 12.308, -426.235, 1005.41, 12.308, 0, 0),
(37, 0, 'СТО', '', 0, 0, 0, 0, 0, 5000000, 5000, 10, 0, 0, 0, 0, 2164.4, -870.218, 28.592, 2164.4, -870.218, 28.592, 0, 0),
(38, 0, 'СТО', '', 0, 0, 0, 0, 0, 5000000, 5000, 10, 0, 0, 0, 0, 2311.99, -2607.24, 21.829, 2311.99, -2607.24, 21.829, 0, 0),
(39, 0, 'СТО', '', 0, 0, 0, 0, 0, 5000000, 5000, 10, 0, 0, 0, 0, 1728.81, 2462.13, 14.979, 1728.81, 2462.13, 14.979, 0, 0),
(40, 0, 'Автосалон', '', 0, 1000000, 0, 0, 0, 8000000, 5000, 7, 0, 0, 0, 0, 802.789, 497.319, 12.276, 802.789, 497.319, 12.276, 337.131, 0),
(41, 0, 'Автосалон', '', 0, 1000000, 0, 0, 0, 15000000, 5000, 7, 0, 0, 0, 0, 660.813, 2667.93, 14.501, 660.813, 2667.93, 14.501, 148.321, 0),
(42, 0, 'Автосалон', '', 0, 1000000, 0, 0, 0, 12000000, 5000, 7, 0, 0, 0, 0, 1411.06, 460.16, 13.203, 1411.06, 460.16, 13.203, 146.174, 0),
(43, 0, 'Автосалон', '', 0, 1000000, 0, 0, 0, 7000000, 5000, 7, 0, 0, 0, 0, -916.011, 1188.01, 10.725, -916.011, 1188.01, 10.725, 209.909, 0),
(44, 0, 'Автосалон', '', 0, 0, 0, 0, 0, 10000000, 5000, 7, 0, 0, 0, 0, -735.496, 1964.26, 45.942, -735.496, 1964.26, 45.942, 89.7661, 0),
(45, 0, 'Пункт выдачи 1', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, 1803.15, 2037.02, 16.008, 1803.15, 2037.02, 16.008, 0, 0),
(46, 0, 'Пункт выдачи 2', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, 292.997, 1541.5, 12.157, 292.997, 1541.5, 12.157, 0, 0),
(47, 0, 'Пункт выдачи 3', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, 614.632, 579.857, 12.188, 614.632, 579.857, 12.188, 0, 0),
(48, 0, 'Пункт выдачи 4', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, 2566.41, -2516, 22.12, 2566.41, -2516, 22.12, 0, 0),
(49, 0, 'Пункт выдачи 5', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, 2386.72, -1708.89, 22.084, 2386.72, -1708.89, 22.084, 0, 0),
(50, 0, 'Пункт выдачи 6', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, -528.564, -1788.57, 41.066, -528.564, -1788.57, 41.066, 0, 0),
(51, 0, 'Пункт выдачи 7', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, -2265.86, -322.51, 28.101, -2265.86, -322.51, 28.101, 0, 0),
(52, 0, 'Пункт выдачи 8', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, -2457.94, 1134.41, 10.855, -2457.94, 1134.41, 10.855, 0, 0),
(53, 0, 'Технический центр', '', 0, 0, 0, 0, 0, 3000000, 5000, 14, 0, 0, 0, 0, -1824.45, 2717.56, 57.767, -1824.45, 2717.56, 57.767, 0, 0),
(54, 0, 'СТО', '', 0, 0, 0, 0, 1789084800, 15000000, 5000, 10, 9, 0, 0, 0, -432.045, 1005.61, 12.19, 0, 0, 0, 0, 0),
(55, 0, '', '', 0, 0, 0, 0, 0, 25000000, 5000, 12, 11, 0, 0, 0, 1732.13, 2447.95, 14.9792, 0, 0, 0, 0, 0),
(56, 18, 'Стайлинг Центр', '', 0, 10000, 0, 0, 1786665600, 35000000, 5000, 13, 12, 0, 0, 0, 2311.74, -2601.81, 21.8291, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `business_gps`
--

CREATE TABLE `business_gps` (
  `id` int(11) NOT NULL,
  `bid` int(11) NOT NULL,
  `pos` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `business_profit`
--

CREATE TABLE `business_profit` (
  `id` int(11) NOT NULL,
  `bid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL,
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `business_profit`
--

INSERT INTO `business_profit` (`id`, `bid`, `uid`, `uip`, `time`, `money`, `view`) VALUES
(4, 12, 6, '216.227.144.162', 1786136323, 150, 1),
(5, 12, 6, '216.227.144.162', 1786136326, 75, 1),
(6, 6, 6, '216.227.144.162', 1786266325, 300, 0),
(7, 6, 6, '216.227.144.162', 1786266330, 5000, 0),
(8, 6, 6, '216.227.144.162', 1786266348, 150, 0),
(9, 6, 6, '216.227.144.162', 1786266352, 150, 0),
(10, 6, 6, '216.227.144.162', 1786266353, 150, 0),
(11, 6, 6, '216.227.144.162', 1786266354, 150, 0),
(12, 6, 6, '216.227.144.162', 1786266359, 150, 0),
(13, 6, 6, '216.227.144.162', 1786266361, 150, 0),
(14, 6, 6, '216.227.144.162', 1786266361, 150, 0),
(15, 28, 12, '51.83.187.4', 1786276806, 150, 1),
(16, 28, 12, '51.83.187.4', 1786276807, 150, 1),
(17, 28, 12, '51.83.187.4', 1786276808, 150, 1),
(18, 28, 12, '51.83.187.4', 1786276809, 150, 1),
(19, 28, 12, '51.83.187.4', 1786276809, 150, 1),
(20, 28, 12, '51.83.187.4', 1786276810, 150, 1),
(21, 28, 12, '51.83.187.4', 1786276813, 1050, 1),
(22, 28, 12, '51.83.187.4', 1786276818, 75, 1),
(23, 28, 12, '51.83.187.4', 1786276819, 300, 1),
(24, 28, 12, '51.83.187.4', 1786276822, 5000, 1),
(25, 8, 5, '89.218.71.183', 1786481830, 1050, 0),
(26, 8, 5, '89.218.71.183', 1786481842, 225, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `car_obmen`
--

CREATE TABLE `car_obmen` (
  `car_1` int(11) NOT NULL DEFAULT 5,
  `car_2` int(11) NOT NULL DEFAULT 5,
  `car_3` int(11) NOT NULL DEFAULT 5,
  `car_4` int(11) NOT NULL DEFAULT 5,
  `car_5` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `change_names`
--

CREATE TABLE `change_names` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(21) NOT NULL,
  `time` int(11) NOT NULL,
  `ip` varchar(16) NOT NULL DEFAULT '255.255.255.255'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `charity`
--

CREATE TABLE `charity` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `charity`
--

INSERT INTO `charity` (`id`, `uid`, `money`, `time`) VALUES
(679, 20, 1200000, 1786563671);

-- --------------------------------------------------------

--
-- Структура таблицы `contbykbass`
--

CREATE TABLE `contbykbass` (
  `id` int(3) NOT NULL,
  `type` int(1) NOT NULL DEFAULT 0,
  `region` int(1) NOT NULL DEFAULT 1,
  `item` int(5) NOT NULL DEFAULT 0,
  `name` varchar(30) NOT NULL DEFAULT 'by @lonexsbio',
  `contprice` int(8) NOT NULL DEFAULT 0,
  `itemprice` int(8) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `contbykbass`
--

INSERT INTO `contbykbass` (`id`, `type`, `region`, `item`, `name`, `contprice`, `itemprice`) VALUES
(1, 1, 1, 400, 'RUS', 100000, 100000),
(2, 1, 2, 400, 'CHINA', 100000, 100000),
(3, 1, 3, 400, 'DUBAI', 100000, 100000),
(4, 1, 4, 400, 'GERMANIA', 100000, 100000);

-- --------------------------------------------------------

--
-- Структура таблицы `debug`
--

CREATE TABLE `debug` (
  `id` int(11) NOT NULL,
  `text` varchar(256) NOT NULL,
  `date` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `donate_log`
--

CREATE TABLE `donate_log` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `donate` int(11) NOT NULL,
  `description` varchar(64) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'None'
) ENGINE=MyISAM DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп данных таблицы `donate_log`
--

INSERT INTO `donate_log` (`id`, `uid`, `uip`, `time`, `donate`, `description`) VALUES
(1, 7, '216.227.144.162', 1786467660, 2, 'акция'),
(2, 5, '95.59.247.15', 1786470457, -350, 'None'),
(3, 5, '89.218.71.183', 1786474860, 2, 'акция'),
(4, 12, '179.237.84.43', 1786476816, -318, 'None'),
(5, 12, '179.237.84.43', 1786476820, -318, 'None'),
(6, 12, '179.237.84.43', 1786476835, -318, 'None'),
(7, 12, '179.237.84.43', 1786476848, -318, 'None'),
(8, 12, '179.237.84.43', 1786476861, -318, 'None'),
(9, 12, '179.237.84.43', 1786476872, -3300, 'None'),
(10, 6, '216.227.144.162', 1786479963, -2500, 'None'),
(11, 6, '216.227.144.162', 1786479981, -3000, 'None'),
(12, 6, '216.227.144.162', 1786479984, -3000, 'None'),
(13, 6, '216.227.144.162', 1786480030, -3000, 'None'),
(14, 6, '216.227.144.162', 1786480032, -30000, 'None'),
(15, 6, '216.227.144.162', 1786480105, -5000, 'None'),
(16, 6, '216.227.144.162', 1786480109, -500, 'None'),
(17, 5, '89.218.71.183', 1786481983, 300, 'Награда за 1 место по онлайну'),
(18, 5, '89.218.71.183', 1786487522, -5000, 'None'),
(19, 5, '89.218.71.183', 1786487580, -900, 'None'),
(20, 5, '89.218.71.183', 1786487583, -2000, 'None'),
(21, 5, '89.218.71.183', 1786487587, -5000, 'None'),
(22, 5, '89.218.71.183', 1786487589, -3000, 'None'),
(23, 5, '89.218.71.183', 1786487593, -3000, 'None'),
(24, 5, '89.218.71.183', 1786487595, -2000, 'None'),
(25, 5, '89.218.71.183', 1786489191, -300, 'тест'),
(26, 12, '51.83.187.4', 1786489193, -6785, 'Покупка донатного номерного знака'),
(27, 12, '51.83.187.4', 1786489247, -6785, 'Покупка донатного номерного знака'),
(28, 12, '51.83.187.4', 1786489260, 2, 'акция'),
(29, 5, '89.218.71.183', 1786489260, 2, 'акция'),
(30, 12, '51.83.187.4', 1786489264, -300, 'тест'),
(31, 12, '51.83.187.4', 1786489268, -300, 'тест'),
(32, 12, '51.83.187.4', 1786489284, -70, 'Смена номера телефона'),
(33, 12, '51.83.187.4', 1786489292, -5000, 'None'),
(34, 12, '51.83.187.4', 1786489294, -2500, 'None'),
(35, 12, '51.83.187.4', 1786489299, -3000, 'None'),
(36, 12, '51.83.187.4', 1786489598, -5000, 'None'),
(37, 12, '51.83.187.4', 1786489600, -500, 'None'),
(38, 12, '51.83.187.4', 1786489603, -2000, 'None'),
(39, 6, '216.227.144.162', 1786489622, -6785, 'Покупка донатного номерного знака'),
(40, 5, '89.218.71.183', 1786489628, -6785, 'Покупка донатного номерного знака'),
(41, 6, '216.227.144.162', 1786489874, -500, 'None'),
(42, 6, '216.227.144.162', 1786489894, -300, 'тест'),
(43, 6, '216.227.144.162', 1786489897, -100, 'Покупка смены пола'),
(44, 6, '216.227.144.162', 1786489901, -100, 'Покупка смены пола'),
(45, 6, '216.227.144.162', 1786489907, -300, 'тест'),
(46, 6, '216.227.144.162', 1786489910, -500, 'тест'),
(47, 6, '216.227.144.162', 1786489925, -300, 'тест'),
(48, 6, '216.227.144.162', 1786489930, -50, 'Покупка смены имени'),
(49, 6, '216.227.144.162', 1786489944, -100, 'тест'),
(50, 6, '216.227.144.162', 1786489945, -100, 'тест'),
(51, 5, '89.218.71.183', 1786490097, -1700, 'None'),
(52, 5, '89.218.71.183', 1786490106, 9999, 'Выдача доната от админа Ray_Amigo'),
(53, 6, '216.227.144.162', 1786492719, -2500, 'None'),
(54, 6, '216.227.144.162', 1786492860, 2, 'акция'),
(55, 15, '2.26.144.10', 1786492860, 2, 'акция'),
(56, 15, '2.26.144.10', 1786492862, 1, 'Выдача доната от админа Pepel_Ghost'),
(57, 15, '2.26.144.10', 1786492868, 10000, 'Выдача доната от админа Pepel_Ghost'),
(58, 15, '2.26.144.10', 1786492873, 10000, 'Выдача доната от админа Pepel_Ghost'),
(59, 6, '216.227.144.162', 1786492901, -2500, 'None'),
(60, 15, '2.26.144.10', 1786493068, -2500, 'None'),
(61, 6, '216.227.144.162', 1786493075, -5, 'Покупка законопослушности'),
(62, 6, '216.227.144.162', 1786493075, -5, 'Покупка законопослушности'),
(63, 6, '216.227.144.162', 1786493078, -75, 'тест'),
(64, 6, '216.227.144.162', 1786493130, -2000, 'None'),
(65, 6, '216.227.144.162', 1786493213, -70, 'Покупка SIM-карты'),
(66, 15, '2.26.144.10', 1786493232, -5, 'Покупка законопослушности'),
(67, 15, '2.26.144.10', 1786493234, -5, 'Покупка законопослушности'),
(68, 15, '2.26.144.10', 1786493236, -5, 'Покупка законопослушности'),
(69, 15, '2.26.144.10', 1786493238, -5, 'Покупка законопослушности'),
(70, 15, '2.26.144.10', 1786493241, -5, 'Покупка законопослушности'),
(71, 15, '2.26.144.10', 1786493243, -500, 'тест'),
(72, 15, '2.26.144.10', 1786493386, -8500, 'None'),
(73, 6, '216.227.144.162', 1786493664, -318, 'None'),
(74, 6, '216.227.144.162', 1786493746, -318, 'None'),
(75, 6, '216.227.144.162', 1786493755, -318, 'None'),
(76, 6, '216.227.144.162', 1786493771, -318, 'None'),
(77, 6, '216.227.144.162', 1786493794, -318, 'None'),
(78, 6, '216.227.144.162', 1786493809, -3300, 'None'),
(79, 6, '216.227.144.162', 1786493938, -305, 'None'),
(80, 6, '216.227.144.162', 1786493967, -468, 'None'),
(81, 15, '2.26.144.10', 1786495448, 5, 'None'),
(82, 15, '2.26.144.10', 1786495462, 10, 'None'),
(83, 15, '2.26.144.10', 1786495483, 700, 'None'),
(84, 15, '2.26.144.10', 1786495574, -1000, 'None'),
(85, 15, '2.26.144.10', 1786496434, -1690, 'Покупка BlackPass Deluxe'),
(86, 15, '2.26.144.10', 1786496460, 2, 'акция'),
(87, 15, '2.26.144.10', 1786496838, 15, 'None'),
(88, 15, '2.26.144.10', 1786496846, 700, 'None'),
(89, 15, '2.26.144.10', 1786496889, 700, 'None'),
(90, 15, '2.26.144.10', 1786496892, 700, 'None'),
(91, 12, '51.83.187.4', 1786521935, -300, 'тест'),
(92, 12, '51.83.187.4', 1786521939, -50, 'Покупка смены имени'),
(93, 12, '51.83.187.4', 1786521957, -5785, 'Покупка донатного номерного знака'),
(94, 12, '51.83.187.4', 1786521964, -2500, 'None'),
(95, 12, '51.83.187.4', 1786521967, -5000, 'None'),
(96, 12, '51.83.187.4', 1786521970, -3000, 'None'),
(97, 12, '51.83.187.4', 1786521974, -3000, 'None'),
(98, 12, '51.83.187.4', 1786521979, -2000, 'None'),
(99, 12, '51.83.187.4', 1786522006, -6200, 'None'),
(100, 12, '51.83.187.4', 1786522014, -1000, 'None'),
(101, 12, '51.83.187.4', 1786522019, -5000, 'None'),
(102, 12, '51.83.187.4', 1786522021, -1700, 'None'),
(103, 12, '51.83.187.4', 1786522023, -500, 'None'),
(104, 12, '51.83.187.4', 1786522027, -350, 'None'),
(105, 5, '89.218.71.183', 1786526832, -2500, 'None'),
(106, 15, '2.26.144.10', 1786530570, -150, 'тест'),
(107, 12, '51.83.187.4', 1786531337, -300, 'тест'),
(108, 12, '51.83.187.4', 1786531347, -70, 'Покупка SIM-карты'),
(109, 12, '51.83.187.4', 1786531372, -300, 'тест'),
(110, 12, '51.83.187.4', 1786531375, -300, 'тест'),
(111, 12, '51.83.187.4', 1786531376, -300, 'тест'),
(112, 12, '51.83.187.4', 1786531378, -300, 'тест'),
(113, 12, '51.83.187.4', 1786531380, -300, 'тест'),
(114, 12, '51.83.187.4', 1786531381, -300, 'тест'),
(115, 12, '51.83.187.4', 1786531381, -300, 'тест'),
(116, 12, '51.83.187.4', 1786531384, -300, 'тест'),
(117, 12, '51.83.187.4', 1786531386, -300, 'тест'),
(118, 12, '51.83.187.4', 1786531387, -300, 'тест'),
(119, 12, '51.83.187.4', 1786531389, -300, 'тест'),
(120, 12, '51.83.187.4', 1786531400, -5000, 'None'),
(121, 15, '2.26.144.11', 1786532313, -1000, 'None'),
(122, 15, '2.26.144.11', 1786532460, 2, 'акция'),
(123, 12, '51.83.187.4', 1786532460, 2, 'акция'),
(124, 12, '51.83.187.4', 1786532568, -318, 'None'),
(125, 12, '51.83.187.4', 1786532582, -318, 'None'),
(126, 12, '51.83.187.4', 1786532593, -318, 'None'),
(127, 12, '51.83.187.4', 1786532601, -318, 'None'),
(128, 12, '51.83.187.4', 1786532610, -318, 'None'),
(129, 12, '51.83.187.4', 1786532620, -3300, 'None'),
(130, 12, '51.83.187.4', 1786532705, -468, 'None'),
(131, 12, '51.83.187.4', 1786532721, -305, 'None'),
(132, 12, '51.83.187.4', 1786532964, -2000, 'None'),
(133, 17, '2.26.144.11', 1786533805, 10000, 'Выдача доната от админа Pepel_izBlood'),
(134, 17, '2.26.144.11', 1786533807, 10000, 'Выдача доната от админа Pepel_izBlood'),
(135, 17, '2.26.144.11', 1786533809, 10000, 'Выдача доната от админа Pepel_izBlood'),
(136, 17, '2.26.144.11', 1786533810, 10000, 'Выдача доната от админа Pepel_izBlood'),
(137, 17, '2.26.144.11', 1786533812, 10000, 'Выдача доната от админа Pepel_izBlood'),
(138, 17, '2.26.144.11', 1786533813, 10000, 'Выдача доната от админа Pepel_izBlood'),
(139, 17, '2.26.144.11', 1786533815, 10000, 'Выдача доната от админа Pepel_izBlood'),
(140, 17, '2.26.144.11', 1786533815, 10000, 'Выдача доната от админа Pepel_izBlood'),
(141, 17, '2.26.144.11', 1786533816, 10000, 'Выдача доната от админа Pepel_izBlood'),
(142, 17, '2.26.144.11', 1786533819, 10000, 'Выдача доната от админа Pepel_izBlood'),
(143, 17, '2.26.144.11', 1786533820, 10000, 'Выдача доната от админа Pepel_izBlood'),
(144, 17, '2.26.144.11', 1786533820, 10000, 'Выдача доната от админа Pepel_izBlood'),
(145, 17, '2.26.144.11', 1786533821, 10000, 'Выдача доната от админа Pepel_izBlood'),
(146, 17, '2.26.144.11', 1786533822, 10000, 'Выдача доната от админа Pepel_izBlood'),
(147, 17, '2.26.144.11', 1786533823, 10000, 'Выдача доната от админа Pepel_izBlood'),
(148, 17, '2.26.144.11', 1786533851, -50, 'Покупка смены имени'),
(149, 16, '216.227.144.162', 1786534069, 10000, 'Выдача доната от админа Pepel_izBlood'),
(150, 16, '216.227.144.162', 1786534071, 10000, 'Выдача доната от админа Pepel_izBlood'),
(151, 16, '216.227.144.162', 1786534076, 10000, 'Выдача доната от админа Pepel_izBlood'),
(152, 16, '216.227.144.162', 1786534079, 10000, 'Выдача доната от админа Pepel_izBlood'),
(153, 16, '216.227.144.162', 1786534081, 10000, 'Выдача доната от админа Pepel_izBlood'),
(154, 16, '216.227.144.162', 1786534082, 10000, 'Выдача доната от админа Pepel_izBlood'),
(155, 16, '216.227.144.162', 1786534085, 10000, 'Выдача доната от админа Pepel_izBlood'),
(156, 16, '216.227.144.162', 1786534086, 10000, 'Выдача доната от админа Pepel_izBlood'),
(157, 18, '2.26.144.6', 1786534223, 10000, 'Выдача доната от админа Pepel_izBlood'),
(158, 18, '2.26.144.6', 1786534224, 10000, 'Выдача доната от админа Pepel_izBlood'),
(159, 18, '2.26.144.6', 1786534226, 10000, 'Выдача доната от админа Pepel_izBlood'),
(160, 18, '2.26.144.6', 1786534227, 10000, 'Выдача доната от админа Pepel_izBlood'),
(161, 18, '2.26.144.6', 1786534228, 10000, 'Выдача доната от админа Pepel_izBlood'),
(162, 18, '2.26.144.6', 1786534229, 10000, 'Выдача доната от админа Pepel_izBlood'),
(163, 18, '2.26.144.6', 1786534230, 10000, 'Выдача доната от админа Pepel_izBlood'),
(164, 18, '2.26.144.6', 1786534231, 10000, 'Выдача доната от админа Pepel_izBlood'),
(165, 18, '2.26.144.6', 1786534232, 10000, 'Выдача доната от админа Pepel_izBlood'),
(166, 18, '2.26.144.6', 1786534233, 10000, 'Выдача доната от админа Pepel_izBlood'),
(167, 18, '2.26.144.6', 1786534234, 10000, 'Выдача доната от админа Pepel_izBlood'),
(168, 18, '2.26.144.6', 1786534235, 10000, 'Выдача доната от админа Pepel_izBlood'),
(169, 18, '2.26.144.6', 1786534236, 10000, 'Выдача доната от админа Pepel_izBlood'),
(170, 18, '2.26.144.6', 1786534237, 10000, 'Выдача доната от админа Pepel_izBlood'),
(171, 18, '2.26.144.6', 1786534237, 10000, 'Выдача доната от админа Pepel_izBlood'),
(172, 16, '216.227.144.162', 1786534653, -300, 'тест'),
(173, 16, '216.227.144.162', 1786534655, -300, 'тест'),
(174, 16, '216.227.144.162', 1786534659, -300, 'тест'),
(175, 16, '216.227.144.162', 1786534662, -300, 'тест'),
(176, 16, '216.227.144.162', 1786534664, -300, 'тест'),
(177, 16, '216.227.144.162', 1786534666, -300, 'тест'),
(178, 19, '51.83.187.4', 1786535004, 10000, 'Выдача доната от админа Danya_Feel'),
(179, 16, '216.227.144.162', 1786535015, -5000, 'None'),
(180, 19, '51.83.187.4', 1786535023, -5000, 'None'),
(181, 19, '51.83.187.4', 1786535025, -500, 'None'),
(182, 19, '51.83.187.4', 1786535038, -2000, 'None'),
(183, 16, '216.227.144.162', 1786535496, -5000, 'None'),
(184, 19, '179.237.84.43', 1786542395, -300, 'None'),
(185, 12, '179.237.84.43', 1786542942, -1000, 'None'),
(186, 12, '179.237.84.43', 1786543000, -6200, 'None'),
(187, 16, '216.227.144.162', 1786543260, 2, 'акция'),
(188, 18, '2.26.144.11', 1786543260, 2, 'акция'),
(189, 18, '2.26.144.11', 1786543443, 700, 'None'),
(190, 18, '2.26.144.11', 1786543451, 700, 'None'),
(191, 18, '2.26.144.11', 1786543453, 700, 'None'),
(192, 18, '2.26.144.11', 1786543457, 700, 'None'),
(193, 18, '2.26.144.11', 1786543460, 700, 'None'),
(194, 18, '2.26.144.11', 1786543979, -5785, 'Покупка донатного номерного знака'),
(195, 18, '2.26.144.11', 1786544000, -6785, 'Покупка донатного номерного знака'),
(196, 18, '2.26.144.11', 1786544049, -5285, 'Покупка донатного номерного знака'),
(197, 18, '2.26.144.11', 1786544206, -3000, 'None'),
(198, 18, '2.26.144.11', 1786544240, -5000, 'None'),
(199, 18, '2.26.144.6', 1786549959, -2000, 'None'),
(200, 18, '2.26.144.6', 1786550113, -2500, 'None'),
(201, 18, '2.26.144.6', 1786550127, -3600, 'None'),
(202, 16, '216.227.144.162', 1786550460, 2, 'акция'),
(203, 18, '2.26.144.6', 1786550460, 2, 'акция'),
(204, 21, '95.56.250.183', 1786559963, 9999, 'Выдача доната от админа Ray_Amigo'),
(205, 21, '95.56.250.183', 1786559965, 9999, 'Выдача доната от админа Ray_Amigo'),
(206, 21, '95.56.250.183', 1786559966, 9999, 'Выдача доната от админа Ray_Amigo'),
(207, 21, '95.56.250.183', 1786559970, -3000, 'None'),
(208, 21, '95.56.250.183', 1786563494, -5000, 'None'),
(209, 20, '51.83.187.4', 1786563545, 10000, 'Выдача доната от админа Dev_RTF'),
(210, 20, '51.83.187.4', 1786563550, -5000, 'None'),
(211, 20, '51.83.187.4', 1786563552, -2500, 'None'),
(212, 21, '95.56.250.183', 1786563674, -450, 'None'),
(213, 21, '95.56.250.183', 1786563701, -2000, 'None'),
(214, 21, '95.56.250.183', 1786563759, -300, 'тест'),
(215, 21, '95.56.250.183', 1786563764, -340, 'None'),
(216, 20, '51.83.187.4', 1786563800, 10000, 'Выдача доната от админа Dev_RTF'),
(217, 20, '51.83.187.4', 1786563802, 10000, 'Выдача доната от админа Dev_RTF'),
(218, 20, '51.83.187.4', 1786563803, 10000, 'Выдача доната от админа Dev_RTF'),
(219, 20, '51.83.187.4', 1786563805, 10000, 'Выдача доната от админа Dev_RTF'),
(220, 20, '51.83.187.4', 1786563805, 10000, 'Выдача доната от админа Dev_RTF'),
(221, 20, '51.83.187.4', 1786563807, 10000, 'Выдача доната от админа Dev_RTF'),
(222, 20, '51.83.187.4', 1786563808, 10000, 'Выдача доната от админа Dev_RTF'),
(223, 20, '51.83.187.4', 1786563809, 10000, 'Выдача доната от админа Dev_RTF'),
(224, 20, '51.83.187.4', 1786563810, 10000, 'Выдача доната от админа Dev_RTF'),
(225, 20, '51.83.187.4', 1786563811, 10000, 'Выдача доната от админа Dev_RTF'),
(226, 20, '51.83.187.4', 1786563813, 10000, 'Выдача доната от админа Dev_RTF'),
(227, 20, '51.83.187.4', 1786563814, 10000, 'Выдача доната от админа Dev_RTF'),
(228, 20, '51.83.187.4', 1786563815, 10000, 'Выдача доната от админа Dev_RTF'),
(229, 20, '51.83.187.4', 1786563816, 10000, 'Выдача доната от админа Dev_RTF'),
(230, 20, '51.83.187.4', 1786563818, 10000, 'Выдача доната от админа Dev_RTF'),
(231, 20, '51.83.187.4', 1786563819, 10000, 'Выдача доната от админа Dev_RTF'),
(232, 20, '51.83.187.4', 1786563820, 10000, 'Выдача доната от админа Dev_RTF'),
(233, 20, '51.83.187.4', 1786563821, 10000, 'Выдача доната от админа Dev_RTF'),
(234, 20, '51.83.187.4', 1786563822, 10000, 'Выдача доната от админа Dev_RTF'),
(235, 20, '51.83.187.4', 1786563823, 10000, 'Выдача доната от админа Dev_RTF'),
(236, 20, '51.83.187.4', 1786563824, 10000, 'Выдача доната от админа Dev_RTF'),
(237, 20, '51.83.187.4', 1786563826, 10000, 'Выдача доната от админа Dev_RTF'),
(238, 20, '51.83.187.4', 1786563827, 10000, 'Выдача доната от админа Dev_RTF'),
(239, 20, '51.83.187.4', 1786563828, 10000, 'Выдача доната от админа Dev_RTF'),
(240, 20, '51.83.187.4', 1786563829, 10000, 'Выдача доната от админа Dev_RTF'),
(241, 20, '51.83.187.4', 1786563830, 10000, 'Выдача доната от админа Dev_RTF'),
(242, 20, '51.83.187.4', 1786563832, 10000, 'Выдача доната от админа Dev_RTF'),
(243, 20, '51.83.187.4', 1786563834, 10000, 'Выдача доната от админа Dev_RTF'),
(244, 20, '51.83.187.4', 1786563836, 10000, 'Выдача доната от админа Dev_RTF'),
(245, 20, '51.83.187.4', 1786563837, 10000, 'Выдача доната от админа Dev_RTF'),
(246, 20, '51.83.187.4', 1786563838, 10000, 'Выдача доната от админа Dev_RTF'),
(247, 20, '51.83.187.4', 1786563839, 10000, 'Выдача доната от админа Dev_RTF'),
(248, 20, '51.83.187.4', 1786563840, 10000, 'Выдача доната от админа Dev_RTF'),
(249, 20, '51.83.187.4', 1786563841, 10000, 'Выдача доната от админа Dev_RTF'),
(250, 20, '51.83.187.4', 1786563843, 10000, 'Выдача доната от админа Dev_RTF'),
(251, 20, '51.83.187.4', 1786563844, 10000, 'Выдача доната от админа Dev_RTF'),
(252, 20, '51.83.187.4', 1786563845, 10000, 'Выдача доната от админа Dev_RTF'),
(253, 20, '51.83.187.4', 1786563846, 10000, 'Выдача доната от админа Dev_RTF'),
(254, 20, '51.83.187.4', 1786563847, 10000, 'Выдача доната от админа Dev_RTF'),
(255, 20, '51.83.187.4', 1786563848, 10000, 'Выдача доната от админа Dev_RTF'),
(256, 20, '51.83.187.4', 1786563849, 10000, 'Выдача доната от админа Dev_RTF'),
(257, 20, '51.83.187.4', 1786563850, 10000, 'Выдача доната от админа Dev_RTF'),
(258, 20, '51.83.187.4', 1786563851, 10000, 'Выдача доната от админа Dev_RTF'),
(259, 20, '51.83.187.4', 1786563852, 10000, 'Выдача доната от админа Dev_RTF'),
(260, 20, '51.83.187.4', 1786563853, 10000, 'Выдача доната от админа Dev_RTF'),
(261, 20, '51.83.187.4', 1786563854, 10000, 'Выдача доната от админа Dev_RTF'),
(262, 20, '51.83.187.4', 1786563855, 10000, 'Выдача доната от админа Dev_RTF'),
(263, 20, '51.83.187.4', 1786563871, 10000, 'Выдача доната от админа Dev_RTF'),
(264, 20, '51.83.187.4', 1786563873, 10000, 'Выдача доната от админа Dev_RTF'),
(265, 20, '51.83.187.4', 1786563874, 10000, 'Выдача доната от админа Dev_RTF'),
(266, 20, '51.83.187.4', 1786563892, -2000, 'None'),
(267, 20, '51.83.187.4', 1786563909, -900, 'None'),
(268, 20, '51.83.187.4', 1786563911, -5000, 'None'),
(269, 20, '51.83.187.4', 1786564300, -500, 'None'),
(270, 20, '51.83.187.4', 1786564303, -350, 'None'),
(271, 20, '51.83.187.4', 1786564305, -2000, 'None'),
(272, 20, '51.83.187.4', 1786564323, -500, 'None'),
(273, 20, '51.83.187.4', 1786564784, -300, 'тест'),
(274, 20, '51.83.187.4', 1786564818, -300, 'тест'),
(275, 20, '51.83.187.4', 1786564820, -300, 'тест'),
(276, 20, '51.83.187.4', 1786564822, -300, 'тест'),
(277, 20, '51.83.187.4', 1786564824, -300, 'тест'),
(278, 20, '51.83.187.4', 1786564860, 2, 'акция'),
(279, 20, '51.83.187.4', 1786564884, -5000, 'None'),
(280, 21, '95.56.250.183', 1786565023, -600, 'None'),
(281, 20, '51.83.187.4', 1786565286, -305, 'None'),
(282, 20, '51.83.187.4', 1786565447, -468, 'None'),
(283, 20, '51.83.187.4', 1786565562, -5785, 'Покупка донатного номерного знака'),
(284, 18, '2.26.144.11', 1786566459, 15, 'None'),
(285, 18, '2.26.144.11', 1786566476, 15, 'None'),
(286, 20, '51.83.187.4', 1786570424, -5000, 'None'),
(287, 20, '51.83.187.4', 1786570439, -35000, 'None'),
(288, 20, '51.83.187.4', 1786570506, -2650, 'None'),
(289, 20, '51.83.187.4', 1786570509, -2650, 'None'),
(290, 20, '51.83.187.4', 1786570513, -2650, 'None'),
(291, 20, '51.83.187.4', 1786570516, -2650, 'None'),
(292, 20, '51.83.187.4', 1786570519, -2650, 'None'),
(293, 20, '51.83.187.4', 1786570524, -27500, 'None'),
(294, 20, '51.83.187.4', 1786570718, -3902, 'None'),
(295, 20, '51.83.187.4', 1786570724, -2544, 'None'),
(296, 16, '216.227.144.162', 1786598167, -468, 'None'),
(297, 16, '216.227.144.162', 1786598199, -305, 'None'),
(298, 16, '216.227.144.162', 1786598246, -3300, 'None'),
(299, 16, '216.227.144.162', 1786598253, -318, 'None'),
(300, 16, '216.227.144.162', 1786598257, -318, 'None'),
(301, 16, '216.227.144.162', 1786598261, -318, 'None'),
(302, 16, '216.227.144.162', 1786598268, -318, 'None'),
(303, 16, '216.227.144.162', 1786598273, -318, 'None'),
(304, 18, '2.26.144.6', 1786599282, -468, 'None'),
(305, 18, '2.26.144.6', 1786599396, -305, 'None'),
(306, 18, '2.26.144.6', 1786599491, -3300, 'None'),
(307, 18, '2.26.144.6', 1786599499, -318, 'None'),
(308, 18, '2.26.144.6', 1786599510, -318, 'None'),
(309, 18, '2.26.144.6', 1786599517, -318, 'None'),
(310, 18, '2.26.144.6', 1786599535, -318, 'None'),
(311, 18, '2.26.144.6', 1786599542, -318, 'None'),
(312, 16, '216.227.144.162', 1786600571, -3300, 'None'),
(313, 22, '216.227.144.162', 1786616955, 800, 'None'),
(314, 22, '216.227.144.162', 1786617369, -42, 'None'),
(315, 20, '5.181.201.9', 1786617601, -15000, 'None'),
(316, 20, '5.181.201.9', 1786617632, -5000, 'None'),
(317, 20, '5.181.201.9', 1786617977, -4750, 'None'),
(318, 20, '5.181.201.9', 1786618117, -741, 'None'),
(319, 20, '5.181.201.9', 1786618127, -483, 'None'),
(320, 20, '5.181.201.9', 1786618213, -5785, 'Покупка донатного номерного знака'),
(321, 20, '5.181.201.9', 1786618271, -504, 'None'),
(322, 20, '5.181.201.9', 1786618283, -504, 'None'),
(323, 20, '5.181.201.9', 1786618291, -504, 'None'),
(324, 20, '5.181.201.9', 1786618299, -504, 'None'),
(325, 20, '5.181.201.9', 1786618307, -504, 'None'),
(326, 20, '5.181.201.9', 1786618315, -5225, 'None');

-- --------------------------------------------------------

--
-- Структура таблицы `donations`
--

CREATE TABLE `donations` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `time` varchar(16) NOT NULL,
  `date` varchar(16) NOT NULL,
  `activated` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `dragy`
--

CREATE TABLE `dragy` (
  `id` int(11) NOT NULL,
  `owner` int(11) NOT NULL DEFAULT -1,
  `veh_id` int(11) NOT NULL,
  `veh_srv` int(11) NOT NULL DEFAULT -1,
  `s100` float NOT NULL DEFAULT 0,
  `s200` float NOT NULL DEFAULT 0,
  `s300` float NOT NULL DEFAULT 0,
  `s400` float NOT NULL DEFAULT 0,
  `s100_200` float NOT NULL DEFAULT 0,
  `s200_300` float NOT NULL DEFAULT 0,
  `s300_400` float NOT NULL DEFAULT 0,
  `date` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `event_dacha_players`
--

CREATE TABLE `event_dacha_players` (
  `account_id` int(11) NOT NULL,
  `level` int(11) NOT NULL DEFAULT 0,
  `experience` int(11) NOT NULL DEFAULT 0,
  `created_at` int(11) NOT NULL DEFAULT 0,
  `updated_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `family`
--

CREATE TABLE `family` (
  `id` int(11) NOT NULL,
  `name` varchar(64) NOT NULL DEFAULT '',
  `u_id` int(11) NOT NULL DEFAULT 0,
  `time` int(11) NOT NULL DEFAULT 0,
  `color` int(11) NOT NULL DEFAULT -1,
  `level` int(11) NOT NULL DEFAULT 1,
  `score` int(11) NOT NULL DEFAULT 1,
  `exp` int(11) NOT NULL DEFAULT 0,
  `rank1` varchar(32) NOT NULL DEFAULT 'Новичок',
  `rank2` varchar(32) NOT NULL DEFAULT 'Участник',
  `rank3` varchar(32) NOT NULL DEFAULT 'Опытный',
  `rank4` varchar(32) NOT NULL DEFAULT 'Старший',
  `rank5` varchar(32) NOT NULL DEFAULT 'Проверенный',
  `rank6` varchar(32) NOT NULL DEFAULT 'Ветеран',
  `rank7` varchar(32) NOT NULL DEFAULT 'Заместитель',
  `rank8` varchar(32) NOT NULL DEFAULT 'Совладелец',
  `rank9` varchar(32) NOT NULL DEFAULT 'Заместитель лидера',
  `rank10` varchar(32) NOT NULL DEFAULT 'Лидер',
  `money` int(11) NOT NULL DEFAULT 0,
  `drugs` int(11) NOT NULL DEFAULT 0,
  `tree` int(11) NOT NULL DEFAULT 0,
  `metal` int(11) NOT NULL DEFAULT 0,
  `ammo` int(11) NOT NULL DEFAULT 0,
  `house_id` int(11) NOT NULL DEFAULT -1,
  `pos_x` float NOT NULL DEFAULT 0,
  `pos_y` float NOT NULL DEFAULT 0,
  `pos_z` float NOT NULL DEFAULT 0,
  `pos_fa` float NOT NULL DEFAULT 0,
  `inter` int(11) NOT NULL DEFAULT 0,
  `world` int(11) NOT NULL DEFAULT 0,
  `r_TakeMoney` int(11) NOT NULL DEFAULT 10,
  `r_TakeDrugs` int(11) NOT NULL DEFAULT 10,
  `r_TakeMetall` int(11) NOT NULL DEFAULT 10,
  `r_TakeAmmo` int(11) NOT NULL DEFAULT 10,
  `r_Inv` int(11) NOT NULL DEFAULT 9,
  `r_UnInv` int(11) NOT NULL DEFAULT 9,
  `r_Mute` int(11) NOT NULL DEFAULT 9,
  `r_UnMute` int(11) NOT NULL DEFAULT 9,
  `r_Warn` int(11) NOT NULL DEFAULT 9,
  `r_UnWarn` int(11) NOT NULL DEFAULT 9,
  `r_GiveRang` int(11) NOT NULL DEFAULT 10,
  `family_cars` int(11) NOT NULL DEFAULT 0,
  `ochki` int(11) NOT NULL DEFAULT 0,
  `ochki1` int(11) NOT NULL DEFAULT 0,
  `ochki2` int(11) NOT NULL DEFAULT 0,
  `ochki3` int(11) NOT NULL DEFAULT 0,
  `ochki4` int(11) NOT NULL DEFAULT 0,
  `owner` int(11) NOT NULL DEFAULT 0,
  `reputation` int(11) NOT NULL DEFAULT 0,
  `slot_veh` int(11) NOT NULL DEFAULT 5,
  `patron` int(11) NOT NULL DEFAULT 0,
  `material` int(11) NOT NULL DEFAULT 0,
  `heath_kit` int(11) NOT NULL DEFAULT 0,
  `armour` int(11) NOT NULL DEFAULT 0,
  `arnour_count` int(11) NOT NULL DEFAULT 0,
  `mask` int(11) NOT NULL DEFAULT 0,
  `level_storage` int(11) NOT NULL DEFAULT 1,
  `level_weapon` int(11) NOT NULL DEFAULT 1,
  `level_compound` int(11) NOT NULL DEFAULT 1,
  `house` int(11) NOT NULL DEFAULT -1,
  `rang_1` varchar(96) NOT NULL DEFAULT '1 ранг,0,0,0,0,0,0',
  `rang_2` varchar(96) NOT NULL DEFAULT '2 ранг,0,0,0,0,0,0',
  `rang_3` varchar(96) NOT NULL DEFAULT '3 ранг,0,0,0,0,0,0',
  `rang_4` varchar(96) NOT NULL DEFAULT '4 ранг,0,0,0,0,0,0',
  `rang_5` varchar(96) NOT NULL DEFAULT '5 ранг,1,1,1,1,1,1'
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `family`
--

INSERT INTO `family` (`id`, `name`, `u_id`, `time`, `color`, `level`, `score`, `exp`, `rank1`, `rank2`, `rank3`, `rank4`, `rank5`, `rank6`, `rank7`, `rank8`, `rank9`, `rank10`, `money`, `drugs`, `tree`, `metal`, `ammo`, `house_id`, `pos_x`, `pos_y`, `pos_z`, `pos_fa`, `inter`, `world`, `r_TakeMoney`, `r_TakeDrugs`, `r_TakeMetall`, `r_TakeAmmo`, `r_Inv`, `r_UnInv`, `r_Mute`, `r_UnMute`, `r_Warn`, `r_UnWarn`, `r_GiveRang`, `family_cars`, `ochki`, `ochki1`, `ochki2`, `ochki3`, `ochki4`, `owner`, `reputation`, `slot_veh`, `patron`, `material`, `heath_kit`, `armour`, `arnour_count`, `mask`, `level_storage`, `level_weapon`, `level_compound`, `house`, `rang_1`, `rang_2`, `rang_3`, `rang_4`, `rang_5`) VALUES
(2, 'РђРґРјРёРЅРёСЃС‚СЂР°С†РёСЏ РЎРµ', 0, 0, -1, 1, 1, 0, 'Новичок', 'Участник', 'Опытный', 'Старший', 'Проверенный', 'Ветеран', 'Заместитель', 'Совладелец', 'Заместитель лидера', 'Лидер', 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 0, 0, 0, 0, 0, 0, 7, 0, 7, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1'),
(3, 'Dota 2', 0, 0, -1, 1, 1, 0, 'Новичок', 'Участник', 'Опытный', 'Старший', 'Проверенный', 'Ветеран', 'Заместитель', 'Совладелец', 'Заместитель лидера', 'Лидер', 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 0, 0, 0, 0, 0, 0, 9, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1'),
(5, 'Р°С…Р°С…Р°С…', 5, 1786292315, 0, 1, 1, 0, 'Ранг 1', 'Ранг 2', 'Ранг 3', 'Ранг 4', 'Ранг 5', 'Ранг 6', 'Ранг 7', 'Ранг 8', 'Ранг 9', 'Лидер', 0, 0, 0, 0, 0, -1, -2430.39, 200.912, 26.135, 114.107, 0, 0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1'),
(10, 'Котакбасик ', 0, 0, 15, 1, 1, 0, 'Новичок', 'Участник', 'Опытный', 'Старший', 'Проверенный', 'Ветеран', 'Заместитель', 'Совладелец', 'Заместитель лидера', 'Лидер', 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 0, 0, 0, 0, 0, 0, 5, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1'),
(12, 'Hosts Dynasty', 0, 0, -1, 1, 1, 0, 'Новичок', 'Участник', 'Опытный', 'Старший', 'Проверенный', 'Ветеран', 'Заместитель', 'Совладелец', 'Заместитель лидера', 'Лидер', 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 0, 0, 0, 0, 0, 0, 6, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1'),
(13, 'DARK_ANGEL', 0, 0, -1, 1, 1, 0, 'Новичок', 'Участник', 'Опытный', 'Старший', 'Проверенный', 'Ветеран', 'Заместитель', 'Совладелец', 'Заместитель лидера', 'Лидер', 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 0, 0, 0, 0, 0, 0, 15, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1'),
(15, 'Сосиски', 0, 0, -1, 1, 1, 0, 'Новичок', 'Участник', 'Опытный', 'Старший', 'Проверенный', 'Ветеран', 'Заместитель', 'Совладелец', 'Заместитель лидера', 'Лидер', 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 9, 9, 9, 9, 9, 9, 10, 0, 0, 0, 0, 0, 0, 12, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 1, -1, '1 ранг,0,0,0,0,0,0', '2 ранг,0,0,0,0,0,0', '3 ранг,0,0,0,0,0,0', '4 ранг,0,0,0,0,0,0', '5 ранг,1,1,1,1,1,1');

-- --------------------------------------------------------

--
-- Структура таблицы `familyblack`
--

CREATE TABLE `familyblack` (
  `family_id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `reason` varchar(64) NOT NULL DEFAULT '',
  `created_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `familynew`
--

CREATE TABLE `familynew` (
  `id` int(11) NOT NULL,
  `owner` int(11) NOT NULL DEFAULT 0,
  `name` varchar(32) NOT NULL DEFAULT '',
  `color` int(11) NOT NULL DEFAULT 0,
  `chatcolor` int(11) NOT NULL DEFAULT 0,
  `slot_veh` int(11) NOT NULL DEFAULT 0,
  `reputation` int(11) NOT NULL DEFAULT 0,
  `zaxvati` int(11) NOT NULL DEFAULT 0,
  `moneti` int(11) NOT NULL DEFAULT 0,
  `syndicate` int(11) NOT NULL DEFAULT 0,
  `patron` int(11) NOT NULL DEFAULT 0,
  `material` int(11) NOT NULL DEFAULT 0,
  `heath_kit` int(11) NOT NULL DEFAULT 0,
  `armour` int(11) NOT NULL DEFAULT 0,
  `money` int(11) NOT NULL DEFAULT 0,
  `mask` int(11) NOT NULL DEFAULT 0,
  `level_storage` int(11) NOT NULL DEFAULT 1,
  `level_weapon` int(11) NOT NULL DEFAULT 1,
  `level_compound` int(11) NOT NULL DEFAULT 1,
  `house` int(11) NOT NULL DEFAULT -1,
  `notif` mediumtext NOT NULL,
  `notif_seq` int(11) NOT NULL DEFAULT 0,
  `rang_1` varchar(64) NOT NULL DEFAULT '1 ранг,0,0,0,0,0',
  `rang_2` varchar(64) NOT NULL DEFAULT '2 ранг,0,0,0,0,0',
  `rang_3` varchar(64) NOT NULL DEFAULT '3 ранг,0,0,0,0,0',
  `rang_4` varchar(64) NOT NULL DEFAULT '4 ранг,0,0,0,0,0',
  `rang_5` varchar(64) NOT NULL DEFAULT '5 ранг,1,1,1,1,1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `familysystem`
--

CREATE TABLE `familysystem` (
  `id` int(11) NOT NULL,
  `family_id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `ownable_car_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `access_rank` int(11) NOT NULL DEFAULT 1,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `family_ad`
--

CREATE TABLE `family_ad` (
  `id` int(11) NOT NULL,
  `family` int(11) NOT NULL DEFAULT 0,
  `ad_text` varchar(192) NOT NULL DEFAULT '',
  `create_id` int(11) NOT NULL DEFAULT 0,
  `create_name` varchar(24) NOT NULL DEFAULT '',
  `time` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `family_ad`
--

INSERT INTO `family_ad` (`id`, `family`, `ad_text`, `create_id`, `create_name`, `time`) VALUES
(1, 2, 'Ваша семья заняла первое место в прошлом сезоне', -1, 'Система', 1786579238),
(2, 3, 'Ваша семья заняла второе место в прошлом сезоне', -1, 'Система', 1786579238),
(3, 5, 'Ваша семья заняла третье место в прошлом сезоне', -1, 'Система', 1786579238);

-- --------------------------------------------------------

--
-- Структура таблицы `family_cars`
--

CREATE TABLE `family_cars` (
  `id` int(11) NOT NULL,
  `family_owner` int(11) NOT NULL,
  `model_id` int(11) NOT NULL DEFAULT 0,
  `color_1` int(11) NOT NULL DEFAULT 0,
  `color_2` int(11) NOT NULL DEFAULT 0,
  `pos_x` float NOT NULL DEFAULT 0,
  `pos_y` float NOT NULL DEFAULT 0,
  `pos_z` float NOT NULL DEFAULT 0,
  `angle` float NOT NULL DEFAULT 0,
  `create_time` int(11) NOT NULL DEFAULT 0,
  `number` varchar(32) NOT NULL DEFAULT '',
  `rang` int(11) NOT NULL DEFAULT 5,
  `plate_type` int(11) NOT NULL DEFAULT 1,
  `plate_number` varchar(16) NOT NULL DEFAULT '',
  `plate_region` varchar(8) NOT NULL DEFAULT '',
  `vynil_name` varchar(32) NOT NULL DEFAULT '',
  `f_state` int(11) NOT NULL DEFAULT 0,
  `nitro_level` int(11) NOT NULL DEFAULT 0,
  `launch` int(11) NOT NULL DEFAULT 0,
  `pdvradar` int(11) NOT NULL DEFAULT 0,
  `lights_color` int(11) NOT NULL DEFAULT 0,
  `underlights_color` int(11) NOT NULL DEFAULT 0,
  `underlights_color_lf` int(11) NOT NULL DEFAULT 0,
  `underlights_color_rt` int(11) NOT NULL DEFAULT 0,
  `is_FarLight_active` int(11) NOT NULL DEFAULT 0,
  `pnevmo_selected` int(11) NOT NULL DEFAULT 0,
  `percentofclirness` int(11) NOT NULL DEFAULT 0,
  `percentofclirnessZ` int(11) NOT NULL DEFAULT 0,
  `is_hydro_active` int(11) NOT NULL DEFAULT 0,
  `pos_last_x` float NOT NULL DEFAULT 0,
  `pos_last_y` float NOT NULL DEFAULT 0,
  `pos_last_z` float NOT NULL DEFAULT 0,
  `angle_last` float NOT NULL DEFAULT 0,
  `region` varchar(8) NOT NULL DEFAULT '',
  `number_type` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `family_cars`
--

INSERT INTO `family_cars` (`id`, `family_owner`, `model_id`, `color_1`, `color_2`, `pos_x`, `pos_y`, `pos_z`, `angle`, `create_time`, `number`, `rang`, `plate_type`, `plate_number`, `plate_region`, `vynil_name`, `f_state`, `nitro_level`, `launch`, `pdvradar`, `lights_color`, `underlights_color`, `underlights_color_lf`, `underlights_color_rt`, `is_FarLight_active`, `pnevmo_selected`, `percentofclirness`, `percentofclirnessZ`, `is_hydro_active`, `pos_last_x`, `pos_last_y`, `pos_last_z`, `angle_last`, `region`, `number_type`) VALUES
(9230, 3, 2572, 0, 0, 797.996, 522.1, 12.081, 335.517, 1786148920, '------', 5, 1, '', '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 1),
(9235, 12, 28672, 0, 0, 1996.55, 1790.14, 14.9, 181.708, 1786494225, '------', 5, 1, '', '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `family_log`
--

CREATE TABLE `family_log` (
  `id` int(11) NOT NULL,
  `family` int(11) NOT NULL,
  `player` int(11) NOT NULL DEFAULT 0,
  `to_player` int(11) NOT NULL DEFAULT 0,
  `text` text NOT NULL,
  `time` int(11) NOT NULL DEFAULT 0,
  `type` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `family_log`
--

INSERT INTO `family_log` (`id`, `family`, `player`, `to_player`, `text`, `time`, `type`) VALUES
(36240, 12, 6, -1, '5 ранг Pepel_Ghost[0] загрузил автомобиль Mercedes-Benz G 63 AMG Brabus.', 1786505030, 9);

-- --------------------------------------------------------

--
-- Структура таблицы `family_storage_items`
--

CREATE TABLE `family_storage_items` (
  `family_id` int(11) NOT NULL,
  `slot` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL DEFAULT 1,
  `value` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `fuel_stations`
--

CREATE TABLE `fuel_stations` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL DEFAULT 'None',
  `improvements` int(11) NOT NULL,
  `fuels` int(11) NOT NULL,
  `fuel_price` int(11) NOT NULL,
  `buy_fuel_price` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `eviction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `fuel_stations`
--

INSERT INTO `fuel_stations` (`id`, `owner_id`, `name`, `improvements`, `fuels`, `fuel_price`, `buy_fuel_price`, `balance`, `rent_time`, `price`, `rent_price`, `lock`, `x`, `y`, `z`, `eviction`) VALUES
(11, 0, 'Заправочная станция', 0, 1000, 3, 0, 0, 0, 90000000, 9000, 0, 2877.87, 541.919, 26.3542, 0),
(10, 0, 'Заправочная станция', 0, 10000, 3, 0, 0, 0, 90000000, 9000, 0, 2674.46, 2616.66, 16.9724, 0),
(9, 0, 'Заправочная станция', 4, 1000, 3, 0, 0, 0, 100000000, 10000, 0, 2245.21, -1784.98, 21.7109, 0),
(8, 0, 'Заправочная станция', 0, 10000, 3, 0, 0, 0, 90000000, 9000, 0, 2368.07, -766.732, 14.0431, 0),
(7, 0, 'Заправочная станция', 4, 1000, 3, 0, 0, 0, 90000000, 9000, 0, -890.503, 1486.84, 27.4242, 0),
(14, 0, 'None', 4, 1000, 3, 0, 0, 0, 1000000, 10000, 0, -537.518, 1315.61, 20.7424, 0),
(15, 0, 'None', 4, 1000, 3, 0, 0, 0, 20012300, 400123, 0, 1600.41, 2898.01, 12.0431, 0),
(17, 0, 'None', 4, 10000, 10, 0, 0, 0, 1000000, 5000, 0, 2276.39, -739.561, 13.4187, 0),
(20, 0, 'None', 0, 1000, 3, 0, 0, 0, 12000123, 5000, 0, 2776.67, 751.794, 31.0258, 0),
(18, 0, 'None', 0, 1000, 3, 0, 0, 0, 12000123, 10004, 0, -2539.23, -695.798, 29.6205, 0),
(19, 0, 'None', 0, 1000, 3, 0, 0, 0, 12000123, 5001, 0, 1016.17, -779.029, 41.165, 0),
(21, 0, 'None', 0, 1000, 3, 0, 0, 0, 1000000, 5000, 0, 2641.88, 2587, 16.432, 0),
(22, 0, 'None', 1, 1000, 3, 0, 0, 0, 1000000, 5000, 0, -2069.7, 2464.53, 57.665, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `fuel_stations_profit`
--

CREATE TABLE `fuel_stations_profit` (
  `id` int(11) NOT NULL,
  `fid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL,
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `fuel_stations_profit`
--

INSERT INTO `fuel_stations_profit` (`id`, `fid`, `uid`, `uip`, `time`, `money`, `view`) VALUES
(3220, 17, 6, '216.227.144.162', 1786308910, 45, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `full_dostup`
--

CREATE TABLE `full_dostup` (
  `id` int(11) NOT NULL,
  `name` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `gang_repositories`
--

CREATE TABLE `gang_repositories` (
  `id` int(11) NOT NULL,
  `metall` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `lock` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `gang_repositories`
--

INSERT INTO `gang_repositories` (`id`, `metall`, `ammo`, `drugs`, `money`, `lock`) VALUES
(1, 2000, 10000, 500, 20000, 1),
(2, 2000, 10000, 500, 20000, 1),
(3, 2000, 10000, 500, 20000, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `gang_zones`
--

CREATE TABLE `gang_zones` (
  `id` int(11) NOT NULL,
  `min_x` float NOT NULL,
  `min_y` float NOT NULL,
  `max_x` float NOT NULL,
  `max_y` float NOT NULL,
  `fraction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `gang_zones`
--

INSERT INTO `gang_zones` (`id`, `min_x`, `min_y`, `max_x`, `max_y`, `fraction`) VALUES
(1, -2667, 149, -2567, 249, 3),
(2, -2567, 149, -2467, 249, 3),
(3, -2467, 149, -2367, 249, 3),
(4, -2367, 149, -2267, 249, 3),
(5, -2267, 149, -2167, 249, 3),
(6, -2167, 149, -2067, 249, 3),
(7, -2167, 49, -2067, 149, 3),
(8, -2267, 49, -2167, 149, 3),
(9, -2367, 49, -2267, 149, 3),
(10, -2467, 49, -2367, 149, 3),
(11, -2567, 49, -2467, 149, 3),
(12, -2667, 49, -2567, 149, 3),
(13, -2667, -51, -2567, 49, 3),
(14, -2567, -51, -2467, 49, 3),
(15, -2467, -51, -2367, 49, 3),
(16, -2367, -51, -2267, 49, 3),
(17, -2267, -51, -2167, 49, 3),
(18, -2167, -51, -2067, 49, 3),
(19, -2167, -151, -2067, -51, 3),
(20, -2267, -151, -2167, -51, 3),
(21, -2367, -151, -2267, -51, 3),
(22, -2467, -151, -2367, -51, 3),
(23, -2567, -151, -2467, -51, 3),
(24, -2667, -151, -2567, -51, 3),
(25, -2667, -251, -2567, -151, 3),
(26, -2567, -251, -2467, -151, 3),
(27, -2467, -251, -2367, -151, 3),
(28, -2367, -251, -2267, -151, 3),
(29, -2267, -251, -2167, -151, 3),
(30, -2167, -251, -2067, -151, 1),
(31, 1974, 2007, 2074, 2107, 1),
(32, 1874, 2007, 1974, 2107, 1),
(33, 1774, 2007, 1874, 2107, 1),
(34, 1674, 2007, 1774, 2107, 3),
(35, 1574, 2007, 1674, 2107, 3),
(36, 1574, 2107, 1674, 2207, 3),
(37, 1674, 2107, 1774, 2207, 2),
(38, 1774, 2107, 1874, 2207, 2),
(39, 1874, 2107, 1974, 2207, 1),
(40, 1974, 2107, 2074, 2207, 3),
(41, 1974, 2207, 2074, 2307, 3),
(42, 1874, 2207, 1974, 2307, 1),
(43, 1774, 2207, 1874, 2307, 1),
(44, 1674, 2207, 1774, 2307, 1),
(45, 1574, 2207, 1674, 2307, 1),
(46, 1574, 2307, 1674, 2407, 1),
(47, 1674, 2307, 1774, 2407, 1),
(48, 1774, 2307, 1874, 2407, 1),
(49, 1874, 2307, 1974, 2407, 1),
(50, 1974, 2307, 2074, 2407, 1),
(51, 1974, 2407, 2074, 2507, 1),
(52, 1874, 2407, 1974, 2507, 1),
(53, 1774, 2407, 1874, 2507, 1),
(54, 1674, 2407, 1774, 2507, 1),
(55, 1574, 2407, 1674, 2507, 1),
(56, 1574, 2507, 1674, 2607, 1),
(57, 1674, 2507, 1774, 2607, 1),
(58, 1774, 2507, 1874, 2607, 3),
(59, 1874, 2507, 1974, 2607, 3),
(60, 1974, 2507, 2074, 2607, 2),
(61, 1751, -311, 1851, -211, 2),
(62, 1751, -411, 1851, -311, 3),
(63, 1651, -411, 1751, -311, 3),
(64, 1651, -311, 1751, -211, 1),
(65, 1551, -311, 1651, -211, 2),
(66, 1551, -411, 1651, -311, 2),
(67, 1451, -411, 1551, -311, 2),
(68, 1451, -311, 1551, -211, 2),
(69, 981, -265, 1081, -165, 2),
(70, 981, -365, 1081, -265, 2),
(71, 981, -465, 1081, -365, 3),
(72, 881, -465, 981, -365, 1),
(73, 881, -365, 981, -265, 1),
(74, 881, -265, 981, -165, 1),
(75, 781, -265, 881, -165, 1),
(76, 781, -365, 881, -265, 3),
(77, 781, -465, 881, -365, 1),
(78, 681, -465, 781, -365, 1),
(79, 681, -365, 781, -265, 3),
(80, 681, -265, 781, -165, 0),
(81, 581, -265, 681, -165, 3),
(82, 581, -365, 681, -265, 3),
(83, 581, -465, 681, -365, 3),
(84, 481, -465, 581, -365, 3),
(85, 481, -365, 581, -265, 3),
(86, 481, -265, 581, -165, 2),
(87, 381, -265, 481, -165, 3),
(88, 381, -365, 481, -265, 0),
(89, 381, -465, 481, -365, 3),
(90, 281, -365, 381, -265, 2),
(91, 2401, -330, 2501, -230, 2),
(92, 2501, -330, 2601, -230, 2),
(93, 2501, -230, 2601, -130, 2),
(94, 2501, -130, 2601, -30, 2),
(95, 2401, -230, 2501, -130, 2),
(96, 2401, -130, 2501, -30, 2),
(97, 2301, -230, 2401, -130, 2),
(98, 2601, -330, 2701, -230, 2),
(99, 2601, -230, 2701, -130, 1),
(100, 2201, -230, 2301, -130, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `garages`
--

CREATE TABLE `garages` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL DEFAULT 0,
  `price` int(11) NOT NULL DEFAULT 500000,
  `lock` int(11) NOT NULL DEFAULT 0,
  `x` float NOT NULL DEFAULT 0,
  `y` float NOT NULL DEFAULT 0,
  `z` float NOT NULL DEFAULT 0,
  `exit_x` float NOT NULL DEFAULT 0,
  `exit_y` float NOT NULL DEFAULT 0,
  `exit_z` float NOT NULL DEFAULT 0,
  `exit_angle` float NOT NULL DEFAULT 0,
  `improvements` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `garages`
--

INSERT INTO `garages` (`id`, `owner_id`, `price`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `improvements`) VALUES
(1, 0, 500000, 0, 353.404, 800.074, 12, 350.682, 800.797, 12, 69.381, 1),
(2, 0, 500000, 0, 354.905, 804.006, 12, 352.324, 804.991, 12, 66.7752, 1),
(3, 0, 500000, 0, 356.451, 808.065, 12.0073, 353.898, 808.92, 12.0073, 66.5632, 2),
(4, 0, 500000, 0, 357.905, 811.891, 12.0073, 355.276, 813.422, 12.0073, 67.9254, 1),
(5, 0, 500000, 0, 359.422, 815.865, 12, 356.466, 816.753, 12.0073, 65.2152, 1),
(6, 0, 500000, 0, 360.909, 819.765, 12, 358.047, 820.573, 12, 72.5789, 2),
(7, 0, 500000, 0, 362.431, 823.763, 12, 360.489, 824.517, 12, 64.0241, 2),
(8, 0, 500000, 0, 363.94, 827.73, 12, 361.112, 828.732, 12, 71.2634, 2),
(9, 16, 500000, 0, 365.421, 831.631, 12.0085, 362.63, 832.608, 12, 70.8588, 2),
(12, 0, 30000000, 0, -703.681, -1530.65, 41.372, -703.681, -1530.65, 41.372, 216.762, 1),
(11, 0, 30000000, 0, 342.906, 984.23, 12.04, 342.906, 984.23, 12.04, 279.426, 1),
(13, 0, 30000000, 0, -705.938, -1534.42, 41.372, -705.938, -1534.42, 41.372, 167.006, 1),
(14, 0, 30000000, 0, -707.984, -1537.85, 41.372, -707.984, -1537.85, 41.372, 207.804, 1),
(15, 0, 30000000, 0, -710.284, -1541.7, 41.372, -710.284, -1541.7, 41.372, 236.145, 1),
(16, 0, 30000000, 0, -712.571, -1545.53, 41.374, -712.571, -1545.53, 41.374, 194.228, 1),
(17, 0, 30000000, 0, -714.586, -1548.9, 41.374, -714.586, -1548.9, 41.374, 207.066, 1),
(18, 0, 30000000, 0, -716.76, -1552.54, 41.375, -716.76, -1552.54, 41.375, 186.509, 1),
(19, 0, 30000000, 0, -719.08, -1556.42, 41.374, -719.08, -1556.42, 41.374, 226.024, 1),
(20, 0, 30000000, 0, -721.041, -1559.68, 41.372, -721.041, -1559.68, 41.372, 199.665, 2),
(21, 0, 30000000, 0, -733.576, -1552.81, 41.365, -733.576, -1552.81, 41.365, 58.386, 1),
(22, 0, 30000000, 0, -731.273, -1548.96, 41.363, -731.273, -1548.96, 41.363, 14.418, 1),
(23, 0, 30000000, 0, -729.052, -1545.25, 41.362, -729.052, -1545.25, 41.362, 7.602, 1),
(24, 0, 30000000, 0, -726.92, -1541.67, 41.363, -726.92, -1541.67, 41.363, 1.61, 1),
(25, 0, 30000000, 0, -724.709, -1537.98, 41.363, -724.709, -1537.98, 41.363, 98.882, 1),
(26, 0, 30000000, 0, -722.534, -1534.33, 41.365, -722.534, -1534.33, 41.365, 12.301, 1),
(27, 0, 30000000, 0, -720.254, -1530.51, 41.365, -720.254, -1530.51, 41.365, 354.424, 1),
(28, 0, 30000000, 0, -718.257, -1527.17, 41.365, -718.257, -1527.17, 41.365, 0.61, 1),
(29, 0, 30000000, 0, -716.13, -1523.61, 41.365, -716.13, -1523.61, 41.365, 29.471, 1),
(30, 0, 30000000, 0, -2585.19, -224.4, 26.695, -2585.19, -224.4, 26.695, 226.525, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `garbage_job`
--

CREATE TABLE `garbage_job` (
  `name` varchar(24) NOT NULL,
  `exp` int(11) DEFAULT 0,
  `rank` int(11) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `garbage_job`
--

INSERT INTO `garbage_job` (`name`, `exp`, `rank`) VALUES
('Angelina_Browns', 0, 1),
('Dev_RTF', 0, 1),
('Max_LoveOlesya', 0, 1),
('Mr_Beast', 0, 1),
('Olesya_Ekstazzy', 0, 1),
('Olesya_Ekztazzy', 0, 1),
('Olesya_Exstazzy', 0, 1),
('Pepel_Ghost', 0, 1),
('Ray_Amigo', 0, 1),
('Shadow_Fiend', 0, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `gift`
--

CREATE TABLE `gift` (
  `id` int(16) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `gift`
--

INSERT INTO `gift` (`id`, `x`, `y`, `z`) VALUES
(7, -2480.86, 2827.01, 37.636),
(8, -2484.53, 2823.11, 37.636),
(9, -2491.47, 2824.58, 37.636),
(10, 2285.66, 2644.08, 20.231),
(11, -794.595, -458.9, 741.103),
(12, 724.995, 1443.39, 12.004),
(13, 1789.07, 2147.58, 16.072),
(14, 1789.55, 2090.84, 15.854),
(15, 615.115, 1723.72, 12.071),
(16, 548.536, 1685.86, 12.285),
(17, 1816.03, 2516.47, 15.664),
(18, 203.522, 1693.14, 12.003),
(19, -116.845, 933.761, 12.002),
(20, -410.271, 929.259, 12.118),
(21, 186.086, 819.896, 12.002),
(22, -899.961, 847.547, 12.671),
(23, 1334.67, 2369.56, 17.664),
(24, 1904.88, 2287.96, 15.711),
(25, 1920.47, 1721.52, 15.993),
(26, 1829.78, 1709.1, 16.253),
(27, 1797.74, 1610.69, 16.104),
(28, 1645.52, 1768.98, 16.01),
(29, 1624.2, 1703.22, 16.217),
(30, 1586.36, 1631.21, 16.003),
(31, 1513.19, 1660.9, 16.078),
(32, 1467.76, 1718.65, 17.253),
(33, 1530.12, 1802.63, 16.26),
(34, 1507.59, -2469.83, 45.975),
(35, 1725.69, -2419.32, 11),
(36, 1897.76, -2352.61, 11.213),
(37, 1911.71, -2239.65, 11.19),
(38, 1881.05, -2205.22, 11.25),
(39, 2512.17, -1926.74, 22.328),
(40, 1695.09, -2331.96, 11.008),
(41, 623.586, -1263.35, 40.734),
(42, -624.236, -1697.69, 39.997),
(43, -560.273, -1634.82, 40.916),
(44, -2177.25, -178.017, 25.891),
(45, -2445.9, 119.47, 18.39),
(46, -2572.52, -131.687, 13.931),
(47, -1810.74, 1539.52, 35.279),
(48, -339.556, 1493.82, 20.747),
(49, -284.951, 1455.17, 20.747),
(50, -245.685, 1392.52, 20.747),
(51, 165.758, 1613.34, 12.003),
(52, 770.015, 775.16, 12.085),
(53, 568.766, 385.019, 12.106),
(54, 691.163, 869.931, 12),
(55, -123.093, 617.269, 12.012),
(56, -180.595, 944.447, 12.002),
(57, 1969.79, 2428.41, 15.974),
(58, 1940.82, 2435.37, 16.619),
(59, 1924.09, 2427.08, 16.022),
(60, 1965.04, 2131.56, 15.943),
(61, 1938.2, 2029.33, 15.871),
(62, 2308.35, 1761.66, 0.895),
(63, -169.861, 847.918, 15.489);

-- --------------------------------------------------------

--
-- Структура таблицы `gift_lose`
--

CREATE TABLE `gift_lose` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `gift_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `greenzone`
--

CREATE TABLE `greenzone` (
  `id` int(11) NOT NULL,
  `name` varchar(32) NOT NULL DEFAULT '',
  `x` float NOT NULL DEFAULT 0,
  `y` float NOT NULL DEFAULT 0,
  `z` float NOT NULL DEFAULT 0,
  `radius` float NOT NULL DEFAULT 0,
  `allow_park` tinyint(1) NOT NULL DEFAULT 0,
  `no_weapon` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `hotels`
--

CREATE TABLE `hotels` (
  `id` int(11) NOT NULL,
  `hotel_id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `hotels`
--

INSERT INTO `hotels` (`id`, `hotel_id`, `owner_id`, `rent_time`, `status`) VALUES
(1, 0, 0, 0, 0),
(2, 0, 0, 0, 1),
(3, 0, 0, 0, 1),
(4, 0, 0, 0, 1),
(5, 0, 0, 0, 1),
(6, 0, 0, 0, 1),
(7, 0, 0, 0, 1),
(8, 0, 0, 0, 0),
(9, 0, 0, 0, 0),
(10, 0, 0, 0, 0),
(11, 0, 0, 0, 0),
(12, 0, 0, 0, 0),
(13, 0, 0, 0, 0),
(14, 0, 0, 0, 0),
(15, 0, 0, 0, 0),
(16, 0, 0, 0, 0),
(17, 0, 0, 0, 0),
(18, 0, 0, 0, 0),
(19, 0, 0, 0, 0),
(20, 0, 0, 0, 0),
(21, 0, 0, 0, 0),
(22, 0, 0, 0, 0),
(23, 0, 0, 0, 0),
(24, 0, 0, 0, 0),
(25, 0, 0, 0, 0),
(26, 0, 0, 0, 0),
(27, 0, 0, 0, 0),
(28, 0, 0, 0, 0),
(29, 0, 0, 0, 0),
(30, 0, 0, 0, 0),
(31, 0, 0, 0, 0),
(32, 0, 0, 0, 0),
(33, 0, 0, 0, 0),
(34, 0, 0, 0, 0),
(35, 0, 0, 0, 0),
(36, 0, 0, 0, 0),
(37, 0, 0, 0, 0),
(38, 0, 0, 0, 0),
(39, 0, 0, 0, 0),
(40, 0, 0, 0, 0),
(41, 0, 0, 0, 0),
(42, 0, 0, 0, 0),
(43, 0, 0, 0, 0),
(44, 0, 0, 0, 0),
(45, 0, 0, 0, 0),
(46, 0, 0, 0, 0),
(47, 0, 0, 0, 0),
(48, 0, 0, 0, 0),
(49, 0, 0, 0, 0),
(50, 0, 0, 0, 0),
(51, 0, 0, 0, 0),
(52, 0, 0, 0, 0),
(53, 0, 0, 0, 0),
(54, 0, 0, 0, 0),
(55, 0, 0, 0, 0),
(56, 0, 0, 0, 0),
(57, 0, 0, 0, 0),
(58, 0, 0, 0, 0),
(59, 0, 0, 0, 0),
(60, 0, 0, 0, 0),
(61, 0, 0, 0, 0),
(62, 0, 0, 0, 0),
(63, 0, 0, 0, 0),
(64, 0, 0, 0, 0),
(65, 0, 0, 0, 0),
(66, 0, 0, 0, 0),
(67, 0, 0, 0, 0),
(68, 0, 0, 0, 0),
(69, 0, 0, 0, 0),
(70, 0, 0, 0, 0),
(71, 0, 0, 0, 0),
(72, 0, 0, 0, 0),
(73, 0, 0, 0, 0),
(74, 0, 0, 0, 0),
(75, 0, 0, 0, 0),
(76, 0, 0, 0, 0),
(77, 0, 0, 0, 0),
(78, 0, 0, 0, 0),
(79, 0, 0, 0, 0),
(80, 0, 0, 0, 0),
(81, 0, 0, 0, 0),
(82, 0, 0, 0, 0),
(83, 0, 0, 0, 0),
(84, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `houses`
--

CREATE TABLE `houses` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `improvements` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `entrance` int(11) NOT NULL DEFAULT -1,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL,
  `car_x` float NOT NULL,
  `car_y` float NOT NULL,
  `car_z` float NOT NULL,
  `car_angle` float NOT NULL,
  `store_x` float NOT NULL,
  `store_y` float NOT NULL,
  `store_z` float NOT NULL,
  `eviction` int(11) NOT NULL,
  `store_metall` int(11) NOT NULL,
  `store_drugs` int(11) NOT NULL,
  `store_weapon` int(11) NOT NULL,
  `store_ammo` int(11) NOT NULL,
  `store_skin` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `houses`
--

INSERT INTO `houses` (`id`, `owner_id`, `name`, `improvements`, `rent_time`, `price`, `rent_price`, `type`, `entrance`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `car_x`, `car_y`, `car_z`, `car_angle`, `store_x`, `store_y`, `store_z`, `eviction`, `store_metall`, `store_drugs`, `store_weapon`, `store_ammo`, `store_skin`) VALUES
(1, 0, '', 0, 0, 30000000, 0, 6, -1, 0, -681.871, 909.614, 13.0814, -681.696, 906.357, 12.5611, 179.864, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(2, 0, '', 0, 0, 300000, 0, 6, -1, 0, -722.573, 910.056, 13.1247, -722.972, 904.671, 12.5611, 174.177, -715.849, 904.788, 11.7424, 358.786, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(3, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 1838.18, 1338.24, 9.75565, -744.82, 718.793, 11.8373, 357.014, 1833.38, 1326.51, 9.8282, 93.9606, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(4, 0, '', 6, 0, 5000000, 0, 0, -1, 0, 1813.15, 1333.2, 9.75565, 1812.91, 1330.75, 9.75565, 177.179, 1815.05, 1325.43, 9.91828, 91.4933, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(5, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 1800.64, 1337.81, 9.75565, 1801.27, 1335.48, 9.75565, 177.657, 1794.94, 1326.15, 9.85514, 89.8407, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(6, 0, '', 0, 0, 1000000, 0, 0, -1, 0, 1784.26, 1338.18, 9.75565, 1784.04, 1336.19, 9.75565, 183.924, 1788.21, 1338.37, 9.75565, 179.98, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(7, 0, '', 6, 0, 3000000, 0, 0, -1, 0, 1764.04, 1334.3, 9.75565, 1766.16, 1334.11, 9.75565, 273.538, 1766.49, 1327.62, 9.75565, 92.4101, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(8, 0, '', 0, 0, 7000000, 0, 0, -1, 0, 1865.3, 1358.19, 9.75565, 1865.51, 1360.67, 9.75565, 0.457568, 1870.99, 1366.57, 9.78858, 179.831, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(9, 0, '', 0, 0, 3000000, 0, 0, -1, 0, 1865.87, 1337.14, 9.75565, 1865.92, 1339.07, 9.75565, 0.052339, 1872.02, 1341.17, 9.84551, 178.492, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(10, 0, '', 0, 0, 3000000, 0, 0, -1, 0, 1859.47, 1404.84, 9.75565, 1859.56, 1402.23, 9.75565, 180, 1872.23, 1401.38, 9.85196, 187.806, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(11, 0, '', 0, 0, 3000000, 0, 0, -1, 0, 1865.04, 1419.27, 10.2281, 1865.63, 1421.57, 9.75565, 354.897, 1871.51, 1426.82, 9.81496, 184.006, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(12, 0, '', 0, 0, 3000000, 0, 0, -1, 0, 1866.21, 1439.86, 9.75565, 1866.24, 1441.66, 9.75565, 357.529, 1870.95, 1444, 9.78611, 186.615, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(13, 0, '', 6, 0, 5000000, 0, 0, -1, 0, 2038.9, 1339.88, 26.1435, -998.152, 746.812, 12.1348, 71.7873, -998.152, 746.812, 12.1348, 71.7873, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(14, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 2060.48, 1339.87, 26.1435, 2060.04, 1338.31, 26.1431, 181.308, 2060.11, 1326.08, 26.2445, 91.3083, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(15, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 2204.58, -231.381, 2.06699, 2206.82, -228.955, 2.25525, 277.201, 2211.3, -234.127, 1.87778, 5.1858, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(16, 0, '', 1, 0, 5000000, 0, 0, -1, 0, 2240.53, -197.184, 2.38868, 2242.59, -197.361, 2.29445, 271.396, 2238.01, -206.463, 2.1434, 176.373, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(17, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 2261.31, -230.6, 2.07146, 2261.11, -228.177, 2.1372, 1.26067, 2255.77, -231.819, 2.05207, 3.01565, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(18, 0, '', 2, 0, 5000000, 0, 0, -1, 0, 2329.97, -205.21, 2.4335, 2316.32, -207.188, 2.16208, 182.683, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(19, 0, '', 6, 0, 5000000, 0, 0, -1, 0, 2381.84, -202.405, 2.7631, 2381.45, -204.764, 2.13854, 180.509, 2377.47, -204.53, 2.13854, 180.423, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(20, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 2422.07, -206.157, 2.35224, 2424.88, -207.299, 2.13854, 176.225, 2423.47, -212.532, 2.14481, 83.7904, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(21, 0, '', 0, 0, 5000000, 0, 0, -1, 0, 2414.87, -230.591, 2.06488, 2414.84, -228.595, 2.0888, 358.774, 2410.25, -231.852, 2.05712, 1.34348, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(22, 0, '', 6, 0, 5000000, 0, 0, -1, 0, 2466.45, -201.208, 2.14461, 2465.12, -202.897, 2.14461, 92.2998, 2460.18, -200.027, 2.14461, 182.3, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(23, 0, '', 6, 0, 5000000, 0, 0, -1, 0, 2487.49, -252.622, 1.84195, 2489.96, -252.104, 1.87508, 357.379, 2485.33, -244.838, 2.34694, 14.6319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(24, 0, '', 6, 0, 5000000, 0, 0, -1, 0, 2513.72, -230.512, 2.56648, 2513.41, -228.206, 2.56648, 88.8398, 2507.64, -232.153, 2.45217, 1.48161, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(25, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -785.534, 915.499, 13.0786, -785.899, 913.447, 13.0786, 180.362, -780.734, 902.264, 12.5538, 178.732, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(26, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -829.38, 909.598, 13.0814, -829.351, 907.061, 12.5611, 181.278, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(27, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -870.147, 910.056, 13.1247, -869.911, 907.648, 13.131, 182.031, -861.567, 905.655, 12.5611, 179.966, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(28, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -933.41, 915.487, 13.0786, -933.384, 913.293, 13.0786, 177.809, -926.255, 901.563, 12.5538, 184.076, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(29, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -975.353, 909.615, 13.0814, -975.096, 907.13, 12.5611, 180.731, -963.752, 902.586, 12.5538, 179.792, -15.3143, 1506.02, 1381, 0, 0, 0, 0, 0, 0),
(30, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -968.533, 851.711, 13.0786, -971.872, 851.895, 12.5538, 88.2741, -983.279, 844.578, 12.5538, 91.1568, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(31, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -973.983, 790.814, 13.1247, -977.415, 790.899, 12.6794, 87.2088, -976.715, 781.68, 12.5611, 88.7756, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(32, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -974.458, 753.127, 13.0814, -976.956, 753.312, 12.5611, 90.4049, -982.507, 741.463, 12.5538, 88.7128, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(33, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -848.743, 753.141, 13.0814, -851.451, 752.94, 12.5611, 89.9034, -856.244, 741.16, 12.5611, 89.2141, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(34, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -848.094, 790.744, 13.1247, -850.43, 790.775, 13.131, 89.4218, -852.261, 782.263, 12.5611, 88.0629, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(35, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -842.646, 851.644, 13.0786, -844.634, 851.778, 13.0786, 90.5893, -856.238, 844.828, 12.5538, 92.5517, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(36, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -791.782, 841.27, 13.0814, -789.443, 841.379, 12.5611, 261.73, -785.377, 853.62, 12.5538, 264.425, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(37, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -792.192, 803.566, 13.1247, -789.327, 803.486, 12.9825, 271.275, -787.451, 811.279, 12.5611, 271.922, 2.02755, 1505.85, 1381, 0, 0, 0, 0, 0, 0),
(38, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -797.588, 742.829, 13.0786, -794.696, 742.695, 12.7114, 271.189, -784.155, 749.379, 12.5538, 271.46, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(39, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -730.554, 753.198, 13.0814, -733.028, 753.165, 12.5611, 81.7463, -739.391, 741.919, 12.5538, 93.4848, 8.39874, 1505.83, 1381, 0, 0, 0, 0, 0, 0),
(40, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -730.225, 790.771, 13.131, -732.538, 790.786, 13.131, 90.0579, -733.258, 782.347, 12.5611, 92.5216, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(41, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -724.671, 851.594, 13.0786, -726.863, 851.53, 13.0786, 89.2828, -738.767, 843.65, 12.5538, 94.9425, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(42, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -674.694, 841.237, 13.0814, -672.484, 841.119, 12.5611, 266.73, -666.594, 852.935, 12.5538, 272.432, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(43, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -675.142, 803.555, 13.1247, -672.578, 803.435, 12.9825, 270.823, -672.304, 811.617, 12.5611, 270.905, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(44, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -680.573, 742.795, 13.0786, -677.603, 743.082, 12.7114, 90.7994, -666.647, 749.483, 12.5538, 269.628, 3.65286, 1494.75, 1381, 0, 0, 0, 0, 0, 0),
(45, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 2685.6, -231.553, 3.97524, 2685.56, -229.216, 3.97524, 2.22396, 2698.83, -233.507, 3.97524, 7.15497, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(46, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 2627.62, -232.8, 3.97524, 2627.53, -230.269, 3.97524, 3.87646, 2641.5, -233.218, 3.97524, 2.83082, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(47, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 2608.46, -200.931, 6.83413, 2606.42, -200.792, 6.41226, 93.7575, 2605.57, -190.668, 6.91647, 176.749, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(48, 0, '', 1, 0, 5000000, 0, 1, -1, 0, 2590.71, -230.937, 4.03638, 2590.52, -228.926, 4.04053, 357.939, 2595.93, -235.218, 3.97888, 5.41627, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(49, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 2524.48, -198.869, 3.72267, 2524.78, -202.072, 3.02409, 180.406, 2531.21, -199.023, 3.1993, 186.861, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(50, 0, '', 6, 0, 5000000, 0, 1, -1, 0, 2250.71, 1363.36, 11.3606, 2250.55, 1360.87, 11.3643, 184.523, 2238.22, 1368.55, 11.353, 103.118, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(51, 0, '', 6, 0, 5000000, 0, 1, -1, 0, 2207.51, 1363.42, 11.3606, 2209.74, 1363.74, 11.3601, 273.738, 2219.16, 1354.26, 11.5189, 94.4271, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(52, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 465.347, -1249.77, 41.8968, 466.02, -1247.6, 40.7343, 341.171, 459.281, -1244.9, 40.7343, 340.921, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(53, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 531.188, -1275.49, 40.7343, 532.174, -1273.38, 40.7343, 339.331, 533.845, -1260.7, 40.8498, 272.61, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(54, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 525.155, -1305, 40.7343, 525.849, -1302.69, 40.7343, 351.831, 536.735, -1303.86, 40.7239, 326.88, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(55, 0, '', 5, 0, 5000000, 0, 1, -1, 0, 579.831, -1289.01, 40.7343, 580.6, -1286.9, 40.7343, 340.749, 573.354, -1289.93, 40.6267, 346.346, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(56, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 622.28, -1250.17, 41.8203, 622.017, -1252.59, 40.7343, 164.321, 627.778, -1249.33, 40.7343, 164.07, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(57, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 641.989, -1265.94, 41.8848, 641.107, -1268.57, 40.7343, 162.108, 634.578, -1265.87, 40.7343, 167.345, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(58, 0, '', 1, 0, 5000000, 0, 1, -1, 0, 629.064, -1320.47, 41.5092, 668.287, -1286.27, 40.7343, 157.549, 664.748, -1300.49, 40.4491, 77.7309, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(59, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 680.528, -1284.15, 41.8848, 680.176, -1285.74, 41.0098, 160.636, 674.81, -1301.27, 40.6322, 161.136, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(60, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 733.133, -1308.76, 40.672, 735.056, -1308.9, 40.6996, 251.629, 730.512, -1321.5, 40.2951, 248.703, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(61, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 720.156, -1351.02, 40.7165, 718.409, -1350.28, 40.7165, 73.2154, 714.882, -1358.07, 40.7165, 247.951, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(62, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 778.244, -1315.23, 40.7165, 776.639, -1314.74, 40.7165, 73.9675, 769.048, -1322.08, 40.7165, 167.236, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(63, 0, '', 6, 0, 5000000, 0, 1, -1, 0, 785.178, -1319.98, 41.8189, 785.503, -1321.91, 41.8189, 140.438, 788.617, -1327.23, 40.6862, 166.319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(64, 0, '', 5, 0, 5000000, 0, 1, -1, 0, 826.264, -1339.17, 40.7165, 827.851, -1340.28, 40.7092, 248.958, 823.398, -1348.97, 40.7165, 77.6057, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(65, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 826.275, -1387.15, 40.7165, 826.497, -1385.44, 40.7165, 343.374, 823.202, -1368.17, 40.7125, 251.985, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(66, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 811.911, -1371.2, 40.7165, 812.487, -1369.22, 40.7092, 344.502, 811.461, -1363.27, 40.6565, 246.972, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(67, 0, '', 5, 0, 5000000, 0, 1, -1, 0, 778.237, -1369.94, 40.7165, 777.011, -1371.9, 40.7165, 161.662, 772.075, -1369.88, 40.7165, 345.798, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(68, 0, '', 6, 0, 5000000, 0, 1, -1, 0, 1749.92, 2188.99, 15.9201, 1752.14, 2188.94, 15.8865, 272.566, 1750.8, 2199.84, 15.959, 274.716, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(69, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 1745.97, 2115.04, 16.009, 1747.64, 2114.86, 15.9955, 272.628, 1750.15, 2117.98, 16.0251, 264.149, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(70, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 1911.98, 2266.08, 15.7223, 1911.9, 2264.66, 15.7723, 180.157, 1901.92, 2270.13, 15.8427, 352.136, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(71, 0, '', 5, 0, 5000000, 0, 1, -1, 0, 1945.36, 1845.48, 15.4198, 1947.26, 1845.72, 15.4198, 267.793, 1953.74, 1842.65, 15.525, 190.254, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(72, 0, '', 6, 0, 5000000, 0, 1, -1, 0, 1943.5, 1806.87, 15.5073, 1942.92, 1808.72, 15.3979, 3.4856, 1951.94, 1812.3, 15.5252, 183.862, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(73, 0, '', 0, 0, 5000000, 0, 1, -1, 0, 1989.22, 1793.93, 15.4441, 1986.77, 1794.81, 15.5466, 81.9251, 1982.07, 1800.58, 15.584, 82.4265, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(74, 0, '', 5, 0, 5000000, 0, 1, -1, 0, 1994.83, 1746.2, 15.6989, 1992.68, 1746.14, 15.6989, 89.6134, 1985.42, 1748.85, 15.6989, 88.027, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(75, 0, '', 6, 0, 5000000, 0, 1, -1, 0, 1944.01, 1753.15, 15.3423, 1945.73, 1753.2, 15.3423, 271.348, 1952.3, 1748.19, 15.5097, 270.013, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(76, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -425.162, 1440.38, 20.9844, -425.245, 1442.2, 20.7421, 358.008, -433.16, 1444.21, 20.7421, 3.41713, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(77, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -423.341, 1464.19, 21.3906, -423.552, 1462.23, 20.8906, 179.972, -430.957, 1465.47, 20.7422, 174.311, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(78, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -410.581, 1441.88, 21.3906, -410.678, 1443.74, 20.8906, 1.32913, -402.344, 1439.35, 20.7421, 5.27737, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(79, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -397.837, 1463.92, 21.197, -397.669, 1462.35, 20.8906, 181.6, -410.036, 1465.79, 20.7421, 184.733, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(80, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -391.905, 1441.38, 21.4921, -391.744, 1443.21, 20.9637, 1.43149, -380.477, 1440.66, 20.7421, 11.6461, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(81, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -376.115, 1464.68, 21.4921, -376.222, 1462.77, 20.9119, 178.968, -387.457, 1467.4, 20.7421, 177.193, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(82, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -364.914, 1465.68, 20.9844, -364.743, 1463.99, 20.7421, 180.996, -356.19, 1462.59, 20.7421, 178.321, 287.675, 2163.1, 1765.51, 0, 0, 0, 0, 0, 0),
(83, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -351.675, 1441.13, 21.3906, -350.313, 1440.92, 20.8906, 269.522, -355.819, 1431.47, 20.7421, 277.543, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(84, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -329.338, 1427.34, 21.4921, -330.969, 1427.13, 21.0743, 88.0374, -336.504, 1428.61, 20.7469, 183.437, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(85, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -328.339, 1415.81, 20.9844, -329.72, 1415.85, 20.7421, 89.8548, -332.36, 1407.15, 20.7421, 90.3132, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(86, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -351.864, 1421.12, 21.1973, -350.137, 1420.74, 20.8906, 270.815, -352.585, 1409.75, 20.7422, 269.354, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(87, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -292.945, 1442.34, 21.3905, -293.042, 1443.58, 20.8905, 0.081564, -283.14, 1438.66, 20.7421, 359.06, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(88, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -289.77, 1465.66, 20.9844, -289.806, 1463.78, 20.7421, 179.123, -281.466, 1461.95, 20.7421, 181.273, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(89, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -300.876, 1463.93, 21.1971, -300.663, 1462.32, 20.8906, 179.914, -312.018, 1464.46, 20.7421, 173.604, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(90, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -260.416, 1464.19, 21.3905, -260.552, 1460.96, 20.8905, 176.757, -268.297, 1466.1, 20.7421, 183.862, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(91, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -272.757, 1441.4, 21.4921, -272.746, 1443.19, 20.973, 355.735, -261.755, 1440.76, 20.7421, 3.94447, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(92, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -232.337, 1419.83, 21.4921, -234.24, 1419.95, 20.9158, 89.8381, -231.23, 1430.15, 20.7421, 91.2167, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(93, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -254.872, 1413.5, 21.1977, -253.382, 1413.52, 20.8906, 273.304, -257.392, 1402.29, 20.7422, 273.994, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(94, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -260.536, 1374.17, 21.3905, -260.649, 1372.92, 21.1303, 181.81, -268.603, 1376.34, 20.7421, 179.805, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(95, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -289.84, 1375.68, 20.9844, -289.628, 1373.97, 20.7421, 179.867, -281.549, 1372.2, 20.7421, 184.775, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(96, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -272.877, 1351.38, 21.4921, -272.686, 1353.12, 21.0118, 358.697, -261.12, 1348.57, 20.7421, 359.429, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(97, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -231.349, 1386.35, 20.9844, -233.167, 1386.34, 20.7421, 91.0055, -235.643, 1378, 20.7421, 94.3466, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(98, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -232.859, 1401.01, 21.3905, -234.66, 1401.04, 20.8905, 88.037, -231.906, 1409.12, 20.7421, 93.301, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(99, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -293.169, 1352.34, 21.3905, -292.939, 1354.14, 20.8905, 1.51659, -284.363, 1349.55, 20.7421, 3.02077, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(100, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -353.632, 1302.69, 20.9844, -351.91, 1302.39, 20.7421, 268.057, -350.644, 1310.77, 20.7421, 273.591, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(101, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -329.851, 1300.97, 21.3905, -331.736, 1300.95, 20.8905, 89.2045, -328.737, 1309.13, 20.7421, 91.3978, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(102, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -351.674, 1289.53, 21.3906, -350.469, 1289.65, 20.8906, 270.603, -354.3, 1280, 20.7421, 271.856, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(103, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -328.337, 1286.25, 20.9844, -330.026, 1286.26, 20.7421, 91.0612, -331.45, 1277.86, 20.7421, 89.2009, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(104, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -373.511, 1250.88, 21.3906, -373.686, 1251.99, 21.2286, 358.752, -365.589, 1249.28, 20.7421, 3.76572, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(105, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -388.083, 1249.4, 20.9844, -387.946, 1251.19, 20.7421, 359.63, -396.471, 1252.99, 20.7421, 5.10154, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(106, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -417.614, 1250.88, 21.3906, -417.256, 1252.44, 20.8906, 356.246, -409.16, 1250.21, 20.7421, 2.01091, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(107, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -404.945, 1272.93, 21.1974, -405.101, 1271.27, 20.8906, 177.746, -417.189, 1274.28, 20.7421, 184.577, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(108, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -383.128, 1273.64, 21.4921, -383.083, 1271.45, 20.8906, 178.145, -394.387, 1277.65, 20.7421, 176.559, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(109, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -451.967, 1274.53, 20.9844, -451.817, 1272.96, 20.7421, 179.587, -443.666, 1271.15, 20.7421, 177.1, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(110, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -441.686, 1309.5, 21.3906, -439.884, 1309.79, 20.8906, 270.784, -444.347, 1300.32, 20.7421, 273.478, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(111, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -419.83, 1298.92, 21.3906, -421.736, 1299.25, 20.8906, 86.3147, -418.823, 1307.11, 20.7421, 93.4982, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(112, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -444.682, 1282.47, 20.9921, -443.003, 1282.5, 20.9921, 268.379, -436.343, 1286.04, 20.8908, 287.387, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(113, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -410.085, 1352.13, 21.1971, -410.226, 1354.1, 20.8905, 0.476833, -398.711, 1351.54, 20.7421, 6.36763, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(114, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -419.428, 1374.19, 21.3905, -419.504, 1371.49, 20.8905, 178.053, -426.771, 1375.6, 20.7421, 185.635, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(115, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -394.199, 1374.67, 21.4921, -394.07, 1373.18, 21.1525, 178.531, -405.406, 1377.29, 20.7421, 175.19, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(116, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -233.292, 1483.73, 21.3905, -234.865, 1483.67, 20.8905, 90.2325, -232.209, 1493.42, 20.7421, 93.4912, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(117, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -260.507, 1526.68, 21.3905, -260.298, 1525.2, 20.8905, 178.593, -268.581, 1527.66, 20.7421, 184.359, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(118, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -272.927, 1503.9, 21.4921, -272.649, 1505.63, 21.0078, 359.2, -261.504, 1503.63, 20.7421, 356.858, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(119, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -278.894, 1526.39, 21.1972, -278.698, 1524.92, 20.8905, 179.071, -290.41, 1527.95, 20.7421, 187.218, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(120, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -301.195, 1527.18, 21.4921, -300.878, 1526.02, 21.3519, 181.578, -312.304, 1528.67, 20.7421, 105.678, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(121, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -306.239, 1502.89, 20.9844, -306.121, 1504.68, 20.7421, 0.242283, -314.521, 1507.17, 20.7421, 4.67194, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(122, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -293, 1505.09, 21.3905, -293.041, 1506.39, 20.8905, 2.31029, -283.651, 1502.21, 20.7421, 185.569, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(123, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -355.886, 1526.23, 21.3906, -355.953, 1524.32, 20.8906, 180.285, -365.738, 1526.56, 20.7421, 2.0399, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(124, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -369.969, 1504.65, 21.1976, -370.045, 1505.77, 21.0421, 357.696, -358.428, 1502.85, 20.7421, 182.146, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(125, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -376.125, 1527.18, 21.4921, -375.969, 1525.32, 20.9426, 180.285, -387.038, 1527.95, 20.7421, 5.73736, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(126, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -388.513, 1504.38, 21.3905, -388.467, 1506.02, 20.8905, 357.822, -380.621, 1503.68, 20.7421, 184.629, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(127, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -408.831, 1528.18, 20.9844, -408.844, 1526.33, 20.7421, 180.575, -400.602, 1525.8, 20.7421, 185.421, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(128, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -411.941, 1504.84, 21.3905, -411.768, 1506.4, 20.8905, 359.98, -403.175, 1504.11, 20.7421, 187.927, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(129, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -419.916, 1526.43, 21.1973, -419.796, 1525.31, 21.0474, 179.487, -431.212, 1526.06, 20.7422, 2.18167, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(130, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -435.795, 1503.89, 21.4921, -436.178, 1506.25, 20.8905, 359.98, -424.871, 1504.76, 20.7421, 194.319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(131, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -460.632, 1490.12, 20.9844, -459.277, 1490.1, 20.7421, 271.232, -457.879, 1498.07, 20.7421, 270.961, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(132, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -458.685, 1476.96, 21.3906, -457.392, 1477.03, 20.8906, 269.477, -460.585, 1467.69, 20.7422, 280.131, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(133, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -458.885, 1437.56, 21.1975, -457.283, 1437.45, 20.8906, 271.294, -459.233, 1425.94, 20.7421, 274.365, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(134, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -459.635, 1415.45, 21.4921, -458.077, 1415.3, 21.1172, 275.055, -459.328, 1403.95, 20.7421, 87.4091, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(135, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -437.298, 1401.41, 21.3906, -438.562, 1401.45, 20.8906, 89.5202, -437.341, 1410.79, 20.7421, 268.392, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(136, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -460.636, 1378.19, 20.9844, -458.981, 1378.29, 20.7421, 268.412, -458.245, 1386.65, 20.7421, 276.641, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(137, 0, '', 0, 0, 5000000, 0, 3, -1, 0, 394.404, 701.187, 12.802, 395.196, 702.649, 12.4392, 335.191, 399.485, 698.061, 12.117, 341.5, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(138, 0, '', 0, 0, 5000000, 0, 3, -1, 0, 473.25, 673.052, 12.1515, 471.56, 673.618, 12.126, 68.5648, 469.493, 677.414, 12.1315, 342.816, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(139, 0, '', 0, 0, 5000000, 0, 3, -1, 0, 485.676, 672.548, 12.1311, 485.903, 674.764, 12.135, 340.204, 491.847, 678.574, 12.149, 251.635, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(140, 0, '', 6, 0, 5000000, 0, 3, -1, 0, 504.005, 662.206, 12.4645, 502.455, 662.698, 12.1381, 66.4736, 515.125, 661.209, 12.1102, 335.21, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(141, 0, '', 5, 0, 500000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(142, 0, '', 5, 0, 500000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(143, 0, '', 0, 0, 450000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(144, 0, '', 5, 0, 500000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(145, 0, '', 0, 0, 500000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(146, 0, '', 5, 0, 500000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(147, 0, '', 5, 0, 500000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(148, 0, '', 5, 0, 450000, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(149, 0, '', 5, 0, 500000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(150, 0, '', 5, 0, 450000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2901.24, 1507.65, 2001, 0, 0, 0, 0, 0, 0),
(151, 0, '', 5, 0, 500000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(152, 0, '', 5, 0, 450000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(153, 0, '', 0, 0, 500000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(154, 0, '', 5, 0, 500000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(155, 0, '', 5, 0, 500000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(156, 0, '', 0, 0, 500000, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(157, 0, '', 0, 0, 450000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(158, 0, '', 0, 0, 450000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(159, 0, '', 5, 0, 450000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(160, 0, '', 6, 0, 500000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(161, 0, '', 5, 0, 450000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(162, 0, '', 5, 0, 500000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(163, 0, '', 5, 0, 450000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(164, 0, '', 5, 0, 500000, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(165, 0, '', 5, 0, 500000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(166, 0, '', 0, 0, 450000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(167, 0, '', 5, 0, 500000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(168, 0, '', 5, 0, 500000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(169, 0, '', 0, 0, 450000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(170, 0, '', 5, 0, 450000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(171, 0, '', 5, 0, 500000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(172, 0, '', 5, 0, 450000, 0, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(173, 0, '', 5, 0, 450000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(174, 0, '', 0, 0, 500000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(175, 0, '', 0, 0, 500000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(176, 0, '', 5, 0, 500000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(177, 0, '', 5, 0, 500000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(178, 0, '', 5, 0, 450000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(179, 0, '', 5, 0, 450000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(180, 0, '', 5, 0, 500000, 0, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(181, 0, '', 0, 0, 500000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(182, 0, '', 5, 0, 500000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(183, 0, '', 5, 0, 500000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(184, 0, '', 5, 0, 450000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(185, 0, '', 0, 0, 500000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(186, 0, '', 5, 0, 450000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(187, 0, '', 5, 0, 500000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(188, 0, '', 5, 0, 450000, 0, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(189, 0, '', 4, 0, 450000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(190, 0, '', 0, 0, 500000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(191, 0, '', 0, 0, 500000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(192, 0, '', 5, 0, 500000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(193, 0, '', 0, 0, 500000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(194, 0, '', 0, 0, 500000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(195, 0, '', 5, 0, 500000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(196, 0, '', 5, 0, 450000, 0, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(197, 0, '', 0, 0, 450000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(198, 0, '', 0, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(199, 0, '', 5, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(200, 0, '', 6, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(201, 0, '', 5, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(202, 0, '', 3, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(203, 0, '', 0, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(204, 0, '', 1, 0, 500000, 0, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(205, 0, '', 0, 0, 450000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(206, 0, '', 3, 0, 500000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(207, 0, '', 0, 0, 500000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(208, 0, '', 5, 0, 500000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(209, 0, '', 0, 0, 450000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(210, 0, '', 0, 0, 500000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(211, 0, '', 5, 0, 450000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(212, 0, '', 5, 0, 450000, 0, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(213, 0, '', 5, 0, 500000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(214, 0, '', 0, 0, 450000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(215, 0, '', 5, 0, 500000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(216, 0, '', 5, 0, 500000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2899.15, 1505.84, 2001, 0, 0, 0, 0, 0, 0),
(217, 0, '', 5, 0, 450000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(218, 0, '', 5, 0, 500000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(219, 0, '', 5, 0, 500000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(220, 0, '', 0, 0, 450000, 0, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(221, 0, '', 5, 0, 500000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(222, 0, '', 0, 0, 500000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(223, 0, '', 5, 0, 500000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(224, 0, '', 5, 0, 500000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(225, 0, '', 0, 0, 450000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(226, 0, '', 5, 0, 450000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(227, 0, '', 0, 0, 500000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(228, 0, '', 5, 0, 500000, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(229, 0, '', 6, 0, 500000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(230, 0, '', 0, 0, 450000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(231, 0, '', 5, 0, 450000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(232, 0, '', 5, 0, 450000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(233, 0, '', 5, 0, 450000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(234, 0, '', 0, 0, 500000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(235, 0, '', 0, 0, 450000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(236, 0, '', 5, 0, 500000, 0, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(237, 0, '', 0, 0, 500000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(238, 0, '', 0, 0, 450000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(239, 0, '', 0, 0, 450000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(240, 0, '', 0, 0, 450000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(241, 0, '', 0, 0, 500000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(242, 0, '', 0, 0, 500000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(243, 0, '', 0, 0, 500000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(244, 0, '', 0, 0, 450000, 0, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(245, 0, '', 5, 0, 500000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(246, 0, '', 0, 0, 450000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(247, 0, '', 0, 0, 450000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(248, 0, '', 0, 0, 500000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(249, 0, '', 0, 0, 500000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(250, 0, '', 0, 0, 450000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(251, 0, '', 0, 0, 450000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(252, 0, '', 0, 0, 500000, 0, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(253, 0, '', 0, 0, 500000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(254, 0, '', 5, 0, 450000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(255, 0, '', 6, 0, 450000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(256, 0, '', 5, 0, 500000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(257, 0, '', 0, 0, 500000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(258, 0, '', 5, 0, 450000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(259, 0, '', 0, 0, 500000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(260, 0, '', 5, 0, 450000, 0, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(261, 0, '', 5, 0, 450000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(262, 0, '', 0, 0, 500000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(263, 0, '', 5, 0, 500000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(264, 0, '', 5, 0, 500000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(265, 0, '', 5, 0, 500000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(266, 0, '', 5, 0, 500000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(267, 0, '', 0, 0, 450000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(268, 0, '', 5, 0, 450000, 0, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(269, 0, '', 5, 0, 500000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(270, 0, '', 5, 0, 500000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(271, 0, '', 0, 0, 450000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(272, 0, '', 5, 0, 500000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(273, 0, '', 5, 0, 500000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(274, 0, '', 0, 0, 500000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(275, 0, '', 0, 0, 500000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(276, 0, '', 5, 0, 450000, 0, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(277, 0, '', 0, 0, 450000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(278, 0, '', 5, 0, 500000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(279, 0, '', 5, 0, 500000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(280, 0, '', 5, 0, 450000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(281, 0, '', 5, 0, 500000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(282, 0, '', 5, 0, 450000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(283, 0, '', 5, 0, 500000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(284, 0, '', 5, 0, 500000, 0, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(285, 0, '', 5, 0, 500000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(286, 0, '', 0, 0, 450000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(287, 0, '', 0, 0, 450000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(288, 0, '', 0, 0, 500000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(289, 0, '', 3, 0, 500000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(290, 0, '', 5, 0, 500000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(291, 0, '', 5, 0, 450000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(292, 0, '', 5, 0, 450000, 0, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(293, 0, '', 5, 0, 500000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(294, 0, '', 5, 0, 450000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(295, 0, '', 5, 0, 450000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(296, 0, '', 5, 0, 450000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(297, 0, '', 0, 0, 500000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(298, 0, '', 5, 0, 500000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(299, 0, '', 5, 0, 450000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(300, 0, '', 0, 0, 500000, 0, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(301, 0, '', 0, 0, 450000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(302, 0, '', 0, 0, 500000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(303, 0, '', 6, 0, 500000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(304, 0, '', 0, 0, 500000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(305, 0, '', 0, 0, 500000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(306, 0, '', 6, 0, 500000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(307, 0, '', 0, 0, 450000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(308, 0, '', 5, 0, 450000, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(309, 0, '', 0, 0, 450000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(310, 0, '', 0, 0, 500000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(311, 0, '', 0, 0, 500000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(312, 0, '', 0, 0, 450000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(313, 0, '', 0, 0, 500000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(314, 0, '', 0, 0, 500000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(315, 0, '', 0, 0, 450000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(316, 0, '', 0, 0, 450000, 0, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(317, 0, '', 5, 0, 500000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(318, 0, '', 0, 0, 500000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(319, 0, '', 5, 0, 500000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(320, 0, '', 5, 0, 450000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(321, 0, '', 5, 0, 450000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(322, 0, '', 5, 0, 450000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(323, 0, '', 5, 0, 500000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(324, 0, '', 5, 0, 450000, 0, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(325, 0, '', 0, 0, 450000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(326, 0, '', 0, 0, 500000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(327, 0, '', 0, 0, 500000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(328, 0, '', 3, 0, 450000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(329, 0, '', 2, 0, 500000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(330, 0, '', 6, 0, 500000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(331, 0, '', 0, 0, 500000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(332, 0, '', 5, 0, 500000, 0, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(333, 0, '', 0, 0, 500000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(334, 0, '', 0, 0, 450000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(335, 0, '', 5, 0, 450000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(336, 0, '', 5, 0, 450000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(337, 0, '', 5, 0, 500000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(338, 0, '', 5, 0, 450000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(339, 0, '', 5, 0, 500000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(340, 0, '', 0, 0, 450000, 0, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(341, 0, '', 5, 0, 500000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(342, 0, '', 0, 0, 450000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(343, 0, '', 0, 0, 500000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(344, 0, '', 6, 0, 500000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(345, 0, '', 5, 0, 500000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(346, 0, '', 0, 0, 450000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(347, 0, '', 5, 0, 450000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(348, 0, '', 5, 0, 500000, 0, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(349, 0, '', 0, 0, 500000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(350, 0, '', 5, 0, 500000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(351, 0, '', 5, 0, 500000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(352, 0, '', 5, 0, 500000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(353, 0, '', 0, 0, 450000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(354, 0, '', 5, 0, 450000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(355, 0, '', 5, 0, 500000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2899.32, 1506.16, 2001, 0, 0, 0, 0, 0, 0),
(356, 0, '', 5, 0, 500000, 0, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(357, 0, '', 5, 0, 500000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(358, 0, '', 5, 0, 500000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(359, 0, '', 0, 0, 500000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(360, 0, '', 0, 0, 450000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(361, 0, '', 5, 0, 500000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(362, 0, '', 0, 0, 500000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(363, 0, '', 5, 0, 500000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(364, 0, '', 5, 0, 450000, 0, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(365, 0, '', 0, 0, 450000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(366, 0, '', 0, 0, 500000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(367, 0, '', 0, 0, 500000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(368, 0, '', 0, 0, 500000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(369, 0, '', 5, 0, 450000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(370, 0, '', 0, 0, 500000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(371, 0, '', 5, 0, 500000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(372, 0, '', 0, 0, 500000, 0, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(373, 0, '', 6, 0, 450000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(374, 0, '', 0, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(375, 0, '', 0, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(376, 0, '', 5, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(377, 0, '', 2, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(378, 0, '', 0, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(379, 0, '', 5, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(380, 0, '', 5, 0, 500000, 0, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(381, 0, '', 4, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(382, 0, '', 5, 0, 450000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(383, 0, '', 0, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(384, 0, '', 0, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(385, 0, '', 5, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(386, 0, '', 3, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(387, 0, '', 5, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(388, 0, '', 5, 0, 500000, 0, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(389, 0, '', 5, 0, 450000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(390, 0, '', 5, 0, 500000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(391, 0, '', 5, 0, 500000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2899.32, 1506.4, 2001, 0, 0, 0, 0, 0, 0),
(392, 0, '', 0, 0, 500000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(393, 0, '', 0, 0, 450000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(394, 0, '', 5, 0, 500000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(395, 0, '', 5, 0, 500000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(396, 0, '', 5, 0, 500000, 0, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(397, 0, '', 5, 0, 450000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(398, 0, '', 5, 0, 450000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(399, 0, '', 5, 0, 450000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(400, 0, '', 5, 0, 500000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(401, 0, '', 0, 0, 450000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(402, 0, '', 5, 0, 500000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(403, 0, '', 5, 0, 450000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(404, 0, '', 0, 0, 500000, 0, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(405, 0, '', 5, 0, 450000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
INSERT INTO `houses` (`id`, `owner_id`, `name`, `improvements`, `rent_time`, `price`, `rent_price`, `type`, `entrance`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `car_x`, `car_y`, `car_z`, `car_angle`, `store_x`, `store_y`, `store_z`, `eviction`, `store_metall`, `store_drugs`, `store_weapon`, `store_ammo`, `store_skin`) VALUES
(406, 0, '', 5, 0, 500000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(407, 0, '', 0, 0, 500000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(408, 0, '', 0, 0, 500000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(409, 0, '', 5, 0, 500000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(410, 0, '', 0, 0, 500000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(411, 0, '', 5, 0, 500000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(412, 0, '', 0, 0, 450000, 0, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(413, 0, '', 5, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(414, 0, '', 0, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(415, 0, '', 0, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(416, 0, '', 0, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(417, 0, '', 5, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(418, 0, '', 5, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(419, 0, '', 5, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(420, 0, '', 0, 0, 500000, 0, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(421, 0, '', 0, 0, 450000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(422, 0, '', 5, 0, 500000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(423, 0, '', 5, 0, 500000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(424, 0, '', 0, 0, 500000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(425, 0, '', 5, 0, 450000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(426, 0, '', 5, 0, 500000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(427, 0, '', 5, 0, 500000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(428, 0, '', 5, 0, 500000, 0, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(429, 0, '', 0, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(430, 0, '', 0, 0, 450000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(431, 0, '', 0, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(432, 0, '', 5, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(433, 0, '', 0, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(434, 0, '', 5, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(435, 0, '', 0, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(436, 0, '', 0, 0, 500000, 0, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(437, 0, '', 0, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(438, 0, '', 0, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(439, 0, '', 5, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(440, 0, '', 5, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(441, 0, '', 5, 0, 450000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(442, 0, '', 5, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(443, 0, '', 0, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(444, 0, '', 0, 0, 500000, 0, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(445, 0, '', 5, 0, 450000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(446, 0, '', 5, 0, 500000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(447, 0, '', 5, 0, 450000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(448, 0, '', 0, 0, 500000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(449, 0, '', 5, 0, 500000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(450, 0, '', 5, 0, 450000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(451, 0, '', 5, 0, 450000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(452, 0, '', 0, 0, 500000, 0, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(453, 0, '', 0, 0, 450000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(454, 0, '', 5, 0, 500000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(455, 0, '', 5, 0, 500000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(456, 0, '', 5, 0, 500000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(457, 0, '', 5, 0, 450000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(458, 0, '', 0, 0, 500000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(459, 0, '', 0, 0, 500000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(460, 0, '', 5, 0, 500000, 0, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(461, 0, '', 5, 0, 500000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(462, 0, '', 5, 0, 500000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(463, 0, '', 6, 0, 450000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(464, 0, '', 0, 0, 500000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(465, 0, '', 5, 0, 500000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(466, 0, '', 0, 0, 500000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(467, 0, '', 5, 0, 450000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(468, 0, '', 0, 0, 450000, 0, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(469, 0, '', 5, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(470, 0, '', 5, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(471, 0, '', 0, 0, 450000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(472, 0, '', 0, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(473, 0, '', 0, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(474, 0, '', 0, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(475, 0, '', 0, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(476, 0, '', 5, 0, 500000, 0, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(477, 0, '', 5, 0, 500000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(478, 0, '', 5, 0, 500000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(479, 0, '', 5, 0, 450000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(480, 0, '', 0, 0, 450000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(481, 0, '', 0, 0, 500000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(482, 0, '', 5, 0, 500000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(483, 0, '', 0, 0, 500000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(484, 0, '', 5, 0, 500000, 0, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(485, 0, '', 1, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(486, 0, '', 0, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(487, 0, '', 5, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(488, 0, '', 5, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(489, 0, '', 5, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(490, 0, '', 0, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(491, 0, '', 0, 0, 500000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(492, 0, '', 5, 0, 450000, 0, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(493, 0, '', 5, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(494, 0, '', 5, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(495, 0, '', 5, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(496, 0, '', 5, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(497, 0, '', 5, 0, 450000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(498, 0, '', 5, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(499, 0, '', 0, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(500, 0, '', 0, 0, 500000, 0, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(501, 0, '', 5, 0, 450000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(502, 0, '', 5, 0, 500000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(503, 0, '', 5, 0, 500000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(504, 0, '', 0, 0, 450000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(505, 0, '', 5, 0, 500000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(506, 0, '', 0, 0, 500000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(507, 0, '', 5, 0, 500000, 0, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2898.38, 1499.75, 2001, 0, 0, 0, 0, 0, 0),
(508, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -915.642, 742.634, 13.0786, -911.77, 742.832, 12.5538, 266.362, -901.488, 753.024, 12.5845, 3.25374, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(509, 0, '', 0, 0, 100000, 0, 6, -1, 0, -2.83529, 595.115, 13.0936, -2.72501, 597.511, 12.7131, 315.935, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(510, 0, '', 0, 0, 100000, 0, 6, -1, 0, 8.77968, 594.24, 13.0997, 9.80212, 597.247, 12.1772, 345.124, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(511, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -910.2, 803.403, 13.1247, -905.621, 803.598, 12.5611, 268.369, -907.983, 809.465, 12.5886, 270.603, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(512, 0, '', 6, 0, 50000000, 0, 6, -1, 0, -909.759, 841.158, 13.0814, -906.767, 841.352, 12.5611, 271.502, -901.315, 850.322, 12.6162, 270.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(530, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 836.383, -1332.92, 40.7165, 833.409, -1333.68, 40.7165, 96.9411, 832.977, -1333.57, 40.7165, 74.0158, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(522, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -286.996, 1249.53, 20.9844, -287.945, 1254.64, 20.8743, 224.162, -295.549, 1254.49, 20.7421, 181.861, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(523, 0, '', 0, 0, 10000000, 0, 5, -1, 0, -316.422, 1251.69, 21.3906, -316.76, 1255.08, 20.8823, 1.0893, -317.552, 1257.26, 20.7414, 3.98212, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(513, 0, '', 0, 0, 50, 0, 6, -1, 0, -306.522, 488.966, 13.223, -309.333, 489.443, 12.8737, 256.344, -321.401, 490.382, 12.8096, 82.1275, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(514, 0, '', 0, 0, 100000000, 0, 0, -1, 0, 2290.85, -191.04, 2.14294, 2289.33, -193.151, 2.14294, 135.187, 2295.71, -210.163, 2.18921, 203.911, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(515, 0, '', 6, 0, 100000000, 0, 2, -1, 0, 2355.03, -261.294, 2.79638, 2356.2, -265.236, 2.79638, 33.9029, 2342.25, -263.525, 1.48889, 87.161, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(516, 0, '', 5, 0, 100000000, 0, 0, -1, 0, 2625.76, -180.869, 7.20756, 2628.45, -184.284, 7.22695, 254.059, 2629.4, -186.107, 7.15312, 267.869, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(517, 0, '', 0, 0, 50, 0, 6, -1, 0, -303.15, 516.448, 13.2285, -307.02, 517.289, 12.8656, 251.935, -317.54, 517.546, 12.6296, 98.692, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(518, 0, '', 0, 0, 10000000, 0, 6, -1, 0, -232.118, 1335, 20.9844, -237.101, 1334.89, 20.8898, 97.8873, -234.816, 1326.01, 20.7421, 75.4721, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(519, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -232.829, 1305.51, 21.3906, -237.241, 1305.4, 20.8823, 98.0557, -240.117, 1301.87, 20.7414, 352.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(520, 0, '', 0, 0, 10000000, 0, 5, -1, 0, -232.333, 1290.93, 20.9844, -236.257, 1290.66, 20.8573, 86.2938, -240.482, 1286.15, 20.7414, 344.773, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(521, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -272.323, 1250.88, 21.3906, -272.709, 1256.92, 20.8898, 2.80142, -277.096, 1258.74, 20.7414, 264.582, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(560, 0, '', 0, 0, 50000000, 0, 2, -1, 0, 669.086, -1283.81, 41.8848, 668.113, -1285.04, 41.0098, 198.469, 662.598, -1301.22, 40.4405, 132.458, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(524, 0, '', 0, 0, 10000000, 0, 5, -1, 0, 1787.55, 2409.34, 15.3082, 1784.32, 2407.95, 15.2733, 285.625, 1787.28, 2402.74, 15.2737, 217.318, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(554, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2210.36, -95.159, 26.125, -2210.6, -95.429, 26.125, 101.839, -2213.64, -95.9077, 26.125, 100.191, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(563, 0, '', 0, 0, 5000000, 0, 2, -1, 0, 1911.18, 1086.44, 28.769, 1912.15, 1086.56, 28.769, 272.656, 1913.01, 1090.29, 28.769, 279.567, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(531, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 772.416, -1273.58, 40.7107, 769.649, -1274.68, 40.7165, 108.351, 766.488, -1274.32, 40.7165, 80.3046, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(561, 0, '', 0, 0, 5000000, 0, 2, -1, 0, -2812.33, -670.784, 8.62537, -2811.96, -671.979, 8.56018, 181.892, -2805.69, -671.704, 8.33861, 182.271, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(552, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2201.14, -107.546, 26.125, -2199.73, -107.922, 26.125, 275.373, -2199.46, -110.804, 26.125, 236.851, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(525, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 668.764, -1363.1, 40.7343, 671.394, -1364.64, 40.7343, 70.4924, 673.607, -1363.34, 40.7343, 300.653, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(526, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 734.808, -1392.2, 40.7134, 730.713, -1390.25, 40.7114, 249.873, 730.575, -1390.55, 40.7115, 118.385, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(527, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 760.23, -1402.05, 40.7168, 0, 0, 0, 0, 765.159, -1403.86, 40.7166, 252.769, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(528, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 791.408, -1407.55, 40.7165, 0, 0, 0, 0, 790.245, -1401.16, 40.7165, 9.00012, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(529, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 829.752, -1413.33, 40.7092, 825.182, -1412.94, 40.7165, 82.5647, 824.649, -1412.82, 40.7165, 78.5232, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(532, 0, '', 6, 0, 20000000, 0, 0, -1, 0, 729.248, -1254.39, 40.9853, 730.12, -1257.73, 40.8622, 196.773, 730.107, -1260.27, 40.824, 177.245, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(533, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 700.42, -1250.33, 40.838, 699.54, -1252.91, 40.7343, 159.758, 696.08, -1257.62, 40.7343, 147.893, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(559, 0, '', 0, 0, 200000, 0, 0, -1, 0, -1543.25, 1584.09, 36.7768, -1544.43, 1583.68, 36.7768, 113.52, -1545.02, 1578.13, 36.7768, 194.254, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(534, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 656.188, -1232.2, 40.7344, 656.802, -1235.06, 40.7344, 186.86, 659.74, -1237.82, 40.7344, 226.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(535, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 644.801, -1244.29, 40.7343, 644.469, -1240.46, 40.7343, 30.3543, 644.469, -1240.46, 40.7343, 30.3543, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(536, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 570.416, -1316.85, 40.7343, 570.307, -1314.74, 40.7343, 352.398, 568.051, -1309.97, 40.7343, 34.6926, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(537, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 548.99, -1312.38, 40.7343, 545.486, -1310.67, 40.7343, 54.9576, 544.006, -1309.85, 40.7343, 59.9365, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(538, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 474.123, -1281.21, 40.7343, 473.429, -1278.54, 40.7343, 352.642, 471.497, -1274.93, 40.7343, 27.3912, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(539, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 468.885, -1254.2, 41.8655, 469.225, -1254.39, 41.8655, 152.511, 468.288, -1261.06, 40.7343, 168.987, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(540, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2223.52, -179.206, 2.46963, 2224.77, -179.031, 2.14385, 249.964, 2230.29, -180.342, 2.1435, 287.416, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(541, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2238.36, -168.02, 2.81221, 2240.67, -168.433, 2.77114, 248.015, 2244.9, -169.235, 2.69577, 261.733, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(542, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2253.29, -167.95, 2.81916, 2253.29, -167.95, 2.81916, 271.618, 2247.52, -169.558, 2.67337, 94.2607, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(543, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2251.19, -200.52, 2.1435, 2250.24, -200.591, 2.1435, 95.9314, 2246.91, -211.047, 2.1435, 216.889, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(544, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2409.29, -260.755, 1.66805, 2406.7, -260.811, 1.75318, 83.2179, 2403.28, -261.662, 1.75457, 105.823, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(545, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2474.37, -264.483, 1.55164, 2466.48, -259.073, 1.81765, 72.504, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(546, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2533.49, -190.739, 3.1993, 2531.81, -190.61, 3.1993, 94.4167, 2527.44, -190.6, 3.04771, 87.2098, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(547, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2609.07, -169.404, 7.32303, 2609.07, -169.404, 7.32303, 8.33922, 2604.16, -175.285, 7.24449, 120.49, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(548, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2205.32, -261.845, 1.61755, 2204.02, -266.187, 1.63748, 79.3288, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(549, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2602.49, -243.833, 3.97888, 2602.49, -243.833, 3.97888, 293.651, 2596.2, -249.211, 3.97888, 143.347, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(550, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2684, -260.958, 3.97524, 2682.17, -261.113, 3.97524, 112.116, 2673.22, -264.327, 4.12566, 108.562, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(551, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2198.26, -97.4927, 26.125, -2196.56, -101.415, 26.125, 119.872, -2196.38, -104.029, 26.125, 180.719, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(553, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2212.51, -107.581, 26.1179, -2212.51, -107.581, 26.1179, 265.764, -2217.92, -106.578, 26.125, 75.1224, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(555, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2195.93, -94.7812, 26.1179, -2195.93, -94.7812, 26.1179, 78.8916, -2188.95, -84.3278, 26.125, 346.332, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(556, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2181.97, -140.857, 26.125, -2181.97, -140.857, 26.125, 161.413, -2181.08, -135.202, 26.125, 344.964, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(557, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2188.79, -139.533, 26.125, -2188.95, -138.087, 26.125, 349.277, -2188.87, -130.554, 26.125, 357.8, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(558, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2195.91, -138.144, 26.125, -2196.01, -136.655, 26.125, 323.861, -2198.82, -135.762, 26.125, 7.20593, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(562, 0, '', 6, 0, 5000000, 0, 2, -1, 0, -2790.45, -709.893, 7.26051, -2788.45, -709.265, 6.47324, 314.297, -2783.39, -703.876, 6.36812, 290.893, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(564, 0, '', 0, 0, 5000000, 0, 2, -1, 0, 1894.06, 1086.17, 28.769, 1895.35, 1086.3, 28.769, 254.574, 1895.99, 1091.29, 28.769, 9.25485, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(565, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1909.75, 1066.22, 28.8205, 1911.4, 1065.94, 28.7805, 270.055, 1911.22, 1069.18, 28.785, 8.56015, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(566, 0, '', 0, 0, 5000000, 0, 2, -1, 0, 1894.91, 1186.52, 30.3278, 1894.77, 1187.59, 30.3224, 355.42, 1899.78, 1188.68, 30.0135, 9.52159, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(567, 0, '', 0, 0, 5000000, 0, 2, -1, 0, 1633.86, 1294.77, 12.2211, 1634.63, 1295.76, 12.2077, 310.05, 1644.82, 1296.42, 12.0926, 283.956, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(568, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 838.705, -1323.03, 40.7096, 837.788, -1322.35, 40.7107, 94.0755, 837.176, -1324.48, 40.7112, 81.0172, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(569, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 834.799, -1391.52, 41.7043, 835.544, -1389.81, 41.3085, 350.786, 842.848, -1392.13, 40.7071, 352.234, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(570, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 623.878, -1243.93, 40.7343, 623.207, -1245.25, 40.7343, 199.795, 630.627, -1242.6, 40.7343, 149.315, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(571, 0, '', 0, 0, 1, 0, 0, -1, 0, 2196.63, -172.736, 2.45325, 2194.6, -169.466, 2.67972, 213.806, 2194.6, -169.466, 2.67972, 213.806, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(572, 0, '', 0, 0, 450000, 0, 2, -1, 0, 263.994, 822.082, 12.6255, 265.461, 825.938, 12.0003, 343.905, 273.856, 821.352, 12.0003, 2.28353, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(573, 0, '', 0, 0, 10000000, 0, 6, -1, 0, -169.506, 847.773, 15.5293, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `housesnew`
--

CREATE TABLE `housesnew` (
  `id` int(11) NOT NULL,
  `accounts_id` int(11) NOT NULL DEFAULT 0,
  `owner_name` varchar(24) NOT NULL DEFAULT '',
  `price` int(11) NOT NULL DEFAULT 0,
  `type` int(11) NOT NULL DEFAULT 0,
  `x` float NOT NULL DEFAULT 0,
  `y` float NOT NULL DEFAULT 0,
  `z` float NOT NULL DEFAULT 0,
  `angle` float NOT NULL DEFAULT 0,
  `int_x` float NOT NULL DEFAULT 2496.01,
  `int_y` float NOT NULL DEFAULT -1692.79,
  `int_z` float NOT NULL DEFAULT 1014.74,
  `int_a` float NOT NULL DEFAULT 180,
  `int_interior` int(11) NOT NULL DEFAULT 3
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `houses_bought`
--

CREATE TABLE `houses_bought` (
  `house_id` int(11) NOT NULL,
  `owner_name` varchar(24) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `houses_renters`
--

CREATE TABLE `houses_renters` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `house_id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `inventory`
--

CREATE TABLE `inventory` (
  `id` int(10) UNSIGNED NOT NULL,
  `account_id` int(10) UNSIGNED NOT NULL,
  `item_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL DEFAULT 0,
  `old_skin` int(11) NOT NULL DEFAULT 0,
  `slot` int(11) NOT NULL,
  `amount` int(11) NOT NULL DEFAULT 1,
  `extra_1` int(11) NOT NULL DEFAULT 0,
  `extra_2` int(11) NOT NULL DEFAULT 0,
  `sim` int(11) NOT NULL DEFAULT 0,
  `oldsim` int(11) NOT NULL DEFAULT 0,
  `source_internal_id` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `inventory`
--

INSERT INTO `inventory` (`id`, `account_id`, `item_id`, `model_id`, `old_skin`, `slot`, `amount`, `extra_1`, `extra_2`, `sim`, `oldsim`, `source_internal_id`, `created_at`, `updated_at`) VALUES
(122783, 5, 134, 6893, 175, 1, 1, 0, 0, 0, 0, 525, '2026-08-07 16:37:06', '2026-08-09 11:56:05'),
(122791, 6, 454, 7390, 0, 25, 1, 7390, 0, 0, 0, 0, '2026-08-07 19:27:08', '2026-08-12 00:00:01'),
(122792, 6, 451, 7387, 0, 4, 1, 7387, 0, 0, 0, 0, '2026-08-07 19:27:17', '2026-08-11 23:53:42'),
(122798, 6, 134, 99, 25, 7, 1, 0, 0, 0, 0, 343, '2026-08-07 20:35:02', '2026-08-11 23:53:42'),
(122799, 6, 454, 7390, 0, 26, 1, 7390, 0, 0, 0, 0, '2026-08-07 20:42:55', '2026-08-11 11:10:47'),
(122807, 7, 134, 5500046, 5896, 3, 1, 0, 0, 0, 0, 561, '2026-08-07 22:20:44', '2026-08-07 22:26:13'),
(122808, 7, 134, 92, 5500046, 4, 1, 0, 0, 0, 0, 342, '2026-08-07 22:21:42', '2026-08-11 16:59:39'),
(122809, 9, 134, 266, 161, 1, 1, 0, 0, 0, 0, 237, '2026-08-08 00:25:59', '2026-08-08 00:29:36'),
(122824, 6, 134, 10, 92, 11, 1, 0, 0, 0, 0, 341, '2026-08-08 23:16:30', '2026-08-09 14:42:09'),
(122825, 6, 22, 2, 0, 5, 2, 0, 0, 0, 0, 0, '2026-08-09 09:05:48', '2026-08-11 23:16:34'),
(122829, 6, 134, 5500047, 0, 12, 1, 0, 0, 0, 0, 562, '2026-08-09 14:22:29', '2026-08-09 14:22:29'),
(122832, 13, 134, 12293, 135, 1, 1, 0, 0, 0, 0, 134, '2026-08-09 15:53:19', '2026-08-09 15:54:20'),
(122833, 13, 511, 14575, 0, 2, 1, 0, 0, 0, 0, 0, '2026-08-09 15:53:24', '2026-08-09 15:53:24'),
(122834, 13, 939, 10492, 0, 3, 1, 0, 0, 0, 0, 0, '2026-08-09 15:53:26', '2026-08-09 15:53:26'),
(122835, 13, 134, 6889, 0, 4, 1, 0, 0, 0, 0, 134, '2026-08-09 15:53:28', '2026-08-09 15:53:28'),
(122838, 6, 134, 5893, 0, 13, 1, 0, 0, 0, 0, 134, '2026-08-09 16:45:56', '2026-08-09 16:45:56'),
(122839, 6, 945, 14643, 0, 3, 1, 0, 0, 0, 0, 0, '2026-08-09 16:46:04', '2026-08-11 23:12:33'),
(122840, 6, 946, 4702, 0, 9, 1, 0, 0, 0, 0, 0, '2026-08-09 16:46:08', '2026-08-09 16:46:08'),
(122842, 6, 966, 15055, 0, 15, 1, 0, 0, 0, 0, 0, '2026-08-09 16:46:21', '2026-08-09 16:46:21'),
(122845, 6, 59, 1754, 0, 16, 1, 0, 0, 0, 0, 0, '2026-08-09 17:07:43', '2026-08-09 17:07:43'),
(122846, 6, 59, 1754, 0, 8, 1, 0, 0, 0, 0, 0, '2026-08-09 17:07:57', '2026-08-09 18:21:27'),
(122847, 6, 59, 1754, 0, 18, 1, 0, 0, 0, 0, 0, '2026-08-09 17:08:11', '2026-08-09 17:08:11'),
(122848, 6, 59, 1754, 0, 19, 1, 0, 0, 0, 0, 0, '2026-08-09 17:08:25', '2026-08-09 17:08:25'),
(122849, 6, 59, 1754, 0, 20, 1, 0, 0, 0, 0, 0, '2026-08-09 17:08:49', '2026-08-09 17:08:49'),
(122850, 6, 59, 1754, 0, 21, 1, 0, 0, 0, 0, 0, '2026-08-09 17:09:06', '2026-08-09 17:09:06'),
(122853, 6, 134, 5500074, 5500074, 10, 1, 0, 0, 0, 0, 134, '2026-08-09 17:20:14', '2026-08-10 10:07:48'),
(122858, 6, 944, 1, 0, 23, 1, 14647, 0, 0, 0, 0, '2026-08-09 18:40:55', '2026-08-09 20:20:44'),
(122867, 6, 1000, 32136, 0, 14, 1, 0, 0, 0, 0, 0, '2026-08-09 20:38:43', '2026-08-09 20:38:43'),
(122873, 5, 359, 1, 0, 2, 1, 18509, 0, 0, 0, 0, '2026-08-10 10:51:52', '2026-08-10 10:51:52'),
(122874, 6, 134, 89, 225, 17, 1, 0, 0, 0, 0, 338, '2026-08-10 12:46:30', '2026-08-12 00:05:54'),
(122878, 6, 442, 7378, 0, 27, 1, 7378, 0, 0, 0, 0, '2026-08-11 11:00:35', '2026-08-11 20:26:12'),
(122881, 7, 944, 1, 0, 1, 1, 14647, 0, 0, 0, 0, '2026-08-11 17:20:44', '2026-08-11 17:20:44'),
(122882, 7, 180, 1, 0, 2, 1, 18243, 0, 0, 0, 0, '2026-08-11 17:21:21', '2026-08-11 17:21:21'),
(122886, 5, 660, 1, 0, 5, 1, 9824, 0, 0, 0, 0, '2026-08-11 19:45:54', '2026-08-11 19:45:54'),
(122887, 6, 134, 5500047, 0, 28, 1, 0, 0, 0, 0, 562, '2026-08-11 20:26:03', '2026-08-11 20:26:03'),
(122890, 5, 1033, 1, 0, 6, 1, 100075, 0, 0, 0, 0, '2026-08-11 22:32:09', '2026-08-11 22:32:09'),
(122892, 5, 517, 14593, 0, 7, 1, 0, 0, 0, 0, 0, '2026-08-11 22:33:03', '2026-08-11 22:33:03'),
(122893, 5, 134, 6864, 6893, 8, 1, 0, 0, 0, 0, 561, '2026-08-11 22:33:07', '2026-08-11 23:02:32'),
(122894, 5, 134, 7770, 0, 9, 1, 0, 0, 0, 0, 558, '2026-08-11 22:33:09', '2026-08-11 22:33:09'),
(122895, 5, 134, 6881, 0, 10, 1, 0, 0, 0, 0, 539, '2026-08-11 22:33:13', '2026-08-11 22:33:13'),
(122896, 5, 134, 5897, 6864, 11, 1, 0, 0, 0, 0, 537, '2026-08-11 22:33:15', '2026-08-12 00:41:32'),
(122902, 5, 939, 1, 0, 12, 1, 10492, 0, 0, 0, 0, '2026-08-11 23:02:41', '2026-08-11 23:02:41'),
(122906, 6, 59, 1754, 0, 2, 1, 0, 0, 0, 0, 0, '2026-08-11 23:07:02', '2026-08-11 23:07:02'),
(122907, 5, 59, 1754, 0, 13, 1, 0, 0, 0, 0, 0, '2026-08-11 23:07:08', '2026-08-11 23:07:08'),
(122908, 6, 492, 4198, 0, 1, 1, 0, 0, 0, 0, 0, '2026-08-11 23:11:14', '2026-08-11 23:12:33'),
(122909, 5, 493, 4199, 0, 14, 1, 0, 0, 0, 0, 0, '2026-08-11 23:14:57', '2026-08-11 23:14:57'),
(122910, 5, 22, 2, 0, 15, 2, 0, 0, 0, 0, 0, '2026-08-11 23:16:30', '2026-08-11 23:16:34'),
(122913, 6, 134, 210, 0, 29, 1, 0, 0, 0, 0, 326, '2026-08-12 00:01:41', '2026-08-12 00:01:41'),
(122914, 15, 134, 5896, 78, 1, 1, 0, 0, 0, 0, 0, '2026-08-12 00:02:30', '2026-08-12 00:02:39'),
(122915, 15, 134, 175, 5896, 2, 1, 0, 0, 0, 0, 230, '2026-08-12 00:04:28', '2026-08-12 00:04:57'),
(122916, 6, 134, 225, 166, 30, 1, 0, 0, 0, 0, 94, '2026-08-12 00:05:30', '2026-08-12 00:05:39'),
(122917, 6, 58, 6666, 0, 22, 1, 6666, 2222, 2222, 6666, 0, '2026-08-12 00:06:53', '2026-08-12 00:06:53'),
(122924, 15, 23, 23, 0, 3, 1, 0, 0, 0, 0, 0, '2026-08-12 01:07:35', '2026-08-12 01:07:35'),
(122937, 5, 134, 6892, 0, 16, 1, 0, 0, 0, 0, 527, '2026-08-12 09:27:12', '2026-08-12 09:27:12'),
(122939, 12, 134, 6881, 5896, 3, 1, 0, 0, 0, 0, 0, '2026-08-12 10:43:51', '2026-08-12 13:50:52'),
(122943, 15, 454, 7390, 0, 4, 1, 7390, 0, 0, 0, 0, '2026-08-12 10:58:36', '2026-08-12 10:58:36'),
(122945, 12, 134, 7770, 5897, 4, 1, 0, 0, 0, 0, 0, '2026-08-12 11:09:00', '2026-08-12 13:56:15'),
(122946, 12, 134, 5897, 6864, 1, 1, 0, 0, 0, 0, 537, '2026-08-12 11:09:24', '2026-08-12 13:56:08'),
(122951, 16, 134, 89, 0, 1, 1, 0, 0, 0, 0, 338, '2026-08-12 11:43:35', '2026-08-12 11:43:35'),
(122953, 19, 492, 4198, 0, 2, 1, 0, 0, 0, 0, 0, '2026-08-12 11:43:45', '2026-08-12 11:43:45'),
(122954, 19, 134, 5897, 78, 3, 1, 0, 0, 0, 0, 537, '2026-08-12 11:43:58', '2026-08-12 11:44:06'),
(122955, 19, 657, 1, 0, 1, 1, 9386, 0, 0, 0, 0, '2026-08-12 13:46:13', '2026-08-12 13:46:13'),
(122957, 12, 134, 6864, 6881, 2, 1, 0, 0, 0, 0, 0, '2026-08-12 13:49:15', '2026-08-12 13:50:48'),
(122958, 12, 451, 7387, 0, 5, 1, 7387, 0, 0, 0, 0, '2026-08-12 13:55:49', '2026-08-12 13:56:15'),
(122959, 12, 134, 266, 7770, 6, 1, 0, 0, 0, 0, 237, '2026-08-12 13:56:40', '2026-08-12 13:57:06'),
(122961, 12, 360, 18510, 0, 8, 1, 0, 0, 0, 0, 0, '2026-08-12 13:56:51', '2026-08-12 13:56:51'),
(122962, 12, 134, 5894, 266, 9, 1, 0, 0, 0, 0, 134, '2026-08-12 13:56:57', '2026-08-12 13:57:11'),
(122963, 18, 59, 1754, 0, 1, 1, 0, 0, 0, 0, 0, '2026-08-12 14:12:59', '2026-08-12 14:12:59'),
(122965, 18, 59, 1754, 0, 3, 1, 0, 0, 0, 0, 0, '2026-08-12 14:14:09', '2026-08-12 14:14:09'),
(122966, 18, 134, 7770, 78, 4, 1, 0, 0, 0, 0, 558, '2026-08-12 14:16:46', '2026-08-12 15:52:12'),
(122967, 18, 134, 301, 0, 5, 1, 0, 0, 0, 0, 345, '2026-08-12 14:17:20', '2026-08-12 14:17:20'),
(122968, 18, 134, 6872, 62, 6, 1, 0, 0, 0, 0, 538, '2026-08-12 15:52:39', '2026-08-12 15:55:45'),
(122969, 18, 134, 175, 175, 7, 1, 0, 0, 0, 0, 230, '2026-08-12 15:55:13', '2026-08-12 16:01:23'),
(122970, 18, 134, 62, 6872, 8, 1, 0, 0, 0, 0, 235, '2026-08-12 15:55:27', '2026-08-12 20:24:04'),
(122971, 21, 134, 7770, 136, 1, 1, 0, 0, 0, 0, 558, '2026-08-12 18:39:30', '2026-08-12 20:36:12'),
(122972, 21, 134, 6864, 7770, 2, 1, 0, 0, 0, 0, 561, '2026-08-12 19:38:14', '2026-08-12 19:39:59'),
(122973, 20, 134, 6864, 5897, 1, 1, 0, 0, 0, 0, 561, '2026-08-12 19:39:10', '2026-08-12 19:53:11'),
(122974, 20, 134, 5500062, 0, 2, 1, 0, 0, 0, 0, 562, '2026-08-12 19:39:12', '2026-08-12 19:39:12'),
(122976, 20, 134, 5897, 78, 3, 1, 0, 0, 0, 0, 537, '2026-08-12 19:44:52', '2026-08-12 19:45:22'),
(122982, 20, 657, 1, 0, 5, 1, 9386, 0, 0, 0, 0, '2026-08-12 19:49:41', '2026-08-12 19:49:41'),
(122983, 20, 491, 1, 0, 6, 1, 4197, 0, 0, 0, 0, '2026-08-12 19:51:34', '2026-08-12 19:51:34'),
(122985, 20, 357, 18507, 0, 7, 1, 0, 0, 0, 0, 0, '2026-08-12 19:51:43', '2026-08-12 19:51:43'),
(122988, 20, 492, 1, 0, 10, 1, 4198, 0, 0, 0, 0, '2026-08-12 19:53:07', '2026-08-12 19:53:07'),
(122992, 21, 134, 5500071, 6864, 3, 1, 0, 0, 0, 0, 134, '2026-08-12 20:37:10', '2026-08-12 20:37:16'),
(122993, 21, 359, 1, 0, 7, 1, 18509, 0, 0, 0, 0, '2026-08-12 20:37:17', '2026-08-12 20:37:17');

-- --------------------------------------------------------

--
-- Структура таблицы `inventoryitems`
--

CREATE TABLE `inventoryitems` (
  `id` int(11) NOT NULL,
  `playerid` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `count` int(11) DEFAULT 1,
  `position` int(11) DEFAULT -1,
  `data` varchar(255) DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `inventory_plates`
--

CREATE TABLE `inventory_plates` (
  `account_id` int(11) NOT NULL,
  `slot` int(11) NOT NULL,
  `plate_type` tinyint(4) NOT NULL DEFAULT 1,
  `plate_number` varchar(16) NOT NULL,
  `plate_region` varchar(8) NOT NULL DEFAULT '',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `inventory_plates`
--

INSERT INTO `inventory_plates` (`account_id`, `slot`, `plate_type`, `plate_number`, `plate_region`, `created_at`, `updated_at`) VALUES
(5, 13, 1, 'b777bb', '777', '2026-08-11 23:07:08', '2026-08-11 23:07:08'),
(6, 2, 1, 'e777kx', '777', '2026-08-11 23:07:02', '2026-08-11 23:07:02'),
(6, 8, 1, 'x777am', '77', '2026-08-09 17:07:57', '2026-08-09 18:21:27'),
(6, 16, 1, 'x777am', '777', '2026-08-09 17:07:43', '2026-08-09 17:07:43'),
(6, 18, 1, 'o000oo', '00', '2026-08-09 17:08:11', '2026-08-09 17:08:11'),
(6, 19, 1, 'b888bb', '888', '2026-08-09 17:08:25', '2026-08-09 17:08:25'),
(6, 20, 1, 'b888bb', '88', '2026-08-09 17:08:49', '2026-08-09 17:08:49'),
(6, 21, 1, 'b000op', '000', '2026-08-09 17:09:06', '2026-08-09 17:09:06'),
(6, 200006901, 1, 'b180oa', '18', '2026-08-11 19:48:54', '2026-08-11 19:48:54'),
(12, 200008702, 1, 'a777aa', '777', '2026-08-12 10:43:38', '2026-08-12 10:43:38'),
(18, 1, 1, 'a777ye', '77', '2026-08-12 14:12:59', '2026-08-12 14:12:59'),
(18, 3, 1, 'b666op', '666', '2026-08-12 14:14:09', '2026-08-12 14:14:09');

-- --------------------------------------------------------

--
-- Структура таблицы `invskins`
--

CREATE TABLE `invskins` (
  `account_id` int(11) NOT NULL,
  `internal_id` int(11) NOT NULL,
  `modelid` int(11) NOT NULL,
  `purchased_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `invskins`
--

INSERT INTO `invskins` (`account_id`, `internal_id`, `modelid`, `purchased_at`) VALUES
(5, 525, 6893, '2026-08-07 16:37:06'),
(5, 527, 6892, '2026-08-12 09:27:12'),
(5, 537, 5897, '2026-08-11 22:33:15'),
(5, 539, 6881, '2026-08-11 22:33:13'),
(5, 558, 7770, '2026-08-11 22:33:09'),
(5, 561, 6864, '2026-08-11 22:33:07'),
(6, 94, 225, '2026-08-12 00:05:30'),
(6, 317, 166, '2026-08-11 23:58:39'),
(6, 326, 210, '2026-08-12 00:01:41'),
(6, 338, 89, '2026-08-10 12:46:30'),
(6, 341, 10, '2026-08-08 23:16:30'),
(6, 343, 99, '2026-08-07 20:35:02'),
(6, 526, 6896, '2026-08-07 20:33:20'),
(6, 535, 6871, '2026-08-09 17:10:25'),
(6, 562, 5500047, '2026-08-11 20:26:03'),
(7, 342, 92, '2026-08-07 22:21:42'),
(7, 561, 5500046, '2026-08-07 22:20:44'),
(9, 237, 266, '2026-08-08 00:25:59'),
(12, 237, 266, '2026-08-12 13:56:40'),
(12, 536, 5896, '2026-08-12 08:06:19'),
(12, 537, 5897, '2026-08-12 11:09:24'),
(12, 539, 6881, '2026-08-12 08:06:14'),
(12, 558, 7770, '2026-08-12 08:06:10'),
(12, 561, 6864, '2026-08-12 08:06:07'),
(12, 562, 5500062, '2026-08-12 08:06:04'),
(15, 230, 175, '2026-08-12 00:04:28'),
(16, 338, 89, '2026-08-12 11:43:35'),
(18, 230, 175, '2026-08-12 15:55:13'),
(18, 235, 62, '2026-08-12 15:55:27'),
(18, 345, 301, '2026-08-12 14:17:20'),
(18, 538, 6872, '2026-08-12 15:52:39'),
(18, 558, 7770, '2026-08-12 14:16:46'),
(19, 537, 5897, '2026-08-12 11:43:58'),
(20, 537, 5897, '2026-08-12 19:44:52'),
(20, 561, 6864, '2026-08-12 19:39:10'),
(20, 562, 5500062, '2026-08-12 19:39:12'),
(21, 558, 7770, '2026-08-12 18:39:30'),
(21, 561, 6864, '2026-08-12 19:38:14');

-- --------------------------------------------------------

--
-- Структура таблицы `keys`
--

CREATE TABLE `keys` (
  `id` int(11) NOT NULL,
  `key` varchar(36) NOT NULL,
  `activated` tinyint(4) NOT NULL DEFAULT 0,
  `used_by` varchar(24) DEFAULT NULL,
  `used_at` datetime DEFAULT NULL,
  `subscription_date` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `keys`
--

INSERT INTO `keys` (`id`, `key`, `activated`, `used_by`, `used_at`, `subscription_date`) VALUES
(1, 'devdev', 0, NULL, NULL, '2026-06-26 06:26:26'),
(1506, 'tester', 0, NULL, NULL, '2126-01-17 00:00:00'),
(1507, '9dd1b165-2ed5-4d28-9ec8-b1150e900ea1', 0, NULL, NULL, '2126-01-17 00:00:00');

-- --------------------------------------------------------

--
-- Структура таблицы `lastnumber`
--

CREATE TABLE `lastnumber` (
  `acc_id` int(11) NOT NULL,
  `rus` varchar(32) NOT NULL DEFAULT '',
  `ua` varchar(32) NOT NULL DEFAULT '',
  `by` varchar(32) NOT NULL DEFAULT '',
  `kz` varchar(32) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `lastnumber`
--

INSERT INTO `lastnumber` (`acc_id`, `rus`, `ua`, `by`, `kz`) VALUES
(1, 'c820he|13', 'OO 7047 TT|', '2646 AB-5|', '302cxk|11'),
(5, 'y868tm|20', 'OT 7247 XA|', '6660 CY-2|', '833pxc|16'),
(6, 'h048eh|54', 'ab4941ok|', '1812mp8|', '286aop|09'),
(12, 'x872ma|43', 'MT 2202 KK|', '9273 EA-8|', '468xtx|02'),
(15, 'e701yb|90', 'ck5102yb|', '5452pk4|', '125htm|07'),
(16, 'p278oo|87', 'xm2392mh|', '3912po0|', '908ack|04'),
(18, 'm156pa|26', 'YM 6385 HP|', '5482 CO-0|', '217kaa|09'),
(20, 'k822xh|36', 'OY 6171 OB|', '7695 KB-0|', '058ykp|12'),
(29, 'e039ch|32', 'hy1873tx|', '5253pk4|', '799ath|15'),
(61, 'o634tk|09', 'xe7384ay|', '5448ec5|', '142yxe|04'),
(172, 'c969ch|93', 'tk6302bh|', '6566at3|', '071bch|02'),
(206, 'e077oe|48', 'bc8532hp|', '7372ym4|', '525amm|14'),
(230, 'a668bm|15', 'KX 6232 EH|', '1984 PO-2|', '994aom|07'),
(243, 'y850ok|93', 'TK 8651 HK|', '2509 KT-7|', '225pmc|16'),
(250, 'a859bk|31', 'xc4271cp|', '7389yy0|', '503oam|09'),
(251, 'k770ka|94', 'TM 6401 KM|', '5083 BK-8|', '505kxa|01'),
(254, 'x140hy|77', 'MK 3778 HB|', '1181 AT-7|', '669otm|05'),
(258, 'o503yy|08', 'YE 6255 MA|', '2321 YE-5|', '019xym|16'),
(267, 'y429eo|56', 'EM 9980 OM|', '6811 TT-1|', '789mmp|02'),
(276, 'm744pe|85', 'ah1476yx|', '2871ch8|', '090hco|13'),
(314, 'o953xe|60', 'xy2970ap|', '2847aa1|', '672yoc|15'),
(320, 't922aa|55', 'tm7201ta|', '9283po9|', '735ahp|07'),
(334, 'c948mx|42', 'yc8552ye|', '5794xc5|', '922cpt|16'),
(348, 'b879oa|33', 'YA 2454 HE|', '4592 HE-8|', '434cmc|06'),
(350, 'p043hh|17', 'to2016et|', '9180xp4|', '213mxx|16'),
(358, 'a120bh|21', 'tc2877hp|', '3441ka8|', '768pet|04'),
(478, 'o188yc|59', 'hx7854ha|', '3398ca8|', '063mhp|05'),
(481, 'm415bm|61', 'CO 5556 OY|', '8205 AK-1|', '806eby|11'),
(484, 'x654xm|69', 'TB 5889 AT|', '3385 BY-2|', '898ckx|10'),
(504, 'h133xk|52', 'yb7264th|', '7810mx5|', '202aee|01'),
(506, 't996hk|69', 'ob6178oh|', '1010tc7|', '491pop|13'),
(532, 'm386xy|79', 'xe5533ap|', '7806mx1|', '165yem|12'),
(570, 'c062ck|66', 'mb5957ha|', '7671my7|', '434xyk|05'),
(595, 'x347ex|52', 'pm1114km|', '9912yk0|', '024mbc|03'),
(602, 'k469bx|49', 'HE 7458 OH|', '1992 KE-7|', '477cxk|08'),
(622, 'm897bo|30', 'KB 2300 XY|', '3001 EO-3|', '255xte|04'),
(633, 'a757ep|07', 'KK 5633 TB|', '8597 OO-1|', '579ttt|07'),
(644, 't370pb|86', 'bh7084pb|', '6333ye1|', '647tao|15'),
(646, 'c492ab|44', 'xo2512ex|', '6413ck2|', '478aem|03'),
(662, 't220ph|76', 'PO 7259 PM|', '0061 YO-3|', '917yea|07'),
(717, 'o275tb|65', 'TY 3682 MB|', '3960 BC-3|', '303cbt|08'),
(745, 'k626yh|10', 'AB 5263 EO|', '4222 AH-7|', '075yhe|15'),
(769, 'a091ct|69', 'OA 2986 AT|', '9214 YE-1|', '645opm|10'),
(786, 'p226bb|04', 'YP 0091 YM|', '2012 PX-3|', '719phy|01'),
(820, 'k051eo|81', 'TE 3270 HP|', '9445 MT-3|', '084ckh|01'),
(824, 'o965kc|31', 'TB 6045 MT|', '5530 MX-5|', '769bkx|12'),
(843, 'p622ee|73', 'TK 9674 XY|', '8095 OC-6|', '217ycm|10'),
(844, 'o590ee|09', 'yb3382ah|', '3845oh9|', '370mhk|14'),
(849, 'x551bk|50', 'YB 1906 OC|', '0557 XT-5|', '888boe|02'),
(855, 'o685kh|07', 'bt6776xk|', '6410ct2|', '638mbt|13'),
(862, 'm163ct|39', 'mo2363xh|', '2466oo7|', '224xeh|14'),
(873, 'y374cp|66', 'hh2607pk|', '0684ay6|', '838oxm|05'),
(906, 'o726bb|70', 'AM 4295 TC|', '9964 XY-0|', '608boa|09'),
(937, 'y979aa|58', 'kc3196yy|', '8046hh9|', '819hkt|10'),
(940, 'c519xk|34', 'EB 6935 TK|', '1040 KT-6|', '101kap|17'),
(943, 'k690to|28', 'PT 7855 PO|', '1132 EA-9|', '882epe|14'),
(974, 'o099te|13', 'BO 3881 TM|', '9896 EE-4|', '706oxp|08'),
(1012, 'c567ox|07', 'OB 6504 CY|', '8384 KH-2|', '930ekt|05'),
(1015, 'p245bb|92', 'CP 4921 BA|', '2302 EE-0|', '739eab|03'),
(1016, 'o502tx|67', 'ca0742me|', '9467ox9|', '945kpp|15'),
(1017, 'p433ho|78', 'ak2025ob|', '2545bx7|', '292ete|10'),
(1026, 'm435xx|33', 'YP 0660 HP|', '9289 CO-5|', '656bkh|12'),
(1043, 'c801xh|27', 'mp1901tt|', '1861tp5|', '965acp|17'),
(1053, 'x924ec|63', 'CC 9785 XC|', '6686 CB-1|', '280hbk|12'),
(1055, 'a427ph|81', 'ch9307mt|', '1334xt3|', '512xya|08'),
(1060, 'o310ec|94', 'mk5382ca|', '1007cm7|', '524oot|04'),
(1062, 'e666xy|62', 'xa0285xm|', '5782ty0|', '491eko|12'),
(1070, 'e970tc|71', 'BC 6840 TH|', '7474 OM-6|', '792omc|07'),
(1079, 'p969ce|07', 'MH 6092 PT|', '3968 HY-5|', '042cox|08'),
(1081, 'y717xo|25', 'XT 9312 XT|', '8831 BP-4|', '342tth|13'),
(1084, 'k785ay|54', 'ko9537cy|', '9309kk9|', '187kya|17'),
(1085, 'm827hh|53', 'CH 7118 HM|', '1336 YB-0|', '765pkp|08'),
(1097, 'a129hp|05', 'tp7350eo|', '7963om5|', '095amp|01'),
(1123, 'h944xo|86', 'XT 5969 HK|', '5659 PC-8|', '334pth|03'),
(1125, 'x498cb|15', 'tx5945yb|', '5717et4|', '774bye|01'),
(1144, 'b170ab|70', 'KE 7169 CX|', '5600 YT-1|', '921xox|17'),
(1148, 'p619mc|33', 'km1173kk|', '8982ha8|', '561kkh|17'),
(1178, 'p616ok|16', 'pt0357ao|', '2512oy2|', '454ahk|15'),
(1179, 't198pe|67', 'XX 8331 YK|', '4707 EX-7|', '299eeh|01'),
(1182, 'y788xc|55', 'BT 9787 EY|', '9941 OE-5|', '422tye|02'),
(1183, 'h746hb|70', 'XM 0380 KA|', '5872 EB-1|', '280mcp|11'),
(1189, 'c343ty|60', 'TA 8019 EA|', '7689 EP-7|', '394mke|03'),
(1190, 'k909yc|25', 'OP 3882 PT|', '3937 XH-5|', '538hba|02'),
(1197, 'p830ya|52', 'EK 4931 AA|', '8708 TP-7|', '392chm|08'),
(1210, 'y871at|63', 'YX 2541 BC|', '9200 XE-9|', '495kxo|14'),
(1218, 'x704ea|69', 'OC 7503 XO|', '4504 HB-4|', '748bbm|11'),
(1219, 'c294px|14', 'mp8632ap|', '1940am7|', '848bxe|15'),
(1222, 'e897te|75', 'ke8097xa|', '2082xx7|', '000ccc|00'),
(1227, 'c276ye|06', 'bc2135ck|', '8375ek9|', '006myt|07'),
(1234, 'k104hy|93', 'BO 0342 PP|', '5215 MY-6|', '413ymx|13'),
(1235, 'h321by|63', 'TA 8579 TT|', '2419 YC-2|', '577xxe|04'),
(1239, 'a714xa|49', 'AH 5340 XA|', '3956 CM-2|', '755oob|06'),
(1247, 'b561ay|63', 'bo2461xk|', '2095me7|', '304xmx|04'),
(1255, 'p644te|21', 'pb4458mb|', '8935py4|', '742yax|12'),
(1260, 'e317kb|04', 'XX 8854 TE|', '8563 XY-4|', '552pac|08'),
(1264, 'e675ky|39', 'ay8370pt|', '8302mm2|', '896xex|17'),
(1268, 'o062ec|83', 'KM 0766 XC|', '5557 MM-4|', '779tya|09'),
(1275, 'h533tc|90', 'YH 5406 BX|', '3896 YP-9|', '358xob|06'),
(1276, 't096ex|59', 'TC 8271 TB|', '6414 XO-4|', '570byc|16'),
(1283, 'm617oc|62', 'OH 5020 MX|', '7332 MC-2|', '633poh|12'),
(1286, 'p182tt|07', 'MO 1276 AC|', '7121 XH-1|', '034akm|10'),
(1291, 'e234xp|12', 'MH 9754 YM|', '8321 EC-2|', '491mce|15'),
(1300, 'c525my|32', 'AC 6584 EY|', '3134 OM-9|', '670mco|04'),
(1314, 'x196yo|77', 'MP 4551 HY|', '2418 OP-6|', '317bke|07'),
(1315, 'b131op|15', 'OM 3381 XY|', '3299 AM-1|', '917eam|01'),
(1321, 'b655ey|05', 'MM 1202 PB|', '5346 MA-0|', '870tee|14'),
(1340, 'b489bo|50', 'AT 1139 KH|', '8030 HO-0|', '072xec|12'),
(1342, 'o795yy|89', 'ya5870aa|', '4418tc2|', '992eye|11'),
(1347, 'k284bb|93', 'BE 0537 TA|', '9110 XH-9|', '619tte|12'),
(1364, 'o724hb|33', 'BY 1880 AO|', '8475 AC-8|', '102kbp|15'),
(1365, 'b531hm|76', 'OA 5320 TX|', '0329 YP-5|', '899oph|15'),
(1368, 'y754ko|15', 'hc6809kt|', '2507te6|', '573epa|12'),
(1371, 't088kh|56', 'xm4677tx|', '4161co1|', '261bxo|02'),
(1377, 'm344bo|27', 'OA 8473 MH|', '4947 OY-1|', '584bct|15'),
(1378, 't864at|49', 'BB 5792 KO|', '5953 TO-6|', '202cte|08'),
(1393, 'y005yc|15', 'HH 1238 XH|', '1912 PX-5|', '622moc|10'),
(1394, 't396yp|82', 'oh8158ep|', '0938ey9|', '664xat|08'),
(1398, 'x882km|46', 'oo9044ma|', '4457he9|', '073cxo|02'),
(1399, 't564yb|25', 'pk7380tk|', '3851ym5|', '401hok|11'),
(1413, 'm641ob|48', 'HK 4158 EH|', '2250 EB-5|', '700bbc|14'),
(1419, 'm924to|20', 'ko1199ha|', '4805ao7|', '506chp|05'),
(1420, 'a919aa|14', 'oc6393pt|', '1796mk8|', '957eap|13'),
(1426, 'x346kp|37', 'to2092ay|', '0779xp0|', '757eoh|14'),
(1428, 'o408xy|51', 'HC 7246 MH|', '6884 ME-1|', '249oyh|11'),
(1429, 'p424ty|50', 'EP 9398 CH|', '2924 ME-4|', '040bpt|11'),
(1432, 'e033my|19', 'MC 2550 KM|', '5183 CP-5|', '366oop|08'),
(1433, 'y291ay|10', 'XO 7466 BK|', '4694 TE-5|', '828ytm|17'),
(1440, 'y022xp|39', 'mp0365cm|', '7668ap1|', '410oao|17'),
(1446, 'y100ec|39', 'KM 0635 CC|', '0958 KP-2|', '368moe|04'),
(1450, 't454th|82', 'PA 5736 EH|', '6527 OK-1|', '278hym|07'),
(1460, 'p960ma|89', 'xh6562me|', '2123yx3|', '019mxb|08'),
(1465, 'p939pc|75', 'OO 7847 BY|', '2705 KT-9|', '178hop|12'),
(1466, 'b406kx|49', 'CA 1067 KB|', '5741 YP-1|', '705myp|12'),
(1470, 'b506ak|50', 'ba1005pe|', '0979pb6|', '478xmp|17'),
(1472, 'b794bk|91', 'ho6548tc|', '1986bb7|', '655cxx|06'),
(1474, 'y092yk|33', 'KP 4661 YM|', '6302 EH-9|', '405pxy|01'),
(1481, 'h888by|20', 'bm4357hx|', '8436oy8|', '072bxt|08'),
(1485, 'h970cc|89', 'PX 4508 XX|', '9380 PH-7|', '698hmk|06'),
(1489, 'm843eh|94', 'CB 7533 OK|', '2536 HH-8|', '847oot|01'),
(1490, 'x559mb|75', 'ak5668ob|', '2845yx0|', '900ccc|10'),
(1491, 'k757yb|79', 'pc5305pm|', '1025mo4|', '593myy|07'),
(1492, 'c454eh|71', 'YK 2781 TB|', '2533 HH-8|', '064omp|06'),
(1494, 't463ex|81', 'AM 9386 KX|', '6498 AE-8|', '307xkp|04'),
(1497, 'o120mk|58', 'tk5625pp|', '5354pb5|', '831xky|06'),
(1501, 'k463oa|64', 'ma1964xo|', '8577ao0|', '035bmp|16'),
(1505, 'x739ka|42', 'HO 0246 XY|', '4536 CH-6|', '850chh|09'),
(1506, 'e377ko|26', 'MX 3257 BO|', '8987 AM-4|', '864cht|16'),
(1508, 'a248yo|13', 'CK 5646 TK|', '8128 YK-1|', '445hkb|08'),
(1509, 'm062mc|75', 'PH 8836 CM|', '1612 OM-6|', '859xca|15'),
(1512, 'h913ca|79', 'hb9857cc|', '3437ka5|', '958mbh|16'),
(1513, 'x609ao|02', 'me4031tc|', '2675xt9|', '631yeo|05'),
(1514, 'm372ye|72', 'XC 9743 YM|', '6277 TM-1|', '940oxk|16'),
(1519, 'c444pm|56', 'AA 4075 EB|', '1285 OY-6|', '377bkm|12'),
(1526, 'p308ex|59', 'HB 8150 YP|', '9842 TY-8|', '756ebb|17'),
(1527, 'm241tb|79', 'YC 5469 KK|', '1464 MO-7|', '974ppy|03'),
(1528, 'e973aa|31', 'XC 6819 EP|', '2908 BY-3|', '815ytm|02'),
(1529, 'x247pm|74', 'ko0727hc|', '1553oh4|', '950oey|14'),
(1530, 'a406me|77', 'hy2158xy|', '9332bo7|', '327ayo|10'),
(1532, 'h465ya|47', 'XM 4289 TO|', '7943 KT-5|', '284oob|07'),
(1535, 'y583ho|20', 'MC 0308 XM|', '9979 XM-3|', '423hto|06'),
(1536, 'b534po|31', 'CP 2399 OX|', '2150 XC-9|', '596xoe|16'),
(1541, 'e732ec|76', 'eo7800ce|', '0095ae8|', '112hcy|11'),
(1547, 'b254ky|68', 'EA 6065 HH|', '3255 AA-7|', '709hot|17'),
(1549, 'o703kx|87', 'BP 8124 HA|', '5939 XK-1|', '097eax|12'),
(1552, 'c532bx|55', 'XA 2306 XP|', '5972 MM-1|', '233app|03'),
(1554, 'y623ye|38', 'pb7759xy|', '3927oa2|', '346kby|17'),
(1555, 'y819ta|22', 'yk6358bo|', '9695bt2|', '284pap|08'),
(1560, 'k020mb|60', 'OE 3313 YY|', '0888 HX-0|', '106teb|13'),
(1563, 'x310ek|55', 'BO 3437 BK|', '3858 TY-0|', '495eoo|04'),
(1566, 'k125ym|47', 'kk0000kk|', '8982ma0|', '240btt|05'),
(1574, 'c398oh|59', 'PH 9115 BX|', '7835 KB-7|', '320eax|02'),
(1575, 'm478xp|62', 'YM 6061 AO|', '5889 BK-4|', '414xoa|03'),
(1577, 'h539yx|32', 'HY 6457 AA|', '2871 CX-8|', '553bmm|08'),
(1579, 'e699cm|79', 'pa4041xy|', '6645oc4|', '166aek|10'),
(1580, 't339bo|64', 'TO 8465 HC|', '5379 OM-9|', '230tck|02'),
(1581, 'p501hy|15', 'TB 2635 HM|', '4498 BH-6|', '531opm|14'),
(1585, 'h163oo|31', 'TT 8657 HE|', '7514 BY-6|', '884hpo|15'),
(1586, 'k605he|46', 'et1010oh|', '7060ao2|', '024cpm|12'),
(1587, 'k184te|17', 'TB 6799 AE|', '7696 KY-9|', '587tyx|15'),
(1591, 'c335yy|46', 'XY 0932 KO|', '7988 PE-1|', '062xex|11'),
(1593, 'h323yx|28', 'HY 9188 AP|', '3985 XE-3|', '479ktp|17'),
(1598, 'o024pk|64', 'pt4586xh|', '9982ae5|', '625eae|17'),
(1601, 'a752ma|11', 'ak0309xh|', '4467hx8|', '437oam|05'),
(1602, 'p769py|93', 'MH 8743 XP|', '3154 YK-9|', '498xtb|17'),
(1603, 'k953to|68', 'MX 7333 OM|', '3233 EO-8|', '061xop|08'),
(1604, 'h991bh|49', 'AH 7924 YY|', '6954 KC-5|', '011pkc|03'),
(1605, 'e051oc|86', 'AH 5401 PH|', '1531 OT-6|', '930baa|14'),
(1606, 'b405tt|70', 'EK 7339 CE|', '3093 KB-6|', '010tbb|17'),
(1607, 'h334ph|31', 'by6137xp|', '6079am0|', '392ham|11'),
(1608, 'p088xy|70', 'OO 6201 AH|', '2485 EM-7|', '921cxk|10'),
(1609, 't742ck|53', 'TM 6949 YY|', '7703 AX-0|', '270mto|11'),
(1611, 'a114bp|44', 'YP 6701 TK|', '3811 TY-4|', '749oma|09'),
(1616, 'm354ce|11', 'KX 0107 XB|', '3104 AA-0|', '380ymp|17'),
(1621, 'k696xa|03', 'BX 5207 CX|', '2145 MB-2|', '444tbx|16'),
(1623, 't122hc|24', 'KT 3364 KX|', '2346 XH-0|', '835boe|02'),
(1626, 'x892mb|64', 'ET 3904 HM|', '5257 KP-7|', '064ykx|16'),
(1628, 'm253kc|26', 'ee8895ht|', '0095kk1|', '943ctp|03'),
(1649, 'e246xa|63', 'EX 6309 TO|', '1976 CT-0|', '716ybc|09'),
(1652, 'x384po|58', 'OC 8069 PE|', '9820 OP-4|', '703cea|09'),
(1655, 'e744pc|38', 'ob0923my|', '7879kt3|', '625chk|09'),
(1656, 'e790mc|79', 'TX 9247 TY|', '3868 BE-6|', '771hbt|04'),
(1658, 'a206oe|89', 'CC 0142 CO|', '1300 TT-1|', '447omb|15'),
(1661, 'x513yo|05', 'KP 7734 BX|', '5566ep9|', '227kbp|08'),
(1664, 'x177bb|88', 'at3798hm|', '9155hp1|', '576tct|13'),
(1666, 'p584xh|37', 'EC 9959 BA|', '8586 KA-0|', '677bym|06'),
(1667, 'o165yb|58', 'pm5927th|', '8131mc2|', '380ooh|10'),
(1669, 'b271cm|94', 'OH 9387 XC|', '1365 EE-8|', '292pxk|06'),
(1671, 'h969mx|90', 'CC 2502 EX|', '1858 TH-3|', '176mbt|11'),
(1672, 'o836hm|03', 'KT 6728 XE|', '4275 HO-8|', '038akp|11'),
(1675, 'b434ee|79', 'MX 8671 YY|', '9044 TB-8|', '772eba|02'),
(1681, 'x211xc|81', 'HC 4075 KB|', '1508 XY-8|', '823bhx|15'),
(1683, 'c357ak|40', 'co3026eh|', '0342kh0|', '185xce|13'),
(1687, 'k666ae|17', 'to1407oh|', '7402co2|', '073ath|16'),
(1689, 'a866kc|85', 'pe4112pa|', '1993tm0|', '136btb|14'),
(1691, 'y683ck|32', 'AC 4126 OK|', '3669 HM-9|', '253omm|13'),
(1693, 'o258bm|33', 'HT 5131 AA|', '1505 BB-1|', '491aak|12'),
(1694, 'y096ob|55', 'OY 8812 KY|', '2330 OE-8|', '765coa|02'),
(1698, 'x711cp|46', 'ko0852mt|', '5488ht1|', '472tmk|17'),
(1701, 'k816yx|29', 'tc5134mb|', '9491kc4|', '540emo|03'),
(1702, 'b886ah|07', 'OT 3128 PE|', '1721 CH-5|', '209kkc|06'),
(1703, 'e399xt|07', 'OO 5525 PK|', '9344 XX-0|', '789pma|04'),
(1705, 'x193em|31', 'OC 4201 TY|', '3429 TH-2|', '022eem|14'),
(1706, 'h518bt|16', 'TP 1581 BX|', '7955 MO-9|', '931mpx|09'),
(1708, 'h598hh|60', 'TT 1278 BK|', '2107 HY-1|', '181xey|02'),
(1709, 'e871tt|26', 'CO 6110 TB|', '0292 OB-7|', '687aoa|06'),
(1711, 'p494km|89', 'PO 0281 OX|', '5681 AT-0|', '930map|06'),
(1719, 'x948me|59', 'EY 3043 AB|', '7860 MO-7|', '905aom|03'),
(1720, 'm436tk|78', 'cb9420ya|', '6291ta2|', '021ymt|04'),
(1721, 'o093at|66', 'EO 7311 AC|', '3574 AC-2|', '166mco|15'),
(1722, 't655bm|12', 'YO 8901 OY|', '2671 HH-2|', '895hmo|09'),
(1723, 'h613tt|55', 'EA 7970 KK|', '4653 AX-6|', '976pym|06'),
(1730, 'm089ck|67', 'XC 6820 EM|', '1554 AY-9|', '706bye|03'),
(1732, 'x777ye|777', 'me2665oe|', '1045ec7|', '833akc|04'),
(1734, 'e450pe|29', 'PH 9569 KY|', '7309 XE-9|', '822mty|16'),
(1737, 'b379tb|48', 'hc8621ty|', '0802mh0|', '482och|12'),
(1738, 't552bc|16', 'CT 2867 OA|', '4046 YM-7|', '047tpe|03'),
(1743, 'p674xx|22', 'CT 3070 KE|', '9664 OE-6|', '708obh|05'),
(1745, 'o767ey|52', 'XT 3017 CC|', '5074 YC-5|', '621ehc|12'),
(1748, 'c219hc|11', 'BM 9229 HO|', '5698 XM-1|', '095otc|03'),
(1749, 'k882px|46', 'th6018xb|', '8265th2|', '757tbx|13'),
(1753, 'o360mh|24', 'cy7621kx|', '2430 KX-0|', '277mhm|07'),
(1755, 'b783tb|73', 'HT 8511 KC|', '0714 OO-1|', '952ctp|04'),
(1759, 'b087ma|64', 'KO 9038 AM|', '6387 EM-4|', '550oem|06'),
(1760, 'b207bm|21', 'ma0171oh|', '0802ek7|', '787cmh|06'),
(1767, 'k592kb|71', 'yo7119mh|', '8923ox2|', '471kxk|11'),
(1769, 'a827he|58', 'co9450kh|', '9555kx4|', '557tah|13'),
(1770, 'b152ee|59', 'HB 6527 TC|', '4133 YO-5|', '108keb|13'),
(1771, 'b203ob|34', 'HH 9972 CT|', '5191 EO-5|', '231bkt|02'),
(1772, 'a102my|22', 'BE 5281 PP|', '7977 HA-0|', '753ahp|06'),
(1773, 'e844ye|91', 'xe8188pk|', '5843xk7|', '921cey|11'),
(1775, 'y420kh|74', 'HA 1205 PK|', '1438 PK-1|', '194bka|11'),
(1776, 'h631ch|86', 'CA 6632 PT|', '3682 MP-4|', '848pax|11'),
(1780, 'b289ec|53', 'KB 0387 YO|', '3531 YO-9|', '435mek|06'),
(1786, 'b437he|23', 'HA 5775 KE|', '7605 PE-8|', '106byy|07'),
(1792, 'c617hh|50', 'EY 7755 TX|', '5823 KO-1|', '729coh|10'),
(1794, 'm963cc|19', 'ha1593yy|', '3429xa1|', '925xby|05'),
(1795, 'h047ye|17', 'AC 1904 KO|', '7835 KC-7|', '208bpp|10'),
(1804, 'k394pt|67', 'AA 9542 AC|', '0371 AC-9|', '567omk|16'),
(1808, 'o943yo|28', 'HB 1414 TM|', '6638 AM-9|', '081ymb|11'),
(1809, 'k749yp|81', 'xy9408yy|', '8788ha8|', '682kcp|16'),
(1810, 'e428ep|49', 'AB 9943 YC|', '3560 PE-1|', '081oac|02'),
(1811, 'p616mt|32', 'cm7071tc|', '7725xh7|', '366eap|14'),
(1812, 'y221yy|87', 'OE 0673 CM|', '7525 CY-7|', '370pxp|10'),
(1816, 'y758op|57', 'PH 8338 TE|', '5801 HC-4|', '554ybb|07'),
(1817, 'e000kx|00', 'MC 0797 AH|', '0882 CM-5|', '790aae|04'),
(1820, 'x133oe|15', 'tm0462oa|', '7241ct5|', '864kbk|02'),
(1821, 'y579xh|80', 'PM 5928 PY|', '7237 OT-4|', '352xta|14'),
(1822, 'x232ae|82', 'ca4898ma|', '9594cc3|', '846htk|10'),
(1823, 't561ee|56', 'ep0784ah|', '9831bb9|', '275eoo|12'),
(1824, 't458px|75', 'HY 4452 BC|', '6113kc4|', '031koo|12'),
(1826, 'k302ct|14', 'OM 2041 AT|', '5984 EC-6|', '322mbk|14'),
(1828, 'o354xa|53', 'PP 2518 BY|', '2325 CM-4|', '126ptp|12'),
(1829, 'b017am|60', 'PC 3301 BA|', '4854 YH-9|', '619oxp|13'),
(1832, 'h565ax|92', 'TT 7638 OE|', '5789 PK-8|', '299pap|15'),
(1838, 'k881bm|01', 'EM 3677 EM|', '6451 AX-9|', '294mme|06'),
(1839, 'k018cm|72', 'AC 2332 PC|', '2698 YY-7|', '558cbb|05'),
(1840, 'o000ao|000', 'KB 8382 XB|', '7708 YH-9|', '580tok|04'),
(1841, 'b668th|24', 'EE 2360 MA|', '9736 TT-2|', '897mom|17'),
(1844, 'p671mp|67', 'PE 4180 BY|', '0090 EH-8|', '087yex|01'),
(1845, 'o256ty|33', 'XA 8804 XX|', '0208 KO-4|', '290hok|07'),
(1846, 'x053bk|52', 'tt5084ox|', '6944pc8|', '710abc|05'),
(1849, 'y163xb|50', 'TA 1119 XK|', '6631 CA-6|', '212yyk|10'),
(1850, 't238op|58', 'KT 7691 BP|', '1285 PO-1|', '614oec|17'),
(1851, 'o879tx|11', 'kc8091ho|', '2947kt1|', '206apo|15'),
(1857, 'y566yb|26', 'BM 4713 BP|', '0096 HE-0|', '994ocp|02'),
(1861, 'a876tc|69', 'XK 0799 XP|', '0869 OY-4|', '238oxb|05'),
(1864, 'x851hb|29', 'ek1283pa|', '0233ky2|', '984kyt|05'),
(1867, 'm474xt|04', 'hx3138cp|', '0168tt1|', '803epm|12'),
(1868, 'a550ck|40', 'HE 3164 YK|', '9684 BA-7|', '892eoa|04'),
(1871, 'h894xm|73', 'EK 7544 MY|', '5686 XK-1|', '645cmx|02'),
(1873, 'o749eb|56', 'HK 1100 BA|', '3178 BC-8|', '083ect|08'),
(1874, 'p884ah|71', 'OY 1856 HE|', '7888 HE-4|', '718cxx|04'),
(1875, 'e737he|45', 'kh9743xb|', '2616ca2|', '693tpc|12'),
(1876, 'h959yx|35', 'mo3476ca|', '7788ot8|', '975pha|11'),
(1878, 'p315cx|25', 'CX 8160 YX|', '1931 AO-0|', '729bct|03'),
(1879, 'm605op|51', 'ob3809xk|', '3086xc3|', '317yby|05'),
(1880, 'b495xp|65', 'OY 9707 CT|', '9364 YP-7|', '861hay|13'),
(1882, 'a418ay|19', 'bt5166et|', '2499pt8|', '135kxc|04'),
(1887, 'p985cx|35', 'HX 3452 MB|', '5412 YH-7|', '463hox|03'),
(1893, 'h532pp|44', 'xb1387bk|', '8913me5|', '843bxe|09'),
(1894, 'b373am|52', 'ka2729xh|', '4581ct7|', '000ooo|00'),
(1895, 'm130ae|30', 'YT 1180 KB|', '6596 BT-7|', '218hhc|16'),
(1897, 'm008yp|45', 'PC 5002 CP|', '5337 PO-8|', '253aok|07'),
(1898, 'a382xy|66', 'TP 6441 MC|', '7524 YB-3|', '899cok|06'),
(1899, 'y266tb|35', 'PP 1698 CE|', '6571 OO-1|', '140mtp|02'),
(1900, 't845pa|85', 'MB 0243 TK|', '6968 OE-0|', '468ack|16'),
(1902, 't785bb|38', 'my8756cc|', '2525py3|', '952aka|02'),
(1904, 'b463mh|24', 'AK 7297 YX|', '2823 BK-1|', '547bch|16'),
(1907, 'y904oy|79', 'BM 1863 XP|', '6912 YK-0|', '356xpc|16'),
(1912, 'p883ye|17', 'KH 7817 HH|', '9688 EP-2|', '957chy|07'),
(1914, 'a363yx|27', 'OH 2118 BH|', '1023 MP-5|', '399txe|07'),
(1915, 'c499ak|74', 'HA 3102 HK|', '5915 YA-7|', '713ebb|05'),
(1917, 'p033po|50', 'CB 7431 HM|', '9572 EH-7|', '238mto|04'),
(1918, 'o496xo|66', 'ch2934yy|', '0816cy9|', '237xob|10'),
(1922, 'h563te|49', 'BB 3439 TK|', '0582 YX-5|', '416hhc|11'),
(1924, 'p396pp|90', 'MA 4171 EH|', '2864 YA-6|', '622cke|11'),
(1926, 'o590ae|64', 'ey5590ox|', '8502ma1|', '873eah|13'),
(1929, 't151bp|81', 'XT 7689 EH|', '9798 KH-8|', '010ayt|15'),
(1930, 'k837by|31', 'MY 3456 TB|', '8968 EM-7|', '616kak|01'),
(1932, 'o287ee|14', 'ta9209cy|', '6953ot4|', '771bcm|01'),
(1933, 'e541yp|13', 'PM 1369 EH|', '9593 EK-2|', '054xyh|01'),
(1936, 'x165hy|22', 'ak5860ae|', '5787om5|', '083mbo|06'),
(1937, 'p564mt|42', 'bt7839xy|', '2639yo8|', '295hoa|02'),
(1942, 'k067te|79', 'OX 5442 KC|', '1473 PP-6|', '337tbe|09'),
(1948, 'p341ke|20', 'TM 6371 KK|', '2404 OA-7|', '802ctc|13'),
(1950, 'm291ke|05', 'ME 9188 BC|', '1075 AM-2|', '840aya|11'),
(1953, 'c504xe|32', 'HH 5326 EO|', '0948 PP-8|', '013mxy|12'),
(1954, 'k038yk|93', 'BB 1633 TA|', '8943 YP-7|', '516cpb|08'),
(1957, 't001hb|76', 'yk7197hp|', '3078at8|', '433atk|10'),
(1958, 'o142yt|18', 'XH 7530 CY|', '3023 BH-3|', '479ymx|07'),
(1960, 'x099yk|90', 'bp7803ac|', '2454hh5|', '966kbe|09'),
(1961, 'a219pm|65', 'hp2110oo|', '6516mk6|', '457eac|08'),
(1962, 'c513pa|81', 'XM 9325 BM|', '0362 AA-2|', '101mot|02'),
(1964, 'k366ae|68', 'EE 4808 YE|', '5026 CT-4|', '512tkt|04'),
(1965, 'e468me|11', 'KE 4446 YO|', '7756 HM-9|', '901bxm|15'),
(1967, 't875tx|58', 'to7390km|', '7525oy7|', '022mkk|05'),
(1968, 'e907ck|13', 'BO 8999 OX|', '2069 PM-8|', '357bma|16'),
(1970, 'c667hh|73', 'yo9051bx|', '2960pt5|', '278hth|11'),
(1971, 'o192bp|10', 'ET 3878 CO|', '2264 MC-7|', '824mhe|15'),
(1973, 'm874ob|75', 'eb1912tp|', '9274ch3|', '212cca|14'),
(1977, 'h123pt|41', 'OP 7539 BH|', '7370 KK-5|', '563kap|09'),
(1980, 'm511ty|03', 'AP 7935 HK|', '8767 EK-3|', '525etm|08'),
(1981, 'b475bb|24', 'xh8697th|', '6061ho2|', '434cep|06'),
(1983, 'e018my|54', 'mk6241am|', '1225ex0|', '798ymp|10'),
(1984, 'k835ym|22', 'XH 9819 AH|', '0791 PE-7|', '058xeh|08'),
(1987, 't649xo|77', 'BB 6241 KC|', '9508 HX-2|', '610ptm|02'),
(1988, 'x812yk|34', 'KE 4563 YM|', '9537 OY-1|', '321kyk|10'),
(1990, 't590tk|61', 'ka0596yy|', '4629ym1|', '662opx|12'),
(1995, 'x274ok|83', 'KA 2290 HO|', '8786 TE-3|', '032axa|10'),
(1996, 'p292he|48', 'ha6903ek|', '1520ht2|', '765mbk|14'),
(1998, 't868yx|41', 'EB 3513 KO|', '8249 CC-3|', '788yck|12'),
(2004, 'p136pm|31', 'KH 8436 MY|', '3815 OK-9|', '841phy|03'),
(2008, 'y116mt|75', 'CP 6351 ET|', '2148 HT-4|', '834pot|16'),
(2009, 'o921xm|15', 'hp5608tk|', '1081om4|', '573hkk|16'),
(2011, 'x147ep|02', 'EB 6480 OH|', '7799 OK-9|', '113mte|11'),
(2012, 'e112ab|13', 'TB 3762 KH|', '4658 MO-4|', '679cop|11'),
(2016, 'a210yb|70', 'XE 3582 HP|', '4865 CY-9|', '785mkc|02'),
(2023, 'e810be|77', 'yo4303yy|', '0879kb0|', '948kyx|03'),
(2025, 'y091bc|07', 'AE 7314 BK|', '0651 XA-2|', '526bcp|15'),
(2029, 'c270by|68', 'bm3341eh|', '5484cb1|', '811hok|04'),
(2033, 'k397mc|47', 'KT 5852 TE|', '7784 YY-2|', '567mba|05'),
(2035, 'm330pc|24', 'CK 4690 KB|', '5366 BK-9|', '225txm|03'),
(2036, 'a498bp|12', 'km1723ek|', '0276bt1|', '370yee|13'),
(2037, 'h638xm|88', 'OP 6954 CK|', '2282 HP-4|', '445ppm|03'),
(2038, 'b378oy|40', 'XT 8337 XY|', '1161 EX-2|', '001cat|06'),
(2046, 'k312ym|19', 'te3135ax|', '1575cp5|', '727tco|02'),
(2048, 'm308xa|19', 'XY 2712 KH|', '2449 XY-0|', '627mmk|04'),
(2049, 'p891kp|80', 'BC 7068 HH|', '9758 AA-2|', '037xkx|16'),
(2050, 'p437mc|54', 'MM 1289 EM|', '0469 PA-0|', '770hob|09'),
(2052, 'h626hp|79', 'EM 8550 CX|', '0684 PY-8|', '066exh|09'),
(2053, 'p067ek|47', 'KT 3798 TC|', '4564 CB-8|', '656ppa|04'),
(2056, 'h466ec|32', 'AH 0383 OK|', '1541 XH-1|', '939pmb|13'),
(2058, 'a633cc|64', 'MX 6996 EE|', '7623 XY-5|', '614hxe|05'),
(2061, 'c493ec|03', 'OH 1426 OY|', '4425 TB-5|', '134tyy|02'),
(2062, 'e081ah|17', 'pt9257ae|', '4372yk6|', '920xmy|10'),
(2064, 'b463bx|30', 'tc0600ec|', '1959to6|', '913phx|06'),
(2073, 'k894yk|19', 'KY 1779 XA|', '2721 HY-2|', '154ohk|08'),
(2075, 'h809ph|08', 'xt3575tt|', '1932ee6|', '135pky|06'),
(2078, 'b635eb|19', 'EY 4508 YO|', '1749 CX-9|', '468ckt|01'),
(2079, 'k626py|77', 'XP 4265 PP|', '8586 MY-6|', '659cyc|10'),
(2081, 'a495am|24', 'XH 5174 KA|', '0880 OC-5|', '467yxc|01'),
(2082, 'k977kx|49', 'EK 3651 PA|', '0949 TB-0|', '253eka|16'),
(2083, 'b822ex|47', 'YH 3527 KP|', '3666 XO-6|', '486poa|08'),
(2086, 'x013cc|94', 'KH 8515 EE|', '4150 KA-0|', '473tky|14'),
(2089, 'y344tb|52', 'ao2399ma|', '6600tp6|', '097oko|12'),
(2090, 'y107ck|90', 'hy3815ha|', '7365th2|', '231ybe|14'),
(2091, 'y436pb|56', 'CP 6510 EE|', '9413 CA-9|', '007hah|02'),
(2092, 'k964he|44', 'te6036cb|', '5512ec4|', '837xep|16'),
(2094, 'y194ph|92', 'ht6973xc|', '5204tt4|', '904kxy|12'),
(2096, 'e364yc|71', 'KB 0986 EO|', '9005 TH-1|', '952oym|12'),
(2098, 'o708xt|55', 'ma4838he|', '7041at2|', '836mkp|07'),
(2100, 'e714mk|49', 'mc0997ch|', '3574pa0|', '794koy|10'),
(2102, 'y415oh|04', 'ox9452yp|', '8239kh3|', '873box|08'),
(2103, 'o571kc|86', 'ph3087ta|', '0178kb6|', '065mkk|03'),
(2104, 't126tx|25', 'CA 2763 KE|', '9728 HA-5|', '143cxh|01'),
(2105, 'c601hm|69', 'MX 0054 MA|', '2754 XX-9|', '142mko|10'),
(2106, 'e657xb|45', 'YX 3421 TP|', '3356 TA-2|', '105oxx|16'),
(2113, 'e296tp|83', 'AA 7494 BK|', '7012 YE-3|', '229coo|04'),
(2114, 'x298ae|46', 'pe3612ah|', '2857he1|', '017hyo|02'),
(2115, 'o970eo|10', 'TP 7381 TA|', '9526 BA-3|', '897cpa|03'),
(2117, 'x059em|40', 'XX 2321 XB|', '2855 KE-0|', '269yak|16'),
(2118, 'e576me|74', 'yp9410xt|', '6310mm6|', '492yoh|14'),
(2119, 'c806oy|35', 'CP 0251 MT|', '4421 KB-0|', '777toh|03'),
(2120, 'm818bk|71', 'EY 9938 YM|', '3294 XT-4|', '166hxp|10'),
(2122, 'y112ky|20', 'ET 1219 TE|', '0307 AC-2|', '717axo|05'),
(2123, 'c419ax|87', 'EK 5865 BP|', '9250 EO-3|', '577ttc|08'),
(2124, 'c174my|51', 'yc6464ok|', '1099xe9|', '117oat|08'),
(2125, 'h721ae|29', 'th4976ac|', '5422xo6|', '332kay|02'),
(2126, 'y438ok|72', 'HM 2897 MX|', '4586 YH-6|', '413bhx|03'),
(2127, 'o501ye|63', 'OC 9928 KC|', '9063 HK-2|', '506ceo|16'),
(2135, 'm073am|34', 'pc5117xa|', '2021at7|', '758mhb|01'),
(2137, 't497bo|83', 'AE 4575 ET|', '6315 CM-8|', '129pxb|03'),
(2168, 'a248mb|07', 'EO 8737 YA|', '9982 YC-8|', '492peb|14'),
(2244, 'm462ha|35', 'OX 7694 EK|', '2722 PA-5|', '076hoa|09'),
(2246, 'm438ym|74', 'OH 5876 PA|', '4060 KY-4|', '107yam|10'),
(2247, 't248ax|24', 'TP 1535 MB|', '1603 MH-2|', '263oxx|05'),
(2248, 'h946te|61', 'HY 6015 CA|', '9422 PO-1|', '603mtc|11'),
(2252, 't287ke|80', 'KM 7302 BM|', '7707 OE-7|', '273xhe|10'),
(2254, 'b227yy|58', 'BB 6072 XA|', '3562 PB-4|', '772tbo|04'),
(2255, 'y992eb|56', 'OT 5931 EC|', '3431 TE-9|', '802yyx|04'),
(2264, 'p702bp|92', 'YY 0626 ME|', '9451 OO-2|', '211hyk|04'),
(2266, 'h589oc|39', 'MH 1404 MP|', '6115 BC-7|', '221phc|02'),
(2267, 't382kk|59', 'XT 8781 OM|', '7808 MC-2|', '526ook|10'),
(2268, 'o000oo|12', 'tt0881xm|', '3372mh7|', '439cyp|16'),
(2269, 'b224pe|03', 'YM 5781 PM|', '8192 BY-3|', '136kea|16'),
(2270, 'k514bb|20', 'tx1718ym|', '2212mh7|', '175eaa|11'),
(2271, 'c014hm|55', 'am1204hm|', '2987me6|', '522koy|09'),
(2272, 'b057cm|08', 'CO 2311 XK|', '7340 KH-8|', '235xht|08'),
(2273, 'y432cb|21', 'BO 0884 KE|', '7166 KO-7|', '583kok|06'),
(2274, 'b937ox|86', 'ya6774xt|', '4523hh4|', '259tpa|03'),
(2275, 'b295bk|46', 'AE 6344 OE|', '0994 TA-6|', '393pho|09'),
(2279, 'c102ct|76', 'hb7726ch|', '3482yt1|', '679txx|17'),
(2280, 'c512ax|46', 'YC 3571 CC|', '1224 BT-0|', '683pbb|08'),
(2281, 'c199ec|79', 'hk1317ta|', '6436hm2|', '262yby|10'),
(2282, 'b562bx|83', 'PT 1994 YH|', '4804 HM-1|', '269mpx|07'),
(2283, 'm903am|04', 'tx8669mm|', '8932ab9|', '817mce|14'),
(2284, 'o000oo|11', 'bp5073pm|', '2995am6|', '902ykm|16'),
(2285, 'k826ae|28', 'ac6870bm|', '4553tm4|', '189pok|09'),
(2286, 'y777cm|58', 'OX 0204 MP|', '1027 PP-4|', '810khx|14'),
(2287, 't328ta|62', 'XP 9717 YX|', '0667 HM-9|', '787ypb|03'),
(2288, 'y978ke|47', 'mo2844eb|', '6224py3|', '526bpp|13'),
(2290, 'p848yb|22', 'MK 7252 XM|', '3929 HE-2|', '750kxh|14'),
(2291, 'o881ex|68', 'AB 2447 XH|', '4569 HE-2|', '614och|16'),
(2292, 'a549xb|87', 'EA 4319 KC|', '3836 EO-2|', '881ytc|02'),
(2294, 'a548pp|30', 'CY 4820 XB|', '0682 HA-9|', '594htx|01'),
(2295, 'c140hb|50', 'cy2922ob|', '2946xy8|', '264ebo|08'),
(2296, 'm298pp|16', 'XX 1881 HP|', '8244 YE-4|', '371ytb|10'),
(2297, 'a626xe|77', 'XT 7989 OE|', '5210 OK-5|', '912obc|08'),
(2298, 'k828ae|50', 'CA 1711 OH|', '8206 AC-3|', '673yxk|08'),
(2299, 'e380oa|11', 'CH 9996 KK|', '0954 AP-4|', '593mck|09'),
(2301, 'p733xe|13', 'ph0790hm|', '7175tm5|', '424bkp|07'),
(2303, 'h252ba|28', 'OX 8708 OK|', '5847 OT-0|', '969pyc|04'),
(2304, 'c445tm|92', 'AE 6132 AC|', '6594 HC-7|', '706txy|04'),
(2305, 'c038ma|46', 'MO 3120 XY|', '4866 XP-4|', '977byy|07'),
(2307, 'p550kh|06', 'ab3728tb|', '5440hp7|', '967xac|12'),
(2308, 'x902bm|12', 'KB 8400 YT|', '4663 XK-8|', '186kbe|14'),
(2309, 'k236bm|49', 'BT 5475 MA|', '6162 HB-2|', '083cby|17'),
(2311, 'm553km|03', 'MT 3489 TE|', '9295 TH-9|', '203yom|15'),
(2312, 'h348cy|10', 'KA 4487 YK|', '8702 HO-4|', '807tcx|06'),
(2313, 'k733mh|07', 'TX 2306 HE|', '4971 ME-4|', '234ept|02'),
(2314, 't132kk|71', 'OC 8109 XH|', '2425 BT-4|', '301xoh|12'),
(2315, 'k324ht|46', 'BT 4539 YO|', '6999 CB-2|', '668tct|03'),
(2316, 't587th|46', 'OC 3657 CM|', '9236 CX-1|', '034kaa|05'),
(2317, 'y502ok|94', 'BB 1968 KC|', '5298 BP-2|', '844aeb|14'),
(2318, 'e633em|34', 'HP 9596 KP|', '9691 AT-6|', '134hhb|01'),
(2319, 'p331me|22', 'HE 1312 AX|', '5204 EC-4|', '337poh|04'),
(2320, 'o419yc|78', 'MC 7804 EC|', '9778 YY-9|', '419ppe|09'),
(2321, 'p026hk|39', 'ka4882eo|', '8243mt3|', '432bch|09'),
(2322, 'x457pe|36', 'et3904kp|', '3742ot0|', '546xyx|16'),
(2324, 'a992bh|70', 'TH 1448 OO|', '9999 OT-4|', '109ktx|11'),
(2326, 't922cm|16', 'ME 9303 AX|', '0871 AX-6|', '712ktx|04'),
(2327, 'a696yb|70', 'PE 4247 CT|', '4267 OP-5|', '619apk|10'),
(2328, 'o085yt|66', 'XH 8020 HH|', '9055 OX-0|', '441cee|12'),
(2329, 't833oy|92', 'EM 6052 CE|', '4901 XM-3|', '090tmo|17'),
(2330, 'e604mh|54', 'CB 4877 MY|', '5437 AE-2|', '201aot|17'),
(2331, 'k907py|46', 'PB 1770 TM|', '3915 AK-5|', '621eyk|06'),
(2332, 'k994eb|55', 'pt7971ca|', '8905ox2|', '689tbb|12'),
(2334, 'a969mt|46', 'TK 6434 XH|', '0999 AP-3|', '097tmh|15'),
(2335, 'h092ph|53', 'CY 1107 KA|', '4793 EX-6|', '038eox|01'),
(2336, 'p471bt|60', 'PC 9330 BP|', '9928 OO-8|', '096ehc|13'),
(2337, 'a061ky|91', 'xe2105eb|', '5537mm5|', '740pbk|17'),
(2339, 'c437ch|80', 'om9579cm|', '1945cb3|', '151tmm|15'),
(2340, 't364et|31', 'bb5409tx|', '7451mc7|', '592hhy|10'),
(2341, 'o288yx|25', 'ct8189ea|', '2635ek8|', '576ohy|16'),
(2342, 'k076kt|44', 'ch5836kt|', '3905ba5|', '475ota|02'),
(2343, 'a276ab|86', 'CB 1228 CY|', '0760 YM-2|', '390kyk|06'),
(2344, 'o551yo|87', 'OH 9433 TT|', '2921 XK-1|', '153oke|07'),
(2346, 'h531ph|93', 'BM 0866 OT|', '4396 CC-4|', '771kap|09'),
(2347, 'b198ek|77', 'oc1608me|', '5339ok3|', '470eky|16'),
(2350, 'm931kb|67', 'KO 7610 YC|', '1222 PA-4|', '913hte|15'),
(2351, 'b894hp|15', 'XY 9047 MK|', '9487 PA-8|', '076ybx|03'),
(2353, 'y509tm|32', 'BY 1966 TT|', '6160 OB-8|', '644eat|08'),
(2354, 'e108tb|34', 'OO 1861 CY|', '8863 PT-6|', '793xee|15'),
(2355, 'h903ab|45', 'OB 3547 KK|', '6737 OP-8|', '326pcx|04'),
(2356, 'h093ae|26', 'MX 2521 ME|', '1490 YC-2|', '025mxe|15'),
(2357, 'h558hx|42', 'CB 0853 BP|', '4478 HE-4|', '475cyk|02'),
(2358, 't756mt|22', 'MK 7318 KE|', '0726 OP-8|', '743ecm|08'),
(2359, 'k277ma|67', 'hb1122oy|', '5339yk4|', '576otb|08'),
(2360, 'p863ho|07', 'EO 4950 BT|', '2731 KK-2|', '710pxx|07'),
(2361, 'm753ph|77', 'XH 6369 CM|', '5980 AH-6|', '040tcp|05'),
(2362, 'k743tb|72', 'kh4762to|', '9727cb3|', '141oyy|14'),
(2363, 'o104eb|07', 'XM 2511 PE|', '1752 BP-7|', '519xom|08'),
(2364, 'b580tc|57', 'MK 4156 PC|', '7611 XH-7|', '657bom|10'),
(2368, 't002xp|72', 'bc3975ch|', '1853yp4|', '370okb|15'),
(2369, 'k898te|21', 'BC 1026 YY|', '6725 YY-8|', '522kbo|07'),
(2370, 'o557mx|30', 'OA 1429 MA|', '2296 KM-3|', '914bta|14'),
(2371, 'y229pe|71', 'xc3692ho|', '3588ph0|', '456ebm|12'),
(2372, 'p061ce|33', 'xx0899tc|', '9547tm8|', '198mkx|08'),
(2373, 'o108yy|78', 'tt1593py|', '8459he2|', '710eeo|02'),
(2374, 'y526kp|63', 'my5920ce|', '2716op8|', '156mhm|14'),
(2375, 'h491tm|50', 'mk9565ka|', '9698yx1|', '294eoh|05'),
(2376, 'm182mx|42', 'tc1817px|', '6394co7|', '297hpm|08'),
(2377, 'c283mm|41', 'TT 3627 YA|', '4360 CH-9|', '295thc|02'),
(2378, 'b518ap|56', 'OC 5255 PT|', '4342 TY-8|', '046mam|09'),
(2379, 'b226po|54', 'OK 1485 TB|', '6954 YE-7|', '740tmc|01'),
(2380, 'm802eo|38', 'hh8972co|', '9750yc4|', '795hct|12'),
(2381, 'b487ko|50', 'AX 3897 TB|', '4823 OX-3|', '156yeh|10'),
(2382, 'e962kh|29', 'BP 6897 HE|', '6721 HX-1|', '262oae|09'),
(2385, 'x720mx|55', 'AP 9631 OH|', '9722 EE-2|', '424bph|07'),
(2387, 'o970ep|63', 'ET 6168 HT|', '1522 EC-7|', '546tbo|12'),
(2388, 'y562ca|05', 'BB 7760 OA|', '5295 EO-2|', '373tpp|02'),
(2389, 'h192mm|20', 'HT 9805 KM|', '1741 HA-6|', '462kat|14'),
(2390, 'y081ba|33', 'BA 7567 OC|', '8881 PB-3|', '067mae|14'),
(2391, 'm568ht|87', 'yk9576ta|', '7227ch5|', '169cee|16'),
(2392, 'c791at|40', 'OY 4667 EO|', '3246 AB-2|', '481hhx|03'),
(2394, 't220hx|29', 'YX 0365 BY|', '7773 CP-9|', '834ayp|04'),
(2397, 'h495pb|40', 'HH 9636 YM|', '4980 TA-2|', '005xoh|11'),
(2399, 'p108bt|19', 'HT 0751 MM|', '7043 PB-8|', '472xeh|15'),
(2402, 'a653at|51', 'XC 2970 EM|', '4806 ME-4|', '995tkb|06'),
(2403, 'k055bb|17', 'PK 9643 CT|', '6435 AA-9|', '044ocy|16'),
(2405, 't232be|13', 'oc3186oa|', '5587mm3|', '610kxt|17'),
(2406, 'a670bk|20', 'tk5497kt|', '1612ha9|', '184ooo|07'),
(2407, 'y362ah|82', 'XM 8394 BP|', '6381 PY-8|', '845bky|13'),
(2408, 'x379ak|18', 'OY 7691 TC|', '9180 BE-6|', '668tyc|17'),
(2409, 'c275om|80', 'pk3466py|', '6667ay1|', '660bat|06'),
(2411, 'o249cp|42', 'KM 2179 AY|', '4391 CY-2|', '402bkh|09'),
(2413, 'a624pb|94', 'kx6258ke|', '0936ky9|', '652yaa|02'),
(2414, 'p902yb|01', 'MC 5796 EH|', '8611 MP-9|', '493kko|12'),
(2415, 'p785aa|08', 'XO 4129 CA|', '6602 TO-4|', '498ytt|13'),
(2416, 'k634pp|48', 'BB 2856 HO|', '2637 AO-4|', '679oko|17'),
(2417, 'm628hx|23', 'PB 7129 XE|', '7407 XC-4|', '152xca|11'),
(2418, 't431xa|75', 'xk7337xa|', '5778yb3|', '526phh|10'),
(2419, 'k494ka|07', 'CB 2283 YX|', '6746 CH-2|', '213ybe|05'),
(2420, 'm037bm|32', 'by6124tb|', '1999ah4|', '347hmm|09'),
(2422, 'm646yh|42', 'oh8468kc|', '0748ox5|', '777pco|05'),
(2424, 'm918bt|93', 'YE 2961 AO|', '9412 HK-2|', '854pyt|08'),
(2425, 'b528bx|56', 'ak3885oy|', '9902pk3|', '508obt|05'),
(2427, 'o622yk|61', 'TB 2871 TK|', '6784 TX-6|', '714yhb|12'),
(2428, 'a065yk|48', 'ot0902pm|', '1163ox3|', '609emx|13'),
(2429, 'a265eb|37', 'xy8776oo|', '7096pb3|', '243akp|01'),
(2430, 'x878ka|93', 'yb9069ba|', '6218ox5|', '188xey|05'),
(2431, 'e643ao|81', 'cc7538hy|', '0458tb2|', '165tax|11'),
(2432, 'a959ym|50', 'AC 0733 KK|', '8131 MT-6|', '274beo|15'),
(2433, 'b348ak|66', 'MB 2710 CE|', '2860 CK-5|', '002oek|01'),
(2435, 'c180ao|66', 'OP 4550 BC|', '5317 PC-6|', '974kyk|17'),
(2437, 'p337ko|24', 'MX 9904 HP|', '6109 BT-8|', '838cko|14'),
(2438, 'x821xc|48', 'HE 1990 KO|', '6952 KC-1|', '123tec|05'),
(2439, 'a626kt|29', 'ea7751oe|', '1924be6|', '540yhh|11'),
(2440, 'e655ao|03', 'hx3595ex|', '7017pe2|', '722mmt|17'),
(2441, 'b611aa|66', 'XY 0794 MM|', '6926 YM-9|', '513tca|13'),
(2442, 'h296mc|32', 'XM 5892 ET|', '4071 CC-8|', '737bho|11'),
(2443, 'k274hh|05', 'YB 4247 YT|', '7472 XP-5|', '420ect|01'),
(2444, 'm506eh|31', 'EP 4077 YO|', '8629 MT-7|', '597ptk|11'),
(2445, 't809me|82', 'HA 5616 MM|', '8656 CE-6|', '870epo|14'),
(2450, 'o576yh|39', 'ee6283po|', '4874tx4|', '175hhm|11'),
(2452, 'b230et|29', 'ME 5991 HK|', '0381 AX-6|', '537xma|06'),
(2454, 't004mh|69', 'km7315tb|', '3746kp9|', '800ykc|08'),
(2463, 'a747yy|53', 'CO 9097 OX|', '9206 AK-4|', '295akc|07'),
(2464, 'e775oe|25', 'PM 0519 TC|', '0519 BA-7|', '103kpc|05'),
(2465, 'o203mk|83', 'ea6338mp|', '5585cy0|', '611pkk|01'),
(2467, 'y124yo|33', 'KA 0128 EP|', '2505 KX-0|', '313yao|05'),
(2469, 'p360xh|01', 'xe2764bh|', '3536xy5|', '859bbo|11'),
(2471, 'b004et|63', 'eh4474cx|', '4605ay5|', '136pey|15'),
(2472, 'p231by|12', 'bo7039om|', '3939ep9|', '178omo|16'),
(2473, 'y325cc|69', 'ko0026yk|', '2152ba0|', '025yca|04'),
(2474, 'm596pa|38', 'cb1781ce|', '1946ec9|', '370aoe|13'),
(2475, 'c861ex|57', 'CA 8379 HP|', '5125 XE-8|', '307hyp|01'),
(2476, 'h276tk|71', 'OO 3098 OP|', '2549 AT-8|', '102teo|10'),
(2477, 'p220hb|59', 'BA 7820 AY|', '7384 AT-1|', '189cpo|09'),
(2478, 'o886ya|81', 'OB 6952 AX|', '8571 CC-3|', '205hmo|16'),
(2479, 'y618pe|49', 'XB 2284 PH|', '2819 OA-1|', '093xxx|06'),
(2480, 'm937bo|60', 'oy8152ph|', '7046xh5|', '754xmb|04'),
(2481, 'c167ek|26', 'KM 0846 HB|', '6427 KB-3|', '089xhh|03'),
(2482, 'p528po|77', 'YA 2231 BY|', '3480 YX-5|', '676aec|01'),
(2483, 'x219ep|72', 'mc4535ha|', '4099cb0|', '329heb|10'),
(2484, 'e490oc|24', 'MM 8830 OH|', '7607 AO-0|', '005che|16'),
(2485, 'a765ab|18', 'ET 2532 KX|', '7186 EC-2|', '733tbp|03'),
(2486, 'x488ca|06', 'BX 4790 CA|', '0461 EO-3|', '907ayh|12'),
(2487, 'h924kp|43', 'ot9199ho|', '4091kt9|', '860chx|04'),
(2488, 'k497xb|53', 'XT 1129 TE|', '7364 AM-2|', '363yxc|15'),
(2489, 'o154oh|28', 'XX 6736 KO|', '5684 CC-9|', '971coe|16'),
(2490, 'p518yx|01', 'CA 2367 CK|', '4818 EA-7|', '247cax|05'),
(2491, 'k135xk|15', 'ba4633bx|', '4091ko6|', '498hxh|16'),
(2492, 'm685ht|42', 'CO 2265 MY|', '0673 MO-8|', '602hhc|14'),
(2493, 'x084oh|38', 'pb3756mp|', '4525kh1|', '850aho|13'),
(2495, 'k153km|15', 'OY 2686 TC|', '0182 CE-7|', '186kah|06'),
(2496, 'b999eo|14', 'AM 0847 PH|', '8079 TE-4|', '566htb|15'),
(2497, 'o101pb|29', 'XP 3074 EO|', '8478 MX-4|', '363ctc|13'),
(2504, 'y374po|73', 'YO 0459 TX|', '7376 OB-7|', '684eep|02'),
(2505, 'c554ox|94', 'PY 2488 YT|', '3512 KK-8|', '670emk|15'),
(2506, 'y043eh|37', 'YM 3673 BK|', '0022 XH-3|', '818kbe|13'),
(2507, 'o707kb|67', 'MC 4759 CH|', '8751 CE-8|', '028epy|16'),
(2509, 'x139ok|60', 'YE 0579 AY|', '7355 HY-3|', '343hmx|02'),
(2510, 'o355tc|06', 'EY 2910 YK|', '0171 AH-4|', '474ebt|08'),
(2511, 'h538ba|46', 'CE 4431 XA|', '1206 XX-5|', '659taa|16'),
(2512, 'h922km|53', 'ok8478km|', '6504aa8|', '445ext|17'),
(2514, 'c930bt|80', 'XC 0715 OK|', '6943 BX-1|', '909pyy|05'),
(2515, 'x898mh|04', 'ae4632xt|', '3676xy0|', '238btt|02'),
(2516, 'a233tb|49', 'bt1635eh|', '5700kb8|', '507pto|16'),
(2517, 'p061pt|78', 'EX 4869 AO|', '2695 TK-9|', '549tey|04'),
(2518, 'o156xh|23', 'HM 3166 CC|', '3020 BB-4|', '106mcp|06'),
(2519, 'h904pc|78', 'KX 0610 ET|', '3900 AA-9|', '421koo|09'),
(2522, 'a892at|34', 'MM 2354 OK|', '8420 BO-6|', '916php|08'),
(2523, 'y804cm|56', 'KM 1632 KA|', '1188 TX-5|', '411oxo|07'),
(2524, 'c175xm|20', 'XT 6057 YA|', '0452 HA-2|', '414yhy|04'),
(2525, 'h682ek|79', 'KH 7222 EE|', '7232 CK-5|', '167thy|06'),
(2526, 'b236mx|29', 'bc6804pt|', '9554ka7|', '266tmy|08'),
(2527, 't529kb|47', 'tm1881oh|', '2687kx8|', '953oby|06'),
(2528, 'b282mb|24', 'AK 6144 XC|', '2869 EC-1|', '842okk|15'),
(2529, 'x502ty|49', 'BA 9802 TC|', '1841 AP-4|', '512kye|05'),
(2530, 'h786mh|40', 'KK 4961 EY|', '1794 CP-6|', '857keh|09'),
(2531, 'p838ba|85', 'MP 1284 CC|', '7283 XE-7|', '572omt|10'),
(2533, 'h409ce|32', 'XC 7971 XE|', '6350 OT-2|', '925pat|03'),
(2535, 'h876eb|64', 'OO 0099 AT|', '1340 KA-8|', '045cbp|10'),
(2536, 'y751ho|24', 'be4098ky|', '2061hp2|', '567yhm|17'),
(2537, 'h173ea|89', 'XB 1798 YM|', '2300 AB-5|', '565yhp|09'),
(2538, 'h810kx|82', 'co2310ec|', '0834em5|', '239eox|10'),
(2539, 'c901ky|44', 'OK 9162 CY|', '4352 KB-4|', '779xhm|15'),
(2540, 'o416ca|04', 'KA 9513 BM|', '5368 AP-4|', '947ccy|16'),
(2541, 'a951hp|18', 'HM 9868 AE|', '6087 TO-6|', '122phc|03'),
(2542, 'p096eb|52', 'AM 3867 YH|', '2770 BP-3|', '021amc|17'),
(2544, 'x785bk|61', 'HK 2089 CH|', '8709 XO-5|', '576tky|01'),
(2545, 'm046yp|49', 'hh0533ah|', '5281hh0|', '490ohx|04'),
(2546, 'a704ae|21', 'xx5004eo|', '1938mc1|', '947aoe|15'),
(2547, 'a473bc|25', 'ee1896pm|', '4899xy9|', '543xbc|07'),
(2548, 'k659ot|79', 'TT 1731 BE|', '3865 TM-8|', '695hyx|09'),
(2549, 'x467ot|06', 'et3610xe|', '0735pk6|', '201eyc|06'),
(2550, 'm319ex|48', 'KT 8531 PA|', '2420 CT-5|', '399bpp|14'),
(2551, 'p216ao|93', 'OO 7025 CM|', '7142 YO-6|', '567oeh|12'),
(2553, 'y347eo|04', 'mb2819my|', '2543ey3|', '894xhx|16'),
(2554, 'p434bp|31', 'KP 8677 KH|', '8325 BK-2|', '537eby|04'),
(2555, 'h437mt|48', 'cc9417hx|', '6711ap2|', '905xpb|09'),
(2556, 'm533px|70', 'ee8532mb|', '6423pk0|', '070yyy|02'),
(2557, 't309yh|64', 'cy1489bh|', '4891ba5|', '628pkt|10'),
(2559, 'p958bt|38', 'TA 1082 PT|', '2027 YO-7|', '711oom|15'),
(2560, 'b442ab|22', 'MH 6946 PY|', '2213 TA-2|', '600kya|03'),
(2562, 'a980ma|75', 'ME 8125 XE|', '2071 TK-0|', '321oxk|17'),
(2563, 'o138co|42', 'xt3297aa|', '1925ka4|', '998pch|07'),
(2564, 'e626ko|76', 'EP 4145 KB|', '1834 TM-7|', '904pab|11'),
(2565, 'a058ym|64', 'AH 3952 MT|', '7883 AO-8|', '273kyc|09'),
(2566, 'o520mk|79', 'CA 2974 CA|', '0377 HM-4|', '244ahb|16'),
(2567, 'y503ex|35', 'xh0462ec|', '7287eb2|', '048exc|07'),
(2568, 'c712tk|62', 'PE 7750 AX|', '8590 PX-5|', '328tme|17'),
(2570, 'o879ph|01', 'bp2763mm|', '0765mp9|', '323kxk|10'),
(2571, 'k588mb|67', 'YA 6135 OM|', '7916 EC-4|', '957aeh|12'),
(2572, 'b370ba|12', 'MH 7893 ET|', '5716 OY-6|', '651aye|01'),
(2573, 'b940mc|28', 'HY 4727 TP|', '5277 EC-3|', '563kmo|09'),
(2574, 'a240mc|54', 'tk3391oo|', '4134ho0|', '244bha|09'),
(2575, 'y853pt|08', 'TB 3461 CT|', '0577 PA-3|', '778obb|08'),
(2576, 'h188ae|84', 'ea8948tt|', '5146ae2|', '779ymx|04'),
(2577, 't991mx|10', 'BH 6789 PK|', '9959 CP-7|', '482oyt|15'),
(2578, 'p994tt|20', 'AX 5222 OY|', '8884 TM-7|', '588pmm|09'),
(2579, 'k798yx|42', 'ph8328kt|', '0601pm7|', '113kym|09'),
(2581, 'a756cx|11', 'YX 7625 AE|', '0896 EO-6|', '764ook|01'),
(2582, 'b111yb|25', 'XC 0342 TC|', '4512 XO-5|', '464tpc|03'),
(2583, 'm416ep|70', 'KH 3852 TE|', '3694 BX-1|', '067pkx|17'),
(2584, 'b966ko|09', 'TM 8413 PK|', '3838 XK-4|', '823txa|03'),
(2586, 'y868kh|06', 'KH 0081 TH|', '5030 BK-7|', '233axy|17'),
(2587, 'k587tm|93', 'BX 4390 PC|', '9858 YM-9|', '085xhh|04'),
(2588, 'p598tc|07', 'ec5621yc|', '9597kp0|', '638okk|13'),
(2591, 't337xk|16', 'yy0425yp|', '2576ee0|', '469oab|04'),
(2592, 'x260ay|50', 'CA 3608 AC|', '5865 CX-8|', '935mth|10'),
(2593, 'c768bo|47', 'MC 5481 KY|', '6610 OK-3|', '812cet|13'),
(2594, 'e252px|36', 'AO 7271 YE|', '3875 YX-3|', '351yam|10'),
(2595, 'h887yp|39', 'yy8673cc|', '8399ok7|', '525exk|12'),
(2596, 'o299yx|25', 'YC 3288 PB|', '0215 OX-9|', '088mbt|07'),
(2599, 't022pa|51', 'xt0938ac|', '4705ex3|', '776bca|03'),
(2600, 'k520xk|26', 'th5948pa|', '0216bc7|', '028epc|05'),
(2601, 'h390kt|09', 'mo6075ax|', '5228my5|', '808yoo|13'),
(2602, 'e892ap|47', 'BO 7444 CP|', '1959 XC-5|', '298pam|05'),
(2603, 'y776bm|13', 'EY 8688 XX|', '8260 EY-9|', '052pth|05'),
(2604, 'p061th|47', 'BB 5959 OP|', '3230 MO-8|', '611omy|13'),
(2605, 'm740kc|39', 'my1575ox|', '2435ay0|', '484hmx|05'),
(2606, 'x136oa|05', 'KC 9181 MP|', '5995 OK-9|', '811myo|02'),
(2607, 'm636oa|43', 'AT 6824 HT|', '1884 BX-1|', '532htc|05'),
(2608, 'o518th|19', 'bk6270om|', '6756km5|', '023bbm|13'),
(2609, 'b046yt|76', 'OE 0718 OH|', '9745 MB-0|', '897apc|16'),
(2610, 't780mc|60', 'XT 8458 KC|', '5856 XH-3|', '710cey|15'),
(2611, 'a493bo|43', 'mx4414oo|', '1202mo8|', '711bxm|16'),
(2613, 'k602oo|81', 'EP 9037 EK|', '4758 HX-4|', '676oaa|08'),
(2614, 'c475ty|76', 'cx3135by|', '8538yh1|', '101bba|11'),
(2615, 'x941ob|04', 'CA 7031 YE|', '5893 BX-4|', '378eam|14'),
(2616, 'm745tb|09', 'YP 8484 OM|', '7462 HM-0|', '569tbp|02'),
(2617, 'x943py|43', 'OA 4096 ET|', '5414 AH-5|', '251eta|16'),
(2618, 'x989bo|62', 'PY 6268 OA|', '4266 AK-3|', '533boa|07'),
(2619, 'y119ok|28', 'MM 2967 EH|', '6693 XP-7|', '921meb|01'),
(2620, 'k775ym|08', 'yo7166ay|', '7217pe9|', '574eme|06'),
(2621, 'm259hx|87', 'EY 4661 HA|', '5091 EC-1|', '018xxy|08'),
(2622, 'y406mo|06', 'MH 5511 PX|', '0621 KH-8|', '177etp|05'),
(2624, 'c528km|19', 'HH 1141 YT|', '1351 HH-2|', '453eyy|15'),
(2625, 'b575eh|10', 'TA 9840 XO|', '1647 YM-5|', '350oxk|05'),
(2626, 'a672kc|30', 'CK 7630 TA|', '1220 EE-8|', '295ptb|11'),
(2627, 'o879co|19', 'CB 2521 CC|', '8019 EA-4|', '932kxt|12'),
(2628, 'y691ht|25', 'YE 6721 KO|', '3611 HE-9|', '261cba|08'),
(2629, 'c712hb|14', 'by2973ba|', '9023ty4|', '510oea|09'),
(2631, 'k035tb|44', 'AA 7745 AM|', '2589 TC-5|', '538ohe|15'),
(2638, 'y667th|43', 'PM 5966 MC|', '1557 EO-9|', '797etc|15'),
(2639, 't958ea|52', 'YA 8167 CK|', '7330 TT-8|', '179xhk|01'),
(2642, 'a372bt|56', 'TC 1047 AE|', '9936 EO-1|', '091bxc|09'),
(2643, 'm748cc|84', 'XB 2085 EH|', '8849 PB-9|', '782acc|02'),
(2644, 'y040bp|18', 'hh0729am|', '4615kk3|', '834xbh|01'),
(2645, 'a958yt|54', 'YT 1722 TC|', '9847 BB-3|', '090coa|01'),
(2647, 'k335yo|74', 'EA 7056 MY|', '0873 HY-4|', '658xoo|04'),
(2648, 'm207ho|31', 'TE 3077 TE|', '4770 ME-7|', '862exh|11'),
(2649, 'x198bb|43', 'YC 6538 HB|', '7490 CY-2|', '338ocx|15'),
(2650, 'h705hc|24', 'bt3084kb|', '6893cy7|', '707bok|06'),
(2651, 'h584xc|73', 'OT 4244 BT|', '9012 KY-1|', '116xxb|15'),
(2652, 'c905am|85', 'TE 3047 CE|', '8299 XE-0|', '392pxa|02'),
(2653, 'c961bo|57', 'BK 2308 YB|', '9322 HX-9|', '387kmk|11'),
(2654, 'a985bm|43', 'HP 4707 MO|', '9654 XH-8|', '318tkx|17'),
(2655, 'y839oo|35', 'me5179ho|', '2443ao7|', '387tth|15'),
(2656, 'e954xa|31', 'TP 8541 CH|', '5862 XH-5|', '260bph|04'),
(2657, 'h292bt|45', 'HH 8278 PO|', '0418 YC-6|', '227oxo|07'),
(2659, 'm077eh|23', 'PX 5755 KP|', '3977 BP-7|', '625amm|09'),
(2660, 'a993ka|27', 'MH 0745 PX|', '7030 OC-2|', '188meh|08'),
(2661, 'o946ye|37', 'pe1545ky|', '9586ma0|', '658pme|08'),
(2663, 'p168ok|14', 'YX 2399 YH|', '4949 AE-4|', '727ccx|02'),
(2664, 'k196mo|45', 'xm0055kt|', '6910mh7|', '287ycm|05'),
(2667, 'c026om|54', 'ot6446ck|', '5068xp3|', '127bob|11'),
(2669, 'y855cb|57', 'ao3455mh|', '3567cm1|', '892omt|17'),
(2670, 'm263mp|92', 'OP 7066 MP|', '2069 MT-1|', '231aak|02'),
(2671, 'p754tp|33', 'TO 7512 OB|', '2750 BE-9|', '863tyh|06'),
(2672, 'p763kp|52', 'XE 0204 AC|', '8720 MP-2|', '650hae|10'),
(2673, 'c928tb|47', 'kk4105ak|', '3213ac2|', '554bkh|04'),
(2674, 'e738kt|06', 'AP 9864 MC|', '8710 TK-9|', '461txo|08'),
(2676, 'y750ac|12', 'TX 3230 PP|', '3462 TE-9|', '389keh|05'),
(2677, 'p934ba|84', 'kx5140om|', '2905pt3|', '254tym|16'),
(2678, 'y647ck|16', 'pp1637ca|', '4152to5|', '374xym|02'),
(2679, 'k431yb|94', 'OB 9345 XE|', '3463 XB-5|', '452xce|12'),
(2680, 'x090mb|06', 'XX 5243 CA|', '1675 CY-3|', '641ekx|04'),
(2681, 'p853ca|42', 'EO 1182 MM|', '1673 YP-0|', '635bty|03'),
(2683, 'h204ca|22', 'xh1468px|', '7102tk3|', '385kxe|04'),
(2684, 'm092hk|69', 'CA 5274 EE|', '3077 EO-7|', '949cyx|13'),
(2685, 'o876ok|62', 'CK 4363 HX|', '1622 OA-6|', '778etc|16'),
(2686, 'a235xh|56', 'AM 9617 KH|', '3509 HK-3|', '496eya|11'),
(2687, 'c042ap|29', 'kx2901he|', '1598oa4|', '419ocy|02'),
(2688, 'p381tk|21', 'EC 4830 TE|', '8835 PB-0|', '712pbx|02'),
(2689, 'o724tm|52', 'KY 1545 MC|', '0036 BC-5|', '684ayx|14'),
(2690, 'k247he|93', 'MY 3117 XA|', '7703 HY-6|', '874meo|04'),
(2691, 'o972ox|92', 'KC 4829 XK|', '4016 HB-4|', '195oey|14'),
(2692, 'p030ya|37', 'PH 1936 YP|', '6484 CC-8|', '247xbk|09'),
(2693, 'p600tm|29', 'YH 6990 XP|', '2252 YH-3|', '347bey|02'),
(2694, 'o633yo|70', 'TC 4157 OC|', '7639 EH-4|', '645otb|09'),
(2698, 'e166yh|38', 'EX 2965 MP|', '4553 XA-4|', '946xxt|06'),
(2699, 'p872mt|15', 'XP 1556 OH|', '2127 YO-0|', '772pkc|14'),
(2700, 'o700cc|55', 'bm9907tb|', '1992ao0|', '909key|17'),
(2701, 'b325ko|35', 'YY 1628 AM|', '9648ao1|', '299mcb|07'),
(2702, 'b203cm|05', 'px5337kt|', '6324eh9|', '678ekm|06'),
(2703, 'y203ka|32', 'XC 5926 MO|', '7604 OM-3|', '894txx|05'),
(2704, 'o427ap|38', 'PO 3297 YX|', '5889 TM-4|', '023xcb|04'),
(2705, 'a042ha|80', 'HE 7307 XH|', '0374 HO-7|', '645hoh|02'),
(2706, 'x525hh|42', 'ot1499pm|', '4743tb5|', '218yox|10'),
(2719, 'm051bc|64', 'TT 1290 EY|', '7383 MA-8|', '754mcy|04'),
(2720, 'k212kh|82', 'HK 1720 TH|', '0752 XC-1|', '106yoo|05'),
(2722, 'h509ch|94', 'XT 2355 XA|', '1615 MY-1|', '350xec|11'),
(2723, 'y919ya|58', 'TX 5530 BK|', '1737 HM-9|', '206ybp|14'),
(2724, 'e688mm|69', 'PA 4368 KK|', '7334 HB-6|', '243tte|12'),
(2725, 'c493kh|59', 'XA 3726 PC|', '4322 PA-8|', '770hpt|13'),
(2726, 'p837bk|78', 'HA 5641 PK|', '8682 MB-3|', '702aec|01'),
(2728, 'k790et|16', 'MY 8142 OK|', '1683 PY-4|', '279tyy|10'),
(2730, 'e313ta|43', 'TC 0269 HB|', '1611 MP-7|', '100ehb|01'),
(2731, 'x843ce|31', 'be2817xk|', '5403ch9|', '240phe|09'),
(2733, 't785kc|34', 'KY 6122 YX|', '7945 HH-4|', '348xkb|07'),
(2735, 'b873oe|72', 'OO 5613 MP|', '7738 KA-0|', '658hca|09'),
(2736, 'k840ok|18', 'xy8184ek|', '2507ob9|', '080hee|08'),
(2737, 'o312et|83', 'TY 4400 OP|', '6280 YA-3|', '497beo|06'),
(2738, 'h922ct|05', 'cp1108xy|', '3338ho9|', '235bac|17'),
(2739, 'h125kt|38', 'YM 8492 TY|', '0312 YM-8|', '907ypb|02'),
(2740, 'e849yt|12', 'YM 9764 KK|', '4555 MM-1|', '127ymm|03'),
(2741, 'b477hb|69', 'KX 6112 PH|', '2862 BE-1|', '846aee|17'),
(2742, 't599my|20', 'HO 3990 AP|', '0935 BO-1|', '872kyb|17'),
(2743, 'e466ah|24', 'ak6701yc|', '0479ox4|', '521eop|11'),
(2744, 'h909kk|75', 'EA 8603 OO|', '6611 KA-6|', '475kbe|01'),
(2747, 'a878mo|12', 'BP 1306 EP|', '5775 AO-3|', '363ype|04'),
(2749, 'b262xb|42', 'tk2429hc|', '3456yy8|', '141yah|14'),
(2751, 'o714bk|49', 'pe3643xt|', '3436hp5|', '428php|06'),
(2753, 'e652mp|53', 'cp2456ac|', '8108bo5|', '951omy|02'),
(2754, 'a549cc|47', 'KH 2194 CB|', '2117 XA-8|', '149maa|01'),
(2755, 'y032tm|52', 'KY 8237 EC|', '1089 AB-3|', '215obk|03'),
(2757, 'c484kx|11', 'OT 6722 YY|', '4347 BT-1|', '786cma|11'),
(2758, 'x042yo|58', 'HH 2656 TB|', '1037 HX-6|', '999mpt|08'),
(2759, 'p263mc|17', 'AY 6080 HC|', '3529 MA-5|', '253hmk|16'),
(2760, 'e330tc|12', 'yo1425kx|', '9298ph6|', '355eco|07'),
(2761, 't547kh|15', 'YM 0477 ME|', '2900 OA-8|', '816bhb|01'),
(2763, 'h068ta|26', 'PY 5555 AE|', '5871 EK-9|', '585yoo|06'),
(2764, 'a596ta|81', 'HX 3504 XA|', '6986 KO-5|', '663tok|01'),
(2768, 'y965yx|24', 'YE 1751 BT|', '1320 PO-1|', '776khx|07'),
(2770, 'y684bh|36', 'YY 0887 PO|', '1822 AB-0|', '570ocy|14'),
(2771, 'a943xh|30', 'my2527bb|', '7925me6|', '281bce|03'),
(2772, 'b576ca|40', 'KC 8029 TO|', '4829 CO-0|', '157xbk|08'),
(2773, 't551pe|57', 'bo2598ay|', '5638aa6|', '488xba|10'),
(2774, 'h947ok|83', 'ET 6421 PO|', '9010 AE-7|', '320eya|04'),
(2775, 'k398he|89', 'bo6275bx|', '6128pe1|', '121tkt|03'),
(2777, 'y729ht|55', 'HX 6705 CX|', '1689 MO-7|', '391eek|08'),
(2778, 'p974oo|76', 'MP 4274 CX|', '8923 YE-1|', '561yxm|06'),
(2779, 'y429by|84', 'AB 4890 TT|', '1769 ET-2|', '192aah|05'),
(2781, 'a719xb|74', 'tx5836op|', '4533ca4|', '584bax|06'),
(2782, 'y168xe|45', 'by4673ch|', '5155kx3|', '103yeh|06'),
(2784, 't226oy|51', 'BK 7031 KX|', '9129 XE-5|', '200pab|16'),
(2786, 'h676tt|38', 'EP 9328 EY|', '7477 XK-4|', '037pat|07'),
(2787, 'x380km|74', 'CA 3974 AO|', '2206 XE-7|', '204oxc|14'),
(2788, 'b888mb|53', 'CT 2623 XB|', '6758 KC-9|', '517yph|06'),
(2789, 'o921to|39', 'TE 2989 EP|', '4972 YO-7|', '639bta|11'),
(2791, 'a804em|13', 'ma0697eh|', '5881pc8|', '330exx|14'),
(2792, 'm548mp|76', 'EC 9698 BO|', '2279 MO-8|', '040koo|05'),
(2793, 'o883hb|36', 'HY 4165 CC|', '8182 HT-6|', '186paa|05'),
(2794, 'x112tp|85', 'ty2848pt|', '1591oh7|', '423pcm|06'),
(2795, 'k796ta|30', 'tx0201bc|', '9269kb4|', '929kxa|16'),
(2796, 'e707xy|75', 'PP 2294 MH|', '2768 YM-8|', '690chy|03'),
(2797, 'h104xb|57', 'HM 3443 ET|', '2845 EA-9|', '106ebt|12'),
(2798, 'a373oe|40', 'HA 2701 AE|', '5678 MX-3|', '424yxo|15'),
(2799, 'm954kb|01', 'po9920ap|', '2846ot6|', '808xbc|01'),
(2800, 'o070po|01', 'KP 2462 MM|', '7543 AX-7|', '764pxc|15'),
(2801, 'o147hh|43', 'ox7093oh|', '7880hc4|', '688teo|05'),
(2804, 'y671ok|68', 'MM 2842 EA|', '7382 CY-5|', '823axo|03'),
(2805, 'y702mx|45', 'CB 3459 CC|', '5862 HK-0|', '216kbo|07'),
(2806, 'p193th|68', 'MO 8581 YB|', '5202 ET-7|', '465bxe|10'),
(2807, 'c263oo|45', 'HY 7131 PE|', '7167 BX-4|', '939bac|12'),
(2808, 'a830mo|42', 'mx8235yt|', '7449pt9|', '746mey|14'),
(2819, 'e981ae|89', 'AM 2515 PB|', '3348 OK-7|', '952atc|12'),
(2821, 'b287bm|64', 'XE 5279 YB|', '5208 YK-7|', '234mcm|05'),
(2822, 'h890km|30', 'CX 2189 HY|', '2481 KP-9|', '141aet|10'),
(2823, 'm170hh|15', 'kb0197pa|', '1683aa3|', '632xpo|14'),
(2824, 'a750ah|49', 'BC 7422 PC|', '6439 CA-2|', '061ocy|08'),
(2825, 'c051oh|18', 'TX 0816 HB|', '3489 HK-1|', '852mhh|05'),
(2827, 'm713oe|23', 'CK 3083 BX|', '8582 EY-6|', '357hpc|11'),
(2828, 'p596mt|39', 'cm7456ko|', '4150pb0|', '789cot|16');
INSERT INTO `lastnumber` (`acc_id`, `rus`, `ua`, `by`, `kz`) VALUES
(2829, 'h295yo|33', 'ot0727tb|', '9685ak7|', '880yym|16'),
(2830, 'k755tk|69', 'tm2102kp|', '6103tm5|', '317mca|09'),
(2831, 'k289cx|78', 'em9292ba|', '6493ox1|', '169akk|14'),
(2832, 'x712oa|70', 'MA 4403 PH|', '0806 OH-6|', '475cah|03'),
(2833, 'p152ph|65', 'ka9663xc|', '6013pk1|', '258ape|10'),
(2834, 'o972eb|92', 'HY 8562 XC|', '5520 AM-1|', '065ext|17'),
(2835, 'p995ao|41', 'PB 4636 PO|', '3273 PE-9|', '939bbx|10'),
(2836, 'c154ba|45', 'OB 6665 CC|', '8428 KC-2|', '095xhk|09'),
(2837, 'b074yh|80', 'ME 9758 YC|', '0538 PB-7|', '296oph|11'),
(2838, 'k669ap|63', 'PO 9116 MT|', '3847 HO-0|', '345axc|06'),
(2839, 'x147ho|10', 'co4075to|', '3925ae6|', '882kah|17'),
(2840, 'y254po|05', 'xy2982me|', '5976mc6|', '272abx|15'),
(2841, 'c040bx|84', 'XO 1653 HX|', '3159 EE-8|', '129xky|12'),
(2842, 'c308to|33', 'ky7768ak|', '1076at3|', '444phy|02'),
(2843, 't125cb|92', 'TA 8118 EE|', '8446 OE-5|', '081abh|14'),
(2845, 'h855ky|70', 'tp2670py|', '5408ct9|', '844tpm|15'),
(2846, 'o823op|14', 'OX 2277 HY|', '3346 PC-1|', '648tck|10'),
(2847, 'p804tx|17', 'kx1110xe|', '9004ae7|', '193atb|17'),
(2848, 'h961ey|51', 'tx1518oc|', '1447px9|', '587hck|12'),
(2849, 'c390ae|24', 'CA 1218 TT|', '6647 XK-5|', '824omy|13'),
(2850, 'k794kh|15', 'CC 8971 EX|', '5349 KT-6|', '996kcx|05'),
(2851, 'k668hy|62', 'ta8219kc|', '5654mk6|', '498hoh|03'),
(2852, 'e318ce|51', 'AY 7307 HO|', '2298 AH-2|', '698eca|15'),
(2853, 'c632pk|32', 'CP 2767 XE|', '2889 MK-3|', '762yme|07'),
(2854, 't704pt|92', 'PP 0807 YY|', '1332 BY-4|', '517kkp|05'),
(2856, 'x822ay|21', 'EK 7281 BH|', '1652 HY-5|', '350mmx|10'),
(2857, 'b647mc|23', 'ke5501eo|', '1621xh7|', '167ayt|15'),
(2858, 'm105et|46', 'OK 6589 XY|', '5566 EM-0|', '448hom|15'),
(2860, 'x708ac|36', 'AB 9081 AX|', '4087 HK-3|', '121okp|08'),
(2861, 'a667cc|60', 'PY 6988 YT|', '2806 KK-4|', '768oap|15'),
(2862, 'y760he|02', 'KP 7526 YC|', '0422 CA-4|', '499abb|12'),
(2863, 'b993pa|68', 'YY 7946 BE|', '6250 AB-0|', '772yto|13'),
(2865, 'c788kb|64', 'AA 6688 KE|', '1140 TK-6|', '783yec|10'),
(2866, 'o948me|27', 'TB 3871 PP|', '4824 YY-4|', '636eco|10'),
(2867, 'k329hh|21', 'AC 2108 MY|', '4497 MK-9|', '338bhy|17'),
(2869, 't248bx|10', 'TK 0951 XX|', '5635 PH-8|', '487tpx|03'),
(2870, 'x304kh|74', 'MY 9943 YM|', '3595 OT-7|', '659aak|03'),
(2872, 'e543hk|65', 'ec9128ec|', '2034ma0|', '076obe|14'),
(2873, 'e016hy|34', 'CC 7110 XP|', '4352 XO-1|', '684epm|17'),
(2874, 'e022ac|04', 'xo5286eb|', '6498pt4|', '669boe|04'),
(2875, 'x541pb|32', 'BB 6809 EM|', '7634 YO-3|', '797oby|05'),
(2877, 't787bo|02', 'ca9248xm|', '9409bm9|', '625pxa|04'),
(2878, 'o504ep|02', 'cp3966oh|', '2213ym1|', '033bha|14'),
(2879, 'e103yp|71', 'PA 0024 AT|', '0612 BB-5|', '506hkk|16'),
(2880, 'a748om|63', 'OB 2640 BT|', '1649 AC-2|', '565byp|03'),
(2881, 'm406he|76', 'XT 9553 AB|', '4819 EC-7|', '743hhy|01'),
(2882, 'k180oo|26', 'cb4151xm|', '6937oe8|', '377pot|04'),
(2883, 'x935xe|91', 'ok8855hc|', '7693yt8|', '513ocx|04'),
(2885, 'y403eh|41', 'PM 8897 EP|', '0719 HT-1|', '488key|14'),
(2886, 'a070ta|35', 'ek7791co|', '2188ob9|', '892omh|03'),
(2887, 'x217eb|68', 'MA 4478 EE|', '9233 TY-4|', '330pxc|03'),
(2888, 'p104bo|51', 'MH 4053 OK|', '6704 ME-5|', '451bby|09'),
(2889, 'b741yc|59', 'YK 8852 EH|', '8342 XH-0|', '660btt|05'),
(2893, 'o105ex|15', 'BM 4359 YO|', '2443 YM-9|', '705ceo|15'),
(2894, 'e475oy|80', 'AE 5522 MT|', '0563 XH-6|', '980xya|11'),
(2896, 'h132ay|09', 'OT 1732 MH|', '6933 KM-6|', '333emh|03'),
(2897, 'e644ym|29', 'MA 9373 OX|', '3143 XC-7|', '407hkm|08'),
(2898, 'x290xt|58', 'PK 8760 EC|', '7068 OO-2|', '628cep|05'),
(2899, 'k224to|16', 'co1732pk|', '3708xh6|', '080ypt|05'),
(2900, 'e866mp|78', 'ox3256kx|', '1207yp1|', '506yct|02'),
(2901, 'p868xp|52', 'TB 4913 MK|', '5848 EB-7|', '426aox|03'),
(2902, 'h885ho|36', 'TY 6669 OH|', '6599 BB-6|', '357bcy|04'),
(2903, 'y471yy|18', 'TK 0476 XY|', '7846 PK-6|', '379tyc|14'),
(2904, 'a402me|91', 'xa5973bc|', '2999pp0|', '197ckm|04'),
(2905, 'o236yo|32', 'tm9542ey|', '2040ek8|', '910amb|06'),
(2908, 'b234tx|68', 'BX 7180 PB|', '1786 AT-9|', '010mtx|15'),
(2909, 'b667ee|30', 'MK 1784 BB|', '2419 CE-4|', '137apy|10'),
(2911, 'x180kh|86', 'TK 0957 YH|', '8350 HM-1|', '747pma|10'),
(2912, 'c627yx|11', 'oy2629ya|', '6596hx9|', '805hyc|07'),
(2913, 'x300pp|43', 'YO 5485 OB|', '6054 EH-5|', '185xtc|12'),
(2914, 'm165cm|63', 'CO 4893 EH|', '1431 BY-7|', '461ayy|13'),
(2916, 'c460pt|39', 'HC 7903 YC|', '3430 OP-5|', '790bpb|09'),
(2917, 'b512ec|61', 'KK 3061 XA|', '4481 CY-0|', '998xxm|12'),
(2918, 't830hx|53', 'kb9835cp|', '5254pt7|', '650too|03'),
(2919, 'p902xm|15', 'OB 6745 YK|', '9916 EK-0|', '463cat|09'),
(2920, 'y992pk|49', 'PH 4477 HC|', '6524 MH-6|', '142xyo|06'),
(2921, 'm493kb|59', 'EH 9390 PO|', '8924 XO-8|', '359mth|04'),
(2922, 'b543yp|51', 'XA 4125 PM|', '0963 PH-0|', '565cxy|05'),
(2923, 'x187ap|81', 'bk3805yp|', '6245ap5|', '700mxm|17'),
(2924, 'k686kb|37', 'KO 6655 EX|', '8168 AB-3|', '943bok|10'),
(2925, 'x959ay|70', 'ym0706pp|', '5436po6|', '006eeb|10'),
(2926, 'b258hc|29', 'BE 9375 PO|', '7089 YC-3|', '664xkp|13'),
(2927, 't302ho|82', 'CE 7713 BC|', '3502 BE-7|', '575cyo|01'),
(2928, 't105cx|83', 'xx9376pp|', '2685yh2|', '436tpm|02'),
(2929, 'c162pe|64', 'AT 2685 PO|', '7204 HO-1|', '611kbo|08'),
(2930, 'o775yt|24', 'ea6769bp|', '5739xy8|', '737pxh|08'),
(2931, 'o192ea|78', 'XO 5502 MY|', '5841 OB-5|', '366mbh|13'),
(2935, 'x004op|87', 'HT 5979 EM|', '4240 MM-7|', '971hka|05'),
(2937, 'y807kh|83', 'TA 0159 TA|', '9126 AM-0|', '594cka|02'),
(2938, 'c664xp|58', 'XM 5671 TA|', '5162 EE-8|', '138yay|11'),
(2939, 'b395px|33', 'EH 2746 XM|', '3152 TK-8|', '950mbb|15'),
(2941, 'h842ok|05', 'YP 6022 EO|', '6676 TM-5|', '614ktx|02'),
(2942, 'h910cm|62', 'KT 5422 BM|', '5346 AO-8|', '004hyy|02'),
(2943, 'm296pe|34', 'KP 8020 BY|', '3296 EC-1|', '768xke|06'),
(2944, 'm397px|46', 'AT 6710 KC|', '0331 TK-6|', '134kpc|07'),
(2945, 'p834ke|68', 'cy3866to|', '7882co9|', '184heo|17'),
(2946, 'o781ce|82', 'xy9380kt|', '5346ym8|', '279xet|14'),
(2947, 'e391by|86', 'ET 2395 OT|', '9349 OK-2|', '113bpo|01'),
(2948, 'o816ax|90', 'BE 6936 EO|', '6246 XC-9|', '803cep|12'),
(2949, 'a893mp|04', 'XP 7316 MO|', '9906 PO-9|', '700okm|12'),
(2950, 'b386om|75', 'kh8065he|', '6467yx8|', '119hca|14'),
(2951, 'x682ot|29', 'YB 5447 ET|', '5721 OE-9|', '086hec|13'),
(2954, 'k368kc|81', 'TO 0622 KC|', '3976 AB-3|', '731bkp|17'),
(2955, 'p951bp|31', 'kt8021eb|', '6678xk4|', '093aoa|02'),
(2957, 'p667ap|26', 'TC 7783 MO|', '8641 OK-2|', '084tky|17'),
(2958, 'x098tk|02', 'xa6085xy|', '3994yp5|', '777ktk|03'),
(2959, 'y379xp|92', 'YM 1136 HX|', '0692 CC-3|', '581pax|02'),
(2960, 'y492ax|51', 'KT 0801 KK|', '1914 EK-7|', '364mpc|16'),
(2961, 'h467te|62', 'TC 3732 CK|', '6006 AX-1|', '357tbk|15'),
(2962, 'p925yo|26', 'MM 8947 CH|', '6712 CB-4|', '581obp|04'),
(2964, 't142ac|58', 'HY 3799 PT|', '2964 EX-9|', '053oco|07'),
(2966, 'x664xb|08', 'EA 6355 EC|', '6441 OO-4|', '973ebp|15'),
(2967, 'e253xc|44', 'OH 4494 PK|', '9511 XB-4|', '268abo|14'),
(2968, 'e268hk|10', 'PC 5961 CK|', '5867 CX-6|', '508mha|04'),
(2969, 'k695tm|65', 'BX 9095 AH|', '4374 EH-4|', '525ccx|02'),
(2971, 'm897hh|47', 'CX 2577 HO|', '0831 BA-7|', '531ypb|14'),
(2972, 'y770ct|73', 'ET 5593 PB|', '2918 XH-8|', '977hcc|12'),
(2973, 'a610xa|80', 'MO 4771 EK|', '2208 KE-9|', '359phh|13'),
(2974, 'k778ok|69', 'TY 2563 YA|', '9685 XB-0|', '600teh|15'),
(2975, 'e457kh|75', 'ke9820hk|', '7298ay1|', '780aby|14'),
(2976, 'h930ab|72', 'BE 7106 PK|', '1648 BM-6|', '971mha|15'),
(2977, 'o514hm|92', 'TH 3755 HT|', '3204 YY-2|', '616bba|07'),
(2978, 't795eh|94', 'xc9013mc|', '0527xx4|', '955tcb|08'),
(2980, 'p215xp|18', 'OK 9672 CY|', '4452 PY-2|', '963yya|03'),
(2981, 'y651yk|12', 'ak8263bh|', '5620yx5|', '983bck|03'),
(2982, 'c586xt|68', 'KP 5094 EB|', '0527 XY-5|', '519eem|15'),
(2983, 'e497ba|43', 'MT 2122 EY|', '1085 OP-8|', '205ecy|05'),
(2984, 'c366te|20', 'ax4865kx|', '4955ht6|', '305abb|08'),
(2985, 'y477te|59', 'yk6850bm|', '4189kx5|', '543xtm|17'),
(2987, 'c643kh|42', 'oa9153ah|', '2075ah1|', '114xoe|10'),
(2988, 'b783ok|44', 'ab1555me|', '7874pb1|', '850xpt|17'),
(2989, 'm934ab|69', 'EX 0451 KP|', '4731 YA-2|', '337ybp|16'),
(2990, 't500am|66', 'YH 5566 XH|', '3304 OE-0|', '599etb|07'),
(2991, 'b280ba|62', 'OC 7078 YA|', '6911 CC-7|', '347tma|15'),
(2993, 'o326ke|58', 'tx0725yb|', '5105ye2|', '532xhp|04'),
(2994, 'c742ak|39', 'EX 1612 AY|', '4206 XH-3|', '696yth|02'),
(2998, 'o697ax|43', 'AY 8569 BM|', '2464 BH-9|', '583tpp|03'),
(2999, 'e898xe|89', 'oc3903my|', '5752ok2|', '172ahx|14'),
(3000, 'x105am|73', 'TM 3017 EP|', '7519 PT-9|', '342tek|15'),
(3001, 't594px|28', 'PP 2614 AX|', '6843 BH-9|', '652bkh|05'),
(3002, 'm019eb|30', 'ke7771hk|', '0381ch5|', '959mmk|06'),
(3003, 'b426bx|04', 'HC 5604 OB|', '5776 AB-1|', '182eec|10'),
(3005, 't090pm|91', 'MH 7880 OT|', '5866 KP-9|', '490mtc|03'),
(3006, 'h100km|19', 'EY 6070 BY|', '6556 OE-5|', '961eak|15'),
(3008, 'k901ep|53', 'XC 4397 CT|', '4192 KY-7|', '721mpy|15'),
(3011, 'e454bc|17', 'hm4849ea|', '6543yo2|', '074xhm|13'),
(3013, 'y787tb|73', 'ha2112pp|', '0140yp9|', '204ybx|05'),
(3014, 'p632tb|81', 'ak6220by|', '0612hy3|', '544bmh|11'),
(3016, 'y891hx|33', 'KE 9847 HM|', '9755 TM-0|', '239kkc|01'),
(3017, 'h786pb|54', 'ec1862he|', '1896bp1|', '856axt|13'),
(3020, 'm880ex|30', 'em3578cy|', '6749mt4|', '140poy|05'),
(3022, 'm406ba|24', 'hk8601xy|', '6523xb7|', '017kco|03'),
(3024, 'e369ax|05', 'ca2731eb|', '8353oh1|', '788tem|01'),
(3025, 't041cc|18', 'CK 5906 EO|', '2190 CT-6|', '807yeo|16'),
(3026, 'm347ye|04', 'CH 3105 MY|', '0990 KB-8|', '529hxb|04'),
(3028, 'k151by|59', 'XE 5855 BY|', '2684 AC-5|', '940akb|13'),
(3029, 'y649ac|92', 'yc1766th|', '5010ea2|', '494aep|05'),
(3032, 'p984pc|25', 'PE 1931 BE|', '2895 BK-8|', '022hyt|14'),
(3033, 'b903ph|36', 'TE 1068 MY|', '1960 TT-0|', '063phe|15'),
(3034, 't190th|48', 'AE 9362 PX|', '3409 AP-1|', '108bto|05'),
(3035, 'a675kb|72', 'HY 8062 MH|', '3397 PE-1|', '163yyc|14'),
(3036, 'b934hp|71', 'et4167xt|', '8126em6|', '365hep|16'),
(3050, 'b694bc|03', 'eo6529ea|', '4614yc9|', '713cmk|01'),
(3051, 'a907bm|32', 'KO 6222 AO|', '0074 CM-5|', '756oye|13'),
(3053, 'e619ma|66', 'mb0506bc|', '2867et2|', '896eyk|08'),
(3054, 'p310yb|23', 'xx7981xb|', '5384cb6|', '034pyb|09'),
(3055, 'e108oo|38', 'oh4127mh|', '7507eb0|', '877tcx|04'),
(3057, 'b246my|46', 'OC 2270 EP|', '9773 YT-7|', '352xxt|11'),
(3058, 'b578ky|04', 'OH 2613 AX|', '4730 TO-0|', '205ykc|14'),
(3059, 'o488xx|60', 'hp7293ob|', '7248ee0|', '183ckk|04'),
(3060, 'e697bc|34', 'PT 6327 XE|', '3794 HP-3|', '635eab|10'),
(3061, 'a121cm|17', 'MH 9091 EC|', '1120 EK-8|', '713eek|04'),
(3063, 'b287he|90', 'YP 5301 PX|', '0441 TT-6|', '079eka|11'),
(3064, 'k711hp|39', 'CY 3807 BT|', '6799 CH-8|', '286thc|01'),
(3071, 'a072kh|60', 'HO 0123 CK|', '7697 ME-2|', '828xao|15'),
(3074, 'e214ky|41', 'yk6679ct|', '1215ho1|', '332yma|12'),
(3075, 'e974cc|47', 'ky7812ec|', '8279cc1|', '595ccm|04'),
(3082, 'm005xm|90', 'PM 5891 PC|', '4161 HP-2|', '055apc|13'),
(3083, 'o547tm|35', 'BX 4530 YY|', '2336 AH-5|', '397ecm|14'),
(3084, 'm323to|82', 'PA 4652 AM|', '8062 TE-5|', '836pea|08'),
(3086, 'o531yo|57', 'HE 9351 XX|', '9826 KX-3|', '006okt|06'),
(3087, 'o717am|52', 'yh1169kp|', '9086em1|', '491myk|08'),
(3090, 'm955mm|68', 'ep0543oo|', '0771bp8|', '630bbm|16'),
(3091, 'm160yt|70', 'YP 0491 AK|', '3680 OE-9|', '434yke|02'),
(3094, 'p070pe|46', 'kp4564te|', '1940mb5|', '198cpo|11'),
(3095, 'a617to|31', 'XH 1818 CC|', '8529 AK-7|', '550hpm|02'),
(3096, 'x066yx|37', 'ym6939mx|', '0628yx0|', '415oky|11'),
(3098, 'p803pp|59', 'my5083bh|', '9644ec9|', '447cee|09'),
(3099, 'a549te|37', 'ta4700xp|', '6121bp7|', '717hee|13'),
(3100, 'y926mt|02', 'CE 2740 TB|', '6694 BY-9|', '187abx|04'),
(3106, 'k228km|19', 'ck1802yt|', '3262mc6|', '271exp|12'),
(3109, 'b807ma|51', 'KO 2832 OA|', '4949 TK-3|', '251tmp|08'),
(3111, 'm471ym|80', 'YT 0829 HT|', '2005 OO-3|', '756kax|02'),
(3112, 'e489kh|46', 'ko8850eo|', '4551bx7|', '626cca|06'),
(3113, 'p456tx|78', 'pc0506tb|', '9843ct3|', '113hea|05'),
(3115, 'o729kk|53', 'YA 9964 EH|', '3883 PT-3|', '282toe|15'),
(3116, 'c713ty|07', 'HX 1158 YP|', '8838 PP-4|', '839tpm|06'),
(3117, 'p093ho|81', 'MO 0342 AX|', '2974 KM-5|', '797tpc|07'),
(3118, 'p996kp|36', 'XA 5300 TM|', '4077 BO-1|', '572epc|13'),
(3121, 'o557ae|45', 'oa8026kh|', '8948co1|', '276hch|12'),
(3124, 'o577py|06', 'KE 0756 AA|', '4933 TA-2|', '794keb|05'),
(3126, 'e910mt|49', 'ay2940po|', '6877xc1|', '900axa|07'),
(3129, 'b494em|34', 'EE 9029 MM|', '0854 BY-2|', '510xkx|04'),
(3137, 'y773kx|09', 'HB 5518 YX|', '1780 TK-0|', '444thk|14'),
(3138, 'a608ha|61', 'BC 3091 EB|', '2738 MO-2|', '308yke|06'),
(3142, 'e930om|35', 'YP 9879 EE|', '5598 EA-9|', '454hpy|13'),
(3143, 'y730ax|18', 'HA 3283 PA|', '7788 OT-5|', '725btt|01'),
(3144, 'p090km|05', 'ET 4636 AX|', '1367 PX-5|', '376bho|07'),
(3145, 'e717ae|37', 'XM 3098 MP|', '3725 PB-8|', '939eme|12'),
(3146, 'h098ac|62', 'tx2055kx|', '7081ty9|', '241yeb|02'),
(3147, 'o039yh|80', 'XM 1624 MA|', '6195 MK-0|', '842pxh|16'),
(3148, 'b997xt|23', 'ea4472ht|', '1377by9|', '568ohy|06'),
(3149, 'h605ca|09', 'OX 9032 AE|', '9215 OA-9|', '028mth|04'),
(3151, 'y966bh|39', 'am6306pe|', '6241hb3|', '859xca|01'),
(3152, 'a477yk|40', 'AB 1525 EM|', '9514 OM-8|', '548xmo|11'),
(3153, 'm327yx|92', 'AK 3981 HY|', '6851 BH-6|', '777meh|01'),
(3154, 'e782yy|88', 'ta2123cx|', '4561th0|', '419yxo|02'),
(3155, 't200th|14', 'PH 2532 EA|', '4691 HH-0|', '991cma|12'),
(3157, 'm509kx|73', 'co0813ty|', '0144pb3|', '701btb|09'),
(3159, 'k573ty|90', 'ak3671hk|', '7018am1|', '809aha|05'),
(3160, 'e041op|06', 'OC 2395 AO|', '1484 XX-8|', '202ykk|13'),
(3163, 'h480at|58', 'MK 0041 XB|', '5116 BX-8|', '988bop|09'),
(3168, 'x640kx|68', 'XP 8963 PM|', '0593 XY-8|', '228cha|16'),
(3169, 'h629be|10', 'cy6060am|', '1739kp3|', '196bty|11'),
(3170, 'b514op|37', 'HP 6785 EC|', '5184 TT-5|', '409toa|17'),
(3172, 'b478ao|53', 'XH 1438 YA|', '4380 YP-9|', '628ybp|05'),
(3173, 'm905ka|36', 'pc2050co|', '8124pa6|', '753tmb|03'),
(3174, 'p265bp|68', 'OA 7493 BO|', '5112 AC-6|', '595aoo|14'),
(3175, 'o781eo|30', 'XY 9024 AA|', '5120 ET-0|', '660khe|05'),
(3176, 'k989oh|10', 'HT 6993 AA|', '4628 XY-6|', '645mmb|06'),
(3178, 'y074ko|28', 'BY 1376 HT|', '6822 AK-8|', '645cyy|06'),
(3179, 'm453oo|30', 'CC 7226 AE|', '1592 CX-6|', '422ymo|09'),
(3181, 'o926xa|19', 'HE 4858 EE|', '4719 XB-2|', '225cxk|12'),
(3182, 'x012xp|11', 'OT 4392 CE|', '7320 EO-9|', '109xky|13'),
(3183, 'o084yy|53', 'mk8361yt|', '7666yx3|', '266pbc|07'),
(3184, 'h340em|53', 'KY 0911 KM|', '4028 EP-4|', '596bxb|10'),
(3186, 'x199pa|43', 'YC 8217 EM|', '4568 AX-5|', '233mct|17'),
(3189, 'y719cb|39', 'HC 4965 CM|', '3601 PM-6|', '491bko|06'),
(3191, 'e600ce|41', 'BH 0325 OX|', '4764 EX-3|', '434kat|01'),
(3192, 'a168bx|65', 'oa7679oa|', '1738hp1|', '472mac|17'),
(3193, 'o104tb|58', 'oc0148aa|', '7987hm5|', '452ach|07'),
(3194, 'o489oc|66', 'ko2870om|', '7790xp1|', '419bpc|14'),
(3198, 'b921hy|76', 'HT 1941 KK|', '9866 TY-1|', '377mhk|10'),
(3199, 'a535ca|67', 'XC 0787 XC|', '8528 YC-0|', '744ayh|02'),
(3201, 'x116ma|93', 'AE 8047 CT|', '6868 KY-2|', '810bxp|10'),
(3202, 'm225at|17', 'EX 0990 PH|', '2306 MC-0|', '983pmc|08'),
(3203, 'k526kp|91', 'AK 0725 BB|', '6948 PH-7|', '683kxb|06'),
(3204, 'a346cp|15', 'HH 0798 EH|', '0403 TY-8|', '976yko|15'),
(3205, 't001ax|39', 'XP 7206 ET|', '2764 BT-9|', '409mkt|16'),
(3206, 'a291ka|22', 'YA 1587 AP|', '0147 MH-6|', '562bhe|01'),
(3207, 'h625mk|51', 'CM 1714 MO|', '3844 EM-4|', '067oae|08'),
(3208, 'b837cp|68', 'YY 1413 EH|', '8213 TA-5|', '199aax|02'),
(3209, 'o359hx|42', 'me3438bt|', '8008ee6|', '026kkb|04'),
(3210, 'b666am|50', 'KC 8112 ET|', '7649 XB-9|', '000ctp|12'),
(3211, 'b255yh|94', 'HP 9848 TT|', '8220 BM-4|', '372xyp|06'),
(3212, 'c920bx|67', 'TE 4262 CH|', '8342 OX-8|', '841ema|14'),
(3213, 'p296cx|25', 'KK 9111 YT|', '3045 AY-0|', '303cbx|04'),
(3214, 'c171cy|27', 'OK 4869 EM|', '7008 MO-4|', '080khh|07'),
(3222, 'c876tb|67', 'ao0555mb|', '3886xp5|', '100tph|16'),
(3227, 'h089kp|17', 'pb4694ke|', '9807ca9|', '307tky|10'),
(3228, 'o707am|56', 'EH 5078 CM|', '0979 XC-7|', '829txk|12'),
(3231, 'm038kp|47', 'xb2121ck|', '5481ky7|', '132hth|11'),
(3232, 'm347oa|85', 'HB 9825 BH|', '8711 TT-1|', '118thc|03'),
(3233, 'h237yh|16', 'ye7378yh|', '5704ox5|', '866bbh|03'),
(3236, 'o718ta|81', 'mx6022oe|', '1844ct7|', '781emb|17'),
(3237, 'c722ob|69', 'xc7385ph|', '3585yo7|', '937tbc|13'),
(3239, 'c484ox|51', 'et5574hk|', '6701oc5|', '508kcp|15'),
(3240, 'm521cc|87', 'ot9463pb|', '8453hx8|', '638opx|12'),
(3241, 'c196ye|48', 'CH 0557 CA|', '8137 HE-9|', '708emo|12'),
(3242, 'y333yc|48', 'MK 3163 PB|', '2030 BK-4|', '334hoo|03'),
(3245, 'o575tm|69', 'ch1149pm|', '1129yk8|', '118oeo|02'),
(3246, 'a715me|34', 'CB 4796 AA|', '7210 AK-1|', '748hxo|14'),
(3249, 'p900pc|45', 'EH 8161 KM|', '1186 PM-7|', '567yop|09'),
(3251, 'h757he|40', 'KY 5795 YM|', '9941 EE-1|', '490bpm|04'),
(3253, 'x530eo|94', 'ya1540pt|', '0601co8|', '033yhb|02'),
(3254, 'm117mk|04', 'OE 4160 XA|', '9130 BP-6|', '398xcp|17'),
(3256, 'e209ka|50', 'BP 9869 CA|', '3048 XM-2|', '959myb|03'),
(3257, 'x196ke|36', 'HE 6197 BE|', '0148 BK-3|', '575eyb|13'),
(3258, 't032xa|42', 'BY 4195 HX|', '4788 OT-5|', '989xpt|04'),
(3259, 'h361oo|02', 'KM 8896 HO|', '4795 KH-4|', '130yxb|05'),
(3260, 'm313ky|75', 'MM 8665 BP|', '7039 XM-2|', '203the|11'),
(3261, 'b173pb|22', 'XP 2252 PO|', '1936 YC-8|', '865bpe|01'),
(3262, 'y494he|31', 'AP 8207 YX|', '1436 TH-2|', '921bkb|15'),
(3265, 'o412ko|36', 'MY 2351 KX|', '8695 HX-6|', '312obc|07'),
(3266, 'e794xh|84', 'YO 6084 EP|', '2941 YB-4|', '617hyx|01'),
(3267, 'h371ta|08', 'HX 6566 BO|', '7690 CB-2|', '495xbk|03'),
(3268, 'y106tm|65', 'tb3117yo|', '8999ct1|', '143yhk|13'),
(3269, 'e588xa|10', 'CY 7194 YY|', '7686 PT-9|', '901ece|10'),
(3270, 'y467om|37', 'XT 2714 HT|', '5691 OM-9|', '049aeb|01'),
(3272, 'b546yk|02', 'HM 5326 EO|', '0122 TH-0|', '156pae|16'),
(3276, 'b983ox|44', 'XH 6717 OO|', '6272 EO-6|', '035xeh|09'),
(3277, 'b966ea|37', 'om7331ba|', '9412ah7|', '924eom|10'),
(3278, 'm849me|41', 'CM 4900 HA|', '7976 HO-1|', '280eoh|15'),
(3279, 'a824hx|93', 'pt1074pc|', '0116cb1|', '935mpt|08'),
(3280, 'a162at|46', 'BP 8226 YB|', '1364 XH-8|', '764thh|14'),
(3281, 'o778he|83', 'om9653eb|', '7949aa1|', '838xkk|03'),
(3285, 'm772ek|19', 'YT 0453 OE|', '2858 MH-2|', '925ktt|17'),
(3287, 't680mo|02', 'HM 4495 HE|', '2521 MM-3|', '378xto|13'),
(3288, 'k109po|67', 'OA 7184 XX|', '2940 HY-6|', '732kem|08'),
(3289, 'e615hm|64', 'TA 1528 TB|', '1524 CX-1|', '251mmc|02'),
(3290, 'e322cx|46', 'TM 7180 OO|', '2201 YM-8|', '533oyt|04'),
(3291, 'o771bh|24', 'OM 8439 XH|', '2844 EY-9|', '950bck|10'),
(3293, 'y454kb|11', 'ak1603be|', '3394kh5|', '312oek|02'),
(3294, 'a402hk|05', 'AK 8708 EE|', '0145 EX-9|', '899ckp|10'),
(3295, 'p062xx|49', 'PH 3469 OC|', '9747 YO-9|', '809cko|11'),
(3296, 'c877py|26', 'OO 3025 AX|', '3433 EA-4|', '080xyb|08'),
(3297, 't044am|43', 'po8000bo|', '1189yt1|', '033yce|02'),
(3298, 'b079pm|49', 'XA 5796 BM|', '5210 AB-0|', '558kpc|16'),
(3299, 'm771xp|71', 'MC 8813 BK|', '0300 BO-6|', '558cbo|13'),
(3302, 'b720om|59', 'HB 7209 YM|', '8437 MX-6|', '973apt|15'),
(3303, 'm487tm|53', 'ao9818xa|', '9260xt6|', '828ekh|17'),
(3304, 'p774pc|01', 'EB 2546 EA|', '2327 BB-9|', '097byx|15'),
(3305, 'k614bc|87', 'bt3722hc|', '8215yk6|', '998kyp|08'),
(3306, 'h441hm|78', 'OX 2529 YX|', '2502 PB-0|', '044ptm|06'),
(3307, 'y273he|55', 'TB 5064 OH|', '8211 HT-2|', '066ock|01'),
(3308, 't148ta|15', 'EP 7472 AH|', '0596 CE-2|', '394yxe|10'),
(3309, 'p345ph|90', 'KA 8399 BA|', '9371 MT-3|', '058pmm|13'),
(3311, 'm938hp|73', 'EC 9644 PH|', '5388 EC-6|', '646kbh|14'),
(3312, 'y525op|29', 'CK 7852 MM|', '8872 BE-9|', '867kxt|08'),
(3313, 'e453ao|09', 'bc9743xm|', '5342ta7|', '706eoa|07'),
(3315, 'c128xp|84', 'bc7360mm|', '7165tx7|', '446ebk|10'),
(3318, 'k047bb|01', 'OE 9057 KY|', '5828 OY-4|', '902ykk|07'),
(3319, 'h179ce|30', 'OM 7349 YC|', '6486 HT-2|', '722aem|01'),
(3320, 'c225ka|56', 'MX 7255 PH|', '0591 HE-8|', '983oam|11'),
(3324, 'k404tx|60', 'ex7597aa|', '4706po7|', '951xtt|04'),
(3327, 'p604mt|25', 'BH 4044 PC|', '3420 BC-8|', '063mma|12'),
(3328, 'y521cy|24', 'EE 9611 AY|', '5565 BE-0|', '139xcy|03'),
(3329, 'p493ey|36', 'BC 8687 AH|', '7225 PH-6|', '856myt|12'),
(3330, 'b004tk|58', 'MP 9788 PY|', '8692 TC-4|', '272coo|13'),
(3331, 'c927mp|40', 'ba8266oo|', '3999mx4|', '830cbh|14'),
(3333, 'x217cy|79', 'BT 5524 OM|', '6853 BE-6|', '519ypm|17'),
(3335, 'x098ha|35', 'KC 1970 AO|', '7481 EO-8|', '108yok|05'),
(3336, 'x005cc|71', 'CH 2357 KO|', '2948 OH-4|', '925hey|17'),
(3338, 'x177kk|70', 'ht4138ob|', '2968ho9|', '970mhe|12'),
(3339, 'p550yo|43', 'CE 4578 MK|', '7690 KH-8|', '341kcp|17'),
(3340, 'k959aa|34', 'HK 9947 YH|', '1668 AK-0|', '206hhm|01'),
(3341, 'h864yo|78', 'PX 8631 BB|', '1556 TH-5|', '570thh|03'),
(3343, 'm755km|34', 'YC 5435 CK|', '7810 BM-0|', '699aok|14'),
(3344, 'x873ct|16', 'HT 8646 YK|', '0200 MB-0|', '213hkh|07'),
(3345, 'b523ao|10', 'KB 8299 BP|', '5951 AE-0|', '840mka|16'),
(3346, 'p080th|18', 'ht2402mb|', '3259xm1|', '929xmk|12'),
(3347, 'p545ma|06', 'BT 0309 YC|', '1103 KY-5|', '605hhx|16'),
(3349, 'a817xt|80', 'TO 8447 CX|', '4663 TM-1|', '089yac|13'),
(3350, 'm961ch|88', 'XA 8766 BC|', '3344 HT-0|', '194apc|11'),
(3351, 'h251aa|60', 'BA 1145 BK|', '3001 KT-0|', '579cam|12'),
(3352, 'x146mt|38', 'bk7836eh|', '6478mm1|', '511moc|05'),
(3353, 'k750hc|19', 'TH 5707 OE|', '4841 AE-5|', '996cht|12'),
(3355, 'x976pc|85', 'HO 4693 OE|', '0313 CE-0|', '299epo|12'),
(3356, 'e904ea|32', 'MA 1781 PM|', '8954 BO-8|', '534kkh|14'),
(3357, 'e154cy|36', 'th7473be|', '8644bc9|', '421ayo|14'),
(3358, 'y767mm|55', 'AM 7082 XM|', '2991 PC-5|', '955bap|16'),
(3359, 'o041ek|21', 'YA 4521 CY|', '6018 YE-1|', '001aek|11'),
(3360, 'a460me|58', 'AM 5017 OC|', '2287 AA-7|', '546aab|14'),
(3363, 'c898ko|51', 'cp9899mt|', '9635be6|', '836ohx|07'),
(3364, 'k342cp|88', 'EO 4291 HY|', '3585 HX-4|', '327xey|09'),
(3366, 'y295eo|86', 'YP 7173 HP|', '5361 KT-6|', '726ocx|11'),
(3367, 't157eb|15', 'PH 0155 EX|', '6251 CH-9|', '781ekc|10'),
(3368, 'o501mc|84', 'EB 0410 MX|', '9459 OY-0|', '418myp|13'),
(3369, 'm340bp|33', 'kb3956km|', '7507mo6|', '924oox|04'),
(3370, 't669hx|77', 'OM 9037 MK|', '4784 AP-0|', '389exk|15'),
(3371, 'o792pk|76', 'YE 7137 TY|', '3319 MB-8|', '739xca|02'),
(3372, 'x303kx|68', 'PB 0472 XK|', '1839 MH-2|', '002hpx|08'),
(3373, 'a484ce|12', 'YK 8185 TM|', '2085 EB-5|', '746tmb|09'),
(3374, 'e788ek|20', 'HX 8085 OY|', '6893 AC-2|', '271mky|14'),
(3375, 'p844at|50', 'tm3250bc|', '8970ca0|', '394pxe|02'),
(3376, 'm486at|11', 'EE 4299 MM|', '7267 PY-2|', '330oko|07'),
(3377, 'a681bb|11', 'MY 5926 HB|', '9964 CX-5|', '070xkm|14'),
(3378, 'c795ph|53', 'TX 2878 PA|', '8714 KK-5|', '899hbt|07'),
(3379, 'm770mt|79', 'hx8553em|', '8963cy2|', '902yhp|03'),
(3380, 'e044hx|28', 'yk5615bb|', '8110cy4|', '696kpo|08'),
(3381, 'c084ac|34', 'HE 0223 BP|', '7713 BO-3|', '999tpa|07'),
(3382, 't162kb|80', 'hk7407kt|', '1802ht9|', '984cko|09'),
(3383, 'k878ha|38', 'TA 5393 KC|', '3522 BY-0|', '782tab|14'),
(3400, 'h560te|77', 'bh9584ab|', '8378xc7|', '156eyh|07'),
(3402, 't920ht|30', 'cy6708ac|', '5819xk2|', '279emk|10'),
(3403, 'e324ox|63', 'AB 7076 MP|', '7710 CM-1|', '965acb|14'),
(3404, 'm600bt|94', 'pp4636cp|', '4576he4|', '461ook|07'),
(3405, 'e848eb|89', 'AY 6171 CB|', '6119 YA-9|', '892kte|17'),
(3406, 'h306hc|22', 'op6491ae|', '8257hb8|', '882bmt|05'),
(3407, 'h666ob|37', 'ma7310tt|', '6826tb2|', '334mxy|14'),
(3408, 'm343tm|72', 'km1530kb|', '4460yo9|', '107acy|11'),
(3410, 'e345kp|28', 'YT 5616 AX|', '0524 AH-9|', '676mho|08'),
(3411, 'p701be|92', 'EH 6664 PT|', '5604 AP-4|', '107htk|07'),
(3412, 'a348kh|74', 'KA 6451 AY|', '4974 EY-5|', '330mhh|08'),
(3413, 'm746tc|58', 'yt6323kk|', '8521kk2|', '237obt|16'),
(3414, 'c887mc|38', 'ay9161xo|', '5906xx2|', '580ypb|15'),
(3415, 'e782my|15', 'be5167ky|', '5222ox8|', '834aat|08'),
(3417, 'o107he|41', 'KB 7531 OX|', '0913 TB-5|', '949bcp|10'),
(3418, 'e358ex|24', 'mb2154xe|', '6737pc4|', '707aaa|05'),
(3422, 't658cy|40', 'MB 3744 AE|', '9706 KT-4|', '523xee|08'),
(3423, 'h539yh|46', 'TT 9595 YE|', '9531 YE-2|', '664yxk|15'),
(3424, 'x075kp|01', 'HP 8592 XK|', '9885 XP-8|', '163ecx|10'),
(3425, 'a383hb|15', 'ep1135tp|', '5632ok1|', '756pot|05'),
(3426, 'x090ex|18', 'CO 6267 YH|', '5592 BH-8|', '377opy|01'),
(3431, 'm826oc|49', 'TE 9162 TE|', '3998 EB-3|', '700pby|08'),
(3432, 'k164hb|85', 'KO 9144 XM|', '6519 TA-5|', '617oxb|12'),
(3433, 'm763xk|02', 'CA 6110 OB|', '5540 AO-7|', '412xab|13'),
(3434, 'm698xy|29', 'at6333xa|', '3158ap9|', '084key|04'),
(3435, 'p833co|62', 'BT 3305 MT|', '5706 XK-9|', '970bah|02'),
(3436, 'm663tx|20', 'OB 5535 YB|', '4929 YK-8|', '599bop|04'),
(3437, 'o959yx|53', 'MY 6761 KB|', '6908 OY-7|', '638epc|14'),
(3438, 'c349mx|08', 'ko3652ek|', '3987bb0|', '759kyx|11'),
(3439, 'e934eo|22', 'ME 8550 CC|', '1694 TB-8|', '805aoa|04'),
(3440, 'e276xb|49', 'ET 3494 OK|', '8254 TT-0|', '654obe|11'),
(3441, 'c083bb|59', 'XK 4532 OO|', '3496 HY-4|', '241hbt|16'),
(3442, 'k479tb|64', 'ht2852yh|', '2178xp3|', '212pmo|05'),
(3444, 'c923ea|55', 'YK 6247 TB|', '0086 CA-9|', '759ytc|05'),
(3445, 'b173hk|26', 'XY 2258 PH|', '3763 BE-4|', '449akc|04'),
(3446, 'p533tm|52', 'mm1917ty|', '2268ap7|', '774amo|08'),
(3449, 'h766xp|34', 'yt9946xh|', '0593hk5|', '514pyt|16'),
(3450, 'y031bp|19', 'ta5688hx|', '1693ok0|', '795hba|14'),
(3451, 'e006xa|32', 'ob0982oo|', '6533pp4|', '433ttb|04'),
(3453, 'o383kp|21', 'HB 0444 HH|', '9438 TC-5|', '998cpb|10'),
(3454, 'x798ok|41', 'XM 2889 OH|', '9766 AP-9|', '619kcc|17'),
(3455, 'b154ym|01', 'YO 6597 CH|', '7026 YX-1|', '842bte|07'),
(3457, 'c428tm|71', 'HM 2432 HT|', '4033 XE-3|', '046myx|13'),
(3458, 'c498mo|05', 'AE 8375 AT|', '8580 AC-7|', '844hba|05'),
(3459, 'y095yb|29', 'pk6344ax|', '8306ex8|', '521ato|14'),
(3460, 'p910yy|07', 'my2876xx|', '2183ax9|', '401pok|13'),
(3461, 'h186kh|53', 'EC 5102 CC|', '1387 MC-5|', '247aba|06'),
(3462, 'h218ka|38', 'ke7756cp|', '7539ek6|', '236yxt|11'),
(3463, 'o243ah|78', 'KA 1610 MM|', '4121 TB-0|', '758ttk|14'),
(3464, 'm040xo|07', 'MP 6546 TC|', '1074 TX-9|', '845axk|03'),
(3465, 'e433mx|33', 'YA 5506 MC|', '9775 PP-5|', '537hax|17'),
(3466, 'h759ch|22', 'XB 1271 OP|', '4381 XX-3|', '658mha|14'),
(3467, 'y649kk|08', 'KE 4858 MX|', '5127 MC-1|', '839kxx|09'),
(3468, 'e086ep|74', 'CH 2039 KX|', '7051 CP-7|', '798hey|08'),
(3471, 'k535xc|32', 'PT 5468 PE|', '1290 TC-1|', '962mao|07'),
(3472, 'y198xh|04', 'EP 2091 HK|', '7468 YB-3|', '351hom|06'),
(3473, 'h214xk|84', 'mm5717ak|', '2944ma4|', '803kmc|13'),
(3474, 'k002kh|57', 'BP 3664 YK|', '8109 MH-4|', '558ehp|03'),
(3475, 'x714eb|11', 'oa3983cp|', '1710cc1|', '832cme|04'),
(3476, 'b699mh|89', 'PP 7049 MY|', '6682 KC-2|', '974moc|15'),
(3478, 'h342pe|42', 'xb0629ap|', '4458oo1|', '587ecp|07'),
(3479, 't085py|83', 'pt6641ht|', '5627hy2|', '335cko|03'),
(3480, 'a308yp|80', 'xa9645tx|', '9733ak3|', '901mte|02'),
(3481, 'k893am|88', 'KB 2019 BM|', '6287 XB-9|', '807cbk|14'),
(3482, 'a351pc|52', 'tt2641mo|', '7837tc9|', '276ehp|02'),
(3488, 'y573ah|05', 'EK 9538 ME|', '9551 CB-2|', '736tet|15'),
(3489, 'a630yy|09', 'hb3928yy|', '2707kp1|', '544aet|17'),
(3490, 'y042yo|09', 'CX 9773 PC|', '6248 XB-4|', '229ekb|14'),
(3492, 'b286tx|69', 'OH 5013 YB|', '4293 MK-6|', '721yot|01'),
(3494, 'k667ko|44', 'YY 9113 YK|', '9980 KP-8|', '529ctb|08'),
(3496, 't259my|11', 'ya8963bh|', '5989py8|', '448tax|02'),
(3497, 'y450mo|83', 'hp1353ma|', '6357hh9|', '427kym|08'),
(3498, 'h234ac|57', 'EC 9917 YK|', '4909 OX-5|', '315bxh|06'),
(3499, 'm378ta|54', 'om9589xc|', '8992ec7|', '365mba|12'),
(3500, 't653hb|47', 'HO 1138 PC|', '3569 CY-8|', '768yth|07'),
(3501, 'b753ke|91', 'MB 9075 TM|', '7880 PE-1|', '399kph|16'),
(3503, 'a355km|04', 'PP 2445 XK|', '1039 KC-1|', '163ato|14'),
(3506, 'x635ye|23', 'HP 2662 AC|', '4403 XH-6|', '725hhc|06'),
(3511, 'e670pe|44', 'hy5869xk|', '5274hc7|', '688bkm|08'),
(3512, 'y198ao|36', 'YK 4713 AE|', '3849 PY-4|', '840xxe|07'),
(3517, 'y276mc|40', 'KY 0188 OP|', '3131 BO-7|', '103ycp|01'),
(3518, 'o119ab|10', 'tk7553ex|', '5747ky9|', '378bam|07'),
(3519, 'a158hy|16', 'ep9190py|', '8311yx1|', '616pkp|06'),
(3520, 'b629aa|41', 'TK 6315 EA|', '3077 HK-8|', '526aye|16'),
(3521, 'k113op|56', 'AP 6723 PO|', '2938 MP-5|', '005hpe|12'),
(3522, 'o424pb|59', 'xy3965mp|', '7875xh9|', '286pam|01'),
(3523, 'm469hp|48', 'mb1673yh|', '9386cm4|', '910ahh|06'),
(3524, 'p645hp|84', 'TC 6117 BC|', '8536 YT-8|', '390hth|01'),
(3525, 'e205by|52', 'MP 7758 CK|', '2718 XH-9|', '377mtc|15'),
(3526, 'y421bo|17', 'TH 1669 HY|', '3887 CO-9|', '483eyp|05'),
(3528, 'x432ct|75', 'hm4174hk|', '3416ct0|', '503pem|03'),
(3529, 'h698bh|30', 'ca1682xb|', '0043hx7|', '925tmx|05'),
(3530, 'p383bb|93', 'MC 5272 CK|', '6183 BO-3|', '549bcm|06'),
(3531, 'e443ec|56', 'CC 3338 KY|', '1893 AB-2|', '748mee|06'),
(3532, 'k428xo|66', 'BA 8457 EK|', '6682 CX-5|', '787kmm|07'),
(3533, 'h770pt|55', 'BK 5254 MM|', '4597 CP-9|', '658epx|10'),
(3535, 'y761bt|75', 'EE 2837 BO|', '0047 CT-5|', '308cey|15'),
(3536, 't883ce|42', 'bt6359ct|', '9836hp0|', '540kop|04'),
(3538, 'a714xp|93', 'AO 5493 BY|', '1532 AE-6|', '436otx|14'),
(3539, 'k476pt|06', 'BE 1338 XA|', '5791 KY-9|', '962och|15'),
(3541, 'x916ap|57', 'xa6030ac|', '3376pb5|', '774obp|06'),
(3542, 'e629oa|34', 'YA 8603 PM|', '8460 EO-2|', '826tky|09'),
(3543, 'k696ct|11', 'HK 7330 PE|', '9811 AB-3|', '027kmy|13'),
(3545, 'a817bh|41', 'PT 0660 OO|', '1203 EM-0|', '228tyk|03'),
(3546, 'e332xb|59', 'CP 2326 OT|', '1293 HE-5|', '221oae|03'),
(3548, 'a835ae|89', 'ET 3922 TH|', '0514 XK-2|', '805ykx|16'),
(3549, 'y469ck|28', 'BO 2293 MO|', '2341 XA-9|', '231ecp|04'),
(3550, 'k673yb|77', 'ek1912hm|', '6797xb9|', '010ykc|13'),
(3551, 'a510eo|18', 'AE 6514 EB|', '6621 XY-7|', '337exb|04'),
(3553, 'x659he|72', 'KO 1485 BB|', '8674 OT-6|', '370hyh|04'),
(3554, 'y152pa|12', 'MY 5904 EK|', '7202 TY-7|', '304tkk|12'),
(3555, 'o889bo|91', 'ay4194kp|', '1513ta9|', '587hey|09'),
(3556, 't106ah|52', 'HA 3238 TT|', '2045 TT-6|', '267ttx|09'),
(3557, 'c545ky|28', 'mc5962ek|', '8426kc2|', '378xxo|15'),
(3558, 'a956cm|55', 'YO 0675 AB|', '4036 OX-4|', '696kko|08'),
(3559, 'y548pa|04', 'KC 3729 XH|', '7246 OE-8|', '913bke|13'),
(3560, 't573by|72', 'pa6521ya|', '3156ab4|', '147oap|06'),
(3562, 'b185pc|20', 'bo9584xy|', '8044by5|', '854bho|13'),
(3563, 'a668kh|34', 'KM 7891 PT|', '6234ey6|', '650tap|04'),
(3564, 'c880hb|04', 'PP 0282 PY|', '5712 AC-6|', '615bho|05'),
(3566, 'p921ct|78', 'xc1695km|', '0537cm2|', '054eyk|13'),
(3567, 'b967oy|49', 'AY 7697 OO|', '4041 KX-1|', '431ctp|14'),
(3568, 'e981to|27', 'hh6751pa|', '4595pa8|', '870ttt|15'),
(3569, 'b879aa|48', 'YM 8261 EH|', '7792 KM-4|', '376tpo|11'),
(3570, 'x437kk|30', 'xm3164xm|', '0043tc3|', '400teb|10'),
(3571, 'o000xo|77', 'PA 9207 AP|', '3076 HP-4|', '643cpo|14'),
(3573, 'h859my|51', 'et7261oy|', '2435kp9|', '020cap|01'),
(3574, 'p713ct|31', 'kh3780ep|', '1907mm5|', '139eht|01'),
(3575, 'm287ee|83', 'MH 9684 PX|', '5572 YY-0|', '715pyb|13'),
(3576, 'h330ae|72', 'bh6960hk|', '7525bb4|', '064ocp|01'),
(3577, 'y420ba|85', 'HX 8651 YT|', '4818 KK-7|', '935mco|01'),
(3578, 'm229ke|18', 'PM 6577 OA|', '3175 KO-3|', '010mch|08'),
(3580, 'y421ap|54', 'ka6175ya|', '7227mc6|', '741eee|03'),
(3581, 'x239pm|15', 'xe6240yk|', '1212my9|', '171mbm|15'),
(3582, 'x419ko|35', 'TK 1426 PM|', '5258 TA-5|', '355eyt|17'),
(3583, 't774aa|69', 'PP 5420 HX|', '5906 CT-5|', '580pay|02'),
(3584, 'b532ok|07', 'MA 9822 CH|', '3509 PP-7|', '564mcy|10'),
(3585, 'x875hb|57', 'HC 6028 CT|', '5280 OT-9|', '819ypk|12'),
(3586, 'y530bp|86', 'AP 2131 MX|', '7793 TX-7|', '656ypt|10'),
(3587, 'y525xy|79', 'TO 2224 CK|', '5508 HY-6|', '184emk|09'),
(3589, 'h010ym|59', 'XT 0345 CB|', '6326 AH-8|', '616kcy|01'),
(3591, 'e727kt|57', 'OA 6590 BX|', '9882 OO-6|', '200hah|13'),
(3592, 'b205xk|65', 'et2827ha|', '3220yh2|', '314cbx|17'),
(3593, 'm718mk|41', 'ho4117cm|', '1614xe2|', '754pax|05'),
(3595, 'o960ht|50', 'om5419oc|', '2480eh9|', '151myx|11'),
(3596, 'o850ep|61', 'MP 4197 HX|', '3510 AP-9|', '837btk|14'),
(3597, 'e132pp|26', 'PE 1002 TK|', '0228 PA-4|', '053xee|06'),
(3598, 'o432tb|50', 'HX 8438 EE|', '9290 BM-5|', '769mhk|01'),
(3599, 'o698ah|63', 'CA 5787 MB|', '6191 BT-6|', '511yhe|07'),
(3601, 'e854pc|35', 'OB 9068 OA|', '7272 BC-6|', '924hxb|14'),
(3602, 'c434pp|82', 'th9585ma|', '0614xa8|', '826kkc|17'),
(3603, 'c168ch|48', 'AT 0657 KC|', '7661 KM-6|', '654bay|15'),
(3604, 'c394ch|82', 'ay4144ay|', '8962mm0|', '072axy|09'),
(3605, 'p744bk|44', 'op7897tm|', '3152tp2|', '229xte|13'),
(3607, 'b383yh|55', 'YC 6737 EH|', '7802 TK-5|', '178cem|12'),
(3608, 'm790ax|74', 'BP 3011 EA|', '1263 EP-1|', '543yem|09'),
(3610, 'b343ae|17', 'EE 1497 HC|', '5684 OB-2|', '561teb|03'),
(3614, 'y548ym|76', 'KM 1969 CE|', '5706 PY-5|', '325etb|05'),
(3615, 'y666po|86', 'YC 3663 BE|', '4893 MK-5|', '162kob|03'),
(3616, 'k572th|37', 'eo3738ce|', '5431ht5|', '952cka|15'),
(3617, 'c765hc|68', 'oy0999po|', '3793ho5|', '763axc|03'),
(3618, 't532ea|76', 'YM 9567 YO|', '7150 MP-0|', '605kxb|14'),
(3619, 'y699be|06', 'MX 1548 PT|', '5249 EE-3|', '862cmk|16'),
(3620, 'p736ey|68', 'tb8602oc|', '0391bx2|', '560ycy|03'),
(3621, 'p446tp|03', 'et1030cm|', '8112by7|', '007mpk|15'),
(3622, 'k721yh|29', 'KT 2688 XC|', '0050 XT-1|', '845kxx|09'),
(3624, 't951tx|47', 'CH 1675 TX|', '6094 BB-2|', '147mhe|17'),
(3628, 'h653th|92', 'KT 1890 MH|', '0197 AM-5|', '342hyy|03'),
(3630, 'x429yy|01', 'TM 0006 ET|', '2810 MK-0|', '567ppt|13'),
(3632, 'e128bc|05', 'XO 1681 AT|', '6425 CM-5|', '262ycb|13'),
(3633, 'e511bt|71', 'ak5105ky|', '4497ep7|', '045bmy|08'),
(3634, 'm364xk|26', 'cc3165py|', '2239pe5|', '583byy|15'),
(3635, 'h195cy|76', 'OO 9897 OC|', '9876 MY-3|', '115peh|17'),
(3636, 'y666tt|23', 'PX 4747 MM|', '5717 XC-4|', '951meo|05'),
(3637, 'a209he|77', 'PT 0680 MY|', '6534 AM-9|', '071hho|03'),
(3638, 'b295xa|34', 'OT 1517 ET|', '0123 OE-4|', '029xtk|07'),
(3639, 'c052yb|89', 'ex4317xe|', '5581xp9|', '417bxx|12'),
(3643, 'x258mh|32', 'PX 6371 TE|', '6510 YH-5|', '426met|13'),
(3645, 'k292ac|75', 'yo7636he|', '7537ak2|', '227xbh|06'),
(3648, 'b880yo|70', 'ET 0107 TY|', '3134 ET-9|', '354cby|12'),
(3649, 'e440oe|63', 'BK 5947 MK|', '3463 XH-4|', '110axc|13'),
(3650, 'm247mt|74', 'TY 9390 KM|', '3320 KY-2|', '662pph|04'),
(3651, 'k943mk|47', 'bm8965pa|', '6774ap9|', '524mma|12'),
(3652, 'm359yb|47', 'ot6210bo|', '5375to4|', '960axa|09'),
(3653, 'c050ka|50', 'EM 7333 AA|', '4256 PX-2|', '684khp|01'),
(3654, 'y580xb|04', 'em5583yb|', '8922hk4|', '118kkb|05'),
(3655, 'c838oc|32', 'ok2322at|', '0781ep6|', '406ohb|14'),
(3656, 'o753xb|27', 'eo5185kc|', '8562hy1|', '719cya|12'),
(3658, 'h215kk|12', 'MP 3411 XC|', '7796 YA-1|', '255hbp|07'),
(3659, 'b139ak|05', 'mo6212ao|', '1660kt5|', '227mbt|03'),
(3660, 'e311eb|50', 'xm8790oa|', '2065mm1|', '662pbt|02'),
(3663, 'm773xo|32', 'KC 8918 EE|', '2809 YM-9|', '687cob|03'),
(3664, 'y642ya|47', 'CB 7626 BH|', '5502 TY-4|', '771mpt|15'),
(3666, 'e141xy|08', 'CH 6626 BT|', '1027 CP-8|', '345cpe|02'),
(3667, 'k678oe|67', 'EC 6596 BE|', '1700 EA-3|', '070ptk|05'),
(3669, 'c033pm|47', 'OO 4221 PA|', '7411 OM-5|', '858cxe|09'),
(3670, 'e348mt|86', 'KC 0749 XM|', '0710 PY-2|', '378ehb|06'),
(3674, 't157ko|54', 'AM 3393 CA|', '6200 AY-3|', '964kbo|01'),
(3692, 'o890oh|90', 'pm9945tk|', '0324ak4|', '563txk|06'),
(3693, 'm064kx|19', 'hp3497pm|', '6988bt5|', '491bpk|06'),
(3694, 'c574ac|55', 'mh5109th|', '9305ey2|', '563opo|09'),
(3695, 'p281yx|18', 'PE 3907 YT|', '2514 XX-9|', '896bmt|16'),
(3696, 'y889yx|41', 'PY 3067 YP|', '3652 XC-3|', '400chh|09'),
(3697, 'o459bb|79', 'bh2035yc|', '8999eh5|', '422axx|13'),
(3699, 't669tx|73', 'BP 3593 TE|', '7157 CY-8|', '862yey|07'),
(3700, 'h888ak|43', 'OP 6844 YT|', '1348 BK-1|', '018kxm|17'),
(3701, 'o587bk|35', 'xk5141hy|', '4284xb7|', '475kpm|04'),
(3702, 'h192tx|43', 'HE 7834 CH|', '3152 XC-6|', '038oko|07'),
(3705, 'e993aa|49', 'TO 3751 CK|', '9465 KX-1|', '826bpm|07'),
(3707, 'b334pt|19', 'OH 7431 XT|', '8178 EK-4|', '583mam|06'),
(3712, 'p867bo|86', 'HP 2137 YK|', '3417 CH-6|', '991ayt|04'),
(3715, 'p422mp|79', 'PX 5842 KH|', '5726 EA-3|', '798tht|13'),
(3716, 'o803kx|90', 'YP 0957 TA|', '8288 OY-5|', '398yhh|03'),
(3718, 'm623xk|29', 'PY 3664 CP|', '1676 KE-9|', '278tcy|17'),
(3721, 'b124ym|45', 'kh3315eo|', '2267oy4|', '170oky|09'),
(3724, 'x108om|59', 'MB 6475 AM|', '2616 BO-7|', '662eat|12'),
(3726, 'o263ao|09', 'ye5786ab|', '0396mx0|', '604xay|08'),
(3729, 'm648yx|20', 'KM 2503 OO|', '6343 HE-8|', '504opk|01'),
(3730, 'e957om|71', 'EX 8311 OB|', '1985 YP-9|', '125btx|05'),
(3731, 'h164ho|62', 'AY 0897 KT|', '2111 ET-8|', '870otp|16'),
(3732, 't394ho|31', 'KY 0746 PA|', '0771 BY-1|', '540eee|14'),
(3733, 'b549hk|17', 'ha0342ta|', '5603ke0|', '060kbo|11'),
(3734, 'b426mp|18', 'pt3884ky|', '0290xe6|', '009ykb|11'),
(3735, 'o979be|70', 'ph4897bx|', '2578om8|', '400cab|09'),
(3736, 'b296tm|50', 'BX 7661 KP|', '1986 AT-5|', '920kce|01'),
(3738, 'b250xk|33', 'KY 1789 TX|', '5095 HA-7|', '808kyo|06'),
(3739, 'm883ep|86', 'TK 3928 AE|', '0529 HB-1|', '033xhk|13'),
(3740, 'x289my|10', 'ab3691mc|', '9282yh5|', '364mxb|04'),
(3741, 'm899hm|76', 'XA 2752 TK|', '7339 AX-4|', '525beo|17'),
(3742, 'p773op|78', 'km6592yb|', '1244px2|', '861btm|11'),
(3743, 'm011ob|45', 'EB 6295 TC|', '2444 TT-1|', '301mcm|13'),
(3745, 'k168ct|67', 'BB 5697 EP|', '1493 HO-3|', '841pmx|06'),
(3746, 'k651hb|66', 'EK 5912 BM|', '7283 HO-8|', '515exx|11'),
(3747, 'm520bp|09', 'ck9159cc|', '0984ea2|', '320xth|12'),
(3748, 'b968kb|08', 'HX 9785 CH|', '8722 CO-3|', '434bky|02'),
(3752, 'p006oy|16', 'CT 5837 CT|', '3596 EH-4|', '119ybk|01'),
(3761, 'h551by|47', 'OH 3331 TC|', '3120 AB-6|', '900pyk|01'),
(3763, 'p270ek|11', 'HT 6346 XX|', '4147 CY-3|', '220mbb|11'),
(3769, 'b489oa|12', 'AA 1588 AP|', '0623 XY-3|', '849ycp|09'),
(3774, 'x211xt|12', 'TC 8304 HE|', '7819 KT-4|', '417cke|04'),
(3799, 'o932hk|54', 'mp5087mp|', '7376mc5|', '819bbo|14'),
(3800, 'k797mh|10', 'TX 7180 KM|', '8097 HB-8|', '619oap|15'),
(3801, 'y463yh|39', 'HY 1190 YP|', '6127 AK-9|', '065pea|06'),
(3802, 't670et|09', 'HC 8342 KX|', '3622 EB-0|', '842ext|10'),
(3803, 'o842hb|22', 'TH 5282 ME|', '3779 HB-1|', '691yaa|02'),
(3804, 'o423tb|86', 'HB 6146 CT|', '9436 YO-8|', '197yke|11'),
(3806, 'p008tm|82', 'tp2668xm|', '9537ym1|', '839bxb|06'),
(3808, 'c387kk|54', 'xk0354to|', '0279yk5|', '160bax|04'),
(3810, 'h750bp|69', 'CM 1840 EP|', '8863 MM-9|', '696myo|11'),
(3817, 'a224yx|43', 'ye3435yy|', '5033pk7|', '827yhb|12'),
(3818, 'y116ty|26', 'tx1352pp|', '1277oo5|', '603yhe|05'),
(3820, 'b306mk|83', 'MO 5248 AP|', '7849 BB-8|', '111hah|15'),
(3824, 'p766xt|73', 'mh0872cp|', '9398yx0|', '566cyx|09'),
(3827, 'k922my|23', 'KT 3318 TC|', '0397 KO-5|', '367pom|12'),
(3833, 'o578mt|79', 'CE 4337 EH|', '3070 TO-6|', '488pym|03'),
(3834, 't467po|66', 'HX 3728 EC|', '6888 BA-1|', '474teb|11'),
(3837, 'c628ty|31', 'YE 2702 KB|', '6888 TC-8|', '715opx|10'),
(3838, 'm285ox|06', 'co7791eb|', '4496oh7|', '831thm|10'),
(3839, 'c696xc|43', 'BK 3765 CK|', '1908 HX-4|', '182poc|08'),
(3840, 'p074ch|75', 'PC 0608 EY|', '8275 HP-4|', '515xme|14'),
(3841, 'e445kb|19', 'PK 1712 MH|', '7268 OX-6|', '309kpm|06'),
(3842, 'y325bx|26', 'OB 1873 TA|', '4055 AX-4|', '316bkb|10'),
(3843, 'e136xc|27', 'YY 8435 AO|', '3694 MT-7|', '227ooc|05'),
(3845, 'y189ky|62', 'ht9637hx|', '2524xh6|', '592yep|16'),
(3846, 'y012he|59', 'PT 4648 EY|', '2414 PK-4|', '966aea|08'),
(3847, 'x114et|50', 'EB 0532 BO|', '5007 TT-9|', '695key|06'),
(3848, 'b894mm|18', 'km7132xc|', '0174mk0|', '940yhb|01'),
(3849, 'h619tc|10', 'YP 0731 HP|', '4057 BK-1|', '455mey|12'),
(3850, 'x341ec|09', 'YC 8383 MB|', '6075 MX-8|', '979yxh|16'),
(3851, 'b534cb|58', 'px3477et|', '9683yy0|', '413pty|07'),
(3852, 'y949bx|82', 'OP 4356 OT|', '4312 PP-3|', '052cxx|17'),
(3856, 't301km|60', 'KY 7532 BO|', '8376 TE-0|', '246oap|14'),
(3858, 'a657be|38', 'ko0974ee|', '4785tk6|', '113tta|05'),
(3860, 'k928tc|15', 'BT 4706 OB|', '9674 EH-7|', '425xak|07'),
(3861, 'a630yc|54', 'MM 7043 YC|', '7806 XP-4|', '159xhm|03'),
(3862, 't226ay|28', 'po0485op|', '3543pk6|', '665mta|13'),
(3865, 'a998bk|72', 'ET 4213 XO|', '2495 PH-2|', '159yoc|14'),
(3866, 'k830bx|89', 'TC 1616 TH|', '7988 TC-0|', '812kkh|06'),
(3867, 'k882cp|18', 'tt4231hy|', '5970bb6|', '873ata|16'),
(3868, 'x812to|53', 'YK 5619 ET|', '1901 XA-1|', '344yma|17'),
(3869, 'h778hc|84', 'HK 2803 BE|', '4481 TT-3|', '724bmh|15'),
(3870, 'x065be|22', 'BA 1434 KB|', '5732 KP-8|', '396ybc|07'),
(3873, 'c179bb|32', 'XY 9438 MO|', '5272 YH-6|', '756mph|04'),
(3875, 'c589pk|16', 'ba4751yp|', '9266ex4|', '586oxk|06'),
(3876, 'y242ob|75', 'EP 6611 HT|', '4512 OO-7|', '873omo|06'),
(3879, 'a372ep|55', 'om9327my|', '8187eb0|', '965tph|09'),
(3880, 'k788hb|06', 'mo8298my|', '9447yy4|', '219eoo|17'),
(3883, 'p960ah|84', 'OM 5796 AY|', '0915 CT-5|', '114yxc|07'),
(3885, 'm040pe|71', 'HC 2701 EA|', '1632 TT-1|', '177boy|15'),
(3886, 'e843ek|12', 'OE 5470 MB|', '1353 BO-7|', '471obb|15'),
(3887, 'e047mc|42', 'KA 8032 EE|', '3913 OK-5|', '106ybb|08'),
(3888, 'e442et|13', 'BH 6449 HE|', '4908 OY-4|', '334aec|17'),
(3889, 'k527am|83', 'ok6461tx|', '0444by5|', '487okp|03'),
(3890, 'm421oy|39', 'XC 3912 YE|', '6380 ME-7|', '040bey|16'),
(3891, 'a694yh|17', 'pe8764yh|', '1107ce1|', '652hoh|16'),
(3892, 'h359at|57', 'xc7379ek|', '3320ho3|', '001yyh|07'),
(3893, 'm356pm|36', 'OX 2932 YO|', '4357 TE-0|', '719the|13'),
(3894, 'p668ek|60', 'CX 6730 XT|', '6585 AT-3|', '194aom|10'),
(3897, 'e991pc|55', 'PX 7229 AB|', '8383 EC-1|', '594bmt|05'),
(3899, 'e350yy|49', 'BT 2782 CP|', '9318 BP-1|', '900hkp|16'),
(3902, 'p408km|29', 'ok2282mp|', '6022ha2|', '595tco|07'),
(3904, 'o752bk|66', 'ma7039mb|', '7333ax0|', '415kpo|13'),
(3906, 'y948ph|46', 'BO 4184 AO|', '0819 KT-1|', '679mxk|03'),
(3907, 'y564xe|22', 'xe5187et|', '1216tt8|', '645mhh|06'),
(3908, 'h615tb|28', 'YH 1604 EB|', '5291 EE-3|', '220pec|04'),
(3911, 'k164km|51', 'BY 0924 BE|', '6553 KM-9|', '002kxe|05'),
(3912, 'x047kh|94', 'ta5467mk|', '5140mm0|', '345kcp|17'),
(3913, 'o738op|72', 'xc4927ab|', '0835hp6|', '093apm|08'),
(3917, 'x815pc|23', 'bh6026pe|', '4892am6|', '918bmx|16'),
(3919, 'm068xo|40', 'MC 6758 BT|', '1456 YM-7|', '024hab|05'),
(3920, 'h064pk|79', 'AM 0976 MM|', '8109 ME-3|', '679axo|02'),
(3921, 'b493ee|60', 'eo5037xh|', '1774bh6|', '636axa|01'),
(3923, 'b821py|85', 'te4204kh|', '5227xm2|', '731mcy|13'),
(3924, 'a651mx|55', 'EC 2625 BH|', '5987 MO-9|', '375pmx|17'),
(3925, 'y487xt|90', 'HX 5132 YY|', '3155 ME-9|', '928okm|16'),
(3926, 'x570mc|93', 'HP 7953 HY|', '9259 OT-0|', '939ytc|17'),
(3927, 'p479mh|53', 'MO 1293 MO|', '9288 EO-6|', '681hhe|06'),
(3928, 'p766hy|19', 'ym4447mm|', '8291yc7|', '842myy|13'),
(3929, 'm115xe|91', 'KK 2140 XO|', '2346 KA-5|', '819yyb|01'),
(3930, 'p323ha|64', 'th4473ok|', '7206hb2|', '001tka|05'),
(3931, 'o940mp|58', 'AH 9832 KT|', '6465 CE-2|', '098ppt|13'),
(3932, 'k514kx|94', 'PE 5960 YX|', '6176 TX-7|', '965eyh|17'),
(3933, 'h633xa|27', 'EC 7221 BB|', '9335 TC-3|', '880xma|09'),
(3934, 'p164pk|76', 'CK 6650 BY|', '1851 KT-9|', '177key|12'),
(3935, 'y580yx|93', 'ea3385yc|', '4490hk6|', '400ayc|01'),
(3936, 'e825cm|79', 'MB 0063 HH|', '7011 MH-8|', '362xyp|08'),
(3938, 'p774po|80', 'YK 2621 HB|', '3316 YA-0|', '093xmc|09'),
(3939, 'x283cy|83', 'OY 3826 HM|', '8240 XA-9|', '178mkc|12'),
(3940, 'k754cp|64', 'MK 5215 YX|', '4451 OE-9|', '349ctp|10'),
(3941, 'y021aa|87', 'bb8153tp|', '7456px4|', '857mpk|07'),
(3943, 'm503xc|55', 'kh3459yb|', '2235km7|', '713ttp|12'),
(3945, 'b593ma|31', 'MY 9112 HY|', '4713 OC-1|', '899aac|03'),
(3947, 'x110yk|52', 'BM 3486 OP|', '5761 MT-4|', '564pto|01'),
(3948, 'y691pc|35', 'YM 4921 OX|', '1156 EX-8|', '338ptb|09'),
(3949, 'x357th|90', 'EH 7651 KX|', '1848 TX-2|', '839tyt|12'),
(3950, 'y406xp|07', 'YK 1841 AT|', '7103 ME-5|', '570cbk|09'),
(3951, 'x335oa|16', 'oh5677eo|', '5319px9|', '238ybc|03'),
(3952, 't679eo|88', 'PY 8017 PO|', '5270 YK-4|', '332moc|12'),
(3953, 'o532ey|14', 'AO 3428 MK|', '7092 EB-8|', '814khy|01'),
(3954, 'x810et|36', 'tm4487ea|', '0664ak3|', '095myo|16'),
(3955, 'p800pt|41', 'ce6654cy|', '0644yx6|', '298eey|01'),
(3956, 't142ym|60', 'BX 1737 XA|', '6146 HB-0|', '985bmk|11'),
(3957, 'h260ec|81', 'cc3243ae|', '7233oy8|', '809cme|11'),
(3958, 'x980cx|03', 'AY 3129 PK|', '9573 AP-9|', '874coe|06'),
(3959, 'k975ya|28', 'pp1707kc|', '2106ot3|', '346ayb|07'),
(3961, 't684kt|74', 'xe8729po|', '0289kk8|', '628aky|08'),
(3962, 'm570ec|59', 'KX 4145 EY|', '5462 TA-8|', '759cpe|03'),
(3963, 'h954th|59', 'xc2949oc|', '4621yk2|', '786hko|01'),
(3965, 'p601ob|27', 'tc1679hh|', '3180co7|', '381tch|07'),
(3966, 'b948pa|28', 'AM 6016 EB|', '1095 PH-0|', '684kaa|02'),
(3967, 't516xh|34', 'YC 1921 YC|', '5727 ET-2|', '145mko|16'),
(3968, 'a506ax|74', 'xc7490xx|', '7361eb6|', '920eeb|04'),
(3969, 'c018ep|05', 'bo9970et|', '9196kt9|', '767cha|02'),
(3971, 'a315cb|24', 'EX 6654 HC|', '7804 XC-3|', '362cym|01'),
(3972, 'y276pb|34', 'KC 7425 MT|', '4533 YP-3|', '271khy|16'),
(3973, 'h228cm|71', 'ye4506xp|', '0233ky1|', '314omt|14'),
(3975, 'x627ab|76', 'OX 4744 TB|', '7913 CO-4|', '236pcy|03'),
(3976, 'e130cm|40', 'cm3722ya|', '7962ch8|', '257xex|02'),
(3977, 'o869tk|02', 'YC 7739 CA|', '0891 KA-2|', '707ycp|02'),
(3978, 'm837tt|30', 'EC 0914 PA|', '1479 OB-3|', '042pbk|16'),
(3979, 'b117op|91', 'OE 2610 OM|', '3401 PK-0|', '520tmo|10'),
(3981, 'o200kk|05', 'AP 2506 OC|', '9340 EB-5|', '403mhe|17'),
(3982, 'a381ye|81', 'AP 7612 BY|', '7649 CY-5|', '454mce|02'),
(3985, 'x347km|24', 'PT 0154 EK|', '1005 ME-3|', '546ypo|02'),
(3987, 't091cy|42', 'MX 4936 HB|', '0135 TM-0|', '140amh|01'),
(3988, 'a664ox|09', 'bb6674ht|', '7091ba5|', '030ahm|16'),
(3989, 'p533pt|84', 'HC 3718 TA|', '6277 OT-8|', '127ekc|13'),
(3990, 't954xb|46', 'CK 3391 EA|', '0125 MT-9|', '718moh|10'),
(3991, 'h195yy|71', 'OC 7040 BP|', '2249 HT-3|', '583ebk|17'),
(3993, 't000kb|20', 'ae2191py|', '0409oo9|', '075xpy|17'),
(3994, 'x392yp|45', 'MH 6646 KH|', '3846 MH-2|', '367xkk|15'),
(3995, 'p629mt|83', 'ME 6326 PM|', '0467 AB-9|', '917tmm|05'),
(3996, 'c642ax|72', 'OX 2438 CY|', '8094 KK-7|', '588oce|13'),
(3997, 'y243ap|45', 'OY 5193 ME|', '0323 EK-8|', '960mpt|07'),
(3998, 'p167xm|06', 'xk3793bc|', '2440pb3|', '114bmt|13'),
(4000, 'p112mb|80', 'ke4580kk|', '8786px5|', '668hmh|12'),
(4001, 'b190cp|84', 'KX 1578 MT|', '1418 YM-6|', '081txk|09'),
(4002, 'a710te|44', 'HA 6026 YE|', '6684 YX-9|', '196xpp|04'),
(4003, 'o365oy|03', 'BM 3491 XE|', '9412 XH-9|', '319yhh|01'),
(4004, 't948tp|85', 'MC 4580 CB|', '1870 OK-7|', '735bpt|05'),
(4006, 'k242yh|38', 'AP 7578 BK|', '0628 AH-7|', '106yta|02'),
(4007, 't184ok|86', 'HM 9133 OT|', '4697 PB-5|', '260tmc|17'),
(4008, 'o585te|46', 'ac9645xe|', '5001eo7|', '748ext|08'),
(4012, 'o903oy|71', 'ka2335ax|', '1559kt9|', '788ock|14'),
(4013, 'p588hb|19', 'BH 6550 MC|', '8623 PE-8|', '940tpy|02'),
(4014, 'c799ey|48', 'YK 5581 EH|', '9375 MH-3|', '946kop|10'),
(4015, 'c529ae|01', 'MA 8120 YE|', '3442 XH-1|', '907eoh|16'),
(4016, 'y913mh|57', 'BB 9409 TH|', '7092 OH-0|', '203omb|11'),
(4017, 'k703py|65', 'KE 3465 KH|', '5617 EK-1|', '434eox|10'),
(4019, 'b348ht|15', 'ee5213xx|', '4264bt8|', '890bhk|13'),
(4020, 'h346cm|62', 'HT 0780 YY|', '8887 HT-0|', '818xem|14'),
(4021, 'a554op|53', 'OX 9549 CY|', '0585 YK-4|', '723kha|15'),
(4022, 't728ap|05', 'EX 1632 PB|', '5718 YX-4|', '722bha|01'),
(4023, 'h903mk|83', 'YY 6460 BC|', '9633 AO-6|', '594eho|12'),
(4024, 'a400ay|56', 'CC 3113 YT|', '2138 PK-4|', '052okx|01'),
(4026, 'h261co|17', 'XO 4359 OC|', '1419 AP-4|', '281peo|02'),
(4029, 'm764xb|55', 'PB 3271 MO|', '3869 TY-0|', '679pyx|03'),
(4030, 't208bb|87', 'MK 2309 PT|', '7867 YO-6|', '420emp|06'),
(4031, 'b125xb|11', 'EA 5232 PH|', '6499 YB-8|', '406myk|03'),
(4032, 'k222ya|14', 'TP 1287 CK|', '8494 MT-3|', '426xoo|14'),
(4034, 'c299am|30', 'XO 8736 BK|', '7502 BK-7|', '154xme|17'),
(4035, 'x251hx|29', 'PE 8585 XO|', '6957 AK-3|', '272eep|17'),
(4036, 'e633op|46', 'HK 1907 AH|', '5373 EE-6|', '470hym|08'),
(4037, 'o771cb|17', 'aa3749ac|', '7609ax4|', '463ehm|16'),
(4038, 'p541cy|10', 'ey2826oc|', '8611xt8|', '443tcm|12'),
(4039, 'a059hk|06', 'OP 1526 YB|', '6230 HA-5|', '963hcb|07'),
(4041, 'k016pc|02', 'XX 8522 BE|', '0728 OX-1|', '304mhe|11'),
(4042, 'o519xb|13', 'HY 0699 MB|', '4566 OE-7|', '683kyk|07'),
(4043, 'c344ea|08', 'PT 3298 CT|', '0034 TA-7|', '971xbo|08'),
(4045, 'a526hh|36', 'OE 8481 PY|', '4898 AB-6|', '699yyx|10'),
(4047, 'p045ct|30', 'OK 9847 YE|', '0582 YM-8|', '100omm|06'),
(4048, 'e126xp|40', 'mx4930em|', '1374ek0|', '772byp|11'),
(4050, 'a662yo|05', 'ac1508ax|', '5963xy1|', '252thx|08'),
(4051, 'c756eo|33', 'BO 3808 XB|', '6101 AH-2|', '703pcc|13'),
(4052, 't881bx|10', 'tk8990mk|', '7933oe9|', '176kho|09'),
(4053, 'c458ok|71', 'XH 4237 MM|', '6305 CC-9|', '169kat|07'),
(4055, 'c053bm|10', 'pa6455kp|', '4914mp3|', '012kym|17'),
(4056, 'k247ch|47', 'xb3458ye|', '9575ey2|', '674eay|12'),
(4057, 'o683ky|38', 'YB 6052 XB|', '0250 HH-5|', '492hkp|04'),
(4058, 'a981eb|39', 'XX 8170 CT|', '3146 OX-0|', '377xhb|14'),
(4059, 'h343cb|38', 'YC 2340 BB|', '1143 MP-9|', '955tpm|09'),
(4060, 'k622kp|80', 'CY 6920 XY|', '0995 CT-3|', '345ohc|06'),
(4061, 'e938eh|40', 'AX 1623 TH|', '2777 HA-9|', '525kea|13'),
(4062, 'y508ko|60', 'TT 0512 OP|', '5579 EM-2|', '182pmb|11'),
(4063, 'a501ek|34', 'eo5825hy|', '3605ye7|', '785ktx|16'),
(4064, 'o988ok|02', 'CB 9962 CB|', '1523 HM-3|', '935mmm|08'),
(4065, 'p537tb|39', 'to4006tc|', '8242hp7|', '839ecy|03'),
(4066, 'b919mo|01', 'ae8309ch|', '0057xy4|', '751xac|12'),
(4067, 'h868tm|29', 'ye7465oh|', '6448pe2|', '880ceh|16'),
(4068, 't437ck|68', 'ax7829mb|', '8837xx3|', '597cpk|07'),
(4069, 'h408xy|74', 'KA 6577 KC|', '2941 CE-9|', '558oco|02'),
(4073, 'c829py|73', 'OC 4774 EX|', '2118 CM-1|', '933hht|16'),
(4074, 't041me|66', 'ME 5500 PP|', '4765 YH-5|', '959eyc|15'),
(4075, 'e750ey|88', 'KM 3326 CE|', '7006 EX-1|', '818pph|03'),
(4076, 'e872ky|04', 'TE 6686 XA|', '3914 YP-3|', '248keo|12'),
(4077, 'a461tm|57', 'ee4509ep|', '2232tx3|', '066tea|17'),
(4078, 'y540yp|11', 'CA 9876 TM|', '6856 PP-5|', '014app|16'),
(4079, 'h649by|85', 'te7143mc|', '4070pt3|', '965exy|04'),
(4080, 't733xm|48', 'OA 8148 XO|', '0587 KA-7|', '388cex|06'),
(4081, 'h567cy|54', 'ke5496ep|', '0057om8|', '137cxc|15'),
(4082, 'm459at|84', 'th9417oy|', '1559km2|', '837bhe|07'),
(4083, 'e098tc|32', 'eh0360py|', '5313py0|', '750hok|12'),
(4085, 't735eh|14', 'bc3134by|', '5498ak2|', '198tcc|01'),
(4086, 'e413mm|85', 'EO 0502 AB|', '4425 CM-5|', '921mam|15'),
(4087, 'm640hp|17', 'CO 1888 EO|', '0078 BA-5|', '837ckt|12'),
(4089, 'b469eo|47', 'ME 9353 TO|', '8001 AK-3|', '879tex|08'),
(4090, 'y734hk|29', 'CC 4194 KB|', '6459 PX-6|', '285bbc|04'),
(4092, 'b034cc|61', 'TK 2840 YC|', '9673 AM-3|', '140xmp|10'),
(4093, 'k532ap|53', 'AC 5478 MC|', '5284 PM-8|', '843mak|02'),
(4098, 'o700em|33', 'pe2918km|', '3964ye9|', '460txt|12'),
(4099, 'm767ct|42', 'MA 5793 YX|', '4812 YX-2|', '153ypp|05'),
(4100, 'y019ba|93', 'ee0083yp|', '8803em2|', '230oap|04'),
(4101, 'y602ba|10', 'ch4886ay|', '8407tc3|', '406bba|03'),
(4103, 't740ta|35', 'MT 5253 PA|', '5191 EE-0|', '799kyb|13'),
(4105, 'a102ex|34', 'BY 2550 MP|', '3339 AC-9|', '488hxa|02'),
(4106, 'x120yk|07', 'MK 0183 TM|', '0535 KY-6|', '834tak|16'),
(4107, 'b157em|55', 'AH 2676 AP|', '5215 AA-9|', '672hyx|02'),
(4109, 't204tk|20', 'ME 4090 BX|', '8550 MH-8|', '942epe|07'),
(4110, 'b168ty|57', 'co2324yp|', '7566pa0|', '751bab|17'),
(4112, 'p843ob|75', 'OB 3539 CH|', '1228 KX-4|', '604amc|09'),
(4113, 'h670ck|14', 'ye6385py|', '6501ap0|', '610oth|14'),
(4114, 'x219eb|47', 'PT 8070 TT|', '3776 HE-4|', '065oee|13'),
(4115, 'a323po|80', 'XE 5610 MY|', '5836 BO-4|', '268toy|12');
INSERT INTO `lastnumber` (`acc_id`, `rus`, `ua`, `by`, `kz`) VALUES
(4116, 'e276pt|10', 'oe0825xp|', '9007kc8|', '312cob|07'),
(4117, 'o683xp|11', 'YA 5144 PT|', '1734 ME-9|', '462chk|14'),
(4119, 'p294cc|58', 'kx4578oo|', '6091ep2|', '352htm|14'),
(4120, 'h457xt|82', 'OT 8870 AA|', '3377 BP-7|', '764cpa|16'),
(4124, 'k938me|89', 'KH 4693 HY|', '8392 TY-9|', '260hot|08'),
(4125, 'h960ch|85', 'BB 0266 PM|', '1213 AK-2|', '209apk|16'),
(4126, 'b490mt|73', 'MB 4903 KK|', '1225 KT-7|', '228aet|07'),
(4128, 'b621tm|07', 'EC 7135 KC|', '9072 KO-8|', '522toa|13'),
(4133, 'y189ak|72', 'mt8945kt|', '7926ea2|', '068mcb|09'),
(4135, 'c014ya|23', 'pp5526yx|', '8657cc0|', '167tah|02'),
(4136, 'm417kc|26', 'OH 9610 YY|', '5233 CH-9|', '137ycm|08'),
(4137, 'c655ta|66', 'YC 7800 AY|', '9673 XC-1|', '514txb|10'),
(4139, 'e492ha|47', 'OM 0850 PT|', '0109 MO-1|', '966axx|07'),
(4140, 'h964yc|17', 'AB 7595 PE|', '1299 BY-4|', '656kak|06'),
(4141, 'h755ot|70', 'HA 3447 KC|', '5409 XT-9|', '304xox|09'),
(4142, 'c954pp|08', 'MB 5527 XE|', '3922 EC-9|', '512hoo|07'),
(4143, 'y152bk|59', 'KT 7771 HX|', '6034 HE-3|', '792exx|06'),
(4147, 'c122tt|53', 'AP 0477 OO|', '2369 AH-4|', '064kpp|13'),
(4148, 'b878px|71', 'AO 9042 MB|', '2143 OP-6|', '760etm|05'),
(4149, 'c284ak|63', 'hp8248oc|', '1889xm1|', '850boc|04'),
(4150, 'o238te|86', 'HO 6918 EM|', '2347 HP-5|', '714bpo|17'),
(4151, 'a172xk|39', 'CX 6033 HB|', '6403 PO-9|', '242bph|07'),
(4152, 'x914oo|83', 'YA 0766 CC|', '3093 EO-8|', '336hct|08'),
(4153, 'y014xy|43', 'ht0936aa|', '7006kh8|', '797ttb|14'),
(4154, 'x954oo|77', 'MX 9211 CH|', '2230 YA-9|', '257ock|13'),
(4155, 'h619ae|58', 'be3070be|', '2143xx4|', '400kxx|02'),
(4156, 't821xk|75', 'MB 3555 PM|', '6887 ET-4|', '362tkx|17'),
(4157, 'p804pa|24', 'PB 5791 YO|', '8678 ME-8|', '374oae|05'),
(4158, 't776yh|05', 'AO 5613 KA|', '2981 BP-3|', '387heo|08'),
(4159, 'b933ec|49', 'HA 4226 XH|', '3663 PB-9|', '746pea|08'),
(4160, 'm687yb|26', 'CC 2744 ME|', '1246 EE-3|', '835bkc|16'),
(4163, 'b069ae|91', 'XX 3888 XT|', '9947 YH-9|', '653toh|06'),
(4164, 'c880ak|73', 'kh6243oc|', '0150ob0|', '522bpc|05'),
(4165, 'b491mo|35', 'xc3431kt|', '2785cb7|', '114hex|03'),
(4166, 'b483pk|31', 'XT 4270 PX|', '9703 XT-3|', '448ehb|02'),
(4167, 'c611cp|29', 'HA 8642 EA|', '4623 AA-0|', '454cmp|17'),
(4168, 'm860am|69', 'KP 3963 XA|', '1484 MO-3|', '915bep|03'),
(4169, 'h611ec|50', 'CK 3369 KY|', '8637 CX-4|', '418kob|08'),
(4170, 'p874pp|32', 'CX 5310 HO|', '0533 BM-8|', '926eoy|10'),
(4171, 'p283mx|33', 'AP 6875 YX|', '1543 OO-2|', '385pam|12'),
(4172, 'm674ey|69', 'AO 0425 BE|', '8953 YM-1|', '060opt|09'),
(4173, 'k071hh|92', 'oc8997kc|', '8929hh7|', '584hhx|06'),
(4175, 'k080po|25', 'cx1804mb|', '8584bh0|', '520cha|17'),
(4177, 'a973op|03', 'BA 6106 HP|', '6909 XA-4|', '779axk|02'),
(4179, 'k687ey|90', 'MC 2729 AM|', '4417 OT-2|', '324may|09'),
(4180, 'h897ec|44', 'CC 2263 YB|', '5472 HK-1|', '351cct|17'),
(4181, 'h180ah|32', 'tx9339ep|', '9866oc2|', '681yyt|03'),
(4183, 'p181ht|28', 'AE 0943 HH|', '4065 CH-2|', '073aoe|02'),
(4184, 'x332hx|61', 'KX 7001 XP|', '7270 YK-0|', '156oeb|08'),
(4185, 'm138ay|68', 'HO 5386 YX|', '3525 OH-4|', '827xck|14'),
(4186, 'o205aa|89', 'KH 3163 PP|', '1829 TH-3|', '667epo|04'),
(4187, 'p053pb|72', 'OO 8657 OM|', '6967 OK-1|', '428cea|17'),
(4188, 'k280pe|70', 'YM 8042 YE|', '4308 CP-5|', '977ctm|08'),
(4189, 'b003ty|28', 'YP 2690 AO|', '4784 BX-1|', '028kbo|13'),
(4190, 'x606mo|89', 'BB 4989 TT|', '1034 AH-8|', '537hya|17'),
(4191, 'm303mx|17', 'AH 2049 MB|', '4993 CX-2|', '995cob|12'),
(4192, 'c672xm|87', 'HB 3714 TK|', '3543 CO-9|', '621mok|08'),
(4194, 'm108xa|75', 'XX 0729 YX|', '3922 PA-7|', '370ahe|02'),
(4196, 'k130pt|20', 'YP 5809 BA|', '3053 CO-6|', '310kch|16'),
(4197, 'b205kt|41', 'KK 3434 EH|', '4551 PX-4|', '822opc|12'),
(4198, 't026th|41', 'XO 6036 ME|', '3573 XO-7|', '367occ|17'),
(4199, 'b908bh|43', 'MH 1924 EM|', '3965 XY-2|', '320tex|14'),
(4200, 'a790co|71', 'OA 1953 MA|', '6591 TO-9|', '991pxm|13'),
(4201, 'x760pc|04', 'ma5504xo|', '3396ca8|', '422hoc|14'),
(4202, 'x815hk|91', 'YT 2531 HC|', '1809 EY-5|', '873kym|02'),
(4204, 't383ty|08', 'hy9079ca|', '2411px7|', '518coy|16'),
(4205, 'y753xb|65', 'OP 7354 KY|', '6373 XO-7|', '469bem|14'),
(4206, 'm781cm|68', 'XA 6929 PB|', '4893 PH-7|', '646kxt|01'),
(4207, 'e873am|51', 'YB 5526 MA|', '6823 HP-6|', '815pkp|10'),
(4208, 'b959hh|09', 'mb8638bb|', '7058me5|', '754kxb|17'),
(4210, 'h853mt|30', 'XT 2399 HX|', '8557 TE-3|', '732opo|03'),
(4211, 'b115mt|22', 'HP 2828 EH|', '6274 ET-8|', '160oey|13'),
(4212, 'y115xb|47', 'CT 2105 XH|', '1472 TT-0|', '172hoa|04'),
(4214, 'x075ka|27', 'yc7031ko|', '4853tm7|', '876kkx|15'),
(4215, 'k137pk|46', 'KY 9443 TX|', '5822 PX-9|', '316hbx|13'),
(4216, 'e026ak|66', 'xt4262py|', '9337yo6|', '245okh|08'),
(4217, 'x368bc|76', 'TT 9828 MM|', '6826 CY-4|', '859ktm|04'),
(4218, 'x543kk|15', 'OE 3047 MM|', '3425 KK-0|', '290mem|02'),
(4220, 'b866xc|23', 'XY 6590 CO|', '3004 HC-1|', '117obk|07'),
(4221, 'm420hm|23', 'KE 4498 BY|', '2220 OA-7|', '613kah|08'),
(4222, 'a195ay|76', 'to8812ke|', '0692kt6|', '690mmo|12'),
(4223, 'x952em|37', 'BP 0703 BX|', '8483 KX-0|', '420pbk|16'),
(4224, 'b679oo|73', 'KA 9527 HP|', '8665 XE-0|', '198xyb|06'),
(4225, 'm271yk|10', 'xo2226hh|', '0941op6|', '886obm|12'),
(4226, 'y119tt|03', 'PH 4008 YP|', '4458 YX-9|', '362taa|11'),
(4227, 'm730ch|41', 'KE 6730 XY|', '4211 OH-9|', '510btx|14'),
(4228, 'k634em|06', 'TK 6773 BB|', '7386 EX-8|', '889kob|12'),
(4229, 'y884mb|29', 'AT 6931 AX|', '7603 OX-8|', '467ppk|14'),
(4230, 'c663xt|77', 'KP 1890 EO|', '1033 YE-2|', '472hmh|03'),
(4232, 'h440yk|41', 'CC 9185 MB|', '0034 PM-6|', '768mem|08'),
(4233, 'k302bo|23', 'PT 2336 EO|', '1410 BE-9|', '196kbt|06'),
(4234, 'b452oe|87', 'bh4674tc|', '3009tx9|', '356peb|15'),
(4236, 'o198tx|32', 'YB 4010 EO|', '1838 CK-9|', '537bob|14'),
(4237, 'm779ko|08', 'xk6627xa|', '7449yx2|', '161hch|01'),
(4238, 'a987hc|49', 'bc2668pe|', '8307ko5|', '816mek|16'),
(4239, 'o082hy|79', 'bk1743ee|', '8657bp1|', '139abe|11'),
(4240, 'p617co|80', 'px2602cb|', '4676cp9|', '174pot|12'),
(4241, 'o307hb|70', 'ph0477xb|', '7143xe2|', '533bxb|01'),
(4242, 'e548bc|78', 'YO 0114 OB|', '1747 BX-1|', '789epo|16'),
(4243, 't335ot|60', 'OT 0730 AT|', '6350 XH-4|', '315ctx|09'),
(4244, 'm202ka|86', 'HT 0671 EE|', '0312 OO-7|', '134phb|06'),
(4245, 'b289yh|58', 'TP 6692 ET|', '6749 XT-1|', '491yec|01'),
(4247, 'y183px|17', 'YO 1880 EH|', '9488 OC-7|', '730mbt|08'),
(4248, 'b988ao|45', 'th6918ch|', '2436ea9|', '853aco|13'),
(4249, 'c555ec|62', 'mx2729cy|', '6022cb7|', '636pay|12'),
(4250, 'c338eh|94', 'CH 9464 KX|', '2343 OM-2|', '459mkt|05'),
(4251, 'k434mb|47', 'cy7576yb|', '1709ha5|', '085hoo|09'),
(4252, 'm852ao|01', 'ab3240ym|', '0397mm0|', '645pth|06'),
(4254, 'c827kk|66', 'OY 6182 YY|', '5984 TB-7|', '993kxb|03'),
(4255, 'h128yp|09', 'KT 5441 OE|', '8392 HA-1|', '276xpk|15'),
(4256, 'k788oy|28', 'EH 1385 CE|', '2364 ME-5|', '326aat|01'),
(4258, 'h208to|04', 'KP 2806 MC|', '2222 YT-9|', '944mhc|12'),
(4260, 't496ot|18', 'YY 4542 CE|', '7840 EY-8|', '768ahy|13'),
(4263, 'x993at|41', 'co3913xa|', '3532ea2|', '260mpo|16'),
(4264, 'b716mt|89', 'TE 2282 XB|', '1107 XM-6|', '780bhc|14'),
(4265, 'y044ot|64', 'hc5213oe|', '0126yp4|', '187eeb|06'),
(4266, 'm467oe|01', 'MP 0352 OY|', '5560 CB-5|', '390kpm|01'),
(4268, 'a982xk|11', 'OY 4457 OA|', '7881 MC-2|', '015oob|16'),
(4269, 'c033kc|02', 'am5628om|', '6491cm8|', '256xot|05'),
(4270, 'o030pb|86', 'co0844tp|', '6782ox5|', '907eby|06'),
(4271, 't178ye|37', 'YX 1976 MX|', '6041 KY-3|', '828btm|02'),
(4272, 'h710ab|14', 'TY 3391 AA|', '6045 BM-2|', '447aok|10'),
(4273, 'o395ch|61', 'MK 0866 YC|', '8808 CE-5|', '517emc|04'),
(4274, 'y366hp|36', 'CE 8348 MK|', '7726 BE-9|', '860xmx|12'),
(4275, 'm814oh|85', 'AB 7898 XB|', '8394 BH-8|', '975yhh|01'),
(4276, 'y329ck|32', 'to6306xk|', '2051me0|', '901emy|03'),
(4277, 'k402om|43', 'CH 9461 OM|', '2306 OO-1|', '962aky|17'),
(4278, 'e627pp|90', 'ey1403hm|', '6114oa6|', '765omm|11'),
(4279, 'e067ea|85', 'KA 7676 CB|', '6862 TM-0|', '385eoy|02'),
(4280, 'k334kh|34', 'co0458mp|', '8221ah1|', '289kom|06'),
(4281, 'x842yc|03', 'AH 8855 HH|', '1711 AC-0|', '169pxp|13'),
(4282, 'm705xy|54', 'ch4373bm|', '4980yh7|', '921oma|08'),
(4283, 't613xe|55', 'OO 0832 OB|', '7058 HY-4|', '699xkm|01'),
(4284, 'p031py|07', 'OB 5378 KM|', '6619 PA-1|', '241bha|05'),
(4293, 'p974ph|73', 'KB 0432 ME|', '2608 MT-5|', '917ecx|08'),
(4294, 'm332ht|78', 'CM 8696 AP|', '8180 ET-0|', '624ktc|08'),
(4296, 'y140aa|15', 'xx1670kh|', '2527pb4|', '698pha|06'),
(4301, 'y544kx|45', 'EH 9145 TB|', '1246 XC-5|', '006ekh|06'),
(4302, 'c748ct|68', 'EE 8345 KX|', '4055 BC-2|', '810mbc|03'),
(4303, 'x742co|14', 'OC 6448 YT|', '4378 OC-0|', '052ahy|08'),
(4306, 'o558mo|55', 'ak8406cb|', '0294ea0|', '099mhc|13'),
(4307, 'c013ye|31', 'bk6634kt|', '2525ao2|', '264cmt|09'),
(4308, 't704bm|61', 'em2178ae|', '1106ta3|', '227bak|09'),
(4309, 'b519hk|06', 'oh0364eb|', '7413ym0|', '365xoo|10'),
(4310, 'k680mh|01', 'KX 4226 BP|', '4058 KB-3|', '127mkx|15'),
(4312, 'y617hc|76', 'EP 2049 OC|', '1510 XO-7|', '881ybx|02'),
(4313, 'm834bo|42', 'AP 4404 OK|', '1044 PH-4|', '785ocb|02'),
(4314, 'c313ac|22', 'MP 3806 PM|', '6784 TO-8|', '200bbm|01'),
(4315, 'k402mm|21', 'CY 0041 HA|', '7319 AA-3|', '608htx|03'),
(4316, 't377tx|43', 'XX 5536 KB|', '4100 XC-7|', '268ccx|10'),
(4317, 'b589ke|12', 'ec2595pb|', '0728bh3|', '416ete|06'),
(4318, 'p422ex|84', 'CE 3289 OE|', '0854 MX-7|', '216yky|14'),
(4319, 'c722op|63', 'BE 1001 HA|', '8246 CH-3|', '491xtc|10'),
(4320, 'h012ot|78', 'th0127mk|', '0746ae0|', '362oek|08'),
(4321, 't013ta|56', 'MM 8573 CA|', '3368 MB-0|', '216tkc|12'),
(4323, 'e910ho|43', 'EB 3563 EY|', '3502 EX-1|', '039okh|17'),
(4324, 'o772ek|81', 'oe4585ky|', '3498ph2|', '967tet|12'),
(4325, 't635ak|94', 'BK 9879 AP|', '2188 BA-2|', '333ymk|10'),
(4326, 'a264ma|84', 'yh9524kc|', '7537my4|', '281ccm|17'),
(4329, 'y213kc|01', 'hc4723kh|', '0707xp1|', '688hmc|15'),
(4330, 'm913ym|17', 'TE 9493 XT|', '2657 YY-6|', '340yop|11'),
(4331, 'b639bp|11', 'MC 2363 CK|', '8028 BM-3|', '481yyc|09'),
(4332, 'c442cx|84', 'PO 0207 TK|', '9276 PT-1|', '252kbx|15'),
(4333, 't216oe|08', 'pp1254et|', '8248ot1|', '664xya|13'),
(4334, 'y083pp|06', 'MM 6448 EX|', '4569 OE-4|', '706ype|13'),
(4337, 'h318mh|32', 'xx8071yo|', '4817oc7|', '970obb|14'),
(4338, 'k315oo|77', 'MC 7272 MT|', '2224 TC-4|', '783cap|12'),
(4339, 'e051ya|28', 'TK 4307 KK|', '2275 MM-0|', '657mht|12'),
(4340, 'x950tb|32', 'KP 6670 AB|', '0424 EH-8|', '833obo|06'),
(4342, 'e741ba|60', 'EE 1424 MB|', '4501 OP-5|', '764pmp|07'),
(4343, 'k056ac|30', 'mc6368ty|', '4900oc3|', '786xao|14'),
(4344, 'e117co|42', 'XX 7663 KP|', '4161 CC-7|', '631akb|06'),
(4345, 'y823ha|51', 'te9825kt|', '0328ae2|', '376hoc|16'),
(4346, 'p192bc|84', 'co5746yb|', '4746ky9|', '115cmm|02'),
(4348, 'm643pc|90', 'YP 7395 MK|', '2799 HY-3|', '894ecy|16'),
(4349, 'b552ky|33', 'OO 4467 YB|', '8162 OY-0|', '031yha|17'),
(4350, 't774bx|72', 'BO 8474 KH|', '2008 OT-3|', '678bey|09'),
(4351, 'h123ta|76', 'CH 3665 HT|', '1819 OX-8|', '013hpt|04'),
(4352, 'b038px|76', 'MK 1971 HX|', '7122 CP-0|', '824thh|03'),
(4353, 'b583oy|89', 'KE 6730 MC|', '4660 CM-0|', '503mpp|17'),
(4355, 'm225oa|12', 'BC 1071 TP|', '2081 MT-8|', '008kme|14'),
(4356, 'h096ca|94', 'CE 0350 OP|', '7161 TO-1|', '179tet|03'),
(4358, 'h328ot|57', 'HH 4408 TB|', '5096 KH-2|', '734xbh|15'),
(4359, 'c831ek|83', 'YP 3690 XM|', '5193 BK-9|', '957ybk|11'),
(4361, 'o945hx|17', 'OM 5303 AM|', '4982 HO-1|', '075ayc|01'),
(4362, 'a745xk|06', 'AA 4024 TP|', '5829 XO-3|', '005ebx|01'),
(4363, 'e592ta|62', 'MK 1181 TX|', '7479 MT-6|', '462bkb|09'),
(4364, 'h890me|50', 'XE 9821 AP|', '1887 KB-4|', '200pey|09'),
(4365, 'm299bp|62', 'HC 0188 HH|', '3694 CM-7|', '343hkp|04'),
(4366, 'o395tb|47', 'MO 7015 PY|', '5952 CK-4|', '885bxy|05'),
(4367, 'b286pa|34', 'XT 0340 HO|', '5041 EH-6|', '304ybb|04'),
(4368, 'x795py|02', 'TO 8589 AE|', '5690 KA-9|', '265cco|04'),
(4369, 'y738cy|48', 'cp7404kb|', '0100he0|', '726ehy|08'),
(4370, 'x821ee|05', 'EX 1771 OO|', '7414 TE-8|', '589ykx|13'),
(4371, 't323cm|41', 'BE 1595 OM|', '1964 CM-3|', '621ebb|07'),
(4372, 'x444by|41', 'at4875me|', '1858ab0|', '928hbb|06'),
(4374, 'x149bm|79', 'YO 7229 YT|', '2535 EO-1|', '786cek|14'),
(4375, 'o119my|60', 'eb6244ye|', '5486te6|', '834tph|01'),
(4376, 'c208hm|30', 'CB 1205 ME|', '9246 MT-1|', '352ypo|06'),
(4380, 'e106mb|88', 'AT 4834 HP|', '2149 OO-9|', '331oeb|03'),
(4381, 'b157ek|12', 'OH 0683 TC|', '6997 XC-4|', '937kph|05'),
(4384, 'h329ot|68', 'HC 3198 AA|', '3854 MH-7|', '721tpm|05'),
(4386, 'p674tt|75', 'AM 4363 AH|', '0114 OT-6|', '210boe|03'),
(4387, 'y295kc|10', 'TY 3449 PK|', '2487 BH-9|', '482ayx|02'),
(4391, 'b852ko|31', 'MM 8738 YX|', '6275 HT-9|', '821oyt|03'),
(4392, 'm224hy|26', 'ek3134xy|', '1276op6|', '118eco|09'),
(4393, 'c095hx|27', 'HH 9840 CP|', '1966 MC-8|', '404ktc|08'),
(4394, 'k571cc|35', 'TA 7137 PC|', '7905 TB-4|', '126toc|05'),
(4399, 't601eo|06', 'tb8071tc|', '8588xe2|', '640hex|15'),
(4400, 'h307bh|40', 'EA 8048 MO|', '4601 OB-0|', '070heb|02'),
(4401, 'c917tk|91', 'mk5588kx|', '0179ea7|', '661mhp|15'),
(4402, 'a735yo|19', 'MY 3503 OT|', '0312 HB-1|', '369hxh|12'),
(4403, 'y664ek|37', 'AK 0848 TE|', '4754 OA-5|', '205kkt|11'),
(4404, 'h800xp|40', 'EO 5971 OA|', '9554 PO-6|', '037xab|05'),
(4405, 'o727ka|89', 'ya4490bb|', '9501pp0|', '200ahb|17'),
(4407, 'c417ha|28', 'CO 2358 XB|', '0731 TT-9|', '159byc|11'),
(4408, 'a535kc|71', 'BY 1574 XC|', '4094 KE-6|', '474tab|14'),
(4409, 'p424pt|85', 'AT 8441 AE|', '1532 CY-7|', '864tcy|07'),
(4410, 'b375hm|82', 'xy5293ty|', '9749xk3|', '287mxa|15'),
(4411, 'p638xy|38', 'EP 0246 HT|', '3270 OA-5|', '976cpx|07'),
(4412, 'o065hx|03', 'KH 8355 ME|', '4210 YE-7|', '646aph|03'),
(4413, 'b039hm|36', 'hk1354ky|', '0406mp5|', '477xya|04'),
(4414, 'm463pa|47', 'PH 5350 TE|', '4070 BO-9|', '242ame|05'),
(4415, 'a923ap|12', 'om8893yc|', '8679xo6|', '195bma|07'),
(4416, 'y040mo|60', 'EA 6418 PH|', '6641 XA-7|', '473ome|09'),
(4417, 'm008ye|43', 'BX 2287 CH|', '2916 AB-3|', '531bym|15'),
(4420, 'o562ta|64', 'OX 6975 PK|', '2551 TP-5|', '950cke|09'),
(4421, 'o316kt|32', 'YB 5901 CP|', '7833 KO-8|', '657epb|05'),
(4422, 'b672am|49', 'cm3174ox|', '5472eh2|', '129bxk|08'),
(4423, 'x134by|22', 'kc9504kp|', '8975hm0|', '517ytx|09'),
(4424, 'p364co|27', 'BB 1449 PB|', '3534 EA-0|', '769hyo|08'),
(4425, 'k485px|94', 'ht6354ma|', '9480yk3|', '946ccb|02'),
(4426, 'k739hk|46', 'me7455kp|', '3824at1|', '218txc|03'),
(4427, 't423ky|04', 'ky5285et|', '1812xy5|', '443kyc|16'),
(4428, 'o266ea|77', 'oy6696kx|', '2868ek5|', '012exo|17'),
(4429, 'm470pm|04', 'BO 5366 AP|', '5761 TX-4|', '122mmc|06'),
(4430, 'a173cp|28', 'xc2135ct|', '1608xe2|', '712eht|03'),
(4431, 'a926mo|76', 'YH 5025 HA|', '3491 AP-8|', '488pym|08'),
(4432, 't235ak|87', 'PM 0949 EH|', '7422 OT-9|', '337mea|13'),
(4433, 'x566pm|50', 'XT 8199 AP|', '6581 OM-3|', '854kce|04'),
(4434, 'k799ab|59', 'HE 3048 PM|', '9808 OA-0|', '488pby|17'),
(4435, 'm437ey|92', 'BO 9212 TO|', '4084 KO-5|', '264htt|02'),
(4436, 'e664ce|03', 'ye1780bk|', '5585cx5|', '354kcp|11'),
(4438, 'm660ep|01', 'EO 6540 OE|', '6181 KE-5|', '618kca|07'),
(4439, 'h028ya|45', 'bm5140xa|', '1205ec7|', '100key|10'),
(4440, 'o457ap|33', 'CO 1024 OB|', '8389 HO-2|', '032mxo|12'),
(4441, 'e469mp|55', 'PO 1660 MK|', '2017 YH-0|', '431hmt|10'),
(4442, 'c957kc|89', 'PP 1328 TP|', '8729 XC-9|', '080ooy|16'),
(4443, 'o606tt|56', 'ae5049tt|', '1571tm3|', '122maa|14'),
(4445, 'a350hh|84', 'EK 5102 OA|', '8021 CB-9|', '527cme|03'),
(4447, 'y663oe|27', 'bm4377ee|', '1193mb7|', '470mph|15'),
(4448, 'k536mm|54', 'oy0878ey|', '6644ea7|', '684tyy|11'),
(4449, 'c424ah|70', 'CP 3728 TO|', '6865 HH-2|', '460koa|16'),
(4450, 'o639ke|75', 'MA 9129 PE|', '1924 PM-4|', '670cha|14'),
(4451, 'm122kt|63', 'TO 7907 YH|', '0733 HT-2|', '170cxe|13'),
(4452, 'o000oo|576', 'ME 0051 MB|', '4340 XC-8|', '621xcy|15'),
(4453, 't849cp|80', 'TE 1390 PT|', '5622 MY-2|', '874mea|06'),
(4454, 'a161at|58', 'HP 9162 YA|', '2647 CB-6|', '283hpb|02'),
(4455, 'x575yy|68', 'TH 9355 TT|', '4634 AM-0|', '310cke|11'),
(4456, 'c690ec|58', 'OA 7121 KB|', '3514 TH-6|', '912cck|01'),
(4457, 't550tm|58', 'ae4600ca|', '9015he3|', '779txt|17'),
(4460, 'o944ok|87', 'YP 5126 PX|', '9296 KX-8|', '616hma|02'),
(4461, 'b688xh|26', 'CY 3594 KP|', '2317 CC-2|', '213ytb|04'),
(4462, 'e550ym|93', 'KB 2575 EO|', '5833 CH-1|', '036ybt|13'),
(4463, 'c373ey|94', 'OT 0225 CH|', '1845 AX-7|', '519ccm|03'),
(4464, 'b555ty|61', 'EE 3613 AO|', '6473 KX-6|', '058kpx|09'),
(4466, 'y153ke|24', 'BB 7821 OK|', '2369 TK-9|', '348xxh|03'),
(4467, 'c147bh|88', 'KX 3714 TM|', '4860 AP-4|', '097cba|11'),
(4468, 'm919pm|75', 'AC 5603 MP|', '0448 YK-0|', '792oeh|14'),
(4469, 'o020ke|25', 'ak2598pe|', '1225px9|', '528okt|15'),
(4472, 'm237hm|63', 'HO 6583 PX|', '4973 AC-2|', '228xxh|04'),
(4474, 'o778ho|41', 'mp9386cp|', '0688ph0|', '820mca|01'),
(4475, 'h986by|10', 'TM 3436 AH|', '5114 PT-5|', '081abo|06'),
(4477, 'c729at|50', 'MB 6652 YA|', '3744 TC-0|', '863hec|12'),
(4478, 'y936bk|61', 'YK 4959 EE|', '6111 HT-6|', '405kbc|08'),
(4479, 'h834bt|89', 'HP 8030 AC|', '8550 OC-8|', '489ooe|17'),
(4480, 'o501am|53', 'mp2345ck|', '5261pb1|', '337yho|04'),
(4481, 'k683kk|28', 'KM 4096 YM|', '8261 KC-2|', '652kyh|02'),
(4483, 't614ba|79', 'EM 8600 AO|', '0148 OA-7|', '688bke|13'),
(4484, 'e589ay|33', 'mm1499em|', '9448tp8|', '831peh|04'),
(4486, 'k825hk|07', 'EK 7043 AY|', '2227 HT-4|', '880oce|08'),
(4487, 'o011yt|11', 'KB 8046 KB|', '7555 AH-8|', '115aap|09'),
(4488, 'h780oa|65', 'TY 2161 BT|', '8851 MO-6|', '857epb|07'),
(4489, 't684ea|94', 'pa0386yt|', '9112om6|', '385xem|10'),
(4490, 'a898ot|37', 'ep9150cy|', '3676ab5|', '289oom|11'),
(4491, 'k435bc|32', 'pp6733yk|', '1824xt0|', '738txb|08'),
(4492, 'a429ka|49', 'AE 6822 HA|', '7035 EH-7|', '867ayb|12'),
(4493, 'm897ya|50', 'bc0191mm|', '6051oo5|', '871ptk|04'),
(4494, 'k874yh|42', 'et6623by|', '0184xb0|', '865bbm|09'),
(4501, 'a295ea|47', 'oa0789xk|', '2494my1|', '152hyc|11'),
(4505, 'x794eb|57', 'KP 4115 MM|', '1074 AH-6|', '168bmb|09'),
(4506, 't688oc|27', 'MP 1625 EX|', '2986 EE-3|', '122ake|04'),
(4507, 'b870mh|47', 'OY 9738 PO|', '4001 EX-6|', '029pky|09'),
(4508, 'm668ba|86', 'YH 6437 MP|', '9654 HB-3|', '074yhh|15'),
(4509, 'y088yk|56', 'BA 4618 PC|', '8842 EO-1|', '594txo|11'),
(4510, 'k018ay|69', 'TT 4717 KO|', '9439 YH-0|', '550tka|06'),
(4511, 't789em|92', 'XE 4652 BT|', '1861 PY-1|', '952kbx|02'),
(4512, 'p170co|23', 'TT 6570 MM|', '4061 OY-7|', '249hom|09'),
(4513, 'a001mk|58', 'EY 7469 TT|', '8537 TH-4|', '866epm|09'),
(4514, 't522pb|52', 'EA 8758 EB|', '3283 AA-1|', '861xxa|03'),
(4515, 't447xt|71', 'MM 6789 YK|', '6248 CB-9|', '460met|03'),
(4516, 'x111te|39', 'BT 6413 ET|', '7187 MX-8|', '291tpo|17'),
(4517, 't361am|14', 'et0938bm|', '8609hx9|', '189bty|11'),
(4518, 'p464by|75', 'CX 8720 MC|', '8249 YM-3|', '647bha|14'),
(4519, 'c894my|30', 'ET 6449 YB|', '5331 OY-9|', '032ytc|11'),
(4520, 'o620mm|09', 'YP 4445 TH|', '4360 MY-8|', '187epk|02'),
(4522, 'p630ax|09', 'km4242ay|', '0758xx2|', '691yxb|13'),
(4523, 'h274bb|20', 'mm9855ok|', '0552hb5|', '163akk|06'),
(4524, 'y614hc|49', 'ac9148ke|', '4391oc0|', '755hxm|01'),
(4526, 'm479pb|62', 'py1656px|', '0703kt8|', '256coa|02'),
(4527, 'b264ya|92', 'XE 4875 OA|', '3197 OT-8|', '109kxa|11'),
(4528, 'm870mp|56', 'YT 1627 TY|', '9260 XT-8|', '351aka|15'),
(4529, 'p618ah|42', 'HX 9690 MX|', '4195 CB-1|', '376exb|04'),
(4530, 'y927px|43', 'TM 0777 MA|', '0956 CH-5|', '420ymb|17'),
(4531, 'e904bk|76', 'EA 7566 XO|', '6803 MP-8|', '880ecy|17'),
(4534, 't623pc|39', 'TC 5058 EO|', '5725 MH-5|', '972ebp|02'),
(4535, 'x822px|57', 'pc3943mo|', '7434ok7|', '864pbx|13'),
(4536, 'y572ht|90', 'YM 9624 OB|', '6605 TE-9|', '800xco|11'),
(4539, 'h162xm|42', 'TY 2752 AY|', '5453 AK-1|', '812yht|09'),
(4540, 't459bt|06', 'ec7327mp|', '7913oo4|', '300eeb|07'),
(4542, 'y634ac|56', 'me3925ka|', '3658aa5|', '368yke|08'),
(4543, 'a072ha|69', 'me0811tm|', '4381at1|', '304cbc|05'),
(4550, 'b719ab|56', 'YO 0998 PX|', '0870 BH-2|', '312yhh|14'),
(4551, 'b742kb|54', 'HX 0863 OO|', '9492 AA-8|', '779mpe|03'),
(4552, 'h741mo|12', 'AH 5330 OH|', '6969 YT-2|', '001pcb|06'),
(4553, 'e596ye|89', 'CY 3850 AP|', '0240 BK-4|', '669yox|10'),
(4554, 'h134pb|86', 'PB 2200 KY|', '9897 HM-0|', '649bba|05'),
(4555, 'm523hp|73', 'oh4047kt|', '3326xp8|', '615ayo|14'),
(4556, 'h583pm|37', 'XE 8055 HP|', '7788 KB-0|', '190coa|11'),
(4557, 't729ae|46', 'YT 1398 EC|', '1253 TH-8|', '904yeb|17'),
(4558, 'e328bk|53', 'eb2322ho|', '0935ke5|', '994kct|15'),
(4559, 'o603eo|77', 'YX 5405 BH|', '9737 CA-5|', '728ayy|17'),
(4560, 'a468ey|58', 'YE 9530 TB|', '4194 EY-4|', '830the|06'),
(4561, 'x949pt|70', 'kx8025bx|', '2354by2|', '308typ|17'),
(4562, 'm296km|72', 'AK 8538 HE|', '7556 CP-7|', '810xba|03'),
(4566, 'k669ym|70', 'ay5545xe|', '0612ko3|', '832cxe|05'),
(4569, 'p301xx|74', 'EH 1079 KP|', '8029 OP-4|', '045oae|12'),
(4570, 'y849cy|23', 'bx8635ba|', '6664pe1|', '579txh|15'),
(4571, 't375yp|68', 'TT 4706 TX|', '8655 MM-7|', '986xbo|09'),
(4572, 'h229pm|55', 'xa1279tx|', '0249tt3|', '776tee|09'),
(4573, 'o356kh|25', 'KY 6024 HO|', '7716 EM-6|', '129pbk|13'),
(4574, 'a867kp|64', 'TK 5092 AY|', '2220 PB-4|', '424axx|03'),
(4578, 't054bt|40', 'hh4055cm|', '2046bb3|', '271ehe|04'),
(4580, 'm991ox|14', 'HY 1412 MK|', '9141 YO-2|', '513kmo|01'),
(4581, 'o963by|48', 'PH 9108 OC|', '8300 YP-9|', '147xyp|17'),
(4582, 'x514ke|37', 'CP 9276 XP|', '2216 OH-9|', '633cbt|03'),
(4583, 'm236yk|28', 'hy9845ky|', '1568tp4|', '978xxp|03'),
(4584, 'y972ap|11', 'XH 2207 YO|', '7484 CM-9|', '098yyt|11'),
(4585, 'k210ph|44', 'bm7385tb|', '0515oc3|', '671eho|14'),
(4587, 'a920kb|08', 'OK 2670 AE|', '9252 PO-1|', '841cac|09'),
(4588, 'h745ey|69', 'pa7911ch|', '5713ok2|', '512che|04'),
(4589, 'o291tp|20', 'cc6086ee|', '0232xm5|', '792eam|11'),
(4590, 'e514te|43', 'PE 3940 YK|', '1135 MK-5|', '086boy|17'),
(4592, 'm538pc|31', 'yy0639yp|', '4752cb6|', '123tbb|13'),
(4593, 'p532ob|83', 'HO 9226 CO|', '4720 KH-9|', '160bop|03'),
(4594, 'c773bh|29', 'EB 3849 YY|', '7711 OX-4|', '313yye|14'),
(4595, 'p071ka|57', 'XA 7169 AK|', '0718 OA-5|', '823eat|08'),
(4596, 'o419ao|66', 'kp3563yh|', '2134kt9|', '685xbe|16'),
(4597, 'y437bc|56', 'AC 2774 PY|', '9103 PY-7|', '032eoh|02'),
(4598, 't414op|72', 'EY 4504 MK|', '5384 HH-9|', '343bke|09'),
(4599, 'c268ca|81', 'MK 2199 CC|', '9837 XE-4|', '484cax|03'),
(4601, 'o082bb|63', 'PM 1447 EX|', '5910 EX-1|', '533ttb|08'),
(4602, 'h425ho|14', 'CX 7847 EY|', '0573 PA-5|', '151keh|08'),
(4604, 'x933ch|02', 'mk5824oo|', '4591ee6|', '638pae|12'),
(4605, 'y229oa|64', 'KC 8298 KA|', '9334 YP-3|', '106yet|02'),
(4606, 'y187cp|87', 'YK 6974 HE|', '8310 TK-9|', '588ycp|08'),
(4607, 'o459mt|71', 'BB 4868 BP|', '1221 EM-5|', '520ext|05'),
(4608, 'p672ya|28', 'CE 6368 EB|', '6443 KT-1|', '635yca|08'),
(4609, 'm862bp|85', 'HE 5637 AE|', '1161 MY-6|', '860bxt|11'),
(4610, 'a613op|19', 'TH 7776 KA|', '1799 HX-9|', '170oey|14'),
(4611, 'p230ye|12', 'AH 4600 EC|', '8664 XX-4|', '571kcy|01'),
(4612, 'h685co|61', 'AB 4740 XO|', '3600 KH-2|', '407kam|17'),
(4613, 'x911kt|03', 'CX 3211 CX|', '4731 BO-3|', '012mmo|15'),
(4614, 't883ea|73', 'EX 7718 XO|', '2998 EH-7|', '352hkk|02'),
(4615, 'p846mt|25', 'KP 0479 TA|', '8167 HB-2|', '729xek|07'),
(4618, 'p559ax|09', 'HA 3727 OP|', '0190 XY-7|', '757tac|09'),
(4620, 'c998tx|17', 'XM 2445 XP|', '4156 MY-4|', '582acx|11'),
(4621, 'c363mt|06', 'yk6833ce|', '7134xb0|', '921pmy|07'),
(4622, 'b542oa|26', 'TP 5109 OM|', '0954 XC-1|', '783aac|06'),
(4623, 'y456ce|69', 'HH 4841 AP|', '7631 XM-6|', '439teo|17'),
(4625, 'c232ch|61', 'EA 6701 PB|', '2240 AA-4|', '648hph|03'),
(4626, 'm399mx|85', 'MX 2414 KE|', '4084 CM-7|', '176ayb|13'),
(4630, 'o429oe|74', 'yt5744xx|', '2603ot0|', '735xok|07'),
(4631, 'y871bb|13', 'EO 4386 TP|', '5639 CK-1|', '814hbc|16'),
(4632, 'h692ba|51', 'kh0360cb|', '2116mh3|', '917kbt|11'),
(4635, 'p933xo|69', 'pe2337xy|', '3129bp6|', '341tht|02'),
(4636, 't810by|82', 'cm9474pb|', '1574ek5|', '570phb|16'),
(4638, 'p268te|90', 'HH 4376 YH|', '7370 PA-5|', '501tek|08'),
(4646, 'y800ya|67', 'MP 6569 EB|', '6265 YH-1|', '943bxm|16'),
(4647, 't444he|93', 'KY 1862 CX|', '3628 EM-9|', '103map|02'),
(4648, 'o314cx|80', 'EE 6216 HX|', '9417 PA-8|', '244mmt|11'),
(4649, 'b172yc|43', 'HB 7818 XC|', '9182 MT-0|', '875moe|14'),
(4651, 'p717hh|91', 'KB 9915 YT|', '4347 TA-5|', '696hxo|14'),
(4653, 'm531me|78', 'EY 3756 BC|', '7095 MP-6|', '538ota|03'),
(4655, 'e282mt|62', 'TH 4450 CH|', '8714 PX-2|', '394btx|11'),
(4656, 'e340mk|87', 'XP 1537 AA|', '9128 AO-6|', '787xem|11'),
(4660, 'x925ky|32', 'MX 1628 HE|', '0291 PT-3|', '459ymb|10'),
(4661, 'e608yc|10', 'AY 3060 OX|', '6554 KY-4|', '256tyh|06'),
(4662, 'm276ym|87', 'CO 5785 PB|', '0759 OY-4|', '604pxy|10'),
(4663, 'k587hx|33', 'CT 1050 YM|', '7039 KP-5|', '013hhm|03'),
(4664, 'b783ec|68', 'AY 3160 TE|', '9593 XE-9|', '044xoa|09'),
(4665, 'a895mm|32', 'EC 8618 EA|', '8050 TY-7|', '428yha|09'),
(4666, 'e316px|87', 'YE 7282 CH|', '0928 KE-1|', '808yca|10'),
(4667, 'o655xx|73', 'CT 0016 PA|', '0844 HK-7|', '885cex|11'),
(4668, 'c518ae|30', 'PK 0192 PT|', '8472 AT-2|', '470otm|02'),
(4669, 'm317ak|81', 'AO 9825 EC|', '6680 MC-3|', '157kty|13'),
(4670, 'p391et|69', 'XP 4304 MX|', '5583 PO-4|', '603ypm|08'),
(4671, 'y870pe|55', 'PH 0314 OB|', '1054 EK-0|', '592mpt|15'),
(4672, 'm140oc|12', 'KC 4081 BY|', '6324 CO-1|', '820xoo|15'),
(4673, 'k778xb|08', 'XP 4063 BO|', '0550 YM-8|', '653met|14'),
(4674, 'a930pm|47', 'AP 7140 CC|', '4617 XM-7|', '566tea|07'),
(4675, 'o768ob|60', 'KP 3159 KY|', '0897 KM-8|', '660xeh|11'),
(4676, 'm320ph|14', 'xb5719pk|', '5375kb5|', '408cmb|02'),
(4677, 'h214pk|88', 'KB 9404 BH|', '1279 OX-9|', '919yxk|06'),
(4678, 'k065xb|56', 'hm5682hb|', '5460op1|', '801kxx|05'),
(4679, 'b574me|73', 'ke5429et|', '1030kx2|', '721cke|09'),
(4681, 'o658by|28', 'PH 2194 AB|', '4319 XP-7|', '491toc|03'),
(4683, 'x754eo|54', 'AP 0223 XY|', '0792 TX-0|', '360toh|15'),
(4684, 'k425px|71', 'bx9806py|', '5831my8|', '765hty|10'),
(4685, 'h907hp|31', 'YH 9585 BY|', '7216 YH-8|', '633mmt|16'),
(4687, 'm177ax|27', 'KM 2943 HC|', '6939 MC-2|', '947xya|07'),
(4690, 'a449mo|70', 'EA 7370 TP|', '2291 TP-8|', '042tbm|16'),
(4691, 'm787cc|13', 'OY 6885 TK|', '7016 MM-8|', '338yma|14'),
(4692, 'y495ca|64', 'OC 7972 YH|', '3744 PT-7|', '673cpx|04'),
(4694, 'p901kb|14', 'KM 0717 CT|', '1808 CK-3|', '396ayx|06'),
(4695, 'm345pe|28', 'EE 1330 KK|', '3472 XY-3|', '128xba|12'),
(4696, 'o028ob|01', 'AB 7170 BT|', '4381 CP-0|', '853bkt|13'),
(4699, 'c650kh|15', 'EY 7642 EK|', '1397 MT-8|', '348che|02'),
(4700, 'y178kh|42', 'MY 3972 TA|', '8637 PO-1|', '235bmx|15'),
(4703, 'k470to|04', 'XO 5612 EK|', '9822 XM-5|', '514xpm|14'),
(4705, 'b578aa|03', 'pm0370xm|', '7498bh4|', '385xpe|09'),
(4706, 'a927oy|21', 'he2449cp|', '4831yc6|', '619chc|05'),
(4707, 'm713ye|39', 'BC 0238 BM|', '1069 OA-4|', '937top|04'),
(4708, 'e978xh|05', 'MO 3330 KX|', '8093 TO-5|', '629mek|11'),
(4711, 'c151ax|70', 'HH 4355 KT|', '3905 CA-8|', '757mme|07'),
(4712, 'y650ec|13', 'TC 1993 TY|', '8686 MO-0|', '254tbk|04'),
(4713, 't971yx|37', 'TO 9393 CM|', '0768 BH-6|', '398ceb|12'),
(4714, 'x170xa|35', 'aa3070pp|', '7412xm8|', '049teb|16'),
(4715, 'p164mb|28', 'XE 4400 AC|', '9326 MO-7|', '691cpx|13'),
(4718, 'a329ab|31', 'OO 4000 BT|', '9180 XX-3|', '074kbe|08'),
(4719, 'a427ax|23', 'ch2393xh|', '7690oc2|', '626htt|01'),
(4721, 'm902eb|02', 'pc7524yy|', '0853xm5|', '370txb|07'),
(4722, 'c075xe|55', 'KK 1488 YK|', '8932 MY-6|', '776etc|03'),
(4726, 'h179ab|91', 'PC 7214 XP|', '4366 OP-6|', '549bao|17'),
(4727, 'h857eo|43', 'OM 4387 MH|', '2898 MK-9|', '613emb|15'),
(4728, 'x695cc|39', 'bm6878tm|', '0871co5|', '059atp|15'),
(4729, 'c523xx|42', 'TE 7690 OT|', '9763 KT-0|', '331kec|13'),
(4730, 'b790pm|63', 'co7291ae|', '2584pt2|', '092hxx|16'),
(4732, 'm375my|93', 'AK 1308 CX|', '9172 HX-7|', '750bbb|11'),
(4734, 't571xa|82', 'TY 2649 KB|', '3365 YT-7|', '514eta|14'),
(4736, 'h450ec|66', 'CO 5990 CK|', '3474 MA-5|', '950cet|11'),
(4737, 'o031mb|91', 'HA 8784 EX|', '6227 BE-3|', '859pmo|02'),
(4738, 't285yh|70', 'KA 2311 AA|', '7823 AY-9|', '371yox|17'),
(4739, 'c768kc|13', 'oy2788kt|', '5244tt6|', '842meh|07'),
(4740, 'x999tm|20', 'xb1280bk|', '4697mt7|', '340mco|01'),
(4741, 'y930ky|52', 'KE 4289 BE|', '1141 BT-9|', '276bem|04'),
(4742, 't171xo|10', 'XC 2629 TO|', '0580 PP-7|', '355phk|05'),
(4743, 'y737xy|88', 'mo4724ct|', '8357hb9|', '541oae|15'),
(4744, 'x233kh|22', 'OP 9761 CK|', '2300 YP-6|', '850aex|02'),
(4745, 'y103at|92', 'PH 6581 OE|', '6320 EC-9|', '982yoe|06'),
(4746, 'o770py|50', 'TK 1793 XX|', '3737 KP-0|', '280mmo|15'),
(4747, 'y042bx|48', 'EP 0543 HB|', '6061 XT-1|', '269oyx|09'),
(4748, 'p167ka|75', 'AP 1595 PC|', '9485 XB-4|', '553aop|16'),
(4750, 'p517kx|10', 'MH 4612 OX|', '6182 AO-7|', '595pxp|07'),
(4751, 'b113tk|60', 'YH 7186 KB|', '4104 CM-7|', '361acp|13'),
(4752, 'b230yh|79', 'ba8521ax|', '3954hb1|', '980xet|09'),
(4754, 't409tx|26', 'AK 8576 HE|', '6083 AH-0|', '499hxm|03'),
(4755, 'y959hk|28', 'co3257pa|', '6109ta0|', '384ymb|05'),
(4757, 'o054he|30', 'CB 3735 TB|', '0139 TO-9|', '183cxo|05'),
(4758, 'o956ty|57', 'EA 6991 MK|', '5211 BM-0|', '229kbt|09'),
(4759, 'h937kp|42', 'PY 5457 KK|', '8695 XO-5|', '416tmy|11'),
(4760, 'h128ya|85', 'KA 3518 YE|', '0731 KX-7|', '998xmp|16'),
(4761, 'o457yp|29', 'AO 1908 PP|', '0639 KO-1|', '197eko|07'),
(4762, 'k082xo|62', 'CB 8602 OY|', '1137 YE-1|', '341tth|08'),
(4764, 'p903ek|93', 'XM 1236 MY|', '1594 CB-7|', '854hyb|16'),
(4765, 'p660ox|73', 'mo4016ty|', '8909xc8|', '530mxm|03'),
(4766, 'k448tc|61', 'PO 8661 BA|', '9922 AE-0|', '870kke|13'),
(4768, 'x152yy|51', 'MT 9808 XH|', '0489 OK-8|', '420kme|09'),
(4769, 'x227mb|55', 'YB 6178 KO|', '4250 HP-9|', '255kxm|08'),
(4771, 'b074ek|73', 'bx4162yy|', '8995ha0|', '303aty|09'),
(4772, 'k875ma|76', 'hh6906bt|', '4864ah2|', '688xmc|15'),
(4774, 'x999ke|56', 'xe0237ey|', '2286ym4|', '162bxt|04'),
(4775, 'h079et|12', 'YB 5267 HO|', '0126 AY-3|', '155ayc|13'),
(4776, 'y872tc|49', 'AK 7180 CP|', '5946 MK-8|', '727kyp|09'),
(4777, 'k498ak|13', 'XC 8192 YE|', '4028 KB-7|', '785poc|14'),
(4778, 't123ck|88', 'oo2492em|', '9239ay9|', '018eoo|14'),
(4779, 'o974xt|91', 'mh2215pc|', '2579py7|', '783mto|04'),
(4780, 'p437oo|70', 'TY 5617 MP|', '3726 PB-4|', '805bxk|09'),
(4781, 'p214mm|64', 'hx6093ay|', '1151pp4|', '600ymm|09'),
(4783, 'k942xm|02', 'PB 0812 EA|', '1560 XB-3|', '897cxp|12'),
(4784, 'o527mp|71', 'EA 6754 PM|', '9382 KA-6|', '032xpt|12'),
(4785, 't140th|23', 'ec6351hh|', '5774yh3|', '096oec|04'),
(4786, 'c024co|53', 'EY 3167 YO|', '5559 BO-3|', '513bmh|09'),
(4787, 't249yt|20', 'PC 5071 KC|', '1768 KY-5|', '817beo|11'),
(4788, 'k851ob|81', 'BB 7858 BO|', '9379 YK-1|', '909byx|05'),
(4789, 'h742oc|16', 'CE 1656 KH|', '8343 AK-4|', '064yyc|05'),
(4790, 'p315th|43', 'HY 4122 PE|', '8485 CB-6|', '850tbc|09'),
(4791, 'k615ex|80', 'yh3149yk|', '9862ht1|', '980apm|14'),
(4792, 'm303eh|08', 'KX 9891 YA|', '6349 AX-7|', '222phy|10'),
(4794, 'x704ak|37', 'HH 2056 KB|', '0201 XE-4|', '138etp|08'),
(4796, 'c154ox|70', 'ye0434yb|', '1930me9|', '343eec|11'),
(4797, 'y871bm|37', 'HO 9461 AP|', '2980 CX-9|', '544hao|06'),
(4798, 'h696pa|90', 'HM 9761 XP|', '0570 XT-5|', '435koa|07'),
(4799, 'e235pc|30', 'XP 0207 EO|', '3897 XP-0|', '122oxe|12'),
(4800, 'c086oy|92', 'KE 7285 XT|', '1717 YP-4|', '143eyy|17'),
(4801, 'y978aa|40', 'bp1435ee|', '7999pp2|', '332yba|07'),
(4802, 'b360ex|69', 'OC 8656 OK|', '7306 CM-6|', '860tta|10'),
(4803, 'a195ma|37', 'kc7078bm|', '6235px2|', '074mex|04'),
(4804, 'c835aa|23', 'HY 0389 YH|', '7430 ET-6|', '780ykb|06'),
(4805, 'o002mk|90', 'AE 5589 OB|', '1798 OP-9|', '106xkb|05'),
(4809, 'x495ya|53', 'EB 3842 YP|', '1375 KT-3|', '366tct|11'),
(4810, 'c510yh|77', 'MA 9664 MA|', '8732 YA-9|', '921xcp|07'),
(4811, 'k464te|91', 'KY 0949 PP|', '2173 AA-4|', '906ccp|11'),
(4812, 't154co|70', 'MB 8247 TT|', '9627 BX-3|', '630phe|07'),
(4813, 'k620ko|29', 'XE 7496 YP|', '0448 TH-5|', '455tep|09'),
(4814, 'p810mk|41', 'YK 5962 CH|', '9101 OH-7|', '683otx|07'),
(4815, 'h752hb|31', 'PP 7643 BA|', '8596 OT-7|', '003pky|08'),
(4816, 'm638xo|86', 'eo0603kx|', '3245pp9|', '428bob|02'),
(4818, 'a956ak|37', 'TC 7146 KT|', '9422 YE-7|', '540emy|06'),
(4819, 'x704xt|03', 'OC 3770 AM|', '2941 AB-3|', '065kox|10'),
(4820, 'k353ee|53', 'XB 4802 PA|', '6016 BC-0|', '018cxe|08'),
(4821, 'y837ca|22', 'MO 6170 XC|', '5950 HH-3|', '012bhy|07'),
(4823, 'k685ap|23', 'PH 6595 TC|', '2332 BB-8|', '142bho|02'),
(4824, 'h546ka|30', 'AC 6595 AB|', '4963 BC-6|', '746pae|09'),
(4825, 'k764eo|64', 'kk9351bh|', '3510tx3|', '625khx|03'),
(4826, 't127mk|69', 'TT 4913 MP|', '8499 BA-8|', '353tpp|13'),
(4827, 't195xc|38', 'xk8790yy|', '5228ex3|', '029mbx|08'),
(4828, 'm140bh|15', 'AY 8490 XP|', '4298 YM-0|', '363tca|10'),
(4831, 'a927xe|49', 'YO 4252 PH|', '7359 TH-8|', '191cek|10'),
(4833, 'k388ko|94', 'KC 7973 HT|', '7502 XE-7|', '837xoh|07'),
(4835, 'h877ty|87', 'CO 0644 XA|', '7505 HA-2|', '556chh|04'),
(4836, 'x982ca|10', 'YE 0915 PY|', '7376 BE-3|', '070yph|17'),
(4837, 'b264mb|84', 'EC 7185 YT|', '0699 OE-2|', '902pkt|12'),
(4838, 'c335at|01', 'EC 9156 BE|', '0588 YO-8|', '071xaa|03'),
(4839, 't280tm|77', 'XK 9131 MB|', '4430 EX-0|', '158yap|02'),
(4840, 'h790pm|08', 'CM 6106 BM|', '7950 BT-8|', '790boy|08'),
(4841, 'a702pk|28', 'mo6154oa|', '1873ea2|', '931byx|04'),
(4842, 'o219oo|57', 'EB 5717 MY|', '2779 TA-4|', '806phm|17'),
(4843, 'c999py|94', 'mm3253bp|', '6497mx3|', '142eab|13'),
(4844, 'e032mk|77', 'EH 8749 KX|', '8308 BE-1|', '788hte|03'),
(4845, 'e446ko|01', 'tb2196ax|', '1650ap9|', '128ymo|04'),
(4846, 'h284te|46', 'KO 7305 BA|', '6975 BB-5|', '082pkb|08'),
(4847, 'a099hh|34', 'BK 3561 BH|', '8139 MB-1|', '910xat|02'),
(4850, 'm065ka|89', 'KE 7428 HX|', '4156 EP-6|', '729akm|01'),
(4851, 'a409ca|28', 'BY 8024 AP|', '6711 TA-5|', '832xpe|15'),
(4852, 'e561tt|73', 'TY 2738 EM|', '7392 EB-3|', '026hyk|04'),
(4853, 'b687bo|85', 'ho1335yb|', '1059eh0|', '505hop|01'),
(4854, 'o344bx|78', 'MA 6134 OX|', '1532 TK-0|', '293obc|11'),
(4855, 'c939bp|23', 'BB 3793 HT|', '3326 KX-7|', '710hpy|11'),
(4856, 'e494cp|58', 'OP 4164 TE|', '2047 CA-2|', '762peh|04'),
(4857, 'e691ot|64', 'KA 6731 MC|', '1767 BB-8|', '555byp|16'),
(4858, 'e326kb|75', 'mt8680my|', '5114bm1|', '561heb|02'),
(4860, 'c081op|61', 'cm3347xm|', '0943pe9|', '185yta|09'),
(4861, 'y969pt|62', 'BY 3193 YH|', '6401 CC-5|', '183xca|05'),
(4862, 'o484aa|71', 'OK 2336 TY|', '3534 ME-8|', '919ehp|10'),
(4863, 't328pm|71', 'XP 8258 PH|', '8980 HM-4|', '026cah|13'),
(4865, 'k823ay|13', 'ea2316xp|', '0490bh2|', '012apc|07'),
(4866, 'e993bc|38', 'HA 3478 PA|', '8827 BB-3|', '398kya|07'),
(4867, 'y203ea|76', 'om9710at|', '9196ba2|', '060cot|17'),
(4868, 'x210cm|08', 'MX 5311 AK|', '6987 YY-8|', '703bty|07'),
(4869, 'p968mx|37', 'hb6512me|', '9327yp9|', '967oot|10'),
(4870, 'c110mo|01', 'PO 7816 TY|', '8904 BY-0|', '992hta|03'),
(4871, 'c925te|60', 'my1205ce|', '2815ec6|', '121hyx|01'),
(4872, 'b367te|19', 'KH 4954 HA|', '0480 KO-1|', '024bkc|05'),
(4873, 'h913bc|60', 'MK 9811 EC|', '7157 MC-8|', '303bae|02'),
(4874, 't524ty|74', 'ap7618kb|', '6175ke3|', '310yko|05'),
(4875, 'x638by|17', 'YC 7117 AY|', '0763 YA-6|', '755txx|07'),
(4876, 'm464kh|01', 'ah0716ay|', '5030hp3|', '678hcb|03'),
(4878, 'y423hb|62', 'CK 7800 CE|', '8048 TA-9|', '804ema|09'),
(4879, 'x115pa|45', 'EP 9613 TC|', '0679 AP-3|', '405kxh|07'),
(4881, 't906ch|53', 'pa7470ce|', '6720by6|', '478pok|02'),
(4884, 't078bh|85', 'MH 6174 PP|', '8856 TB-1|', '418amx|07'),
(4886, 'y385ob|19', 'TY 8784 YT|', '4582 AH-4|', '645meh|09'),
(4888, 'x837kt|06', 'ey2219bt|', '2227ax1|', '665aok|07'),
(4889, 'a938ok|14', 'ye6711hx|', '6384yb9|', '768ckp|02'),
(4890, 'h176ct|77', 'BB 8461 TB|', '4786 EM-0|', '304ahh|09'),
(4892, 't644tk|78', 'OB 2882 HX|', '2526 HE-0|', '309acp|13'),
(4893, 'e746he|46', 'BO 4816 OP|', '7649 XO-4|', '518cyp|09'),
(4894, 'c438ac|07', 'ct0174ek|', '6511yo3|', '424eac|01'),
(4895, 'x356pc|36', 'CX 3221 OH|', '8221 YA-2|', '027hmy|15'),
(4896, 'h238pt|59', 'KK 8301 OK|', '8196 AO-8|', '057tph|02'),
(4897, 'x773ko|68', 'BP 4427 XO|', '2037 BA-2|', '153bhp|03'),
(4898, 'x515oo|62', 'BO 1878 MH|', '8829 YE-0|', '834amo|08'),
(4899, 't152ea|60', 'co0145th|', '0687at8|', '083hoo|03'),
(4900, 'y227yk|85', 'kh0584ak|', '2563yh1|', '166eob|08'),
(4901, 'm850tx|47', 'BY 3821 HM|', '0609 MX-9|', '097ctp|10'),
(4902, 'y873ty|80', 'OA 8477 MT|', '7567 EM-7|', '015eey|06'),
(4903, 'p102yt|10', 'am0540yh|', '7305ok1|', '970mce|11'),
(4904, 'k278hy|37', 'OP 4501 KE|', '1907 CO-7|', '594eho|14'),
(4905, 'e832tx|51', 'AT 2014 AE|', '7499 MM-6|', '279oep|03'),
(4906, 't129kx|38', 'po3291ex|', '4097ax0|', '650cex|13'),
(4907, 'b660ao|71', 'HM 3245 OH|', '2728 YC-6|', '549occ|16'),
(4908, 'y042oc|79', 'th7243kb|', '3533mo0|', '365xoh|05'),
(4911, 'k086bm|01', 'ce3146po|', '8338xy6|', '837kex|03'),
(4912, 'h685bk|01', 'XM 3792 EY|', '8152 YY-5|', '449yhx|05'),
(4913, 'b976ax|54', 'he2057eh|', '4888hb9|', '699tma|02'),
(4914, 'e881ty|66', 'OC 7683 PM|', '8855 AK-0|', '430ybx|06'),
(4917, 't002xp|15', 'HE 5820 EM|', '3237 MC-1|', '033kot|15'),
(4919, 't563bm|10', 'TP 7233 PK|', '4390 AH-4|', '235yyh|10'),
(4920, 'y986ct|31', 'KH 5764 EY|', '8487 YM-6|', '917mxc|13'),
(4921, 'a267bo|77', 'hp1684bo|', '2917ah4|', '171act|01'),
(4924, 'c500co|83', 'BE 4470 KC|', '3923 KH-5|', '256pba|16'),
(4926, 'm201pb|15', 'AB 1289 PB|', '5623 PA-2|', '997ytx|16'),
(4928, 'x139eo|61', 'tt7561oa|', '4485ko5|', '819hpy|12'),
(4929, 'b214cc|56', 'MH 8510 XH|', '8917 MA-2|', '806mmk|08'),
(4930, 'k060ey|04', 'KE 8979 AY|', '3241 PM-9|', '753pht|10'),
(4931, 'e116ae|49', 'bx3698cm|', '6271ee8|', '212hkm|13'),
(4932, 'o052ke|13', 'MY 1554 OY|', '1847 KX-2|', '908yya|05'),
(4933, 'k618he|13', 'EE 8380 EE|', '8967 TK-6|', '092ktk|06'),
(4934, 'm489hk|38', 'yo1985yh|', '8520ta2|', '142mky|15'),
(4935, 'p625bm|20', 'pt1841ta|', '2818bp5|', '823cpm|17'),
(4937, 'x967mh|36', 'HA 1765 EX|', '1406 XK-0|', '708tox|04'),
(4942, 'p982xh|41', 'MA 3435 CH|', '1766 XT-1|', '065mhm|02'),
(4943, 'e679bx|28', 'pk1865mp|', '6423ck3|', '035xyx|16'),
(4944, 'x508xc|88', 'BA 3517 YO|', '8355 EH-8|', '634eka|04'),
(4945, 'h919ex|70', 'ap2755cx|', '1699hp9|', '720cyy|07'),
(4946, 'h683pk|56', 'AA 2745 XX|', '4764 TO-8|', '109xxh|09'),
(4947, 'a145xe|79', 'op0952po|', '1124pb3|', '328kpa|06'),
(4948, 'k168ky|02', 'AM 9642 YA|', '9603 CX-2|', '766tey|13'),
(4949, 'b643oc|68', 'km6451ym|', '5510tb0|', '548kpo|10'),
(4950, 'a958ob|14', 'HP 5443 YX|', '7846 HO-2|', '412cac|14'),
(4952, 'b825te|53', 'OA 4054 HY|', '4865 AK-5|', '340cep|08'),
(4953, 'h299xh|43', 'BP 5330 MK|', '5560 YA-5|', '188aay|17'),
(4954, 'h638bx|29', 'ym4056et|', '9873px7|', '071xpb|17'),
(4956, 'e493th|56', 'MC 2608 EO|', '4658 MX-1|', '736oax|16'),
(4957, 'c392mp|25', 'tc0157ym|', '3522ec7|', '585hok|02'),
(4958, 'b362eh|11', 'AT 3283 TK|', '0821 HB-0|', '949bee|01'),
(4959, 'o496tt|89', 'EA 0153 AY|', '9607 AX-5|', '514mok|15'),
(4960, 'y763eb|80', 'PC 5118 BX|', '0971 CM-1|', '811tke|01'),
(4966, 'x638bo|68', 'TK 0865 HP|', '0306 CP-4|', '866xot|17');

-- --------------------------------------------------------

--
-- Структура таблицы `leaders`
--

CREATE TABLE `leaders` (
  `id` int(11) NOT NULL,
  `accout_id` int(11) NOT NULL DEFAULT 0,
  `name` varchar(64) NOT NULL,
  `frac_id` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `listban`
--

CREATE TABLE `listban` (
  `acc_id` int(11) NOT NULL,
  `player_name` varchar(24) NOT NULL DEFAULT '',
  `admin_name` varchar(24) NOT NULL DEFAULT '',
  `reason` varchar(128) NOT NULL DEFAULT '',
  `ban_time` int(11) NOT NULL DEFAULT 0,
  `unban_time` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `marketplace_favorites`
--

CREATE TABLE `marketplace_favorites` (
  `account_id` int(11) NOT NULL,
  `lot_id` int(11) NOT NULL,
  `created_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `marketplace_history`
--

CREATE TABLE `marketplace_history` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `lot_id` int(11) NOT NULL DEFAULT 0,
  `item_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL DEFAULT 1,
  `price` int(11) NOT NULL DEFAULT 0,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `seller_name` varchar(24) NOT NULL DEFAULT '',
  `buyer_name` varchar(24) NOT NULL DEFAULT '',
  `item_name` varchar(64) NOT NULL DEFAULT '',
  `created_at` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `marketplace_lots`
--

CREATE TABLE `marketplace_lots` (
  `id` int(11) NOT NULL,
  `seller_id` int(11) NOT NULL,
  `seller_name` varchar(24) NOT NULL,
  `item_id` int(11) NOT NULL,
  `item_count` int(11) NOT NULL,
  `amount` int(11) NOT NULL DEFAULT 1,
  `item_plate` varchar(32) NOT NULL DEFAULT '',
  `item_name` varchar(64) NOT NULL DEFAULT '',
  `item_type` int(11) NOT NULL DEFAULT 0,
  `rarity` int(11) NOT NULL DEFAULT 1,
  `price` int(11) NOT NULL,
  `is_hot` tinyint(4) NOT NULL DEFAULT 0,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` int(11) NOT NULL,
  `expires_at` int(11) NOT NULL,
  `buyer_id` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `marketplace_reward_items`
--

CREATE TABLE `marketplace_reward_items` (
  `id` int(11) NOT NULL,
  `account_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `item_count` int(11) NOT NULL DEFAULT 1,
  `item_plate` varchar(32) NOT NULL DEFAULT '',
  `item_name` varchar(64) NOT NULL DEFAULT '',
  `source_lot` int(11) NOT NULL DEFAULT 0,
  `delivery_kind` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` int(11) NOT NULL DEFAULT 0,
  `expires_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `marketplace_wallet`
--

CREATE TABLE `marketplace_wallet` (
  `account_id` int(11) NOT NULL,
  `balance` bigint(20) NOT NULL DEFAULT 0,
  `updated_at` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `money_log`
--

CREATE TABLE `money_log` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `description` varchar(64) NOT NULL DEFAULT 'None'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `money_log`
--

INSERT INTO `money_log` (`id`, `uid`, `uip`, `time`, `money`, `description`) VALUES
(1, 6, '216.227.144.162', 1786467264, 0, 'None'),
(2, 7, '216.227.144.162', 1786467660, 0, '[BANK] Зарплата'),
(3, 7, '216.227.144.162', 1786468465, 2500000, ''),
(4, 7, '216.227.144.162', 1786468465, 1200000, ''),
(5, 7, '216.227.144.162', 1786468498, 2500000, ''),
(6, 7, '216.227.144.162', 1786468498, 1200000, ''),
(7, 7, '216.227.144.162', 1786468559, 2500000, ''),
(8, 7, '216.227.144.162', 1786468559, 1200000, ''),
(9, 7, '216.227.144.162', 1786468594, 2500000, ''),
(10, 7, '216.227.144.162', 1786468594, 1200000, ''),
(11, 7, '216.227.144.162', 1786468910, 0, 'None'),
(12, 7, '216.227.144.162', 1786468944, 0, 'None'),
(13, 5, '95.59.247.15', 1786470421, 0, 'None'),
(14, 5, '95.59.247.15', 1786470773, -3000000, 'None'),
(15, 5, '89.218.71.183', 1786472142, -3000000, 'None'),
(16, 5, '89.218.71.183', 1786474860, 0, '[BANK] Зарплата'),
(17, 5, '89.218.71.183', 1786476052, -35000000, 'Покупка бизнеса'),
(18, 5, '89.218.71.183', 1786476092, 24500000, '[BANK] Продажа бизнеса'),
(19, 5, '89.218.71.183', 1786476092, 0, 'Продажа бизнеса государству'),
(20, 6, '216.227.144.162', 1786476484, -50000, 'None'),
(21, 5, '89.218.71.183', 1786476484, 50000, 'None'),
(22, 6, '216.227.144.162', 1786476490, -50000, 'None'),
(23, 5, '89.218.71.183', 1786476490, 50000, 'None'),
(24, 5, '89.218.71.183', 1786476503, 0, 'None'),
(25, 6, '216.227.144.162', 1786476522, 0, 'None'),
(26, 12, '179.237.84.43', 1786476693, -15000000, 'Покупка бизнеса'),
(27, 5, '89.218.71.183', 1786477240, 0, 'None'),
(28, 5, '89.218.71.183', 1786477547, 0, 'None'),
(29, 6, '216.227.144.162', 1786477643, 0, 'None'),
(30, 6, '216.227.144.162', 1786479993, 0, 'None'),
(31, 6, '216.227.144.162', 1786479999, 1200000, 'Продажа личного транспорта'),
(32, 6, '216.227.144.162', 1786480007, 0, 'None'),
(33, 6, '216.227.144.162', 1786480014, 4800000, 'Продажа личного транспорта'),
(34, 6, '216.227.144.162', 1786480038, 0, 'None'),
(35, 6, '216.227.144.162', 1786480042, 120000, 'Продажа личного транспорта'),
(36, 6, '216.227.144.162', 1786480064, 0, 'None'),
(37, 6, '216.227.144.162', 1786480070, 1200000, 'Продажа личного транспорта'),
(38, 6, '216.227.144.162', 1786480128, 0, 'None'),
(39, 6, '216.227.144.162', 1786480135, 120000, 'Продажа личного транспорта'),
(40, 6, '216.227.144.162', 1786480143, 0, 'None'),
(41, 5, '89.218.71.183', 1786481830, -2100, 'Покупка телефона'),
(42, 5, '89.218.71.183', 1786481830, 5000, 'Выполнение квеста'),
(43, 5, '89.218.71.183', 1786481842, -450, 'Покупка SIM-карты'),
(44, 5, '89.218.71.183', 1786481877, -250, 'Отправка объявления'),
(45, 5, '89.218.71.183', 1786481898, -50000, 'vip объява'),
(46, 5, '89.218.71.183', 1786481983, 50000000, 'Награда за 1 место по онлайну'),
(47, 5, '89.218.71.183', 1786487414, -3000000, 'None'),
(48, 12, '51.83.187.4', 1786489260, 0, '[BANK] Зарплата'),
(49, 5, '89.218.71.183', 1786489260, 0, '[BANK] Зарплата'),
(50, 5, '89.218.71.183', 1786489401, 0, 'None'),
(51, 12, '51.83.187.4', 1786489403, 0, 'None'),
(52, 12, '51.83.187.4', 1786489423, 0, 'None'),
(53, 12, '51.83.187.4', 1786489428, 0, 'None'),
(54, 12, '51.83.187.4', 1786489432, 0, 'None'),
(55, 5, '89.218.71.183', 1786489434, 0, 'None'),
(56, 5, '89.218.71.183', 1786489447, -9000, 'None'),
(57, 12, '51.83.187.4', 1786489641, -30000000, 'РџРѕРєСѓРїРєР° РіР°СЂР°Р¶Р°'),
(58, 12, '51.83.187.4', 1786489680, -5000000, 'None'),
(59, 6, '216.227.144.162', 1786489818, 0, 'None'),
(60, 5, '89.218.71.183', 1786492149, -5000, 'None'),
(61, 6, '216.227.144.162', 1786492359, -3000000, 'None'),
(62, 6, '216.227.144.162', 1786492851, -67, 'None'),
(63, 15, '2.26.144.10', 1786492851, 67, 'None'),
(64, 6, '216.227.144.162', 1786492860, 0, '[BANK] Зарплата'),
(65, 15, '2.26.144.10', 1786492860, -1, '[BANK] Зарплата'),
(66, 6, '216.227.144.162', 1786492950, -20000000, 'Трейд'),
(67, 15, '2.26.144.10', 1786492950, 20000000, 'Трейд'),
(68, 6, '216.227.144.162', 1786493261, 0, 'None'),
(69, 6, '216.227.144.162', 1786493281, 44000000, 'Продажа личного транспорта'),
(70, 6, '216.227.144.162', 1786493315, 0, 'None'),
(71, 15, '2.26.144.10', 1786493325, -700000, 'Покупка в донат-магазине'),
(72, 6, '216.227.144.162', 1786493414, 0, 'None'),
(73, 6, '216.227.144.162', 1786493708, -15000000, 'Покупка бизнеса'),
(74, 6, '216.227.144.162', 1786494175, -3000000, 'None'),
(75, 15, '2.26.144.10', 1786495446, 2000, 'BlackPass reward'),
(76, 15, '2.26.144.10', 1786495452, 20000, 'BlackPass reward'),
(77, 15, '2.26.144.10', 1786495455, 20000, 'BlackPass reward'),
(78, 15, '2.26.144.10', 1786495459, 20000, 'BlackPass reward'),
(79, 15, '2.26.144.10', 1786495465, 3000, 'BlackPass reward'),
(80, 15, '2.26.144.10', 1786495468, 900000, 'BlackPass reward'),
(81, 15, '2.26.144.10', 1786495470, 900000, 'BlackPass reward'),
(82, 15, '2.26.144.10', 1786495471, 900000, 'BlackPass reward'),
(83, 15, '2.26.144.10', 1786495479, 750000, 'BlackPass reward'),
(84, 15, '2.26.144.10', 1786495481, 750000, 'BlackPass reward'),
(85, 15, '2.26.144.10', 1786495502, 900000, 'BlackPass reward'),
(86, 15, '2.26.144.10', 1786496460, 0, '[BANK] Зарплата'),
(87, 15, '2.26.144.10', 1786496820, 1500000, 'BlackPass reward'),
(88, 15, '2.26.144.10', 1786496822, 900000, 'BlackPass reward'),
(89, 15, '2.26.144.10', 1786496870, 30000, 'BlackPass reward'),
(90, 15, '2.26.144.10', 1786496873, 20000, 'BlackPass reward'),
(91, 5, '89.218.71.183', 1786519547, 21000000, '[BANK] Продажа гаража'),
(92, 5, '89.218.71.183', 1786519547, 0, 'Продажа гаража государству'),
(93, 5, '89.218.71.183', 1786519549, -30000000, 'РџРѕРєСѓРїРєР° РіР°СЂР°Р¶Р°'),
(94, 12, '51.83.187.4', 1786522062, 0, 'None'),
(95, 15, '2.26.144.10', 1786530188, 0, 'None'),
(96, 12, '51.83.187.4', 1786531279, 0, 'None'),
(97, 12, '51.83.187.4', 1786531300, 0, 'None'),
(98, 12, '51.83.187.4', 1786531305, 0, 'None'),
(99, 12, '51.83.187.4', 1786531408, 0, 'None'),
(100, 12, '51.83.187.4', 1786531896, 21000000, '[BANK] Продажа гаража'),
(101, 12, '51.83.187.4', 1786531896, 0, 'Продажа гаража государству'),
(102, 12, '51.83.187.4', 1786531904, -30000000, 'РџРѕРєСѓРїРєР° РіР°СЂР°Р¶Р°'),
(103, 12, '51.83.187.4', 1786531979, -5000000, 'None'),
(104, 15, '2.26.144.11', 1786532290, -3000000, 'None'),
(105, 12, '51.83.187.4', 1786532441, 0, 'None'),
(106, 15, '2.26.144.11', 1786532460, 0, '[BANK] Зарплата'),
(107, 12, '51.83.187.4', 1786532460, 0, '[BANK] Зарплата'),
(108, 12, '51.83.187.4', 1786532481, 0, 'None'),
(109, 15, '2.26.144.11', 1786532511, -50000, 'Покупка улучшения аккаунта'),
(110, 15, '2.26.144.11', 1786532520, -75000, 'Покупка улучшения аккаунта'),
(111, 15, '2.26.144.11', 1786532528, -100000, 'Покупка улучшения аккаунта'),
(112, 15, '2.26.144.11', 1786532535, -125000, 'Покупка улучшения аккаунта'),
(113, 15, '2.26.144.11', 1786532541, -150000, 'Покупка улучшения аккаунта'),
(114, 15, '2.26.144.11', 1786532695, 0, 'None'),
(115, 15, '2.26.144.11', 1786533066, -2000, 'Перегенерация номерного знака'),
(116, 15, '2.26.144.11', 1786533070, -2000, 'Перегенерация номерного знака'),
(117, 15, '2.26.144.11', 1786533072, -2000, 'Перегенерация номерного знака'),
(118, 15, '2.26.144.11', 1786533083, -2000, 'Перегенерация номерного знака'),
(119, 15, '2.26.144.11', 1786533085, -2000, 'Перегенерация номерного знака'),
(120, 15, '2.26.144.11', 1786533089, -2000, 'Перегенерация номерного знака'),
(121, 15, '2.26.144.11', 1786533094, -2000, 'Перегенерация номерного знака'),
(122, 15, '2.26.144.11', 1786533095, -2000, 'Перегенерация номерного знака'),
(123, 15, '2.26.144.11', 1786533098, -2000, 'Перегенерация номерного знака'),
(124, 15, '2.26.144.11', 1786533112, -2000, 'Перегенерация номерного знака'),
(125, 15, '2.26.144.11', 1786533115, -2000, 'Перегенерация номерного знака'),
(126, 15, '2.26.144.11', 1786533122, -2000, 'Перегенерация номерного знака'),
(127, 15, '2.26.144.11', 1786533128, -2000, 'Перегенерация номерного знака'),
(128, 15, '2.26.144.11', 1786533135, -2000, 'Перегенерация номерного знака'),
(129, 15, '2.26.144.11', 1786533142, -2000, 'Перегенерация номерного знака'),
(130, 15, '2.26.144.11', 1786533144, -2000, 'Перегенерация номерного знака'),
(131, 15, '2.26.144.11', 1786533147, -2000, 'Перегенерация номерного знака'),
(132, 15, '2.26.144.11', 1786533149, -2000, 'Перегенерация номерного знака'),
(133, 15, '2.26.144.11', 1786533150, -2000, 'Перегенерация номерного знака'),
(134, 15, '2.26.144.11', 1786533152, -2000, 'Перегенерация номерного знака'),
(135, 15, '2.26.144.11', 1786533153, -2000, 'Перегенерация номерного знака'),
(136, 15, '2.26.144.11', 1786533154, -2000, 'Перегенерация номерного знака'),
(137, 15, '2.26.144.11', 1786533155, -2000, 'Перегенерация номерного знака'),
(138, 15, '2.26.144.11', 1786533156, -2000, 'Перегенерация номерного знака'),
(139, 15, '2.26.144.11', 1786533157, -2000, 'Перегенерация номерного знака'),
(140, 15, '2.26.144.11', 1786533158, -2000, 'Перегенерация номерного знака'),
(141, 15, '2.26.144.11', 1786533159, -2000, 'Перегенерация номерного знака'),
(142, 15, '2.26.144.11', 1786533160, -2000, 'Перегенерация номерного знака'),
(143, 15, '2.26.144.11', 1786533161, -2000, 'Перегенерация номерного знака'),
(144, 15, '2.26.144.11', 1786533162, -2000, 'Перегенерация номерного знака'),
(145, 15, '2.26.144.11', 1786533163, -2000, 'Перегенерация номерного знака'),
(146, 15, '2.26.144.11', 1786533164, -2000, 'Перегенерация номерного знака'),
(147, 15, '2.26.144.11', 1786533166, -2000, 'Перегенерация номерного знака'),
(148, 15, '2.26.144.11', 1786533167, -2000, 'Перегенерация номерного знака'),
(149, 15, '2.26.144.11', 1786533168, -2000, 'Перегенерация номерного знака'),
(150, 15, '2.26.144.11', 1786533169, -2000, 'Перегенерация номерного знака'),
(151, 15, '2.26.144.11', 1786533170, -2000, 'Перегенерация номерного знака'),
(152, 15, '2.26.144.11', 1786533171, -2000, 'Перегенерация номерного знака'),
(153, 15, '2.26.144.11', 1786533172, -2000, 'Перегенерация номерного знака'),
(154, 15, '2.26.144.11', 1786533173, -2000, 'Перегенерация номерного знака'),
(155, 15, '2.26.144.11', 1786533175, -2000, 'Перегенерация номерного знака'),
(156, 15, '2.26.144.11', 1786533176, -2000, 'Перегенерация номерного знака'),
(157, 15, '2.26.144.11', 1786533177, -2000, 'Перегенерация номерного знака'),
(158, 15, '2.26.144.11', 1786533178, -2000, 'Перегенерация номерного знака'),
(159, 15, '2.26.144.11', 1786533179, -2000, 'Перегенерация номерного знака'),
(160, 15, '2.26.144.11', 1786533196, -5000, 'Покупка номерных знаков'),
(161, 5, '89.218.71.183', 1786533352, -35000000, 'Покупка бизнеса'),
(162, 17, '2.26.144.11', 1786533761, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(163, 17, '2.26.144.11', 1786533765, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(164, 17, '2.26.144.11', 1786533773, 48299202, 'Выдача денег от админа Pepel_izBlood'),
(165, 16, '216.227.144.162', 1786534097, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(166, 16, '216.227.144.162', 1786534109, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(167, 16, '216.227.144.162', 1786534110, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(168, 16, '216.227.144.162', 1786534115, 382829929, 'Выдача денег от админа Pepel_izBlood'),
(169, 18, '2.26.144.6', 1786534158, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(170, 18, '2.26.144.6', 1786534159, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(171, 18, '2.26.144.6', 1786534205, 500000000, 'Выдача денег от админа Pepel_izBlood'),
(172, 18, '2.26.144.6', 1786534210, 39392929, 'Выдача денег от админа Pepel_izBlood'),
(173, 16, '216.227.144.162', 1786534272, -3000000, 'None'),
(174, 5, '89.218.71.183', 1786534784, 24500000, '[BANK] Продажа бизнеса'),
(175, 5, '89.218.71.183', 1786534784, 0, 'Продажа бизнеса государству'),
(176, 5, '89.218.71.183', 1786534796, -15000000, 'Покупка бизнеса'),
(177, 16, '216.227.144.162', 1786535284, -888888888, 'None'),
(178, 16, '216.227.144.162', 1786535455, -30000000, 'РџРѕРєСѓРїРєР° РіР°СЂР°Р¶Р°'),
(179, 5, '95.56.250.183', 1786542199, 10500000, '[BANK] Продажа бизнеса'),
(180, 5, '95.56.250.183', 1786542199, 0, 'Продажа бизнеса государству'),
(181, 5, '95.56.250.183', 1786542202, -25000000, 'Покупка бизнеса'),
(182, 19, '179.237.84.43', 1786542399, 0, 'None'),
(183, 12, '179.237.84.43', 1786542536, 0, 'None'),
(184, 12, '179.237.84.43', 1786542789, 100000000, 'Выдача денег от админа Dev_RTF'),
(185, 12, '179.237.84.43', 1786542884, 100000000, 'Выдача денег от админа Dev_RTF'),
(186, 12, '179.237.84.43', 1786542903, -3000000, 'None'),
(187, 16, '216.227.144.162', 1786543260, 0, '[BANK] Зарплата'),
(188, 18, '2.26.144.11', 1786543260, 0, '[BANK] Зарплата'),
(189, 18, '2.26.144.11', 1786543432, 900000, 'BlackPass reward'),
(190, 18, '2.26.144.11', 1786543434, 900000, 'BlackPass reward'),
(191, 18, '2.26.144.11', 1786543436, 900000, 'BlackPass reward'),
(192, 18, '2.26.144.11', 1786543439, 900000, 'BlackPass reward'),
(193, 18, '2.26.144.11', 1786543441, 900000, 'BlackPass reward'),
(194, 18, '2.26.144.11', 1786543446, 900000, 'BlackPass reward'),
(195, 16, '216.227.144.162', 1786543452, 0, 'None'),
(196, 18, '2.26.144.11', 1786543463, 900000, 'BlackPass reward'),
(197, 18, '2.26.144.11', 1786543474, 900000, 'BlackPass reward'),
(198, 18, '2.26.144.11', 1786543483, 900000, 'BlackPass reward'),
(199, 18, '2.26.144.11', 1786543571, 0, 'None'),
(200, 16, '216.227.144.162', 1786550460, 0, '[BANK] Зарплата'),
(201, 18, '2.26.144.6', 1786550460, 0, '[BANK] Зарплата'),
(202, 21, '95.56.250.183', 1786559948, 282882882, 'Выдача денег от админа Ray_Amigo'),
(203, 21, '95.56.250.183', 1786559951, 28288288, 'Выдача денег от админа Ray_Amigo'),
(204, 21, '95.56.250.183', 1786559989, -15000000, 'Покупка бизнеса'),
(205, 20, '51.83.187.4', 1786560522, 1200000, ''),
(206, 20, '51.83.187.4', 1786560692, 0, 'None'),
(207, 20, '51.83.187.4', 1786560711, 0, 'None'),
(208, 20, '51.83.187.4', 1786560743, 0, 'None'),
(209, 20, '51.83.187.4', 1786560791, 0, 'None'),
(210, 21, '95.56.250.183', 1786563629, -2828288, 'Пополнение денег в банкомате (другая сумма)'),
(211, 20, '51.83.187.4', 1786563671, -1200000, 'Благотворительность'),
(212, 20, '51.83.187.4', 1786563699, 0, 'None'),
(213, 20, '51.83.187.4', 1786563716, 0, 'None'),
(214, 21, '95.56.250.183', 1786563737, -9000, 'None'),
(215, 21, '95.56.250.183', 1786563770, -6800, 'None'),
(216, 21, '95.56.250.183', 1786563834, -6800, 'None'),
(217, 20, '51.83.187.4', 1786564860, 0, '[BANK] Зарплата'),
(218, 20, '51.83.187.4', 1786564897, 0, 'None'),
(219, 20, '51.83.187.4', 1786565245, 0, 'None'),
(220, 20, '51.83.187.4', 1786565362, 500000000, 'Выдача денег от админа Dev_RTF'),
(221, 18, '2.26.144.11', 1786566445, 20000, 'BlackPass reward'),
(222, 18, '2.26.144.11', 1786566449, 2000, 'BlackPass reward'),
(223, 18, '2.26.144.11', 1786566456, 3000, 'BlackPass reward'),
(224, 18, '2.26.144.11', 1786566463, 30000, 'BlackPass reward'),
(225, 18, '2.26.144.11', 1786566480, 30000, 'BlackPass reward'),
(226, 18, '2.26.144.11', 1786566483, 30000, 'BlackPass reward'),
(227, 18, '2.26.144.11', 1786566492, 3000, 'BlackPass reward'),
(228, 18, '2.26.144.11', 1786566493, 3000, 'BlackPass reward'),
(229, 18, '2.26.144.11', 1786566706, 0, 'None'),
(230, 20, '51.83.187.4', 1786570319, 0, 'None'),
(231, 20, '51.83.187.4', 1786570448, -8500, 'None'),
(232, 20, '51.83.187.4', 1786570457, 680000, 'Продажа личного транспорта'),
(233, 20, '51.83.187.4', 1786570477, -500000, 'None'),
(234, 20, '51.83.187.4', 1786570626, -500000, 'None'),
(235, 16, '216.227.144.162', 1786579587, 0, 'None'),
(236, 16, '216.227.144.162', 1786598072, 0, 'None'),
(237, 18, '2.26.144.11', 1786598211, 0, 'None'),
(238, 18, '2.26.144.11', 1786598592, -35000000, 'Покупка бизнеса'),
(239, 18, '2.26.144.6', 1786599173, 0, 'None'),
(240, 18, '2.26.144.6', 1786599436, 0, 'None'),
(241, 16, '216.227.144.162', 1786600460, 0, 'None'),
(242, 22, '216.227.144.162', 1786616646, 0, 'None'),
(243, 22, '216.227.144.162', 1786616651, 1200000, 'Продажа личного транспорта'),
(244, 22, '216.227.144.162', 1786616669, -35000, 'None'),
(245, 22, '216.227.144.162', 1786616681, 2800000, 'Продажа личного транспорта'),
(246, 22, '216.227.144.162', 1786616688, -35000, 'None'),
(247, 22, '216.227.144.162', 1786616691, 2800000, 'Продажа личного транспорта'),
(248, 22, '216.227.144.162', 1786616778, 0, 'None'),
(249, 22, '216.227.144.162', 1786616807, 44000000, 'Продажа личного транспорта'),
(250, 22, '216.227.144.162', 1786616871, 0, 'None'),
(251, 22, '216.227.144.162', 1786616876, 20800000, 'Продажа личного транспорта'),
(252, 22, '216.227.144.162', 1786616886, 0, 'None'),
(253, 22, '216.227.144.162', 1786616902, 4000000, 'Продажа личного транспорта'),
(254, 22, '216.227.144.162', 1786616936, 900000, 'BlackPass reward'),
(255, 20, '5.181.201.9', 1786617020, 0, 'None'),
(256, 20, '5.181.201.9', 1786617260, 0, 'None'),
(257, 20, '5.181.201.9', 1786617421, -500000, 'None'),
(258, 20, '5.181.201.9', 1786617559, 0, 'None'),
(259, 20, '5.181.201.9', 1786617567, 4000000, 'Продажа личного транспорта'),
(260, 20, '5.181.201.9', 1786617573, 0, 'None'),
(261, 20, '5.181.201.9', 1786617579, 36000000, 'Продажа личного транспорта'),
(262, 20, '5.181.201.9', 1786617585, 0, 'None'),
(263, 20, '5.181.201.9', 1786617611, 0, 'None'),
(264, 20, '5.181.201.9', 1786617637, 0, 'None'),
(265, 20, '5.181.201.9', 1786617655, 44000000, 'Продажа личного транспорта'),
(266, 20, '5.181.201.9', 1786617663, 0, 'None'),
(267, 20, '5.181.201.9', 1786617861, 0, 'None'),
(268, 20, '5.181.201.9', 1786617891, 32000000, 'Продажа личного транспорта'),
(269, 20, '5.181.201.9', 1786618024, -95000, 'None'),
(270, 20, '5.181.201.9', 1786618043, -95000, 'None'),
(271, 21, '178.94.13.178', 1786620597, 10500000, '[BANK] Продажа бизнеса'),
(272, 21, '178.94.13.178', 1786620597, 0, 'Продажа бизнеса государству');

-- --------------------------------------------------------

--
-- Структура таблицы `objects`
--

CREATE TABLE `objects` (
  `id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `r_pos_x` float NOT NULL,
  `r_pos_y` float NOT NULL,
  `r_pos_z` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `company` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `type`, `company`, `amount`, `price`, `time`) VALUES
(4, 1, 3, 8000, 10, 1613060914),
(5, 2, 36, 400, 25, 1613740339),
(9, 2, 35, 1000, 200, 1613742230),
(13, 2, 11, 62, 100, 1613751765);

-- --------------------------------------------------------

--
-- Структура таблицы `ownable_cars`
--

CREATE TABLE `ownable_cars` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `comfort` int(11) NOT NULL,
  `sport` int(11) NOT NULL,
  `sport_plus` int(11) NOT NULL,
  `drift` int(11) NOT NULL,
  `wheels_kl` float NOT NULL,
  `wheels_size` float NOT NULL,
  `wheels_raz` int(11) NOT NULL,
  `wheels_otkl` float NOT NULL,
  `color_1` int(11) NOT NULL DEFAULT -1,
  `color_2` int(11) NOT NULL DEFAULT -1,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `angle` float NOT NULL,
  `number` varchar(32) NOT NULL DEFAULT '------',
  `status` int(11) NOT NULL,
  `color_body_r` varchar(18) DEFAULT '0',
  `color_body_g` varchar(18) DEFAULT '0',
  `color_wheels` varchar(18) DEFAULT '0',
  `toner_front` int(11) DEFAULT 0,
  `toner_rear` int(11) DEFAULT 0,
  `light_color` varchar(18) DEFAULT '0',
  `neon_center` varchar(18) DEFAULT '0',
  `neon_left` varchar(18) DEFAULT '0',
  `neon_right` varchar(18) DEFAULT '0',
  `vinyl` varchar(32) DEFAULT '',
  `horn_sound` int(11) DEFAULT 0,
  `exhaust_type` int(11) DEFAULT 0,
  `stroboscope_type` int(11) DEFAULT 0,
  `highlight_type` int(11) DEFAULT 0,
  `firmware_type` int(11) DEFAULT 0,
  `brake_level` float DEFAULT 0,
  `turbo_level` int(11) DEFAULT 0,
  `engine_level` int(11) DEFAULT 0,
  `supercharger_level` int(11) DEFAULT 0,
  `nitro_level` int(11) DEFAULT 0,
  `launch_control` int(11) DEFAULT 0,
  `alarm` int(11) NOT NULL,
  `key_in` int(11) NOT NULL,
  `mileage` float NOT NULL,
  `fuel` float NOT NULL DEFAULT 40,
  `create_time` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT 1000,
  `vinilcar` int(11) NOT NULL,
  `pt_engine` int(11) NOT NULL,
  `pt_brake` int(11) NOT NULL,
  `pt_stability` int(11) NOT NULL,
  `nitro` int(11) NOT NULL,
  `launch` int(11) NOT NULL,
  `fars` int(11) NOT NULL,
  `diski` int(11) NOT NULL,
  `brake` int(1) DEFAULT 0,
  `pt_turbo` int(1) DEFAULT 0,
  `supercharger` int(1) DEFAULT 0,
  `max_speed` float DEFAULT 0,
  `hydraulic` tinyint(1) DEFAULT 0,
  `sport1` int(11) NOT NULL,
  `sport2` int(11) NOT NULL,
  `sport3` int(11) NOT NULL,
  `sport4` int(11) NOT NULL,
  `comfort1` int(11) NOT NULL,
  `drift1` int(11) NOT NULL,
  `drift2` int(11) NOT NULL,
  `drift3` int(11) NOT NULL,
  `drift4` int(11) NOT NULL,
  `comfort2` int(11) NOT NULL,
  `comfort3` int(11) NOT NULL,
  `comfort4` int(11) NOT NULL,
  `sport_plus4` int(11) NOT NULL,
  `sport_plus1` int(11) NOT NULL,
  `sport_plus2` int(11) NOT NULL,
  `sport_plus3` int(11) NOT NULL,
  `f_state` int(11) NOT NULL,
  `pdvradar` int(11) NOT NULL,
  `is_hydro_bought` int(11) NOT NULL,
  `is_hydro_active` int(11) NOT NULL,
  `is_pnevmo_bought` int(11) NOT NULL,
  `pnevmo_selected` int(11) NOT NULL,
  `percentofclirness` int(11) NOT NULL,
  `percentofclirnessZ` int(11) NOT NULL,
  `wheel_comp` int(11) NOT NULL,
  `wheel_colors` int(11) NOT NULL,
  `wheel_offset_rr` int(11) NOT NULL DEFAULT 50,
  `wheel_offset_ft` int(11) NOT NULL DEFAULT 50,
  `align_ft` int(11) NOT NULL,
  `align_rr` int(11) NOT NULL,
  `width_ft` int(11) NOT NULL DEFAULT 40,
  `width_rr` int(11) NOT NULL DEFAULT 40,
  `wheel_radius` int(11) NOT NULL DEFAULT 50,
  `body_colors` int(11) NOT NULL,
  `vynil_name` text NOT NULL,
  `tonir_rr` int(11) NOT NULL,
  `tonir_ft` int(11) NOT NULL,
  `vinil_current` int(11) NOT NULL,
  `exhsuast_current` int(11) NOT NULL,
  `horn_current` int(11) NOT NULL,
  `lights_color` int(11) NOT NULL,
  `underlights_color` int(11) NOT NULL,
  `underlights_color_lf` int(11) NOT NULL,
  `underlights_color_rt` int(11) NOT NULL,
  `EnableNeon` int(11) NOT NULL,
  `strab_current` int(11) NOT NULL,
  `horn_id` int(11) NOT NULL,
  `is_FarLight_bought` int(11) NOT NULL,
  `is_FarLight_active` int(11) NOT NULL,
  `iscase` int(11) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `ownable_cars`
--

INSERT INTO `ownable_cars` (`id`, `owner_id`, `model_id`, `comfort`, `sport`, `sport_plus`, `drift`, `wheels_kl`, `wheels_size`, `wheels_raz`, `wheels_otkl`, `color_1`, `color_2`, `pos_x`, `pos_y`, `pos_z`, `angle`, `number`, `status`, `color_body_r`, `color_body_g`, `color_wheels`, `toner_front`, `toner_rear`, `light_color`, `neon_center`, `neon_left`, `neon_right`, `vinyl`, `horn_sound`, `exhaust_type`, `stroboscope_type`, `highlight_type`, `firmware_type`, `brake_level`, `turbo_level`, `engine_level`, `supercharger_level`, `nitro_level`, `launch_control`, `alarm`, `key_in`, `mileage`, `fuel`, `create_time`, `health`, `vinilcar`, `pt_engine`, `pt_brake`, `pt_stability`, `nitro`, `launch`, `fars`, `diski`, `brake`, `pt_turbo`, `supercharger`, `max_speed`, `hydraulic`, `sport1`, `sport2`, `sport3`, `sport4`, `comfort1`, `drift1`, `drift2`, `drift3`, `drift4`, `comfort2`, `comfort3`, `comfort4`, `sport_plus4`, `sport_plus1`, `sport_plus2`, `sport_plus3`, `f_state`, `pdvradar`, `is_hydro_bought`, `is_hydro_active`, `is_pnevmo_bought`, `pnevmo_selected`, `percentofclirness`, `percentofclirnessZ`, `wheel_comp`, `wheel_colors`, `wheel_offset_rr`, `wheel_offset_ft`, `align_ft`, `align_rr`, `width_ft`, `width_rr`, `wheel_radius`, `body_colors`, `vynil_name`, `tonir_rr`, `tonir_ft`, `vinil_current`, `exhsuast_current`, `horn_current`, `lights_color`, `underlights_color`, `underlights_color_lf`, `underlights_color_rt`, `EnableNeon`, `strab_current`, `horn_id`, `is_FarLight_bought`, `is_FarLight_active`, `iscase`) VALUES
(23, 5, 421, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.017, 39.9655, 1786030288, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(24, 5, 28744, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786030290, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(56, 8, 939, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, -2730.2, -1104.81, 8.459, 141.087, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786286568, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(52, 12, 656, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0.749, 39.625, 1786263521, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(29, 7, 667, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.392, 39.745, 1786137938, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(31, 7, 765, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.151277, 39.8559, 1786138382, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, -657931, 101, 76, 0, 0, 40, 40, 101, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(32, 7, 451, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.548, 39.676, 1786140718, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(33, 7, 2568, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786140984, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(34, 7, 2568, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786141000, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(35, 7, 2570, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786143127, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(41, 5, 503, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1.573, 39.204, 1786178372, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(68, 12, 573, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 1, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 6.17, 36.482, 1786353708, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 1, 1, 1, 0, 101, 0, 90, -657931, 101, 101, 0, 0, 101, 101, 101, 0, '', -16777216, -16777216, 0, 93, 110, 0, 0, 0, 0, 0, 0, 33, 0, 0, 1),
(55, 12, 2581, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '2|tt7777tt|', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 2, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 20.0314, 29.8527, 1786276341, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -8125424, '', -16777216, -16777216, 0, 94, 117, 0, 0, 0, 0, 0, 0, 44, 0, 0, 1),
(46, 6, 658, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 1, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 2.808, 37.857, 1786192197, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 1, 1, 1, 1, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 58, -3354748, '', -16777216, -16777216, 0, 93, 114, -10130823, -657931, 0, 0, 0, 30, 41, 0, 0, 1),
(53, 12, 658, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.56383, 39.675, 1786263689, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(57, 13, 2564, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786290813, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(58, 13, 410, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786290814, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(60, 6, 660, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.045555, 39.9413, 1786295672, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(62, 6, 2569, 1, 1, 1, 1, 0, 0, 0, 0, 23, 0, 797.996, 522.1, 12.0808, 335.517, '1|o000oo|000', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 4, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 5.07755, 37.1174, 1786296208, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -8156280, '', -16777216, -16777216, 0, 96, 117, -657931, -657931, 0, 0, 1, 30, 44, 0, 0, 1),
(63, 5, 28672, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786297626, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(64, 12, 28731, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.068999, 39.949, 1786301938, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(65, 5, 633, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '4|014ock|01', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2.94066, 38.1901, 1786303218, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 4, 0, 1, 1, 0, 0, 52, 0, 0, -6512221, 90, 99, 43, 45, 40, 40, 63, 0, '', -16777216, -16777216, 0, 0, 113, 0, 0, 0, 0, 0, 0, 25, 0, 0, 1),
(66, 5, 562, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786305709, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(67, 6, 28690, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 6, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 5.51834, 35.7815, 1786307908, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 1, 0, 1, 0, 101, 0, 37, -657931, 50, 50, 0, 0, 40, 40, 101, -2499884, '', -16777216, -16777216, 0, 98, 109, -4342074, -657931, 0, 0, 1, 0, 32, 0, 0, 1),
(69, 6, 28721, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.491, 39.728, 1786356661, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(70, 6, 28719, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '1|b777op|777', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 5, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 4.876, 37.153, 1786356913, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 1, 0, 1, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -10389624, '', -16777216, -16777216, 0, 97, 117, 0, 0, 0, 0, 0, 30, 44, 0, 0, 1),
(71, 12, 28719, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 2, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 11.319, 35.107, 1786383199, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', -16777216, -16777216, 0, 94, 107, 0, 0, 0, 0, 0, 0, 30, 0, 0, 1),
(73, 7, 2564, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786467943, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(74, 7, 659, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.042, 39.951, 1786468643, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(75, 5, 28669, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.026666, 39.944, 1786470457, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(88, 16, 28672, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 6, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1.45, 38.999, 1786535496, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -657931, '', -16777216, -16777216, 0, 98, 107, -657931, -657931, 0, 0, 0, 0, 30, 0, 0, 1),
(83, 6, 772, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.081, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786480900, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(87, 12, 28672, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, -362.851, 1011.51, 11.5345, 88.1607, '1|t777tt|777', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 5, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 3.72794, 38.0294, 1786531400, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -8125424, '', -16777216, -16777216, 0, 97, 107, 0, 0, 0, 0, 0, 0, 30, 0, 0, 1),
(85, 6, 2601, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2014.53, 1402.53, 25.352, 91.539, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786480900, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(86, 15, 2393, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10.262, 35.142, 1786493386, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(89, 19, 2610, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.107, 39.917, 1786542395, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(90, 18, 28717, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '1|a777ye|777', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 6, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6.922, 36.321, 1786543421, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 26, 47, 0, -12123756, 62, 57, 37, 29, 58, 48, 56, -8256769, '', 0, -419430400, 0, 98, 114, -657931, -7732481, -8256769, -6028801, 1, 0, 41, 0, 0, 1),
(91, 20, 2619, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.131942, 39.8914, 1786560686, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(107, 20, 28689, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.042499, 39.9633, 1786617601, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(94, 21, 467, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786563674, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 16119285, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(95, 21, 562, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.919, 39.555, 1786563764, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(96, 20, 28672, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 797.996, 522.1, 12.0808, 335.517, '4|777ttt|77', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5.09667, 37.2825, 1786564884, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -6316652, '', -16777216, -16777216, 0, 94, 114, 0, 0, 0, 0, 0, 0, 41, 0, 0, 1),
(97, 20, 602, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 1, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 1, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 4.79022, 37.7273, 1786570424, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, -8125424, '', -16777216, -16777216, 0, 93, 107, 0, 0, 0, 0, 0, 0, 30, 0, 0, 1),
(99, 16, 28663, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.312, 39.668, 1786600451, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 50, 50, 0, 33, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(106, 22, 412, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 797.996, 522.1, 12.0808, 335.517, '------', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 1786617369, 1000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 0, '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1),
(110, 20, 466, 1, 1, 1, 1, 0, 0, 0, 0, 3, 0, 797.996, 522.1, 12.0808, 335.517, '3|7777tt7|', 0, '0', '0', '0', 0, 0, '0', '0', '0', '0', '', 0, 2, 5, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 3.766, 38.039, 1786617977, 1000, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 50, 0, 0, 40, 40, 50, 8651792, '', -16777216, -16777216, 0, 94, 114, 0, 0, 0, 0, 0, 0, 41, 0, 0, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `payments`
--

CREATE TABLE `payments` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `sum` int(11) NOT NULL,
  `status` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `billID` text NOT NULL,
  `data_create` datetime NOT NULL,
  `data_accept` datetime NOT NULL DEFAULT current_timestamp(),
  `server_id` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `phone_books`
--

CREATE TABLE `phone_books` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(21) DEFAULT NULL,
  `number` varchar(9) DEFAULT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `player_case_bonus_rewards`
--

CREATE TABLE `player_case_bonus_rewards` (
  `id` int(11) NOT NULL,
  `player_id` int(11) NOT NULL,
  `case_id` int(11) NOT NULL,
  `bonus_id` int(11) NOT NULL,
  `bonus_type` int(11) NOT NULL,
  `internal_id` int(11) NOT NULL DEFAULT 0,
  `item_count` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `player_case_bonus_rewards`
--

INSERT INTO `player_case_bonus_rewards` (`id`, `player_id`, `case_id`, `bonus_id`, `bonus_type`, `internal_id`, `item_count`, `created_at`) VALUES
(23149, 7, 6, 3, 4, 6, 2, '2026-08-07 21:22:17'),
(23150, 7, 6, 5, 4, 6, 1, '2026-08-07 21:22:17'),
(23151, 7, 6, 3, 4, 6, 2, '2026-08-07 21:23:18'),
(23152, 7, 6, 5, 4, 6, 1, '2026-08-07 21:23:18'),
(23153, 7, 6, 3, 4, 6, 2, '2026-08-07 21:24:10'),
(23154, 7, 6, 5, 4, 6, 1, '2026-08-07 21:24:10'),
(23155, 7, 6, 5, 4, 6, 1, '2026-08-07 21:24:23'),
(23156, 7, 5, 1, 5, 665, 0, '2026-08-07 21:25:12'),
(23157, 7, 6, 3, 4, 6, 2, '2026-08-07 21:27:02'),
(23158, 7, 6, 3, 4, 6, 2, '2026-08-07 21:30:22'),
(23159, 7, 6, 5, 4, 6, 1, '2026-08-07 21:30:22'),
(23160, 7, 6, 5, 4, 6, 1, '2026-08-07 21:30:38'),
(23161, 7, 6, 3, 4, 6, 2, '2026-08-07 21:30:49'),
(23162, 7, 6, 3, 4, 6, 2, '2026-08-07 21:31:27'),
(23163, 7, 6, 5, 4, 6, 1, '2026-08-07 21:31:27'),
(23164, 7, 6, 3, 4, 6, 2, '2026-08-07 21:31:53'),
(23165, 7, 6, 5, 4, 6, 1, '2026-08-07 21:31:53'),
(23166, 7, 6, 3, 4, 6, 2, '2026-08-07 22:11:03'),
(23167, 7, 6, 5, 4, 6, 1, '2026-08-07 22:11:03'),
(23168, 7, 6, 3, 4, 6, 2, '2026-08-07 22:15:27'),
(23169, 7, 6, 5, 4, 6, 1, '2026-08-07 22:15:27'),
(23170, 7, 6, 3, 4, 6, 2, '2026-08-07 22:15:46'),
(23171, 7, 6, 5, 4, 6, 1, '2026-08-07 22:15:46'),
(23172, 6, 6, 1, 5, 658, 0, '2026-08-07 23:38:03'),
(23173, 6, 6, 3, 4, 6, 2, '2026-08-07 23:38:03'),
(23174, 6, 6, 5, 4, 6, 1, '2026-08-07 23:38:03'),
(23175, 6, 6, 5, 4, 6, 1, '2026-08-08 00:20:17'),
(23176, 6, 6, 3, 4, 6, 2, '2026-08-08 00:20:56'),
(23177, 6, 6, 3, 4, 6, 2, '2026-08-08 00:21:43'),
(23178, 6, 6, 5, 4, 6, 1, '2026-08-08 00:21:43'),
(23179, 5, 9, 5, 4, 9, 1, '2026-08-08 08:39:26'),
(23180, 6, 6, 3, 4, 6, 2, '2026-08-08 10:21:36'),
(23181, 6, 6, 5, 4, 6, 1, '2026-08-08 10:21:36'),
(23182, 6, 6, 3, 4, 6, 2, '2026-08-08 10:22:17'),
(23183, 6, 6, 5, 4, 6, 1, '2026-08-08 10:22:17'),
(23184, 6, 5, 1, 5, 665, 0, '2026-08-08 10:22:42'),
(23185, 6, 4, 1, 5, 668, 0, '2026-08-08 10:23:32'),
(23186, 6, 5, 1, 5, 665, 0, '2026-08-08 10:24:17'),
(23187, 6, 4, 3, 4, 4, 2, '2026-08-08 10:24:32'),
(23188, 6, 4, 5, 4, 4, 1, '2026-08-08 10:24:32'),
(23189, 6, 4, 5, 4, 4, 1, '2026-08-08 10:24:42'),
(23190, 6, 4, 3, 4, 4, 2, '2026-08-08 10:24:54'),
(23191, 6, 5, 1, 5, 665, 0, '2026-08-08 11:12:31'),
(23192, 6, 6, 3, 4, 6, 2, '2026-08-08 12:21:22'),
(23193, 6, 6, 5, 4, 6, 1, '2026-08-08 12:21:22'),
(23194, 6, 6, 3, 4, 6, 2, '2026-08-08 12:24:09'),
(23195, 6, 6, 5, 4, 6, 1, '2026-08-08 12:24:09'),
(23196, 6, 6, 3, 4, 6, 2, '2026-08-08 12:25:41'),
(23197, 6, 6, 5, 4, 6, 1, '2026-08-08 12:25:42'),
(23198, 6, 6, 1, 5, 658, 0, '2026-08-08 12:29:50'),
(23199, 6, 4, 1, 5, 668, 0, '2026-08-08 14:56:25'),
(23200, 6, 4, 1, 5, 668, 0, '2026-08-08 14:56:55'),
(23201, 6, 4, 3, 4, 4, 2, '2026-08-08 16:24:48'),
(23202, 6, 4, 5, 4, 4, 1, '2026-08-08 16:24:48'),
(23203, 6, 4, 1, 5, 668, 0, '2026-08-08 16:26:32'),
(23204, 6, 4, 3, 4, 4, 2, '2026-08-08 16:26:32'),
(23205, 6, 4, 5, 4, 4, 1, '2026-08-08 16:26:32'),
(23206, 6, 4, 1, 5, 668, 0, '2026-08-08 16:27:00'),
(23207, 6, 4, 3, 4, 4, 2, '2026-08-08 16:27:00'),
(23208, 6, 4, 5, 4, 4, 1, '2026-08-08 16:27:00'),
(23209, 6, 4, 1, 5, 668, 0, '2026-08-08 16:27:32'),
(23210, 6, 4, 3, 4, 4, 2, '2026-08-08 16:27:32'),
(23211, 6, 4, 5, 4, 4, 1, '2026-08-08 16:27:32'),
(23212, 6, 4, 1, 5, 668, 0, '2026-08-08 16:28:02'),
(23213, 6, 4, 3, 4, 4, 2, '2026-08-08 16:28:02'),
(23214, 6, 4, 5, 4, 4, 1, '2026-08-08 16:28:02'),
(23215, 6, 4, 1, 5, 668, 0, '2026-08-08 16:28:30'),
(23216, 6, 4, 3, 4, 4, 2, '2026-08-08 16:28:30'),
(23217, 6, 4, 5, 4, 4, 1, '2026-08-08 16:28:30'),
(23218, 6, 4, 1, 5, 668, 0, '2026-08-08 16:29:03'),
(23219, 6, 4, 3, 4, 4, 2, '2026-08-08 16:29:03'),
(23220, 6, 4, 5, 4, 4, 1, '2026-08-08 16:29:03'),
(23221, 6, 4, 1, 5, 668, 0, '2026-08-08 16:33:36'),
(23222, 6, 4, 3, 4, 4, 2, '2026-08-08 16:33:36'),
(23223, 6, 4, 5, 4, 4, 1, '2026-08-08 16:33:36'),
(23224, 6, 4, 1, 5, 668, 0, '2026-08-08 16:35:44'),
(23225, 6, 4, 3, 4, 4, 2, '2026-08-08 16:35:44'),
(23226, 6, 4, 5, 4, 4, 1, '2026-08-08 16:35:44'),
(23227, 6, 6, 3, 4, 6, 2, '2026-08-08 22:49:51'),
(23228, 6, 6, 5, 4, 6, 1, '2026-08-08 22:49:51'),
(23229, 6, 6, 5, 4, 6, 1, '2026-08-08 23:18:23'),
(23230, 6, 5, 1, 5, 665, 0, '2026-08-09 08:01:30'),
(23231, 6, 4, 1, 5, 668, 0, '2026-08-09 08:01:53'),
(23232, 6, 4, 3, 4, 4, 2, '2026-08-09 08:01:53'),
(23233, 6, 4, 5, 4, 4, 1, '2026-08-09 08:01:53'),
(23234, 12, 6, 5, 4, 6, 1, '2026-08-09 08:16:12'),
(23235, 12, 6, 3, 4, 6, 2, '2026-08-09 08:16:26'),
(23236, 12, 6, 1, 5, 658, 0, '2026-08-09 08:16:34'),
(23237, 12, 5, 1, 5, 665, 0, '2026-08-09 08:17:00'),
(23238, 12, 4, 1, 5, 668, 0, '2026-08-09 08:17:30'),
(23239, 12, 4, 3, 4, 4, 2, '2026-08-09 08:17:31'),
(23240, 12, 4, 5, 4, 4, 1, '2026-08-09 08:17:31'),
(23241, 12, 4, 1, 5, 668, 0, '2026-08-09 08:17:50'),
(23242, 12, 4, 3, 4, 4, 2, '2026-08-09 08:17:50'),
(23243, 12, 4, 5, 4, 4, 1, '2026-08-09 08:17:50'),
(23244, 12, 3, 1, 5, 2581, 0, '2026-08-09 08:18:33'),
(23245, 13, 7, 1, 5, 634, 0, '2026-08-09 15:52:18'),
(23246, 13, 7, 3, 4, 7, 2, '2026-08-09 15:52:18'),
(23247, 13, 7, 5, 4, 7, 1, '2026-08-09 15:52:18'),
(23248, 6, 9, 1, 5, 573, 0, '2026-08-09 16:32:11'),
(23249, 6, 10, 1, 5, 614, 0, '2026-08-09 16:33:02'),
(23250, 6, 11, 3, 4, 11, 2, '2026-08-09 16:33:42'),
(23251, 6, 11, 5, 4, 11, 1, '2026-08-09 16:33:42'),
(23252, 6, 9, 3, 4, 9, 2, '2026-08-09 16:34:13'),
(23253, 6, 9, 5, 4, 9, 1, '2026-08-09 16:34:13'),
(23254, 6, 9, 1, 5, 573, 0, '2026-08-09 16:35:06'),
(23255, 6, 9, 3, 4, 9, 2, '2026-08-09 16:35:06'),
(23256, 6, 9, 5, 4, 9, 1, '2026-08-09 16:35:06'),
(23257, 6, 7, 1, 5, 634, 0, '2026-08-09 16:36:01'),
(23258, 6, 8, 1, 5, 660, 0, '2026-08-09 16:36:52'),
(23259, 6, 8, 3, 4, 8, 2, '2026-08-09 16:43:49'),
(23260, 6, 8, 5, 4, 8, 1, '2026-08-09 16:43:49'),
(23261, 6, 8, 1, 5, 660, 0, '2026-08-09 16:44:44'),
(23262, 6, 8, 3, 4, 8, 2, '2026-08-09 16:44:47'),
(23263, 6, 8, 5, 4, 8, 1, '2026-08-09 16:44:47'),
(23264, 6, 20, 1, 5, 28725, 0, '2026-08-09 17:17:20'),
(23265, 6, 20, 3, 4, 20, 2, '2026-08-09 17:17:20'),
(23266, 6, 20, 5, 4, 20, 1, '2026-08-09 17:17:20'),
(23267, 6, 9, 3, 4, 9, 2, '2026-08-09 17:19:44'),
(23268, 6, 9, 5, 4, 9, 1, '2026-08-09 17:19:44'),
(23269, 6, 2, 3, 4, 2, 2, '2026-08-09 17:39:57'),
(23270, 6, 2, 5, 4, 2, 1, '2026-08-09 17:39:57'),
(23271, 6, 2, 3, 4, 2, 2, '2026-08-09 17:41:30'),
(23272, 6, 2, 5, 4, 2, 1, '2026-08-09 17:41:30'),
(23273, 6, 2, 3, 4, 2, 2, '2026-08-09 17:41:59'),
(23274, 6, 2, 5, 4, 2, 1, '2026-08-09 17:41:59'),
(23275, 12, 21, 1, 5, 28732, 0, '2026-08-09 18:34:28'),
(23276, 6, 15, 1, 5, 28690, 0, '2026-08-09 20:37:17'),
(23277, 12, 21, 3, 4, 21, 2, '2026-08-10 09:17:15'),
(23278, 12, 21, 5, 4, 21, 1, '2026-08-10 09:17:15'),
(23279, 12, 19, 1, 5, 28721, 0, '2026-08-10 09:17:53'),
(23280, 12, 19, 3, 4, 19, 2, '2026-08-10 09:17:53'),
(23281, 12, 19, 5, 4, 19, 1, '2026-08-10 09:17:53'),
(23282, 12, 19, 1, 5, 28721, 0, '2026-08-10 09:18:16'),
(23283, 12, 19, 3, 4, 19, 2, '2026-08-10 09:18:16'),
(23284, 12, 19, 5, 4, 19, 1, '2026-08-10 09:18:16'),
(23285, 12, 9, 1, 5, 573, 0, '2026-08-10 09:19:11'),
(23286, 12, 9, 3, 4, 9, 2, '2026-08-10 09:19:11'),
(23287, 12, 9, 5, 4, 9, 1, '2026-08-10 09:19:11'),
(23288, 12, 9, 1, 5, 573, 0, '2026-08-10 09:19:33'),
(23289, 12, 9, 3, 4, 9, 2, '2026-08-10 09:19:33'),
(23290, 12, 9, 5, 4, 9, 1, '2026-08-10 09:19:33'),
(23291, 12, 9, 1, 5, 573, 0, '2026-08-10 09:20:07'),
(23292, 12, 9, 3, 4, 9, 2, '2026-08-10 09:20:07'),
(23293, 12, 9, 5, 4, 9, 1, '2026-08-10 09:20:07'),
(23294, 12, 9, 1, 5, 573, 0, '2026-08-10 09:20:31'),
(23295, 12, 9, 3, 4, 9, 2, '2026-08-10 09:20:31'),
(23296, 12, 9, 5, 4, 9, 1, '2026-08-10 09:20:31'),
(23297, 12, 9, 1, 5, 573, 0, '2026-08-10 09:20:52'),
(23298, 12, 9, 3, 4, 9, 2, '2026-08-10 09:20:52'),
(23299, 12, 9, 5, 4, 9, 1, '2026-08-10 09:20:52'),
(23300, 12, 9, 1, 5, 573, 0, '2026-08-10 09:21:16'),
(23301, 12, 9, 3, 4, 9, 2, '2026-08-10 09:21:16'),
(23302, 12, 9, 5, 4, 9, 1, '2026-08-10 09:21:16'),
(23303, 6, 19, 1, 5, 28721, 0, '2026-08-10 10:09:16'),
(23304, 6, 19, 3, 4, 19, 2, '2026-08-10 10:09:16'),
(23305, 6, 19, 5, 4, 19, 1, '2026-08-10 10:09:16'),
(23306, 6, 19, 1, 5, 28721, 0, '2026-08-10 10:10:04'),
(23307, 6, 19, 3, 4, 19, 2, '2026-08-10 10:10:04'),
(23308, 6, 19, 5, 4, 19, 1, '2026-08-10 10:10:04'),
(23309, 6, 19, 1, 5, 28721, 0, '2026-08-10 10:10:41'),
(23310, 6, 19, 3, 4, 19, 2, '2026-08-10 10:12:53'),
(23311, 6, 19, 5, 4, 19, 1, '2026-08-10 10:12:53'),
(23312, 6, 19, 1, 5, 28721, 0, '2026-08-10 10:13:39'),
(23313, 6, 19, 3, 4, 19, 2, '2026-08-10 10:13:39'),
(23314, 6, 19, 5, 4, 19, 1, '2026-08-10 10:13:39'),
(23315, 6, 19, 1, 5, 28721, 0, '2026-08-10 10:14:13'),
(23316, 6, 19, 3, 4, 19, 2, '2026-08-10 10:14:13'),
(23317, 6, 19, 5, 4, 19, 1, '2026-08-10 10:14:13'),
(23318, 6, 19, 1, 5, 28721, 0, '2026-08-10 10:14:52'),
(23319, 6, 19, 3, 4, 19, 2, '2026-08-10 10:14:52'),
(23320, 6, 19, 5, 4, 19, 1, '2026-08-10 10:14:52'),
(23321, 12, 19, 1, 5, 28721, 0, '2026-08-10 17:31:20'),
(23322, 12, 19, 3, 4, 19, 2, '2026-08-10 17:31:20'),
(23323, 12, 19, 5, 4, 19, 1, '2026-08-10 17:31:20'),
(23324, 12, 19, 1, 5, 28721, 0, '2026-08-10 17:31:41'),
(23325, 12, 19, 3, 4, 19, 2, '2026-08-10 17:31:41'),
(23326, 12, 19, 5, 4, 19, 1, '2026-08-10 17:31:41'),
(23327, 12, 19, 1, 5, 28721, 0, '2026-08-10 17:32:07'),
(23328, 12, 19, 3, 4, 19, 2, '2026-08-10 17:32:07'),
(23329, 12, 19, 5, 4, 19, 1, '2026-08-10 17:32:07'),
(23330, 12, 19, 1, 5, 28721, 0, '2026-08-10 17:32:32'),
(23331, 12, 19, 3, 4, 19, 2, '2026-08-10 17:32:32'),
(23332, 12, 19, 5, 4, 19, 1, '2026-08-10 17:32:32'),
(23333, 6, 2, 3, 4, 2, 2, '2026-08-11 11:25:53'),
(23334, 6, 2, 5, 4, 2, 1, '2026-08-11 11:25:53'),
(23335, 6, 2, 3, 4, 2, 2, '2026-08-11 11:26:24'),
(23336, 6, 2, 5, 4, 2, 1, '2026-08-11 11:26:24'),
(23337, 6, 2, 3, 4, 2, 2, '2026-08-11 11:28:56'),
(23338, 6, 2, 5, 4, 2, 1, '2026-08-11 11:28:56'),
(23339, 6, 2, 3, 4, 2, 2, '2026-08-11 11:31:44'),
(23340, 6, 2, 5, 4, 2, 1, '2026-08-11 11:31:44'),
(23341, 6, 2, 3, 4, 2, 2, '2026-08-11 11:32:56'),
(23342, 6, 2, 5, 4, 2, 1, '2026-08-11 11:32:56'),
(23343, 6, 2, 3, 4, 2, 2, '2026-08-11 11:33:55'),
(23344, 6, 2, 5, 4, 2, 1, '2026-08-11 11:33:55'),
(23345, 6, 2, 3, 4, 2, 2, '2026-08-11 11:34:45'),
(23346, 6, 2, 5, 4, 2, 1, '2026-08-11 11:34:45'),
(23347, 6, 2, 3, 4, 2, 2, '2026-08-11 11:36:01'),
(23348, 6, 2, 5, 4, 2, 1, '2026-08-11 11:36:01'),
(23349, 6, 2, 3, 4, 2, 2, '2026-08-11 11:36:26'),
(23350, 6, 2, 5, 4, 2, 1, '2026-08-11 11:36:26'),
(23351, 6, 2, 3, 4, 2, 2, '2026-08-11 11:37:48'),
(23352, 6, 2, 5, 4, 2, 1, '2026-08-11 11:37:48'),
(23353, 6, 2, 3, 4, 2, 2, '2026-08-11 11:38:15'),
(23354, 6, 2, 5, 4, 2, 1, '2026-08-11 11:38:15'),
(23355, 6, 2, 3, 4, 2, 2, '2026-08-11 11:39:47'),
(23356, 6, 2, 5, 4, 2, 1, '2026-08-11 11:39:47'),
(23357, 6, 2, 3, 4, 2, 2, '2026-08-11 11:40:18'),
(23358, 6, 2, 5, 4, 2, 1, '2026-08-11 11:40:18'),
(23359, 7, 13, 1, 5, 28681, 0, '2026-08-11 17:07:47'),
(23360, 7, 13, 3, 4, 13, 2, '2026-08-11 17:07:47'),
(23361, 7, 13, 5, 4, 13, 1, '2026-08-11 17:07:47'),
(23362, 7, 13, 1, 5, 28681, 0, '2026-08-11 17:08:22'),
(23363, 7, 13, 3, 4, 13, 2, '2026-08-11 17:08:22'),
(23364, 7, 13, 5, 4, 13, 1, '2026-08-11 17:08:22'),
(23365, 7, 9, 1, 5, 573, 0, '2026-08-11 17:14:25'),
(23366, 7, 9, 3, 4, 9, 2, '2026-08-11 17:14:25'),
(23367, 7, 9, 5, 4, 9, 1, '2026-08-11 17:14:25'),
(23368, 7, 9, 1, 5, 573, 0, '2026-08-11 17:14:58'),
(23369, 7, 9, 3, 4, 9, 2, '2026-08-11 17:14:58'),
(23370, 7, 9, 5, 4, 9, 1, '2026-08-11 17:14:58'),
(23371, 7, 9, 3, 4, 9, 2, '2026-08-11 17:15:59'),
(23372, 7, 9, 5, 4, 9, 1, '2026-08-11 17:15:59'),
(23373, 7, 9, 3, 4, 9, 2, '2026-08-11 17:16:34'),
(23374, 7, 9, 5, 4, 9, 1, '2026-08-11 17:16:34'),
(23375, 7, 4, 1, 5, 668, 0, '2026-08-11 17:24:27'),
(23376, 7, 4, 3, 4, 4, 2, '2026-08-11 17:24:27'),
(23377, 7, 4, 5, 4, 4, 1, '2026-08-11 17:24:27'),
(23378, 7, 4, 1, 5, 668, 0, '2026-08-11 17:24:55'),
(23379, 7, 4, 3, 4, 4, 2, '2026-08-11 17:24:55'),
(23380, 7, 4, 5, 4, 4, 1, '2026-08-11 17:24:55'),
(23381, 5, 17, 1, 5, 28709, 0, '2026-08-11 17:49:43'),
(23382, 5, 17, 3, 4, 17, 2, '2026-08-11 17:49:43'),
(23383, 5, 17, 5, 4, 17, 1, '2026-08-11 17:49:43'),
(23384, 15, 18, 5, 4, 18, 1, '2026-08-12 00:13:24'),
(23385, 15, 17, 5, 4, 17, 1, '2026-08-12 01:01:21'),
(23386, 15, 6, 5, 4, 6, 1, '2026-08-12 01:02:21'),
(23387, 15, 7, 5, 4, 7, 1, '2026-08-12 01:02:26'),
(23388, 15, 1, 1, 4, 3, 1, '2026-08-12 10:59:36'),
(23389, 15, 1, 3, 4, 2, 1, '2026-08-12 10:59:36'),
(23390, 15, 1, 4, 4, 1, 2, '2026-08-12 10:59:36'),
(23391, 15, 1, 5, 4, 1, 1, '2026-08-12 10:59:36'),
(23392, 16, 18, 1, 5, 28718, 0, '2026-08-12 14:00:57'),
(23393, 16, 18, 3, 4, 18, 2, '2026-08-12 14:00:57'),
(23394, 16, 18, 5, 4, 18, 1, '2026-08-12 14:00:57'),
(23395, 18, 18, 1, 5, 28718, 0, '2026-08-12 14:01:32'),
(23396, 16, 18, 1, 5, 28718, 0, '2026-08-12 14:01:33'),
(23397, 16, 18, 3, 4, 18, 2, '2026-08-12 14:01:35'),
(23398, 16, 18, 5, 4, 18, 1, '2026-08-12 14:01:35'),
(23399, 18, 18, 3, 4, 18, 2, '2026-08-12 14:01:37'),
(23400, 18, 18, 5, 4, 18, 1, '2026-08-12 14:01:37'),
(23401, 16, 18, 1, 5, 28718, 0, '2026-08-12 14:02:12'),
(23402, 16, 18, 3, 4, 18, 2, '2026-08-12 14:02:12'),
(23403, 16, 18, 5, 4, 18, 1, '2026-08-12 14:02:12'),
(23404, 18, 18, 1, 5, 28718, 0, '2026-08-12 14:02:29'),
(23405, 18, 18, 3, 4, 18, 2, '2026-08-12 14:02:29'),
(23406, 18, 18, 5, 4, 18, 1, '2026-08-12 14:02:29'),
(23407, 16, 18, 1, 5, 28718, 0, '2026-08-12 14:02:50'),
(23408, 16, 18, 3, 4, 18, 2, '2026-08-12 14:02:50'),
(23409, 16, 18, 5, 4, 18, 1, '2026-08-12 14:02:50'),
(23410, 18, 18, 1, 5, 28718, 0, '2026-08-12 14:03:17'),
(23411, 18, 18, 3, 4, 18, 2, '2026-08-12 14:03:17'),
(23412, 18, 18, 5, 4, 18, 1, '2026-08-12 14:03:17'),
(23413, 20, 21, 5, 4, 21, 1, '2026-08-12 18:48:43'),
(23414, 20, 6, 1, 5, 658, 0, '2026-08-12 18:49:49'),
(23415, 20, 6, 3, 4, 6, 2, '2026-08-12 18:49:49'),
(23416, 20, 6, 5, 4, 6, 1, '2026-08-12 18:49:49'),
(23417, 20, 6, 1, 5, 658, 0, '2026-08-12 18:50:12'),
(23418, 20, 6, 3, 4, 6, 2, '2026-08-12 18:50:12'),
(23419, 20, 6, 5, 4, 6, 1, '2026-08-12 18:50:12'),
(23420, 20, 6, 1, 5, 658, 0, '2026-08-12 18:50:32'),
(23421, 20, 6, 3, 4, 6, 2, '2026-08-12 18:50:32'),
(23422, 20, 6, 5, 4, 6, 1, '2026-08-12 18:50:32'),
(23423, 20, 8, 1, 5, 660, 0, '2026-08-12 18:50:58'),
(23424, 20, 8, 3, 4, 8, 2, '2026-08-12 18:50:59'),
(23425, 20, 8, 5, 4, 8, 1, '2026-08-12 18:50:59'),
(23426, 18, 1, 1, 4, 3, 1, '2026-08-12 20:25:59'),
(23427, 18, 1, 3, 4, 2, 1, '2026-08-12 20:25:59'),
(23428, 18, 1, 4, 4, 1, 2, '2026-08-12 20:25:59'),
(23429, 18, 1, 5, 4, 1, 1, '2026-08-12 20:25:59'),
(23430, 16, 12, 1, 5, 28663, 0, '2026-08-13 05:53:28'),
(23431, 16, 12, 3, 4, 12, 2, '2026-08-13 05:53:28'),
(23432, 16, 12, 5, 4, 12, 1, '2026-08-13 05:53:28'),
(23433, 20, 8, 1, 5, 660, 0, '2026-08-13 10:41:56'),
(23434, 20, 8, 3, 4, 8, 2, '2026-08-13 10:41:56'),
(23435, 20, 8, 5, 4, 8, 1, '2026-08-13 10:41:56'),
(23436, 20, 8, 1, 5, 660, 0, '2026-08-13 10:42:47'),
(23437, 20, 8, 3, 4, 8, 2, '2026-08-13 10:42:47'),
(23438, 20, 8, 5, 4, 8, 1, '2026-08-13 10:42:47');

-- --------------------------------------------------------

--
-- Структура таблицы `player_rewards`
--

CREATE TABLE `player_rewards` (
  `id` int(11) NOT NULL,
  `player_id` int(11) NOT NULL,
  `reward_id` int(11) NOT NULL,
  `reward_data` text NOT NULL,
  `case_id` int(11) DEFAULT NULL,
  `rarity` tinyint(1) DEFAULT 1,
  `reward_type` tinyint(2) DEFAULT 11,
  `status` tinyint(1) DEFAULT 0 COMMENT '0=не получено, 1=получено, 2=распылёно',
  `obtained_date` datetime DEFAULT current_timestamp(),
  `claimed_date` datetime DEFAULT NULL,
  `spray_date` datetime DEFAULT NULL,
  `count` int(11) DEFAULT 1,
  `element_id` int(11) DEFAULT 0,
  `spray_price` int(11) DEFAULT 0,
  `days_duration` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `player_skins`
--

CREATE TABLE `player_skins` (
  `id` int(11) NOT NULL,
  `player_id` int(11) NOT NULL,
  `skin_model` int(11) NOT NULL,
  `skin_name` varchar(128) NOT NULL,
  `obtained_date` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `promocode`
--

CREATE TABLE `promocode` (
  `id` int(11) NOT NULL,
  `code` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `type` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `usings` int(11) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп данных таблицы `promocode`
--

INSERT INTO `promocode` (`id`, `code`, `type`, `amount`, `usings`, `paydays`) VALUES
(1, 'Obnovov', 2, 1000000, 1, 0),
(2, 'OBNOVOVTEST', 2, 1000000, 50, 0),
(3, 'DONATIK', 2, 1000000, 10, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `promocode_activations`
--

CREATE TABLE `promocode_activations` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `code` varchar(32) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `quick_message`
--

CREATE TABLE `quick_message` (
  `name` varchar(64) NOT NULL,
  `text_1` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №1',
  `text_2` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №2',
  `text_3` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №3',
  `text_4` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №4',
  `text_5` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №5',
  `text_6` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №6',
  `text_7` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №7',
  `text_8` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №8',
  `text_9` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №9',
  `text_10` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №10',
  `text_11` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №11',
  `text_12` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №12',
  `text_13` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №13',
  `text_14` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №14',
  `text_15` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №15',
  `text_16` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №16',
  `text_17` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №17',
  `text_18` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №18',
  `text_19` varchar(128) NOT NULL DEFAULT 'Введите текст для поля №19',
  `text_20` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `quick_message`
--

INSERT INTO `quick_message` (`name`, `text_1`, `text_2`, `text_3`, `text_4`, `text_5`, `text_6`, `text_7`, `text_8`, `text_9`, `text_10`, `text_11`, `text_12`, `text_13`, `text_14`, `text_15`, `text_16`, `text_17`, `text_18`, `text_19`, `text_20`) VALUES
('oscar_dev', 'Я @name состаю в организации @frac', 'Я смотрю порно', 'Я гей', '/do срет', '/me пахнет', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', '');

-- --------------------------------------------------------

--
-- Структура таблицы `repositories`
--

CREATE TABLE `repositories` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `action_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `description` varchar(64) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `repositories`
--

INSERT INTO `repositories` (`id`, `type`, `action_id`, `amount`, `description`) VALUES
(1, 0, 0, 59242, 'Шахта, металл'),
(2, 0, 1, 0, 'Шахта, руда'),
(3, 1, 0, 150, 'Завод, металл'),
(4, 1, 1, 8091, 'Завод, топливо'),
(5, 1, 2, 59913, 'Завод, продукты'),
(6, 3, 0, 98340, 'Склад армии, металл'),
(7, 3, 1, 136161, 'Склад армии, патроны'),
(8, 4, 0, 2000, 'Лесопилка, дерево');

-- --------------------------------------------------------

--
-- Структура таблицы `return_money`
--

CREATE TABLE `return_money` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `description` varchar(64) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `return_money`
--

INSERT INTO `return_money` (`id`, `uid`, `money`, `description`, `status`) VALUES
(2488, 6, 250000, 'слет бизнеса', 0),
(2489, 12, 250000, 'слет бизнеса', 0),
(2490, 6, 5000000, 'слет бизнеса', 0),
(2491, 12, 7500000, 'слет бизнеса', 0),
(2492, 16, 12500000, 'слет бизнеса', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `rewards`
--

CREATE TABLE `rewards` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL COMMENT 'ID ?????? ?? ??????? ?????????',
  `award_id` int(11) NOT NULL COMMENT '?????? ????? ? ??????? Case awards',
  `case_id` int(11) NOT NULL COMMENT 'ID ?????'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `roulette_prize`
--

CREATE TABLE `roulette_prize` (
  `id` int(11) NOT NULL,
  `owner` int(11) NOT NULL,
  `prize` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `server_settings`
--

CREATE TABLE `server_settings` (
  `admin_price` int(11) NOT NULL DEFAULT 80,
  `helper_price` int(11) NOT NULL DEFAULT 40,
  `distrub` int(11) NOT NULL DEFAULT 1,
  `donpower` int(11) NOT NULL DEFAULT 1,
  `GiveCoins` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `server_settings`
--

INSERT INTO `server_settings` (`admin_price`, `helper_price`, `distrub`, `donpower`, `GiveCoins`) VALUES
(100, 40, 2, 3, 2);

-- --------------------------------------------------------

--
-- Структура таблицы `test_houses`
--

CREATE TABLE `test_houses` (
  `id` int(11) NOT NULL,
  `owner` int(11) DEFAULT 0,
  `price` int(11) DEFAULT 100000,
  `rent` int(11) DEFAULT 500,
  `x` float DEFAULT 0,
  `y` float DEFAULT 0,
  `z` float DEFAULT 0,
  `a` float DEFAULT 0,
  `interior` int(11) DEFAULT 0,
  `vw` int(11) DEFAULT 0,
  `exit_x` float DEFAULT 0,
  `exit_y` float DEFAULT 0,
  `exit_z` float DEFAULT 0,
  `locked` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `tickets`
--

CREATE TABLE `tickets` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `description` varchar(64) NOT NULL,
  `issuer` varchar(32) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `trunkcar`
--

CREATE TABLE `trunkcar` (
  `id` int(10) UNSIGNED NOT NULL,
  `acc_id` int(11) NOT NULL,
  `oc_id` int(11) NOT NULL,
  `slot` tinyint(3) UNSIGNED NOT NULL,
  `item_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL DEFAULT 1,
  `value` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `trunkcar`
--

INSERT INTO `trunkcar` (`id`, `acc_id`, `oc_id`, `slot`, `item_id`, `amount`, `value`, `created_at`, `updated_at`) VALUES
(41424, 5, 65, 0, 664, 1, 9828, '2026-08-11 19:40:48', '2026-08-11 19:40:48'),
(41426, 5, 65, 1, 144, 1, 15143, '2026-08-11 19:45:56', '2026-08-11 19:45:56'),
(41427, 6, 69, 0, 22, 1, 0, '2026-08-11 19:48:52', '2026-08-11 19:48:52'),
(41428, 6, 69, 1, 59, 1, 1754, '2026-08-11 19:48:54', '2026-08-11 19:48:54'),
(41429, 6, 69, 2, 946, 1, 4702, '2026-08-11 19:48:57', '2026-08-11 19:48:57'),
(41432, 6, 82, 0, 134, 1, 29, '2026-08-12 00:10:52', '2026-08-12 00:10:52'),
(41433, 12, 87, 0, 58, 1, 7777, '2026-08-12 10:43:35', '2026-08-12 10:43:35'),
(41434, 12, 87, 1, 134, 1, 122, '2026-08-12 10:43:36', '2026-08-12 10:43:36'),
(41435, 12, 87, 2, 59, 1, 1754, '2026-08-12 10:43:38', '2026-08-12 10:43:38'),
(41436, 12, 87, 3, 134, 1, 5500062, '2026-08-12 10:43:39', '2026-08-12 10:43:39'),
(41437, 12, 87, 4, 134, 1, 5500046, '2026-08-12 10:43:40', '2026-08-12 10:43:40'),
(41440, 12, 87, 7, 22, 6, 0, '2026-08-12 10:43:46', '2026-08-12 10:43:46'),
(41442, 12, 87, 8, 134, 1, 6881, '2026-08-12 10:44:04', '2026-08-12 10:44:04'),
(41444, 12, 87, 10, 134, 1, 266, '2026-08-12 10:44:10', '2026-08-12 10:44:10'),
(41445, 12, 87, 6, 134, 1, 6864, '2026-08-12 10:44:12', '2026-08-12 10:44:12'),
(41446, 12, 87, 11, 134, 1, 5500062, '2026-08-12 10:44:15', '2026-08-12 10:44:15'),
(41448, 12, 87, 9, 517, 1, 14593, '2026-08-12 13:49:19', '2026-08-12 13:49:19'),
(41449, 12, 87, 5, 657, 1, 9386, '2026-08-12 13:49:20', '2026-08-12 13:49:20'),
(41450, 12, 87, 12, 357, 1, 18507, '2026-08-12 13:49:20', '2026-08-12 13:49:20'),
(41451, 12, 87, 13, 657, 1, 9386, '2026-08-12 13:49:22', '2026-08-12 13:49:22'),
(41452, 12, 87, 14, 493, 1, 4199, '2026-08-12 13:49:24', '2026-08-12 13:49:24'),
(41453, 12, 87, 15, 492, 1, 4198, '2026-08-12 13:49:25', '2026-08-12 13:49:25'),
(41454, 12, 87, 16, 492, 1, 4198, '2026-08-12 13:49:28', '2026-08-12 13:49:28');

-- --------------------------------------------------------

--
-- Структура таблицы `trunks`
--

CREATE TABLE `trunks` (
  `id` int(11) NOT NULL,
  `oc_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `value` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `unitpay_payments`
--

CREATE TABLE `unitpay_payments` (
  `id` int(10) NOT NULL,
  `unitpayId` varchar(255) NOT NULL,
  `account` varchar(255) NOT NULL,
  `sum` float NOT NULL,
  `itemsCount` int(11) NOT NULL DEFAULT 1,
  `dateCreate` datetime NOT NULL,
  `dateComplete` datetime DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `vehicle_store_components`
--

CREATE TABLE `vehicle_store_components` (
  `vehicleid` int(11) NOT NULL,
  `componentid` int(11) NOT NULL,
  `state` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_general_ci;

--
-- Дамп данных таблицы `vehicle_store_components`
--

INSERT INTO `vehicle_store_components` (`vehicleid`, `componentid`, `state`) VALUES
(67, 2056, 0),
(67, 2057, 0),
(67, 2058, 0),
(67, 2059, 0),
(67, 2060, 0),
(67, 2061, 0),
(67, 2062, 0),
(67, 2063, 0),
(67, 2064, 0),
(86, 1624, 0),
(86, 1625, 0),
(86, 1626, 0),
(86, 1627, 0),
(86, 1628, 0),
(86, 1629, 0),
(86, 1630, 0),
(86, 1631, 0),
(86, 1632, 0),
(86, 1633, 0),
(90, 2265, 0),
(90, 2266, 0),
(90, 2267, 0),
(90, 2268, 0),
(90, 2269, 0),
(90, 2270, 0),
(90, 2271, 0),
(90, 2272, 0),
(90, 2273, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `whitelist`
--

CREATE TABLE `whitelist` (
  `id` int(11) NOT NULL,
  `name` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `ytpromocode`
--

CREATE TABLE `ytpromocode` (
  `id` int(11) NOT NULL,
  `code` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `type` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `usings` int(11) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `ytpromocode`
--

INSERT INTO `ytpromocode` (`id`, `code`, `type`, `amount`, `usings`, `paydays`) VALUES
(2, 'test', 1, 10000000, 99982, 0),
(3, 'test1', 2, 10000000, 99799, 0),
(4, 'Extazzy Arz', 3, 1000000, 99999, 0),
(5, 'Extazzy', 0, 10000000, 99998, 0),
(6, '#create', 3, 50000, 99996, 0),
(7, 'Yarik', 1, 100, 99997, 0),
(8, 'prizma ', 3, 100, 99999, 0),
(9, '#PUPS', 2, 10000000, 100000, 0),
(10, 'exp', 3, 500, 100000, 0),
(11, 'РєРѕРґ', 1, 10000, 100000, 0),
(12, '#wave', 2, 10000, 100000, 0),
(13, '#fenny', 2, 3000, 100000, 0),
(14, '#borzov', 1, 1000, 99999, 0),
(15, '1111', 1, 1000000, 99999, 0),
(16, 'DMZSOSAL', 1, 10000000, 99998, 0),
(17, 'DMZ', 2, 10000000, 100000, 0),
(18, 'MYBOSS', 1, 10000000, 100000, 0),
(19, '#borz', 0, 10000000, 99997, 0),
(20, '52', 3, 10000000, 99995, 0),
(21, 'mellow', 3, 10000000, 99995, 0),
(22, 'Р±Р»СЏС‚СЊ', 3, 99999, 100000, 0),
(23, 'РѕРєР°Рє', 3, 9999999, 100000, 0),
(24, 'okak', 3, 999999, 100000, 0),
(25, 'coco', 3, 9999999, 99999, 0),
(26, 'co', 3, 108, 99999, 0),
(27, 'Toxic', 3, 500, 100000, 0),
(28, 'Patter', 1, 1000000, 99999, 0),
(29, 'Luis', 1, 75000, 100000, 0),
(30, '0', 1, 2, 99996, 0),
(31, 'hui', 2, 1000000, 100000, 0),
(32, 'ebal', 3, 10000000, 100000, 0),
(33, 'Mokan', 2, 10000, 100000, 0),
(34, 'ilon', 1, 10000000, 99998, 0),
(35, 'Skaly', 3, 10000, 100000, 0),
(36, 'Tommy', 2, 10000000, 100000, 0),
(37, 'enzo', 0, 1000000, 99991, 0),
(38, '#goose', 3, 100000, 100000, 0),
(39, '#larik', 2, 50000, 100000, 0),
(40, 'BRBONUS', 1, 10000000, 99997, 0),
(41, 'Jaguars', 3, 1000000, 100000, 0),
(42, '#Mirtvec', 3, 1000000, 99999, 0),
(43, '@xyi', 1, 1000000, 99998, 0),
(44, 'xoxo', 2, 10000000, 99997, 0),
(45, '1', 2, 10000000, 98935, 0),
(46, '2', 2, 1000000, 99938, 0),
(47, 'NULS', 1, 5000, 99999, 0),
(48, 'СЃРµРєСЃ', 3, 100, 100000, 0),
(49, 'cod', 3, 100, 100000, 0),
(50, 'Wi', 2, 50000, 99999, 0),
(51, 'Ded 11', 2, 1, 100000, 0),
(52, 'batman', 1, 10000000, 99999, 0),
(53, 'Dear', 3, 9133133, 99999, 0),
(54, 'Create', 1, 50, 99994, 0),
(55, '#bonus', 2, 9999999, 100000, 0),
(56, 'BONUS', 2, 10000000, 99987, 0),
(57, 'orion', 3, 100000, 100000, 0),
(58, 'lol', 3, 10, 100000, 0),
(59, '#Youkuzzi', 2, 1000000, 100000, 0),
(60, 'brain', 3, 99, 99999, 0),
(61, '#yt', 3, 15, 100000, 0),
(62, 'Mommy', 2, 1000000, 100000, 0),
(63, 'С…СѓР№', 1, 100000, 99999, 0),
(64, 'welomy', 3, 100, 99999, 0),
(65, 'Relt', 1, 10000000, 99999, 0),
(66, 't', 0, 1000000, 99999, 0),
(67, 'D_Z', 1, 5000, 100000, 0),
(68, 'es', 3, 1000000, 99999, 0),
(69, '#HYPNOSE', 1, 10000, 99996, 0),
(70, '#SHAMA', 2, 10000, 100000, 0),
(71, '#morozov', 1, 5000, 100000, 0),
(72, 'hople', 3, 10000, 100000, 0),
(73, 'Grunt', 2, 1000, 100000, 0),
(74, 'Zayrov', 2, 100, 99999, 0),
(75, 'Zayrov1', 2, 100, 99999, 0),
(76, '#Agmin', 2, 5000000, 100000, 0),
(77, 'LEROV', 2, 333333, 100000, 0),
(78, '#BR', 2, 10000000, 100000, 0),
(79, '#Aodzaki ', 3, 100000, 100000, 0),
(80, '#borzzz', 2, 10000, 99999, 0),
(81, '7', 3, 10000000, 99988, 0),
(82, 'Cliff ', 0, 100000, 100000, 0),
(83, 'Dady ', 2, 1000000, 100000, 0),
(84, '777', 1, 10000000, 99998, 0),
(85, '#borzz', 1, 100000, 99999, 0),
(86, '5', 1, 100000, 99996, 0),
(87, '6', 2, 100000, 99997, 0),
(88, 'Molodoy ', 0, 1, 100000, 0),
(89, '#e', 3, 108, 99999, 0),
(90, '#eblan', 2, 100000, 99999, 0),
(91, 'reaper', 3, 100000, 100000, 0),
(92, '#xxx', 3, 150, 99999, 0),
(93, 'forb', 3, 10000, 99999, 0),
(94, '#enzo', 0, 10000000, 99998, 0),
(95, 'Br.BONUS', 2, 10000000, 99983, 0),
(96, 'robux', 1, 10000000, 99999, 0),
(97, 'robuxx', 2, 10000000, 99999, 0),
(98, '099', 3, 500000, 99987, 0),
(99, '098', 2, 100000, 99999, 0),
(100, 'Kerasin', 0, 15000, 100000, 0),
(101, 'heartless', 2, 100000, 99994, 0),
(102, '12345', 3, 1000, 99999, 0),
(103, 'money', 0, 10000000, 99999, 0),
(104, 'robug', 2, 10000000, 99999, 0),
(105, 'Bushido', 1, 10000, 99999, 0),
(106, 'Р”РѕРЅР°С‚', 1, 10000000, 99997, 0),
(107, 'Р‘Р¦', 2, 10000000, 99997, 0),
(108, 'VIR', 1, 300999, 100000, 0),
(109, '01br', 1, 50000, 100000, 0),
(110, 'young', 3, 10000000, 99999, 0),
(111, '10', 3, 10, 99995, 0),
(112, 'Wolkers', 1, 1000000, 100000, 0),
(113, 'Pupsik', 3, 1000000, 100000, 0),
(114, '#Stam', 1, 2, 99991, 0),
(115, '#Ron', 1, 1, 99999, 0),
(116, '#Marloy', 1, 1000, 100000, 0),
(117, '#Qowi', 1, 10000000, 99999, 0),
(118, 'KAKTUS', 1, 15000, 99999, 0),
(119, 'pahan', 3, 20000, 100000, 0),
(120, '@test', 2, 1000000, 99996, 0),
(121, '@test1', 1, 10000000, 99996, 0),
(122, '@test2', 3, 10000000, 99996, 0),
(123, '@test3', 2, 10000000, 99992, 0),
(124, '#almaz', 0, 10000000, 100000, 0),
(125, '#PAHAN', 3, 100000, 99998, 0),
(126, '#FRTX', 0, 1, 100000, 0),
(127, '#Barry', 2, 250000, 99999, 0),
(128, 'fruzy', 1, 10000000, 99996, 0),
(129, 'aboba', 3, 100000, 100000, 0),
(130, 'Baani', 3, 10000000, 100000, 0),
(131, 'cyrovsky', 3, 5000000, 100000, 0),
(132, 'gigi', 3, 1000000, 99999, 0),
(133, 'Mercyriev', 2, 10000000, 99995, 0),
(134, 'BRTEST', 1, 7500000, 100000, 0),
(135, 'HN', 1, 10000, 100000, 0),
(136, 'HiN_1', 0, 100000, 99999, 0),
(137, 'HiN_2', 1, 500, 100000, 0),
(138, 'HiN_3', 2, 500, 100000, 0),
(139, 'HiN_4', 3, 50, 100000, 0),
(140, 'KIDS', 1, 898911, 100000, 0),
(141, 'SAK1RA', 2, 1000000, 99999, 0),
(142, 'LOX', 2, 10000000, 99999, 0),
(143, 'Han', 2, 10000, 100000, 0),
(144, 'BATEK', 3, 10000, 99999, 0),
(145, 'azeg', 2, 10000000, 99998, 0),
(146, 'azeg2', 3, 1000, 99999, 0),
(147, '30', 3, 100000, 100000, 0),
(148, 'maga', 1, 50000, 100000, 0),
(149, 'yupik', 1, 10000000, 100000, 0),
(150, '#FOX', 1, 50000, 99999, 0),
(151, 'brouen', 2, 10000000, 100000, 0),
(152, 'Naezd', 3, 100000, 99998, 0),
(153, 'SCAR', 0, 150000, 99998, 0),
(154, 'SCARY', 2, 1000000, 99998, 0),
(155, 'fandex', 1, 10000000, 100000, 0),
(156, 'Hamann', 3, 1000000, 99998, 0),
(157, 'SHEIH', 2, 999999, 99999, 0),
(158, 'CBO', 2, 10000000, 99995, 0),
(159, 'arest', 3, 10000, 100000, 0),
(160, 'Dimon', 3, 10000000, 100000, 0),
(161, 'Fama', 1, 1, 100000, 0),
(162, 'Dima1', 2, 10000000, 99999, 0),
(163, 'Xleb', 1, 10000000, 99999, 0),
(164, 'maloiden', 0, 10000000, 99999, 0),
(165, '#ADMIN', 3, 500, 99999, 0),
(166, 'Mazer', 3, 500000, 99998, 0),
(167, 'РµС…Рї', 3, 10000000, 100000, 0),
(168, 'voronen', 3, 10000000, 100000, 0),
(169, '#aye', 1, 55555, 99998, 0),
(170, 'porno', 2, 550000, 99991, 0),
(171, 'ceks', 1, 550000, 99998, 0),
(172, 'VELL', 3, 1000000, 99998, 0),
(173, 'Aze', 2, 100000, 100000, 0),
(174, 'BIno', 2, 10000000, 99998, 0),
(175, '#head', 3, 10000, 100000, 0),
(176, '#SKAY', 3, 1000, 99999, 0),
(177, 'test3', 3, 1000, 99999, 0),
(178, 'pivo', 1, 10000000, 100000, 0),
(179, 'zaharka', 1, 10000000, 99999, 0),
(180, '#doma', 2, 10000000, 100000, 0),
(181, 'SKAYLANDSD', 1, 1000000, 99998, 0),
(182, 'Lucas', 0, 10000000, 99998, 0),
(183, 'Dima', 1, 2, 99999, 0),
(184, 'gromov', 3, 10000000, 100000, 0),
(185, '67', 1, 10000000, 99990, 0),
(186, '#Richov', 3, 10000, 99999, 0),
(187, 'kolpa', 2, 1000, 100000, 0),
(188, '#Rich', 1, 3000000, 99998, 0),
(189, 'freak', 2, 10000000, 100000, 0),
(190, 'Unicorn', 1, 10000000, 100000, 0),
(191, 'mrurban', 2, 10000, 99996, 0),
(192, 'brbonusofficial', 2, 3500, 100000, 0),
(193, 'brilliant', 2, 100000, 100000, 0),
(194, 'darkangelsigma', 2, 10000000, 99962, 0),
(195, 'Lovka', 3, 10000000, 99994, 0),
(196, 'v', 3, 100, 99999, 0),
(197, 'cristallix', 2, 10000000, 99942, 0),
(198, 'Lovkiy', 1, 10000000, 99999, 0),
(199, 'Lo', 1, 10000000, 99999, 0),
(200, 'J', 1, 10000000, 99999, 0),
(201, 'job', 1, 10000000, 99999, 0),
(202, 'kolbasa', 1, 10000000, 99999, 0),
(203, '#Dexter', 2, 10000000, 100000, 0),
(204, 'darma3dCCCCC', 2, 10000000, 100000, 0),
(205, 'Mma', 2, 3, 100000, 0),
(206, '#Mma', 2, 3, 100000, 0),
(207, 'Nike', 1, 10000000, 100000, 0),
(208, 'mevezy', 3, 10000000, 99995, 0),
(209, 'Sierra', 2, 10000000, 99988, 0),
(210, 'BC', 1, 10000000, 99999, 0),
(211, 'TIME', 2, 10000000, 99999, 0),
(212, 'ASA', 0, 1, 100000, 0),
(213, 'Cliford 1', 2, 10000000, 100000, 0),
(214, 'Larry', 0, 100000, 100000, 0),
(215, '#BAG', 0, 10000000, 99998, 0),
(216, 'ton', 3, 50000, 99999, 0),
(217, 'tg', 1, 9999999, 99999, 0),
(218, 'Icy', 3, 10, 100000, 0),
(219, 'Hide', 3, 10000, 99999, 0),
(220, 'Hides', 1, 10000000, 99999, 0),
(221, 'Hid', 1, 500000, 99999, 0),
(222, 'H', 2, 5000000, 99997, 0),
(223, 'DONATE', 2, 10000000, 99993, 0),
(224, 'Tetyv', 3, 10000000, 99999, 0),
(225, 'NUR ', 2, 10000000, 100000, 0),
(226, 'ADMIN', 2, 10000000, 99999, 0),
(227, '#sotkarever', 2, 10000000, 100000, 0),
(228, 'yt', 2, 10000000, 99999, 0),
(229, 'nevskiy', 1, 10000000, 99999, 0),
(230, '3k1m', 1, 2, 99999, 0),
(231, 'toncoin', 1, 9123123, 99999, 0),
(232, 'РЈРњР’Р”', 2, 500000, 99998, 0),
(233, '3', 3, 10000, 99993, 0),
(234, 'tc', 3, 999999, 99999, 0),
(235, 'EWZ', 3, 10, 99999, 0),
(236, 'test9', 3, 10000000, 100000, 0),
(237, 'yang', 3, 1000000, 100000, 0),
(238, 'test39', 2, 10000000, 100000, 0),
(239, 'Vladik', 3, 10000, 99999, 0),
(240, 'VVVVV', 1, 10000000, 99999, 0),
(241, 'VVVVV V', 2, 10000000, 99999, 0),
(242, 'top', 3, 10, 100000, 0),
(243, 'Vortex', 1, 10000000, 100000, 0),
(244, '@exp1', 3, 1000000, 99997, 0),
(245, '#sunex', 3, 100000, 100000, 0),
(246, 'Bop', 2, 10000000, 100000, 0),
(247, 'krutoy', 3, 10000000, 100000, 0),
(248, 'NEWS', 1, 500123, 99998, 0),
(249, 'NKT67', 2, 25000, 100000, 0),
(250, 'NKT', 2, 100000, 99999, 0),
(251, 'NEWST', 1, 9000123, 99996, 0),
(252, 'N67', 3, 200000, 99999, 0),
(253, '5267', 2, 500000, 100000, 0),
(254, '6767', 2, 10000000, 99958, 0),
(255, 'RT', 2, 10000000, 99846, 0),
(256, 'GROZNY', 3, 10000000, 99989, 0),
(257, 'BRB', 2, 10000000, 99997, 0),
(258, 'brooklin', 2, 10000000, 100000, 0),
(259, 'love', 0, 1, 99999, 0),
(260, 'sekspornogey', 2, 10000000, 99999, 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `accessories`
--
ALTER TABLE `accessories`
  ADD PRIMARY KEY (`account_id`,`slot`);

--
-- Индексы таблицы `accessories_players`
--
ALTER TABLE `accessories_players`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `accessory_inventory`
--
ALTER TABLE `accessory_inventory`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `accounts`
--
ALTER TABLE `accounts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `email` (`email`),
  ADD KEY `phone` (`phone`),
  ADD KEY `house` (`house`),
  ADD KEY `name` (`name`) USING BTREE;

--
-- Индексы таблицы `aclogs`
--
ALTER TABLE `aclogs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `action_log`
--
ALTER TABLE `action_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `bank_accounts_log`
--
ALTER TABLE `bank_accounts_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ban_list`
--
ALTER TABLE `ban_list`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `blackpass_logs`
--
ALTER TABLE `blackpass_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_blackpass_logs_player` (`account_id`,`season_number`),
  ADD KEY `idx_blackpass_logs_action` (`action`);

--
-- Индексы таблицы `blackpass_players`
--
ALTER TABLE `blackpass_players`
  ADD PRIMARY KEY (`account_id`,`season_number`),
  ADD KEY `idx_blackpass_players_season` (`season_number`);

--
-- Индексы таблицы `blackpass_tasks`
--
ALTER TABLE `blackpass_tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_blackpass_tasks_player` (`account_id`,`season_number`,`task_group`,`period_key`);

--
-- Индексы таблицы `bought_houses`
--
ALTER TABLE `bought_houses`
  ADD PRIMARY KEY (`house_id`);

--
-- Индексы таблицы `business`
--
ALTER TABLE `business`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `business_gps`
--
ALTER TABLE `business_gps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `bid` (`bid`);

--
-- Индексы таблицы `business_profit`
--
ALTER TABLE `business_profit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`bid`),
  ADD KEY `view` (`view`);

--
-- Индексы таблицы `car_obmen`
--
ALTER TABLE `car_obmen`
  ADD UNIQUE KEY `car_1` (`car_1`,`car_2`,`car_3`,`car_4`,`car_5`);

--
-- Индексы таблицы `change_names`
--
ALTER TABLE `change_names`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Индексы таблицы `charity`
--
ALTER TABLE `charity`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uid` (`uid`);

--
-- Индексы таблицы `contbykbass`
--
ALTER TABLE `contbykbass`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `debug`
--
ALTER TABLE `debug`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `donate_log`
--
ALTER TABLE `donate_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `donations`
--
ALTER TABLE `donations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `dragy`
--
ALTER TABLE `dragy`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Индексы таблицы `event_dacha_players`
--
ALTER TABLE `event_dacha_players`
  ADD PRIMARY KEY (`account_id`);

--
-- Индексы таблицы `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `family_name` (`name`);

--
-- Индексы таблицы `familyblack`
--
ALTER TABLE `familyblack`
  ADD PRIMARY KEY (`family_id`,`account_id`),
  ADD KEY `idx_familyblack_account_id` (`account_id`);

--
-- Индексы таблицы `familynew`
--
ALTER TABLE `familynew`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_familynew_owner` (`owner`),
  ADD KEY `idx_familynew_reputation` (`reputation`);

--
-- Индексы таблицы `familysystem`
--
ALTER TABLE `familysystem`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_family_ownable` (`family_id`,`ownable_car_id`),
  ADD KEY `idx_family` (`family_id`),
  ADD KEY `idx_owner` (`owner_id`),
  ADD KEY `idx_ownable` (`ownable_car_id`);

--
-- Индексы таблицы `family_ad`
--
ALTER TABLE `family_ad`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_family_ad_family` (`family`);

--
-- Индексы таблицы `family_cars`
--
ALTER TABLE `family_cars`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_family_cars_family_owner` (`family_owner`);

--
-- Индексы таблицы `family_log`
--
ALTER TABLE `family_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_family_log_family_time` (`family`,`time`),
  ADD KEY `idx_family_log_type` (`type`);

--
-- Индексы таблицы `family_storage_items`
--
ALTER TABLE `family_storage_items`
  ADD PRIMARY KEY (`family_id`,`slot`),
  ADD KEY `idx_family_storage_items_family_id` (`family_id`);

--
-- Индексы таблицы `fuel_stations`
--
ALTER TABLE `fuel_stations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `fuel_stations_profit`
--
ALTER TABLE `fuel_stations_profit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`fid`),
  ADD KEY `view` (`view`);

--
-- Индексы таблицы `full_dostup`
--
ALTER TABLE `full_dostup`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gang_repositories`
--
ALTER TABLE `gang_repositories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gang_zones`
--
ALTER TABLE `gang_zones`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `garages`
--
ALTER TABLE `garages`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `garbage_job`
--
ALTER TABLE `garbage_job`
  ADD PRIMARY KEY (`name`);

--
-- Индексы таблицы `gift`
--
ALTER TABLE `gift`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gift_lose`
--
ALTER TABLE `gift_lose`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `greenzone`
--
ALTER TABLE `greenzone`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `hotels`
--
ALTER TABLE `hotels`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `houses`
--
ALTER TABLE `houses`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `housesnew`
--
ALTER TABLE `housesnew`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_accounts_id` (`accounts_id`);

--
-- Индексы таблицы `houses_bought`
--
ALTER TABLE `houses_bought`
  ADD PRIMARY KEY (`house_id`);

--
-- Индексы таблицы `houses_renters`
--
ALTER TABLE `houses_renters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`),
  ADD KEY `house_id` (`house_id`);

--
-- Индексы таблицы `inventory`
--
ALTER TABLE `inventory`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_inventory_account_slot` (`account_id`,`slot`),
  ADD KEY `idx_inventory_account_item` (`account_id`,`item_id`),
  ADD KEY `idx_inventory_account_item_model` (`account_id`,`item_id`,`model_id`);

--
-- Индексы таблицы `inventoryitems`
--
ALTER TABLE `inventoryitems`
  ADD PRIMARY KEY (`id`),
  ADD KEY `playerid` (`playerid`);

--
-- Индексы таблицы `inventory_plates`
--
ALTER TABLE `inventory_plates`
  ADD PRIMARY KEY (`account_id`,`slot`),
  ADD KEY `idx_inventory_plates_account_id` (`account_id`);

--
-- Индексы таблицы `invskins`
--
ALTER TABLE `invskins`
  ADD PRIMARY KEY (`account_id`,`internal_id`),
  ADD KEY `idx_invskins_account` (`account_id`),
  ADD KEY `idx_invskins_purchased_at` (`purchased_at`);

--
-- Индексы таблицы `keys`
--
ALTER TABLE `keys`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `key_unique` (`key`);

--
-- Индексы таблицы `lastnumber`
--
ALTER TABLE `lastnumber`
  ADD PRIMARY KEY (`acc_id`);

--
-- Индексы таблицы `leaders`
--
ALTER TABLE `leaders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `listban`
--
ALTER TABLE `listban`
  ADD PRIMARY KEY (`acc_id`),
  ADD KEY `idx_unban_time` (`unban_time`);

--
-- Индексы таблицы `marketplace_favorites`
--
ALTER TABLE `marketplace_favorites`
  ADD PRIMARY KEY (`account_id`,`lot_id`),
  ADD KEY `lot_id` (`lot_id`);

--
-- Индексы таблицы `marketplace_history`
--
ALTER TABLE `marketplace_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account_id` (`account_id`),
  ADD KEY `lot_id` (`lot_id`);

--
-- Индексы таблицы `marketplace_lots`
--
ALTER TABLE `marketplace_lots`
  ADD PRIMARY KEY (`id`),
  ADD KEY `seller_id` (`seller_id`),
  ADD KEY `status` (`status`),
  ADD KEY `item_id` (`item_id`),
  ADD KEY `expires_at` (`expires_at`);

--
-- Индексы таблицы `marketplace_reward_items`
--
ALTER TABLE `marketplace_reward_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account_id` (`account_id`),
  ADD KEY `source_lot` (`source_lot`),
  ADD KEY `expires_at` (`expires_at`);

--
-- Индексы таблицы `marketplace_wallet`
--
ALTER TABLE `marketplace_wallet`
  ADD PRIMARY KEY (`account_id`);

--
-- Индексы таблицы `money_log`
--
ALTER TABLE `money_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `objects`
--
ALTER TABLE `objects`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ownable_cars`
--
ALTER TABLE `ownable_cars`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `phone_books`
--
ALTER TABLE `phone_books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Индексы таблицы `player_case_bonus_rewards`
--
ALTER TABLE `player_case_bonus_rewards`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_player_id` (`player_id`),
  ADD KEY `idx_case_id` (`case_id`);

--
-- Индексы таблицы `player_rewards`
--
ALTER TABLE `player_rewards`
  ADD PRIMARY KEY (`id`),
  ADD KEY `player_id` (`player_id`),
  ADD KEY `reward_id` (`reward_id`),
  ADD KEY `case_id` (`case_id`),
  ADD KEY `status` (`status`),
  ADD KEY `obtained_date` (`obtained_date`),
  ADD KEY `idx_player_rewards_status` (`player_id`,`status`),
  ADD KEY `idx_player_rewards_case` (`player_id`,`case_id`),
  ADD KEY `idx_player_rewards_rarity` (`player_id`,`rarity`);

--
-- Индексы таблицы `player_skins`
--
ALTER TABLE `player_skins`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_player_skin` (`player_id`,`skin_model`);

--
-- Индексы таблицы `promocode`
--
ALTER TABLE `promocode`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `promocode_activations`
--
ALTER TABLE `promocode_activations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `repositories`
--
ALTER TABLE `repositories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `type` (`type`,`action_id`);

--
-- Индексы таблицы `return_money`
--
ALTER TABLE `return_money`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `rewards`
--
ALTER TABLE `rewards`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uid_idx` (`uid`);

--
-- Индексы таблицы `roulette_prize`
--
ALTER TABLE `roulette_prize`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `test_houses`
--
ALTER TABLE `test_houses`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tickets`
--
ALTER TABLE `tickets`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `trunkcar`
--
ALTER TABLE `trunkcar`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_trunkcar_acc_oc_slot` (`acc_id`,`oc_id`,`slot`),
  ADD KEY `idx_trunkcar_oc` (`oc_id`),
  ADD KEY `idx_trunkcar_acc` (`acc_id`);

--
-- Индексы таблицы `trunks`
--
ALTER TABLE `trunks`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `vehicle_store_components`
--
ALTER TABLE `vehicle_store_components`
  ADD PRIMARY KEY (`vehicleid`,`componentid`);

--
-- Индексы таблицы `whitelist`
--
ALTER TABLE `whitelist`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ytpromocode`
--
ALTER TABLE `ytpromocode`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `accessories_players`
--
ALTER TABLE `accessories_players`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=106;

--
-- AUTO_INCREMENT для таблицы `accessory_inventory`
--
ALTER TABLE `accessory_inventory`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `accounts`
--
ALTER TABLE `accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `aclogs`
--
ALTER TABLE `aclogs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `action_log`
--
ALTER TABLE `action_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=302;

--
-- AUTO_INCREMENT для таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `bank_accounts_log`
--
ALTER TABLE `bank_accounts_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `ban_list`
--
ALTER TABLE `ban_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT для таблицы `blackpass_logs`
--
ALTER TABLE `blackpass_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `blackpass_tasks`
--
ALTER TABLE `blackpass_tasks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=413;

--
-- AUTO_INCREMENT для таблицы `business`
--
ALTER TABLE `business`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT для таблицы `business_gps`
--
ALTER TABLE `business_gps`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=204;

--
-- AUTO_INCREMENT для таблицы `business_profit`
--
ALTER TABLE `business_profit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT для таблицы `change_names`
--
ALTER TABLE `change_names`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=870;

--
-- AUTO_INCREMENT для таблицы `charity`
--
ALTER TABLE `charity`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=680;

--
-- AUTO_INCREMENT для таблицы `contbykbass`
--
ALTER TABLE `contbykbass`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `debug`
--
ALTER TABLE `debug`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `donate_log`
--
ALTER TABLE `donate_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=327;

--
-- AUTO_INCREMENT для таблицы `donations`
--
ALTER TABLE `donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `dragy`
--
ALTER TABLE `dragy`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `family`
--
ALTER TABLE `family`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT для таблицы `familynew`
--
ALTER TABLE `familynew`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1378;

--
-- AUTO_INCREMENT для таблицы `familysystem`
--
ALTER TABLE `familysystem`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `family_ad`
--
ALTER TABLE `family_ad`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `family_cars`
--
ALTER TABLE `family_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9236;

--
-- AUTO_INCREMENT для таблицы `family_log`
--
ALTER TABLE `family_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36241;

--
-- AUTO_INCREMENT для таблицы `fuel_stations`
--
ALTER TABLE `fuel_stations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `fuel_stations_profit`
--
ALTER TABLE `fuel_stations_profit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3221;

--
-- AUTO_INCREMENT для таблицы `full_dostup`
--
ALTER TABLE `full_dostup`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `gang_repositories`
--
ALTER TABLE `gang_repositories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `gang_zones`
--
ALTER TABLE `gang_zones`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT для таблицы `garages`
--
ALTER TABLE `garages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT для таблицы `gift`
--
ALTER TABLE `gift`
  MODIFY `id` int(16) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT для таблицы `gift_lose`
--
ALTER TABLE `gift_lose`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5419;

--
-- AUTO_INCREMENT для таблицы `greenzone`
--
ALTER TABLE `greenzone`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `hotels`
--
ALTER TABLE `hotels`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT для таблицы `houses`
--
ALTER TABLE `houses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=574;

--
-- AUTO_INCREMENT для таблицы `housesnew`
--
ALTER TABLE `housesnew`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=269;

--
-- AUTO_INCREMENT для таблицы `houses_renters`
--
ALTER TABLE `houses_renters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `inventory`
--
ALTER TABLE `inventory`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=122995;

--
-- AUTO_INCREMENT для таблицы `inventoryitems`
--
ALTER TABLE `inventoryitems`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `keys`
--
ALTER TABLE `keys`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4808;

--
-- AUTO_INCREMENT для таблицы `leaders`
--
ALTER TABLE `leaders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `marketplace_history`
--
ALTER TABLE `marketplace_history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `marketplace_lots`
--
ALTER TABLE `marketplace_lots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `marketplace_reward_items`
--
ALTER TABLE `marketplace_reward_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `money_log`
--
ALTER TABLE `money_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=273;

--
-- AUTO_INCREMENT для таблицы `objects`
--
ALTER TABLE `objects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `ownable_cars`
--
ALTER TABLE `ownable_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=111;

--
-- AUTO_INCREMENT для таблицы `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=212;

--
-- AUTO_INCREMENT для таблицы `phone_books`
--
ALTER TABLE `phone_books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=119;

--
-- AUTO_INCREMENT для таблицы `player_case_bonus_rewards`
--
ALTER TABLE `player_case_bonus_rewards`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23439;

--
-- AUTO_INCREMENT для таблицы `player_rewards`
--
ALTER TABLE `player_rewards`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `player_skins`
--
ALTER TABLE `player_skins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `promocode`
--
ALTER TABLE `promocode`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `promocode_activations`
--
ALTER TABLE `promocode_activations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=833;

--
-- AUTO_INCREMENT для таблицы `repositories`
--
ALTER TABLE `repositories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `return_money`
--
ALTER TABLE `return_money`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2493;

--
-- AUTO_INCREMENT для таблицы `rewards`
--
ALTER TABLE `rewards`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `roulette_prize`
--
ALTER TABLE `roulette_prize`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=127;

--
-- AUTO_INCREMENT для таблицы `test_houses`
--
ALTER TABLE `test_houses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `tickets`
--
ALTER TABLE `tickets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1187;

--
-- AUTO_INCREMENT для таблицы `trunkcar`
--
ALTER TABLE `trunkcar`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41455;

--
-- AUTO_INCREMENT для таблицы `trunks`
--
ALTER TABLE `trunks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT для таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=135;

--
-- AUTO_INCREMENT для таблицы `whitelist`
--
ALTER TABLE `whitelist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `ytpromocode`
--
ALTER TABLE `ytpromocode`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=261;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
