-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Мар 08 2023 г., 19:15
-- Версия сервера: 10.5.12-MariaDB-0+deb11u1
-- Версия PHP: 7.4.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gs183200`
--

-- --------------------------------------------------------

--
-- Структура таблицы `anticheat_settings`
--

CREATE TABLE `anticheat_settings` (
  `ac_code` int(2) NOT NULL,
  `ac_code_trigger_type` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `anticheat_settings`
--

INSERT INTO `anticheat_settings` (`ac_code`, `ac_code_trigger_type`) VALUES
(0, 0),
(1, 0),
(2, 0),
(3, 0),
(4, 0),
(5, 0),
(6, 0),
(7, 0),
(8, 0),
(9, 0),
(10, 0),
(11, 0),
(12, 0),
(13, 0),
(14, 0),
(15, 0),
(16, 0),
(17, 0),
(18, 0),
(19, 0),
(20, 0),
(21, 0),
(22, 0),
(23, 0),
(24, 0),
(25, 0),
(26, 0),
(27, 0),
(28, 0),
(29, 0),
(30, 0),
(31, 0),
(32, 0),
(33, 0),
(34, 0),
(35, 0),
(36, 0),
(37, 0),
(38, 0),
(39, 0),
(40, 0),
(41, 0),
(42, 0),
(43, 0),
(44, 0),
(45, 0),
(46, 0),
(47, 0),
(48, 0),
(49, 0),
(50, 0),
(51, 0),
(52, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `atm`
--

CREATE TABLE `atm` (
  `atm_id` int(4) NOT NULL,
  `atm_pos_x` float NOT NULL,
  `atm_pos_y` float NOT NULL,
  `atm_pos_z` float NOT NULL,
  `atm_pos_xr` float NOT NULL,
  `atm_pos_yr` float NOT NULL,
  `atm_pos_zr` float NOT NULL,
  `atm_status` int(4) NOT NULL DEFAULT 1,
  `atm_money` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `atm`
--

INSERT INTO `atm` (`atm_id`, `atm_pos_x`, `atm_pos_y`, `atm_pos_z`, `atm_pos_xr`, `atm_pos_yr`, `atm_pos_zr`, `atm_status`, `atm_money`) VALUES
(1, -493.774, 921.381, 12.1426, 0, 0, 90, 1, 0),
(2, 1832.36, 2522.78, 15.661, 0, 0, 180, 1, 0),
(3, -2460.03, 2841.59, 38.3816, 0, 0, 180, 1, 0),
(4, -1966.66, 296.32, 35.226, 0, 0, 0, 1, 0),
(5, -2056.3, 477.25, 35.001, 0, 0, 180, 1, 0),
(6, -2420.17, 987.43, 45.124, 0, 0, 180, 1, 0),
(7, -1805.41, 1200.53, 24.926, 0, 0, 90, 1, 0),
(8, -1623.51, 716.771, 14.436, 0, 0, -90, 1, 0),
(9, -1317.22, 2700.94, 50.061, 0, 0, 120, 1, 0),
(10, -739.681, 2753.28, 47.054, 0, 0, 0, 1, 0),
(11, 58.958, 1221.93, 18.652, 0, 0, 180, 1, 0),
(12, 2108.78, 896.394, 10.94, 0, 0, -90, 1, 0),
(13, 2021.52, 1016.64, 10.644, 0, 0, 90, 1, 0),
(14, 2173.95, 1403.05, 10.845, 0, 0, 0, 1, 0),
(15, 2389.21, 2453.92, 10.575, 0, 0, 0, 1, 0),
(16, 1652.64, 2200.6, 10.625, 0, 0, 90, 1, 0),
(17, 2401.21, 1483.2, 10.628, 0, 0, 90, 1, 0),
(18, 2646.11, 1129.83, 10.983, 0, 0, 90, 1, 0),
(19, 1707.4, 1020.11, 10.614, 0, 0, 0, 1, 0),
(20, 1374.71, 473.62, 19.907, 0, 0, -25, 1, 0),
(21, 215.044, 17.302, 2.345, 0, 0, 180, 1, 0),
(22, -27.537, -269.267, 5.235, 0, 0, 90, 1, 0),
(23, -508.455, -506.512, 25.335, 0, 0, -90, 1, 0),
(24, -78.859, -1171.75, 1.933, 0, 0, 337, 1, 0),
(25, 661.642, -575.942, 16.11, 0, 0, 0, 1, 0),
(26, 865.649, -597.406, 18.151, 0, 0, -90, 1, 0),
(27, 1928.54, -1780.19, 13.376, 0, 0, 180, 1, 0),
(28, 1679.99, -2335.6, 13.355, 0, 0, -90, 1, 0),
(29, 1496.04, -1750.46, 15.16, 0, 0, -90, 1, 0),
(30, 1610.48, -1887.74, 13.351, 0, 0, 180, 1, 0),
(31, 1384.05, -1082.65, 27.175, 0, 0, 0, 1, 0),
(32, 999.8, -914.86, 42.116, 0, 0, 5, 1, 0),
(33, 531.912, -1293.56, 16.962, 0, 0, 270, 1, 0),
(34, -1025.17, -589.245, 31.798, 0, 0, 90, 1, 0),
(35, -1554.19, -2737.11, 48.556, 0, 0, 55, 1, 0),
(36, -2233.81, -2566.48, 31.729, 0, 0, 60, 1, 0),
(37, 709.36, -1440.89, 13.295, 0, 0, -90, 1, 0),
(38, 1594.49, 1816.64, 10.632, 0, 0, 0, 1, 0),
(39, 1210.18, -1820.27, 13.282, 0, 0, 90, 1, 0),
(40, 1715.58, -1129.31, 23.842, 0, 0, 90, 1, 0),
(41, 1011.66, -1353.47, 13.685, 0, 0, 90, 1, 0),
(42, 349.938, 2543.61, 16.474, 0, 0, 0, 1, 0),
(43, 2647.24, -2440.47, 13.08, 0, 0, 270, 1, 0),
(44, 1751.57, -1898.66, 13.412, 0, 0, 180, 1, 0),
(45, -2036.43, -239.03, 35.271, 0, 0, 270, 1, 0),
(46, 2487.33, -1521.15, 23.988, 0, 0, 0, 1, 0),
(47, 2597.12, 1426.45, 10.676, 0, 0, 0, 1, 0),
(48, -2563.4, 522.544, 14.575, 0, 0, -90, 1, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `bon`
--

CREATE TABLE `bon` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `user_name` varchar(24) NOT NULL,
  `time_input_cmd` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `businesses`
--

CREATE TABLE `businesses` (
  `b_id` int(11) NOT NULL,
  `b_owner_inc` int(8) NOT NULL DEFAULT -1,
  `b_owner_name` varchar(32) COLLATE utf8_unicode_ci NOT NULL DEFAULT 'The State',
  `b_name` varchar(32) COLLATE utf8_unicode_ci NOT NULL DEFAULT 'Бизнес',
  `b_pos_x` float NOT NULL,
  `b_pos_y` float NOT NULL,
  `b_pos_z` float NOT NULL,
  `b_pos_c` float NOT NULL,
  `b_int` int(11) NOT NULL,
  `b_money` int(11) NOT NULL,
  `b_close` int(4) NOT NULL DEFAULT 0,
  `b_price` int(11) NOT NULL,
  `b_product` int(11) NOT NULL,
  `b_type` int(11) NOT NULL DEFAULT -1,
  `b_cost` int(5) NOT NULL DEFAULT 5,
  `b_fee` int(8) NOT NULL DEFAULT 0,
  `b_maxproduct` int(9) NOT NULL DEFAULT 15000,
  `b_improve` varchar(32) COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0',
  `b_mafia` int(6) NOT NULL DEFAULT 0,
  `b_tax` int(8) NOT NULL DEFAULT 0,
  `b_family` int(11) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `businesses`
--

INSERT INTO `businesses` (`b_id`, `b_owner_inc`, `b_owner_name`, `b_name`, `b_pos_x`, `b_pos_y`, `b_pos_z`, `b_pos_c`, `b_int`, `b_money`, `b_close`, `b_price`, `b_product`, `b_type`, `b_cost`, `b_fee`, `b_maxproduct`, `b_improve`, `b_mafia`, `b_tax`, `b_family`) VALUES
(1, 13, 'Leonid_Petruhin', 'xyi', -3.237, -0.859, 10.926, 91.069, 1, 0, 0, 1, 0, 6, 0, 0, 15000, '0|0|0', 23, 0, 0),
(2, -1, 'The State', 'xyi', -8.075, -11.241, 10.764, 149.004, 1, 0, 0, 1, 0, 4, 0, 0, 15000, '0|0|0', 24, 0, 0),
(3, 10, 'Lincoln_Muller', '1', -10.422, -13.316, 10.758, 153.229, 1, 0, 0, 1, 0, 7, 0, 0, 15000, '0|0|0', 25, 0, 0),
(4, 14, 'Strong_Ramirez', '24/7', 2577.81, -2377.59, 22.939, 88.786, 1, 0, 0, 1500000, 0, 0, 5, 0, 15000, '0|0|0', 22, 0, 0),
(5, -1, 'The State', 'Тюнинг', 2431.68, 1395.04, 11.76, 347.409, 3, 0, 0, 25000000, 0, 3, 50, 0, 15000, '0|0|0', 22, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `businesses_history`
--

CREATE TABLE `businesses_history` (
  `bh_id` int(6) NOT NULL,
  `bh_business` int(11) NOT NULL,
  `bh_date` date NOT NULL,
  `bh_count` int(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `businesses_history`
--

INSERT INTO `businesses_history` (`bh_id`, `bh_business`, `bh_date`, `bh_count`) VALUES
(1, 1, '2023-01-13', 0),
(2, 2, '2023-01-13', 0),
(3, 3, '2023-01-13', 0),
(4, 1, '2023-01-14', 0),
(5, 2, '2023-01-14', 0),
(6, 3, '2023-01-14', 0),
(7, 1, '2023-01-15', 0),
(8, 2, '2023-01-15', 0),
(9, 3, '2023-01-15', 0),
(10, 1, '2023-01-16', 0),
(11, 2, '2023-01-16', 0),
(12, 3, '2023-01-16', 0),
(13, 1, '2023-01-17', 0),
(14, 2, '2023-01-17', 0),
(15, 3, '2023-01-17', 0),
(16, 1, '2023-01-18', 0),
(17, 2, '2023-01-18', 0),
(18, 3, '2023-01-18', 0),
(19, 1, '2023-01-19', 0),
(20, 2, '2023-01-19', 0),
(21, 3, '2023-01-19', 0),
(22, 1, '2023-01-20', 0),
(23, 2, '2023-01-20', 0),
(24, 3, '2023-01-20', 0),
(25, 1, '2023-01-21', 0),
(26, 2, '2023-01-21', 0),
(27, 3, '2023-01-21', 0),
(28, 1, '2023-01-23', 0),
(29, 2, '2023-01-23', 0),
(30, 3, '2023-01-23', 0),
(31, 1, '2023-01-24', 0),
(32, 2, '2023-01-24', 0),
(33, 3, '2023-01-24', 0),
(34, 1, '2023-01-25', 0),
(35, 2, '2023-01-25', 0),
(36, 3, '2023-01-25', 0),
(37, 1, '2023-01-26', 0),
(38, 2, '2023-01-26', 0),
(39, 3, '2023-01-26', 0),
(40, 1, '2023-01-27', 0),
(41, 2, '2023-01-27', 0),
(42, 3, '2023-01-27', 0),
(43, 1, '2023-01-28', 0),
(44, 2, '2023-01-28', 0),
(45, 3, '2023-01-28', 0),
(46, 1, '2023-01-30', 0),
(47, 2, '2023-01-30', 0),
(48, 3, '2023-01-30', 0),
(49, 1, '2023-01-31', 0),
(50, 2, '2023-01-31', 0),
(51, 3, '2023-01-31', 0),
(52, 4, '2023-01-31', 0),
(53, 1, '2023-02-01', 0),
(54, 2, '2023-02-01', 0),
(55, 3, '2023-02-01', 0),
(56, 4, '2023-02-01', 0),
(57, 5, '2023-02-01', 0),
(58, 1, '2023-02-02', 0),
(59, 2, '2023-02-02', 0),
(60, 3, '2023-02-02', 0),
(61, 4, '2023-02-02', 0),
(62, 5, '2023-02-02', 0),
(63, 1, '2023-02-03', 0),
(64, 2, '2023-02-03', 0),
(65, 3, '2023-02-03', 0),
(66, 4, '2023-02-03', 0),
(67, 5, '2023-02-03', 0),
(68, 1, '2023-02-04', 0),
(69, 2, '2023-02-04', 0),
(70, 3, '2023-02-04', 0),
(71, 4, '2023-02-04', 0),
(72, 5, '2023-02-04', 0),
(73, 1, '2023-02-05', 0),
(74, 2, '2023-02-05', 0),
(75, 3, '2023-02-05', 0),
(76, 4, '2023-02-05', 0),
(77, 5, '2023-02-05', 0),
(78, 1, '2023-02-06', 0),
(79, 2, '2023-02-06', 0),
(80, 3, '2023-02-06', 0),
(81, 4, '2023-02-06', 0),
(82, 5, '2023-02-06', 0),
(83, 1, '2023-02-07', 0),
(84, 2, '2023-02-07', 0),
(85, 3, '2023-02-07', 0),
(86, 4, '2023-02-07', 0),
(87, 5, '2023-02-07', 0),
(88, 1, '2023-02-08', 0),
(89, 2, '2023-02-08', 0),
(90, 3, '2023-02-08', 0),
(91, 4, '2023-02-08', 0),
(92, 5, '2023-02-08', 0),
(93, 1, '2023-02-09', 0),
(94, 2, '2023-02-09', 0),
(95, 3, '2023-02-09', 0),
(96, 4, '2023-02-09', 0),
(97, 5, '2023-02-09', 0),
(98, 1, '2023-02-10', 0),
(99, 2, '2023-02-10', 0),
(100, 3, '2023-02-10', 0),
(101, 4, '2023-02-10', 0),
(102, 5, '2023-02-10', 0),
(103, 1, '2023-02-11', 0),
(104, 2, '2023-02-11', 0),
(105, 3, '2023-02-11', 0),
(106, 4, '2023-02-11', 0),
(107, 5, '2023-02-11', 0),
(108, 1, '2023-02-12', 0),
(109, 2, '2023-02-12', 0),
(110, 3, '2023-02-12', 0),
(111, 4, '2023-02-12', 0),
(112, 5, '2023-02-12', 0),
(113, 1, '2023-02-13', 0),
(114, 2, '2023-02-13', 0),
(115, 3, '2023-02-13', 0),
(116, 4, '2023-02-13', 0),
(117, 5, '2023-02-13', 0),
(118, 1, '2023-02-14', 0),
(119, 2, '2023-02-14', 0),
(120, 3, '2023-02-14', 0),
(121, 4, '2023-02-14', 0),
(122, 5, '2023-02-14', 0),
(123, 1, '2023-02-15', 0),
(124, 2, '2023-02-15', 0),
(125, 3, '2023-02-15', 0),
(126, 4, '2023-02-15', 0),
(127, 5, '2023-02-15', 0),
(128, 1, '2023-02-16', 0),
(129, 2, '2023-02-16', 0),
(130, 3, '2023-02-16', 0),
(131, 4, '2023-02-16', 0),
(132, 5, '2023-02-16', 0),
(133, 1, '2023-02-17', 0),
(134, 2, '2023-02-17', 0),
(135, 3, '2023-02-17', 0),
(136, 4, '2023-02-17', 0),
(137, 5, '2023-02-17', 0),
(138, 1, '2023-02-18', 0),
(139, 2, '2023-02-18', 0),
(140, 3, '2023-02-18', 0),
(141, 4, '2023-02-18', 0),
(142, 5, '2023-02-18', 0),
(143, 1, '2023-02-19', 0),
(144, 2, '2023-02-19', 0),
(145, 3, '2023-02-19', 0),
(146, 4, '2023-02-19', 0),
(147, 5, '2023-02-19', 0),
(148, 1, '2023-02-20', 0),
(149, 2, '2023-02-20', 0),
(150, 3, '2023-02-20', 0),
(151, 4, '2023-02-20', 0),
(152, 5, '2023-02-20', 0),
(153, 1, '2023-02-21', 0),
(154, 2, '2023-02-21', 0),
(155, 3, '2023-02-21', 0),
(156, 4, '2023-02-21', 0),
(157, 5, '2023-02-21', 0),
(158, 1, '2023-02-22', 0),
(159, 2, '2023-02-22', 0),
(160, 3, '2023-02-22', 0),
(161, 4, '2023-02-22', 0),
(162, 5, '2023-02-22', 0),
(163, 1, '2023-02-23', 0),
(164, 2, '2023-02-23', 0),
(165, 3, '2023-02-23', 0),
(166, 4, '2023-02-23', 0),
(167, 5, '2023-02-23', 0),
(168, 1, '2023-02-24', 0),
(169, 2, '2023-02-24', 0),
(170, 3, '2023-02-24', 0),
(171, 4, '2023-02-24', 0),
(172, 5, '2023-02-24', 0),
(173, 1, '2023-02-25', 0),
(174, 2, '2023-02-25', 0),
(175, 3, '2023-02-25', 0),
(176, 4, '2023-02-25', 0),
(177, 5, '2023-02-25', 0),
(178, 1, '2023-02-26', 0),
(179, 2, '2023-02-26', 0),
(180, 3, '2023-02-26', 0),
(181, 4, '2023-02-26', 0),
(182, 5, '2023-02-26', 0),
(183, 1, '2023-02-27', 0),
(184, 2, '2023-02-27', 0),
(185, 3, '2023-02-27', 0),
(186, 4, '2023-02-27', 0),
(187, 5, '2023-02-27', 0),
(188, 1, '2023-02-28', 0),
(189, 2, '2023-02-28', 0),
(190, 3, '2023-02-28', 0),
(191, 4, '2023-02-28', 0),
(192, 5, '2023-02-28', 0),
(193, 1, '2023-03-01', 0),
(194, 2, '2023-03-01', 0),
(195, 3, '2023-03-01', 0),
(196, 4, '2023-03-01', 0),
(197, 5, '2023-03-01', 0),
(198, 1, '2023-03-02', 0),
(199, 2, '2023-03-02', 0),
(200, 3, '2023-03-02', 0),
(201, 4, '2023-03-02', 0),
(202, 5, '2023-03-02', 0),
(203, 1, '2023-03-03', 0),
(204, 2, '2023-03-03', 0),
(205, 3, '2023-03-03', 0),
(206, 4, '2023-03-03', 0),
(207, 5, '2023-03-03', 0),
(208, 1, '2023-03-04', 0),
(209, 2, '2023-03-04', 0),
(210, 3, '2023-03-04', 0),
(211, 4, '2023-03-04', 0),
(212, 5, '2023-03-04', 0),
(213, 1, '2023-03-05', 0),
(214, 2, '2023-03-05', 0),
(215, 3, '2023-03-05', 0),
(216, 4, '2023-03-05', 0),
(217, 5, '2023-03-05', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `businesses_orders`
--

CREATE TABLE `businesses_orders` (
  `bo_id` int(9) NOT NULL,
  `bo_price` int(6) NOT NULL DEFAULT 0,
  `bo_products` int(6) NOT NULL DEFAULT 0,
  `bo_date` date NOT NULL,
  `bo_type` int(6) NOT NULL DEFAULT 0,
  `bo_bid` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `cellars`
--

CREATE TABLE `cellars` (
  `cl_id` int(5) NOT NULL,
  `cl_owner` int(11) NOT NULL DEFAULT -1,
  `cl_ownername` varchar(20) CHARACTER SET utf8 NOT NULL DEFAULT 'собственность штата',
  `cl_int` int(3) NOT NULL DEFAULT 0,
  `cl_vw` int(4) NOT NULL DEFAULT 0,
  `cl_pos_x` float NOT NULL,
  `cl_pos_y` float NOT NULL,
  `cl_pos_z` float NOT NULL,
  `cl_pos_c` float NOT NULL,
  `cl_price` int(11) NOT NULL,
  `cl_closed` int(11) NOT NULL,
  `cl_improve` varchar(48) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `cl_safe_data` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `cl_seed` int(6) NOT NULL DEFAULT 0,
  `cl_seed_result` int(6) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `debtor_message`
--

CREATE TABLE `debtor_message` (
  `dm_id` int(11) NOT NULL,
  `dm_text` varchar(168) CHARACTER SET utf8 NOT NULL,
  `dm_dest` int(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `debtor_message`
--

INSERT INTO `debtor_message` (`dm_id`, `dm_text`, `dm_dest`) VALUES
(1, '{FFFFFF}Сотрудники мэрии вынесли Вам предупреждение за невыплату налогов.\n\n{AFAFAF}* В случае неоплаты налогов Вы можете потерять часть собственности', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `deposit_boxes`
--

CREATE TABLE `deposit_boxes` (
  `db_id` int(6) NOT NULL,
  `db_owner` int(6) NOT NULL,
  `db_pincode` int(6) NOT NULL DEFAULT 1111,
  `db_money` int(12) NOT NULL DEFAULT 0,
  `db_name` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `deposit_boxes`
--

INSERT INTO `deposit_boxes` (`db_id`, `db_owner`, `db_pincode`, `db_money`, `db_name`) VALUES
(1, 23, 1337, 0, 'first'),
(2, 134, 1337, 0, 'first'),
(3, 31, 1122, 0, 'Mavlud'),
(4, 67, 9353, 0, 'zel'),
(5, 35, 1234, 0, 'Lukas'),
(6, 46, 1216, 100000, 'Dekweazy'),
(7, 42, 8977, 0, '1'),
(8, 203, 1234, 0, 'Путь к Лидерки'),
(9, 173, 2489, 0, 'Накопления'),
(10, 270, 1337, 0, '123123'),
(11, 272, 6548, 0, '123321'),
(12, 266, 1234, 0, '12'),
(13, 275, 1234, 0, 'Yo Acid'),
(14, 196, 1234, 0, 'Фура'),
(15, 21, 1212, 0, '1212'),
(16, 303, 1084, 0, 'На красивую житуху'),
(17, 107, 1111, 0, 'Начало '),
(18, 383, 6666, 0, '666'),
(19, 258, 1234, 100, 'alex'),
(20, 170, 8543, 0, '123'),
(21, 418, 2222, 0, '2'),
(22, 0, 1337, 0, 'first'),
(23, 0, 1056, 70, '1056'),
(24, 159, 1111, 0, 'samper'),
(25, 244, 1056, 0, '1056'),
(26, 631, 1234, 0, 'aye'),
(27, 0, 1234, 0, 'FBI'),
(28, 569, 1906, 0, '999'),
(29, 521, 1056, 0, '1056'),
(30, 254, 1456, 0, 'sklad'),
(31, 7, 1234, 11634551, '022365'),
(32, 2, 2486, 120000000, 'Private 24 GOLD'),
(33, 421, 1111, 0, 'deamon666'),
(34, 447, 1111, 0, 'STIPUHA');

-- --------------------------------------------------------

--
-- Структура таблицы `deposit_logs`
--

CREATE TABLE `deposit_logs` (
  `dl_id` int(9) NOT NULL,
  `dl_from` int(9) NOT NULL,
  `dl_to` int(9) NOT NULL,
  `dl_money` int(12) NOT NULL,
  `dl_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `dm_teams`
--

CREATE TABLE `dm_teams` (
  `t_id` int(11) NOT NULL,
  `t_name` varchar(64) NOT NULL,
  `t_played` int(11) NOT NULL DEFAULT 0,
  `t_wins` int(11) NOT NULL DEFAULT 0,
  `t_type` int(6) NOT NULL,
  `t_rating` int(6) NOT NULL DEFAULT 1000,
  `t_creator` int(9) NOT NULL,
  `t_status` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `elections`
--

CREATE TABLE `elections` (
  `e_id` int(6) NOT NULL,
  `e_name` varchar(24) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `e_votes` int(6) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `everest`
--

CREATE TABLE `everest` (
  `vkid` int(11) NOT NULL,
  `member` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `leave` datetime NOT NULL,
  `message` int(1) NOT NULL,
  `send` int(1) NOT NULL,
  `old` int(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `family`
--

CREATE TABLE `family` (
  `fam_id` int(11) NOT NULL,
  `fam_type` int(2) NOT NULL DEFAULT 0,
  `fam_name` varchar(68) NOT NULL,
  `fam_creator` varchar(24) NOT NULL,
  `fam_chat_color` varchar(16) NOT NULL DEFAULT 'FFFFFF',
  `fam_nationality` int(4) NOT NULL DEFAULT 0,
  `fam_ranks` varchar(700) NOT NULL DEFAULT 'Член семьи|Заместитель|Глава семьи|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none',
  `fam_settings` varchar(64) NOT NULL DEFAULT '3|3|3|3|3|3|3|3',
  `fam_date` date NOT NULL,
  `fam_bank` int(11) NOT NULL DEFAULT 0,
  `fam_house` int(11) NOT NULL DEFAULT 0,
  `fam_members` int(11) NOT NULL DEFAULT 0,
  `fam_rating` int(11) NOT NULL DEFAULT 0,
  `fam_ticket` int(11) NOT NULL DEFAULT 0,
  `fam_max_car` int(3) NOT NULL DEFAULT 3
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `family`
--

INSERT INTO `family` (`fam_id`, `fam_type`, `fam_name`, `fam_creator`, `fam_chat_color`, `fam_nationality`, `fam_ranks`, `fam_settings`, `fam_date`, `fam_bank`, `fam_house`, `fam_members`, `fam_rating`, `fam_ticket`, `fam_max_car`) VALUES
(1, 0, 'Test', 'Thomas_Shelby', 'FFFFFF', 0, 'Член семьи|Заместитель|Глава семьи|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none', '3|3|3|3|3|3|3|3', '2021-12-12', 0, 0, 1, 0, 0, 3),
(2, 0, 'RAMIREZ SQUAD', 'Strong_Ramirez', 'FFFFFF', 0, 'Член семьи|Заместитель|Глава семьи|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none|none', '3|3|3|3|3|3|3|3', '2021-12-12', 0, 0, 0, 0, 0, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `family_blacklist`
--

CREATE TABLE `family_blacklist` (
  `bl_id` int(12) NOT NULL,
  `bl_player` int(6) NOT NULL,
  `bl_family` int(6) NOT NULL,
  `bl_name` varchar(32) NOT NULL,
  `bl_date` date NOT NULL,
  `bl_reason` varchar(24) NOT NULL,
  `bl_add_name` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `family_island`
--

CREATE TABLE `family_island` (
  `fi_id` int(5) NOT NULL,
  `fi_owner` int(11) NOT NULL DEFAULT -1,
  `fi_ownername` varchar(24) NOT NULL DEFAULT 'Собственность штата',
  `fi_int` int(3) NOT NULL DEFAULT 0,
  `fi_vw` int(3) NOT NULL DEFAULT 0,
  `fi_pos_x` float NOT NULL,
  `fi_pos_y` float NOT NULL,
  `fi_pos_z` float NOT NULL,
  `fi_pos_a` float NOT NULL,
  `fi_price` int(11) NOT NULL,
  `fi_family` int(5) NOT NULL DEFAULT 0,
  `fi_improve` varchar(32) NOT NULL DEFAULT '0|0|0|0|0|0',
  `fi_safe_data` varchar(64) NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `fi_safe_code` int(6) NOT NULL DEFAULT 0,
  `fi_radio_status` int(2) NOT NULL DEFAULT 0,
  `fi_radio_url` varchar(128) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `family_vehicles`
--

CREATE TABLE `family_vehicles` (
  `sv_id` int(6) NOT NULL,
  `sv_model` int(6) NOT NULL,
  `sv_type` int(6) NOT NULL,
  `sv_owner` int(4) NOT NULL,
  `sv_rank` int(3) NOT NULL DEFAULT 1,
  `sv_plate` varchar(12) NOT NULL,
  `sv_fuel` float NOT NULL DEFAULT 60,
  `sv_color_1` int(4) NOT NULL DEFAULT 0,
  `sv_color_2` int(4) NOT NULL DEFAULT 0,
  `sv_paint` int(4) NOT NULL DEFAULT 0,
  `sv_pos_x` float NOT NULL,
  `sv_pos_y` float NOT NULL,
  `sv_pos_z` float NOT NULL,
  `sv_pos_a` float NOT NULL,
  `sv_millage` float NOT NULL DEFAULT 0,
  `sv_engine_boost` float NOT NULL DEFAULT 0,
  `sv_brake_boost` float NOT NULL DEFAULT 0,
  `sv_stability_boost` float NOT NULL DEFAULT 0,
  `sv_eng_details` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0',
  `sv_brake_details` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0',
  `sv_stab_details` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0',
  `sv_components` varchar(128) NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0',
  `sv_vw` int(6) NOT NULL DEFAULT 0,
  `sv_int` int(6) NOT NULL DEFAULT 0,
  `sv_wheels` varchar(50) NOT NULL DEFAULT '100.0 |100.0|100.0|100.0',
  `sv_engine` float NOT NULL DEFAULT 100,
  `sv_item` varchar(256) NOT NULL DEFAULT '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0',
  `sv_item_count` varchar(256) NOT NULL DEFAULT '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0',
  `sv_status` int(11) NOT NULL DEFAULT 0,
  `sv_time_id` varchar(11) NOT NULL DEFAULT '0, 0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `fractions`
--

CREATE TABLE `fractions` (
  `f_id` int(6) NOT NULL,
  `f_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `f_leader_name` varchar(24) NOT NULL DEFAULT 'Свободна',
  `f_spawn` varchar(56) NOT NULL,
  `f_ranks` varchar(286) NOT NULL DEFAULT 'None|None|None|None|None|None|None|None|None|None|None|None|None|None|None|None',
  `f_salary` varchar(98) NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0',
  `f_skins_m` varchar(68) NOT NULL DEFAULT '1|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1',
  `f_skins_f` varchar(68) NOT NULL DEFAULT '1|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1',
  `f_chat_color` varchar(24) NOT NULL DEFAULT 'FFFFFF',
  `f_radar_color` varchar(24) NOT NULL,
  `f_rank_settings` varchar(52) NOT NULL DEFAULT '1|1|1|1|1',
  `f_dip` varchar(64) NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `f_drugs` int(9) NOT NULL DEFAULT 0,
  `f_money` int(12) NOT NULL DEFAULT 0,
  `f_materials` int(9) NOT NULL DEFAULT 0,
  `f_guns` int(9) NOT NULL DEFAULT 0,
  `f_dorm_status` int(6) NOT NULL DEFAULT 0,
  `f_money_limit` int(12) NOT NULL DEFAULT 500000
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `fractions`
--

INSERT INTO `fractions` (`f_id`, `f_name`, `f_leader_name`, `f_spawn`, `f_ranks`, `f_salary`, `f_skins_m`, `f_skins_f`, `f_chat_color`, `f_radar_color`, `f_rank_settings`, `f_dip`, `f_drugs`, `f_money`, `f_materials`, `f_guns`, `f_dorm_status`, `f_money_limit`) VALUES
(1, 'Резерв', 'Свободна', '1047.9590|1019.9002|11.0000|328.3885|0|0', 'None|None|None|None|None|None|None|None|None|None|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '295|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '1|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '', '1|1|1|1|1', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000),
(2, 'Резерв', 'Свободна', '1047.9590|1019.9002|11.0000|328.3885|0|0', 'None|None|None|None|None|None|None|None|None|None|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '295|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '1|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '', '1|1|1|1|1', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000),
(3, 'Резерв', 'Свободна', '1047.9590|1019.9002|11.0000|328.3885|0|0', 'None|None|None|None|None|None|None|None|None|None|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '295|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '1|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '', '1|1|1|1|1', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000),
(4, 'Полиция Арзамас', 'Ñâîáîäíà', '-980.327|-12.103|1205.017|315.415|0|1', 'Рядовой|Мл.Сержант|Сержант|Старшина|Прапорщик|Ст.Прапорщик|Мл.Лейтенант|Лейтенант|Капитан|Майор|Подполковник|Полковник|Генерал|None|None|None', '3500|4000|5000|6000|7000|8000|10000|13000|15000|15500|16000|16500|17000|0|0|0', '265|266|280|282|283|284|285|1|1|1|1|1|1|1|1|1', '306|307|309|1|1|1|1|1|1|1|1|1|1|1|1|1', '0000FE', '0x0000FEFF', '13|12|1|1|1', '0|0|0|0|0|0|0|0', 10000, 9877500, 0, 0, 0, 500000),
(5, 'Полиция Южный', 'Свободна', '-980.327|-12.103|1205.017|315.415|0|0', 'Рядовой|Мл.Сержант|Сержант|Старшина|Прапорщик|Ст.Прапорщик|Мл.Лейтенант|Лейтенант|Капитан|Майор|Подполковник|Полковник|Генерал|None|None|None', '2500|3000|3500|4500|5000|5500|6500|7000|8000|8500|9000|10000|12000|0|0|0', '265|266|280|282|283|284|285|1|1|1|1|1|1|1|1|1', '306|307|309|1|1|1|1|1|1|1|1|1|1|1|1|1', '0000FE', '0x0000FEFF', '13|12|12|12|12', '0|0|0|0|0|0|0|0', 0, 9952000, 198, 0, 0, 500000),
(6, 'Резерв', 'Свободна', '1459.0043|-1787.1512|2342.1279|180.0|1|3', 'None|None|None|None|None|None|None|None|None|None|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '295|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '1|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '', '1|1|1|1|1', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000),
(7, 'Федеральная служба безопасности', 'Свободна', '1301.714|-191.58|1201.982|184.163|0|0', 'Рядовой|Младший Сержант|Сержант|Младший Лейтенант|Лейтенант|Майор|Подполковник|Глава СОКР|Глава СК|Глава ГРУ|Заместитель Директора|Директор|None|None|None|None\r\n', '4000|5000|6000|7000|8000|9000|10000|15000|15000|15000|20000|25000|0|0|0|0', '163|172|174|175|211|1|1|1|1|1|1|1|1|1|1|1', '219|141|150|191|1|1|1|1|1|1|1|1|1|1|1|1', '0000FE', '0x0000FEFF', '12|8|1|1|1', '0|0|0|0|0|0|0|0', 10000, 9925000, 12093, 15018, 0, 500000),
(8, 'Армия', 'Свободна', '1868.141|1347.943|1211.609|86.515|1|1', 'Рядовой|Мл.Сержант|Сержант|Прапорщик|Мл.Лейтенант|Лейтенант|Ст.Лейтенант|Капитан|Майор|Подполковник|Полковник|Генерал|None|None|None|None', '2000|2500|3000|3500|4000|4500|5000|7500|10000|12500|15000|20000|0|0|0|0', '61|73|191|255|287|1|1|1|1|11|1|1|1|1|1', '191|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '996533', '0x996533FF', '12|11|1|1|1', '0|0|0|0|0|0|0|0', 10000, 9980000, 11925, 15000, 0, 500000),
(9, 'Резерв', 'Свободна', '-1345.6367|497.0388|11.2027|356.4003|0|0', 'Матрос|Старшина|Мичман|Старший Мичман|Младший Лейтенант|Лейтенант|Старший Лейтенант|Капитан|Майор|Коммандер|Вице-Адмирал|Адмирал флота|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '61|255|287|1|1|1|1|1|1|1|1|1|1|1|1|1', '191|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '0x238C18FF', '12|11|1|1|1', '0|0|0|0|0|0|0|0', 10000, 10000000, 0, 0, 0, 500000),
(10, 'Резерв', 'Свободна', '0|0|0|0|0|0', 'Рядовой|Капрал|Сержант|Старший Сержант|Младший Лейтенант|Лейтенант|Старший Лейтенант|Капитан|Майор|Подполковник|Полковник|Генерал ВВС|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '61|255|287|1|1|1|1|1|1|1|1|1|1|1|1|1', '191|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '238C18', '0x238C18FF', '12|11|1|1|1', '0|0|0|0|0|0|0|0', 10000, 0, 0, 0, 0, 500000),
(11, 'Правительство', 'Свободна', '876.785461|2213.322510|861.682373|90.168259|2|10', 'Охранник|Начальник охраны|Адвокат|Прокурор|Депутат|Министр здравоохранения|Комиссар|Министр обороны|Заместитель Мэра|Мэр|None|None|None|None|None|None', '1000|3000|4000|6500|7500|13000|15000|13000|15000|25000|0|0|0|0|0|0', '17|59|141|147|164|165|187|1|1|1|1|1|1|1|1|1', '143|141|93|1|1|1|1|1|1|1|1|1|1|1|1|1', '29a1e5', '0x29a1e5FF', '10|9|1|1|1', '0|0|0|0|0|0|0|0', 0, 9975000, 0, 0, 0, 500000),
(12, 'Резерв', 'Свободна', '-2763.0432|375.7863|5.8761|270.2456|0|0', 'Водитель|Охранник|Начальник Охраны|Пресс-Секретарь|Секретарь|Адвокат|Прокурор|Депутат|Заместитель Мэра|Мэр|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '147|164|17|187|228|227|1|1|1|1|1|1|1|1|1|1', '143|141|93|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '', '10|9|1|1|1', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000),
(13, 'Резерв', 'Свободна', '245.6658|1859.2133|14.0840|86.2653|0|0', 'Водитель|Охранник|Начальник Охраны|Пресс-Секретарь|Секретарь|Адвокат|Прокурор|Депутат|Заместитель Мэра|Мэр|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '147|164|17|187|228|227|1|1|1|1|1|1|1|1|1|1', '143|141|93|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '', '10|9|1|1|1', '0|0|0|0|0|0|0|0', 10000, 0, 0, 0, 0, 500000),
(14, 'Резерв', 'Свободна', '-2027.0481|-99.2937|35.1641|3.0672|0|0', 'Стажёр|Консультант|Экзаменатор|Младший Инструктор|Инструктор|Менеджер|Заместитель Директора|Директор|None|None|None|None|None|None|None|None', '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0', '171|189|240|1|1|1|1|1|1|1|1|1|1|1|1|1', '11|172|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FFFFFF', '0x6495EDAA', '8|7|1|1|1', '0|0|0|0|0|0|0|0', 10000, 0, 0, 0, 0, 500000),
(15, 'Больница Арзамас', 'Свободна', '1176.8269|-1352.7832|3015.4128|360.0|1|1', 'Интерн|Фельдшер|Участковый врач|Терапевт|Проктолог|Окулист|Хирург|Заведующий отделением|Зам. Главного Врача|Главный врач|None|None|None|None|None|None', '3000|3500|4000|5000|6000|7000|8000|9000|10000|11000|0|0|0|0|0|0', '70|133|148|274|275|276|1|1|1|1|1|1|1|1|1|1', '308|150|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FF6347', '0xFF6347AA', '10|9|1|1|1', '0|0|0|0|0|0|0|0', 10000, 9989000, 0, 0, 0, 500000),
(16, 'Больница Южный', 'Matteo_Catania', '1176.8269|-1352.7832|3015.4128|360.0|1|2', 'Интерн|Фельдшер|Участковый врач|Терапевт|Проктолог|Окулист|Хирург|Заведующий отделением|Зам. Главного Врача|Главный врач|None|None|None|None|None|None', '2500|3000|3500|4500|5000|5500|6500|7500|8500|10000|0|0|0|0|0|0', '70|133|148|274|275|276|1|1|1|1|1|1|1|1|1|1', '308|150|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FF6347', '0xFF6347AA', '10|9|1|1|1', '0|0|0|0|0|0|0|0', 10000, 10000000, 0, 0, 0, 500000),
(17, 'Резерв', 'Rival_Drakonez', '1176.8269|-1352.7832|3015.4128|360.0|1|3', 'Интерн|Фельдшер|Участковый врач|Терапевт|Проктолог|Окулист|Хирург|Заведующий отделением|Зам. Главного Врача|Главный врач|None|None|None|None|None|None', '2500|3000|3500|4500|5000|5500|6500|7500|8500|11000|0|0|0|0|0|0', '70|133|148|274|275|276|1|1|1|1|1|1|1|1|1|1', '308|150|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FF6347', '0xFF6347AA', '10|9|1|1|1', '0|0|0|0|0|0|0|0', 10000, 10000000, 0, 0, 0, 500000),
(18, 'Grove Street', 'Свободна', '2441.755|-1905.012|1519.201|85.435|1|1', '[1] Плэйя|[2] Хастла|[3] Килла|[4] Юонг Г|[5] Гангста|[6] О. Г.|[7] Мобста|[8] Де Кинг|[9] Гетто тавер|Flatcher|None|None|None|None|None|None', '3000|3000|3000|3200|3200|3300|3300|3300|3300|3300|3300|3300|3300|3300|0|0', '105|106|107|270|1|1|1|1|1|1|1|1|1|1|1|1', '56|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '009900', '0x009900AA', '10|9|1|1|1', '1|1|2|0|0|0|0|0', 9400, 5590000, 8050, 8200, 0, 500000),
(19, 'Ballas', 'Areidz_Mechta', '2441.755|-1905.012|1519.201|85.435|1|2', '[1]Baby|[2]Bastard|[3]Burglar|[4]Asessino|[5]Skilled|[6]Destroyer|[7]Shooter|[8]Star|[9]Little Nigga|[10]Big Nigga|None|None|None|None|None|None', '3000|3000|3000|3200|3200|3300|3300|3300|3300|3300|3300|3300|3300|3300|0|0', '102|103|104|1|1|1|1|1|1|1|1|1|1|1|1|1', '195|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'CC00FF', '0xCC00FFAA', '10|9|1|1|1', '1|1|1|1|1|0|3|3', 10000, 7030500, 8260, 9450, 0, 500000),
(20, 'Los Santos Vagos', 'Billy_Stonedwize', '2441.755|-1905.012|1519.201|85.435|1|3', 'Gringo [1]|Виталя Светотехник [2]|Продвинутый Юзер [3]|Уличный Dancer [4]|Lil Bandit [5]|Мастер в Стиле Диско[6]|Торговец Увечий [7]|Сотрудница Орифлейм [8]|Заместитель [9]|Leader [10]|None|None|None|None|None|None', '3000|3000|3000|3200|3200|3300|3300|3300|3300|3300|3300|3300|3300|3300|0|0', '108|109|110|1|1|1|1|1|1|1|1|1|1|1|1|1', '56|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'ffff00', '0xffff00AA', '10|9|1|1|1', '2|1|0|1|1|0|0|0', 9248, 7035000, 7000, 9000, 0, 500000),
(21, 'Rifa', 'Kwiki_Killside', '2441.755|-1905.012|1519.201|85.435|1|4', '[l] El macho|[II] Sparto|[III] Luchador|[IV] Macho|[V] Capturion|[VI]Maestro|[VII] Transito|[VIII] Fasterito|[IX] Motherito|[X] Padre|None|None|None|None|None|None', '3000|3000|3000|3200|3200|3300|3300|3300|3300|3300|3300|3300|3300|3300|0|0', '173|174|175|1|1|1|1|1|1|1|1|1|1|1|1|1', '226|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '6666FF', '0x6666FFAA', '10|9|1|1|1', '4|0|1|1|0|0|3|0', 7960, 5874500, 0, 6339, 0, 500000),
(22, 'Varios Los Aztecas', 'Jake_Uncorage', '2441.755|-1905.012|1519.201|85.435|1|5', 'Ladron|Novato|Amigo|Macho|Dsyrio|Ermano|Bandido|Aytoridid|Legenda|Padre|None|None|None|None|None|None', '3000|3000|3000|3200|3200|3300|3300|3300|3300|3300|3300|3300|3300|3300|0|0', '114|115|116|1|1|1|1|1|1|1|1|1|1|1|1|1', '190|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '00CCFF', '0x00CCFFAA', '10|9|1|1|1', '4|0|1|1|0|0|0|0', 9800, 11490000, 8520, 9100, 0, 500000),
(23, 'La Cosa Nostra', 'Markiz_Feofilov', '-1469.987|324.376|1064.447|85.812|1|1', 'Новицио [1]|Ассосиато [2]|Сомбаттенте [3]|Солдато [4]|Боец [5]|Сото-капо [6]|Капо [7]|Младший босс [8]|Консельери [9]|Дон|None|None|None|None|None|None', '6000|6000|6000|6200|6200|6300|6300|6300|6300|6300|6300|6300|6300|6300|0|0', '113|124|223|127|119|1|1|1|1|1|1|1|1|1|1|1', '91|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'DDA701', '0xDDA701FF', '10|9|1|1|1', '4|0|0|1|0|0|0|0', 10000, 61448600, 9500, 9500, 0, 500000),
(24, 'Русская мафия', 'Ñâîáîäíà', '-2634.867|38.846|1961.13|310.657|1|1', 'Браток [I]|Фраер [II]|Бык [III]|Барыга [IV]|Блатной [V]|Бывалый [VI]|Браток [VII]|Вор [VIII]|Вор в законе [IX]|Авторитет [X]|None|None|None|None|None|None', '6000|6000|6000|6200|6200|6300|6300|6300|6300|6300|6300|6300|6300|6300|0|0', '111|126|125|46|272|1|1|1|1|1|1|1|1|1|1|1', '233|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', 'A1AAAD', '0xA1AAADBB', '10|9|1|1|1', '0|0|4|4|0|0|0|0', 8510, 61448000, 0, 0, 0, 500000),
(25, 'Yakuza', 'Ñâîáîäíà', '2018.181|-1997.526|1074.214|262.669|1|1', 'Камикадзе|Терияки|Кедай|Семейгасира|Вакагасира|Со-Хомбуте|Камбу|Кохай|Самурай|Сёгун [10]|None|None|None|None|None|None', '6000|6000|6000|6200|6200|6300|6300|6300|6300|6300|6300|6300|6300|6300|0|0', '118|120|123|122|208|1|1|1|1|1|1|1|1|1|1|1', '169|1|1|1|1|1|1|1|1|1|1|1|1|1|1|1', '880000', '0x880000BB', '10|9|1|1|1', '0|0|4|0|0|0|0|0', 9500, 62801500, 0, 0, 0, 500000),
(26, 'Резерв', 'Oreste_Baldini', '1449.9722|-1068.8167|1718.0110|180.0|1|1', 'Стажёр|Помощник редакции|Радиотехник|Журналист|Оператор|Ведущий|Помощник редактора|Редактор|Главный Редактор|Директор|None|None|None|None|None|None', '3200|5000|5500|6500|7000|7500|8000|8500|9000|10800|0|0|0|0|0|0', '20|170|186|187|188|1|1|1|1|1|1|1|1|1|1|1', '141|150|219|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FF6600', '0xFF660080', '10|9|10|10|10', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000),
(27, 'National Public Radio', 'Свободна', '1449.9722|-1068.8167|1718.0110|180.0|1|2', 'Стажёр|Помощник редакции|Радиотехник|Журналист|Оператор|Ведущий|Помощник редактора|Редактор|Главный Редактор|Директор|None|None|None|None|None|None', '3200|5000|5500|6500|7000|7500|8000|8500|9000|10800|0|0|0|0|0|0', '20|170|186|187|188|1|1|1|1|1|1|1|1|1|1|1', '141|150|219|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FF6600', '0xFF660080', '10|9|10|10|10', '0|0|0|0|0|0|0|0', 10000, 10000650, 4444, 0, 0, 500000),
(28, 'Резерв', 'Kuchi_Degoni', '1449.9722|-1068.8167|1718.0110|180.0|1|3', 'Стажёр|Помощник редакции|Радиотехник|Журналист|Оператор|Ведущий|Помощник редактора|Редактор|Главный Редактор|Директор|None|None|None|None|None|None', '3200|5000|5500|6500|7000|7500|8000|8500|9000|10800|0|0|0|0|0|0', '20|170|186|187|188|1|1|1|1|1|1|1|1|1|1|1', '141|150|219|1|1|1|1|1|1|1|1|1|1|1|1|1', 'FF6600', '0xFF660080', '10|9|10|10|10', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 500000);

-- --------------------------------------------------------

--
-- Структура таблицы `fractions_blacklist`
--

CREATE TABLE `fractions_blacklist` (
  `bl_id` int(12) NOT NULL,
  `bl_player` int(6) NOT NULL,
  `bl_fraction` int(6) NOT NULL,
  `bl_name` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `gangzones`
--

CREATE TABLE `gangzones` (
  `gz_id` int(11) NOT NULL,
  `gz_x` float NOT NULL,
  `gz_y` float NOT NULL,
  `gz_z` float NOT NULL,
  `gz_a` float NOT NULL,
  `gz_owner` int(11) NOT NULL,
  `gz_spawn` int(10) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=cp1251 COLLATE=cp1251_bin;

-- --------------------------------------------------------

--
-- Структура таблицы `houses`
--

CREATE TABLE `houses` (
  `h_id` int(5) NOT NULL,
  `h_owner` int(11) NOT NULL DEFAULT -1,
  `h_ownername` varchar(20) CHARACTER SET utf8 NOT NULL DEFAULT 'собственность штата',
  `h_int` int(3) NOT NULL DEFAULT 0,
  `h_vw` int(4) NOT NULL DEFAULT 0,
  `h_pos_x` float NOT NULL,
  `h_pos_y` float NOT NULL,
  `h_pos_z` float NOT NULL,
  `h_pos_c` float NOT NULL,
  `h_v_pos_x` float NOT NULL DEFAULT 0,
  `h_v_pos_y` float NOT NULL DEFAULT 0,
  `h_v_pos_z` float NOT NULL DEFAULT 0,
  `h_v_pos_c` float NOT NULL DEFAULT 0,
  `h_price` int(11) NOT NULL,
  `h_rent` int(11) NOT NULL DEFAULT 0,
  `h_rent_status` int(2) NOT NULL DEFAULT 0,
  `h_closed` int(11) NOT NULL,
  `h_renters` int(3) NOT NULL DEFAULT 0,
  `h_improve` varchar(48) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `h_safe_data` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `h_safe_code` int(6) NOT NULL DEFAULT 0,
  `h_prods` int(6) NOT NULL DEFAULT 0,
  `h_seed` int(6) NOT NULL DEFAULT 0,
  `h_seed_result` int(6) NOT NULL DEFAULT 0,
  `h_garage` int(6) NOT NULL DEFAULT 0,
  `h_radio_status` int(3) NOT NULL DEFAULT 0,
  `h_radio_url` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `h_days` int(6) NOT NULL DEFAULT 12
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `houses`
--

INSERT INTO `houses` (`h_id`, `h_owner`, `h_ownername`, `h_int`, `h_vw`, `h_pos_x`, `h_pos_y`, `h_pos_z`, `h_pos_c`, `h_v_pos_x`, `h_v_pos_y`, `h_v_pos_z`, `h_v_pos_c`, `h_price`, `h_rent`, `h_rent_status`, `h_closed`, `h_renters`, `h_improve`, `h_safe_data`, `h_safe_code`, `h_prods`, `h_seed`, `h_seed_result`, `h_garage`, `h_radio_status`, `h_radio_url`, `h_days`) VALUES
(1, 31, 'Ruslan_Bezobid', 6, 0, 1803.09, 2520.43, 15.661, 103.964, 0, 0, 0, 0, 500000, 0, 0, 0, 0, '1|1|1|1|1|1|1|1', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(2, 32, 'Abduazim_Bezobid', 5, 0, 1801.97, 2517.52, 15.661, 66.188, 0, 0, 0, 0, 100000, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(3, -1, 'Ñîáñòâåííîñòü øòàòà', 4, 0, 1804.66, 2515.89, 15.661, 286.614, 0, 0, 0, 0, 100000, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(4, -1, 'Собственность штата', 1, 0, 1703.07, 2819.37, 11.968, 313.521, 0, 0, 0, 0, 1, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(5, -1, 'Собственность штата', 1, 0, -1.059, -4.849, 10.862, 189.88, 0, 0, 0, 0, 1, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(6, -1, 'собственность штата', 4, 1, 2403.61, -914.222, 2.889, 4.609, 0, 0, 0, 0, 150000000, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(7, -1, 'Ñîáñòâåííîñòü øòàòà', 4, 1, 2452.79, -950.566, 2.566, 182.186, 0, 0, 0, 0, 15000000, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12),
(8, -1, 'Собственность штата', 3, 0, 2363.41, -951.209, 2.58, 176.711, 0, 0, 0, 0, 50000000, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 3, 0, '', 12),
(9, 14, 'Strong_Ramirez', 1, 0, 2757.84, -2424.18, 21.688, 357.948, 0, 0, 0, 0, 30, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', 0, 0, 0, 0, 1, 0, '', 12);

-- --------------------------------------------------------

--
-- Структура таблицы `logs_family`
--

CREATE TABLE `logs_family` (
  `id` int(11) NOT NULL,
  `name` varchar(24) CHARACTER SET cp1251 NOT NULL,
  `family` int(11) NOT NULL,
  `type` int(3) NOT NULL,
  `Text` varchar(255) CHARACTER SET cp1251 NOT NULL,
  `text_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `id` int(11) NOT NULL,
  `create_date` date NOT NULL,
  `vk_id` int(9) NOT NULL,
  `priority` int(3) NOT NULL,
  `text` varchar(96) CHARACTER SET utf8 NOT NULL,
  `send` int(3) NOT NULL DEFAULT 0,
  `answer` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `money_logs`
--

CREATE TABLE `money_logs` (
  `log_id` int(11) NOT NULL,
  `name` varchar(20) CHARACTER SET utf8 NOT NULL,
  `from_name` varchar(20) CHARACTER SET utf8 NOT NULL,
  `money` int(12) NOT NULL,
  `reason` varchar(64) CHARACTER SET utf8 NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `money_logs`
--

INSERT INTO `money_logs` (`log_id`, `name`, `from_name`, `money`, `reason`, `date`) VALUES
(215, 'Lincoln_Muller', 'server', 50000, 'продажа дома', '2023-01-14 23:13:46'),
(216, 'Lincoln_Muller', 'server', -1, 'd_house', '2023-01-14 23:13:49'),
(217, 'Lincoln_Mullers', 'server', 15000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-01-19 18:00:00'),
(218, 'Lincoln_Mullers', 'server', -350, '/fixcar', '2023-01-20 21:23:17'),
(219, 'Lincoln_Mullers', 'server', 15000, 'зарплата за администрирования', '2023-01-23 13:00:00'),
(220, 'Lincoln_Muller', 'server', 20000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-01-25 17:00:00'),
(221, 'Strong_Ramirez', 'server', 100000, 'Покупка VIP', '2023-01-31 01:18:42'),
(222, 'Strong_Ramirez', 'server', -15000000, 'd_house', '2023-01-31 01:26:34'),
(223, 'Shrek', 'server', 20000, 'зарплата за администрирования', '2023-01-31 12:44:32'),
(224, 'Strong_Ramirez', 'server', -1500000, 'покупка бизнеса', '2023-01-31 14:38:42'),
(225, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-01-31 15:00:00'),
(226, 'Shrek', 'server', 270000, 'продажа транспорта в гос.', '2023-01-31 18:41:25'),
(227, 'Shrek', 'server', -25500, 'покупка личного транспорта', '2023-01-31 18:41:56'),
(228, 'Strong_Ramirez', 'server', -337500, 'покупка личного транспорта', '2023-01-31 18:42:43'),
(229, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-01-31 19:00:00'),
(230, 'Strong_Ramirez', 'server', -100, 'покупка БУ транспорта', '2023-01-31 20:39:02'),
(231, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-01 11:00:00'),
(232, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-01 19:00:00'),
(233, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-01 20:00:00'),
(234, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-01 21:00:00'),
(235, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-01 22:00:00'),
(236, 'Leonid_Petruhin', 'server', 20000, 'зарплата за администрирования', '2023-02-02 08:00:00'),
(237, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-03 09:00:00'),
(238, 'Zahar_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-03 11:00:00'),
(239, 'Yrys_Croos', 'server', -300000, 'покупка личного транспорта', '2023-02-04 09:39:29'),
(240, 'Zahar_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-04 17:00:00'),
(241, 'Zahar_Ramirez', 'server', -50000000, 'd_house', '2023-02-04 17:00:29'),
(242, 'Zahar_Ramirez', 'server', 25000000, 'продажа дома', '2023-02-04 17:07:35'),
(243, 'Leonid_Petruhin', 'server', 20000, 'зарплата за администрирования', '2023-02-06 23:00:00'),
(244, 'Yrys_Croos', 'server', -100, 'покупка БУ транспорта', '2023-02-07 04:18:35'),
(245, 'Strong_Ramirez', 'server', -30, 'd_house', '2023-02-08 16:16:25'),
(246, 'Zahar_Ramirez', 'server', 100000, 'Ïîêóïêà VIP', '2023-02-08 22:46:17'),
(247, 'Leonid_Petruhin', 'server', 20000, 'зарплата за администрирования', '2023-02-09 09:00:00'),
(248, 'Leonid_Petruhin', 'server', -1, 'покупка бизнеса', '2023-02-10 09:21:50'),
(249, 'Zahar_Ramirez', 'server', 20000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-11 13:00:00'),
(250, 'Aladin_Zloy', 'server', 100000, 'Ïîêóïêà VIP', '2023-02-15 15:34:07'),
(251, 'Test_Aladin', 'server', 100000, 'Ïîêóïêà VIP', '2023-02-15 16:36:01'),
(252, 'Test_Aladin', 'server', -24500, 'ïîêóïêà ëè÷íîãî òðàíñïîðòà', '2023-02-15 16:46:25'),
(253, 'Test_Aladin', 'server', -350, '/fixcar', '2023-02-15 16:46:49'),
(254, 'Test_Aladin', 'server', -350, '/fixcar', '2023-02-15 16:46:54'),
(255, 'Test_Aladin', 'server', 15000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-15 19:00:00'),
(256, 'Strong_Ramirez', 'server', 20000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-15 19:00:00'),
(257, 'Strong_Ramirez', 'server', 20000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-15 23:00:00'),
(258, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-16 12:00:00'),
(259, 'Test_Aladin', 'server', 15000, 'зарплата за администрирования', '2023-02-16 20:00:00'),
(260, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-17 16:00:00'),
(261, 'Test_Aladin', 'server', 15000, 'зарплата за администрирования', '2023-02-18 14:00:00'),
(262, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-19 11:00:00'),
(263, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-19 13:00:00'),
(264, 'Egor_Vinogradovi', 'server', 100000, 'Покупка VIP', '2023-02-19 19:57:47'),
(265, 'Egor_Vinogradovi', 'server', 15000, 'зарплата за администрирования', '2023-02-19 20:00:00'),
(266, 'Rich_Bezobid', 'server', 100000, 'Покупка VIP', '2023-02-19 22:44:52'),
(267, 'Rich_Bezobid', 'server', 20000, 'зарплата за администрирования', '2023-02-19 23:00:00'),
(268, 'Yura', 'server', 15000, 'зарплата за администрирования', '2023-02-19 23:00:00'),
(269, 'Developer', 'server', -260000, 'покупка личного транспорта', '2023-02-20 00:38:53'),
(270, 'Developer', 'server', 5000000, 'Донат валюты', '2023-02-20 00:42:09'),
(271, 'Ruslan_Bezobid', 'server', 13000, 'зарплата за администрирования', '2023-02-20 09:00:00'),
(272, 'Ruslan_Bezobid', 'server', -337500, 'покупка личного транспорта', '2023-02-20 10:28:44'),
(273, 'Ruslan_Bezobid', 'server', -25500, 'покупка личного транспорта', '2023-02-20 10:29:26'),
(274, 'Abduazim_Bezobid', 'server', 9000, 'зарплата за администрирования', '2023-02-20 13:00:00'),
(275, 'Ruslan_Bezobid', 'server', 13000, 'зарплата за администрирования', '2023-02-20 13:00:00'),
(276, 'Strong_Ramirez', 'server', 20000, 'зарплата за администрирования', '2023-02-20 13:00:00'),
(277, 'Ruslan_Bezobid', 'server', 13000, 'зарплата за администрирования', '2023-02-20 14:00:00'),
(278, 'Abduazim_Bezobid', 'server', 9000, 'зарплата за администрирования', '2023-02-20 14:00:00'),
(279, 'Ruslan_Bezobid', 'server', 13000, 'зарплата за администрирования', '2023-02-20 17:00:00'),
(280, 'Ruslan_Bezobid', 'server', 13000, 'зарплата за администрирования', '2023-02-20 19:00:00'),
(281, 'Hanty', 'server', 100000, 'Покупка VIP', '2023-02-21 01:36:17'),
(282, 'Abduazim_Bezobid', 'server', 9000, 'зарплата за администрирования', '2023-02-21 13:00:00'),
(283, 'Abduazim_Bezobid', 'server', -500000, 'd_house', '2023-02-21 17:19:47'),
(284, 'Abduazim_Bezobid', 'server', 9000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-24 17:00:00'),
(285, 'Maksim_Bodakin', 'server', 15000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 16:00:00'),
(286, 'Ruslan_Bezobid', 'server', 13000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 16:00:00'),
(287, 'Abduazim_Bezobid', 'server', 11000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 16:00:00'),
(288, 'Ruslan_Bezobid', 'server', -100000, 'd_house', '2023-02-25 16:23:12'),
(289, 'Ruslan_Bezobid', 'server', 50000, 'ïðîäàæà äîìà', '2023-02-25 16:31:07'),
(290, 'Abduazim_Bezobid', 'server', 11000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 17:00:00'),
(291, 'Maksim_Bodakin', 'server', 15000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 18:00:00'),
(292, 'Ruslan_Bezobid', 'server', 13000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 18:00:00'),
(293, 'Maksim_Bodakin', 'server', -1, 'd_house', '2023-02-25 18:05:06'),
(294, 'Abduazim_Bezobid', 'server', 100000, 'Ïîêóïêà VIP', '2023-02-25 18:48:38'),
(295, 'Abduazim_Bezobid', 'server', 11000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 19:00:00'),
(296, 'Ruslan_Bezobid', 'server', -500000, 'd_house', '2023-02-25 19:22:29'),
(297, 'Ruslan_Bezobid', 'server', 15000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 19:22:47'),
(298, 'Ruslan_Bezobid', 'server', 15000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-02-25 21:59:45'),
(299, 'Abduazim_Bezobid', 'server', -1, 'd_house', '2023-02-26 08:20:04'),
(300, 'Abduazim_Bezobid', 'server', 0, 'продажа дома', '2023-02-26 08:21:27'),
(301, 'Abduazim_Bezobid', 'server', -100000, 'd_house', '2023-02-26 08:51:57'),
(302, 'Abduazim_Bezobid', 'server', 11000, 'зарплата за администрирования', '2023-02-26 09:00:00'),
(303, 'Abduazim_Bezobid', 'server', 11000, 'зарплата за администрирования', '2023-02-26 10:00:00'),
(304, 'Ruslan_Bezobid', 'server', -10000, 'улучшение дома', '2023-02-26 10:45:37'),
(305, 'Ruslan_Bezobid', 'server', -12500, 'улучшение дома', '2023-02-26 10:45:39'),
(306, 'Ruslan_Bezobid', 'server', -15000, 'улучшение дома', '2023-02-26 10:45:42'),
(307, 'Ruslan_Bezobid', 'server', -20000, 'улучшение дома', '2023-02-26 10:45:47'),
(308, 'Ruslan_Bezobid', 'server', -23000, 'улучшение дома', '2023-02-26 10:45:52'),
(309, 'Ruslan_Bezobid', 'server', -25000, 'улучшение дома', '2023-02-26 10:45:55'),
(310, 'Ruslan_Bezobid', 'server', -27500, 'улучшение дома', '2023-02-26 10:45:58'),
(311, 'Ruslan_Bezobid', 'server', -30000, 'улучшение дома', '2023-02-26 10:46:00'),
(312, 'Abduazim_Bezobid', 'server', -25000000, 'ïîêóïêà áèçíåñà', '2023-02-27 17:26:47'),
(313, 'Ruslan_Bezobid', 'server', 15000, 'зарплата за администрирования', '2023-03-01 07:07:09'),
(314, 'Abduazim_Bezobid', 'server', 25000000, 'ïðîäàæà áèçíåñà', '2023-03-02 13:56:56'),
(315, 'Abduazim_Bezobid', 'server', 11000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-03-02 14:00:00'),
(316, 'Developer', 'server', 20000, 'çàðïëàòà çà àäìèíèñòðèðîâàíèÿ', '2023-03-04 15:53:37'),
(317, 'Ruslan_Bezobid', 'server', 15000, 'зарплата за администрирования', '2023-03-08 17:00:00');

-- --------------------------------------------------------

--
-- Структура таблицы `nickname_history`
--

CREATE TABLE `nickname_history` (
  `nh_id` int(6) NOT NULL,
  `nh_owner` int(6) NOT NULL,
  `nh_oldname` varchar(24) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `nh_newname` varchar(24) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `nh_date` date NOT NULL,
  `nh_admin` varchar(24) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT 'none'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `nickname_history`
--

INSERT INTO `nickname_history` (`nh_id`, `nh_owner`, `nh_oldname`, `nh_newname`, `nh_date`, `nh_admin`) VALUES
(1, 20, 'Yrys_Croos', 'Rich_Bezobid', '2023-02-19', 'donate'),
(2, 20, 'Rich_Bezobid', 'Makaka_Ramirez', '2023-02-20', 'donate');

-- --------------------------------------------------------

--
-- Структура таблицы `photographer_job_cooldown`
--

CREATE TABLE `photographer_job_cooldown` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `user_name` varchar(24) NOT NULL,
  `next_time_quest_building` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_with_actors` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_military` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_deputy` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_businessman` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_grandmother` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_wife` timestamp NULL DEFAULT '0000-00-00 00:00:00',
  `next_time_quest_priest` timestamp NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `roulete`
--

CREATE TABLE `roulete` (
  `u_name` varchar(32) NOT NULL,
  `prize` int(25) NOT NULL,
  `status` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `safa_rooster`
--

CREATE TABLE `safa_rooster` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `user_name` varchar(24) CHARACTER SET utf8 NOT NULL,
  `time_input_cmd` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `server_exams`
--

CREATE TABLE `server_exams` (
  `e_id` int(2) NOT NULL,
  `e_name` varchar(24) NOT NULL DEFAULT 'None',
  `e_record` int(5) NOT NULL DEFAULT 30000,
  `e_prize` int(5) NOT NULL DEFAULT 0
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `server_info`
--

CREATE TABLE `server_info` (
  `serv_nelegal_gun` int(11) NOT NULL,
  `serv_nelegal_drugs` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `server_info`
--

INSERT INTO `server_info` (`serv_nelegal_gun`, `serv_nelegal_drugs`) VALUES
(3610, 588);

-- --------------------------------------------------------

--
-- Структура таблицы `server_promocodes`
--

CREATE TABLE `server_promocodes` (
  `promo_id` int(6) NOT NULL,
  `promo_text` varchar(32) NOT NULL,
  `promo_used` int(9) NOT NULL DEFAULT 0,
  `promo_group` int(6) NOT NULL,
  `promo_money` int(9) NOT NULL DEFAULT 0,
  `promo_lic` int(6) NOT NULL DEFAULT 1,
  `promo_skill` int(6) NOT NULL DEFAULT 100,
  `promo_roulette` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `server_variables`
--

CREATE TABLE `server_variables` (
  `var_name` varchar(42) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `var_id` int(11) NOT NULL,
  `var_count` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `server_variables`
--

INSERT INTO `server_variables` (`var_name`, `var_id`, `var_count`) VALUES
('Sawmill dorm', 1, 75651),
('Mine dorm', 2, 109760),
('Factory dorm guns', 3, 54260),
('Mine melted', 4, 109760),
('Mine unmelted', 5, 28),
('Factory dorm mine', 6, 48225),
('Factory dorm wood', 7, 48225),
('election_status', 8, 0),
('server bonus', 9, 12),
('server locked', 10, 0),
('capture time', 11, 3600),
('Grove freeze', 12, 1),
('Ballas freeze', 13, 1),
('Vagos freeze', 14, 1),
('Rifa freeze', 15, 1),
('Aztec freeze', 16, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `server_vehicles`
--

CREATE TABLE `server_vehicles` (
  `sv_id` int(6) NOT NULL,
  `sv_model` int(6) NOT NULL,
  `sv_type` int(6) NOT NULL,
  `sv_owner` int(4) NOT NULL,
  `sv_rank` int(3) NOT NULL DEFAULT 1,
  `sv_plate` varchar(12) NOT NULL,
  `sv_fuel` float NOT NULL DEFAULT 60,
  `sv_color_1` int(4) NOT NULL DEFAULT 0,
  `sv_color_2` int(4) NOT NULL DEFAULT 0,
  `sv_pos_x` float NOT NULL,
  `sv_pos_y` float NOT NULL,
  `sv_pos_z` float NOT NULL,
  `sv_pos_a` float NOT NULL,
  `sv_millage` float NOT NULL DEFAULT 0,
  `sv_inv_slot` varchar(84) NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0',
  `sv_inv_amount` varchar(164) NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0',
  `sv_engine_boost` int(11) NOT NULL DEFAULT 0,
  `sv_brake_boost` int(11) NOT NULL DEFAULT 0,
  `sv_stability_boost` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `teleport_areas`
--

CREATE TABLE `teleport_areas` (
  `area_id` int(6) NOT NULL,
  `area_pickup` int(6) NOT NULL DEFAULT 1318,
  `area_x` float NOT NULL,
  `area_y` float NOT NULL,
  `area_z` float NOT NULL,
  `area_c` float NOT NULL,
  `area_to_x` float NOT NULL,
  `area_to_y` float NOT NULL,
  `area_to_z` float NOT NULL,
  `area_to_c` float NOT NULL,
  `area_virtual_world` int(6) NOT NULL,
  `area_to_virtual_world` int(6) NOT NULL,
  `area_interior` int(6) NOT NULL,
  `area_to_interior` int(6) NOT NULL,
  `area_name` varchar(32) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COLLATE=cp1251_bin;

--
-- Дамп данных таблицы `teleport_areas`
--

INSERT INTO `teleport_areas` (`area_id`, `area_pickup`, `area_x`, `area_y`, `area_z`, `area_c`, `area_to_x`, `area_to_y`, `area_to_z`, `area_to_c`, `area_virtual_world`, `area_to_virtual_world`, `area_interior`, `area_to_interior`, `area_name`) VALUES
(1, 1274, 2103.09, -2.1138, 1398.86, 0, 0, 0, 0, 0, -1, 0, 18, 0, 'buy in shop'),
(2, 1275, -1116.4, -364.525, 1401.55, 0, 0, 0, 0, 0, 1, 0, 1, 0, 'Раздевалка шахты'),
(3, 1274, 21.777, -1106.96, 1029.78, 0, 0, 0, 0, 0, -1, 0, 1, 0, 'buy in ammo'),
(5, 1275, 1687.69, 265.527, 1401, 0, 0, 0, 0, 0, 1, 0, 1, 0, 'Раздевалка завода'),
(6, 1275, 1560.46, 2876.35, 11.7188, 355.465, 0, 0, 0, 0, 0, 0, 0, 0, 'Раздевалка лесопилки'),
(7, 1274, 2697.63, 298.616, 1401, 0, 0, 0, 0, 0, -1, 0, -1, 0, 'buy in clothes'),
(8, 1318, 895.282, 7.8421, 1405.69, 0, -306.893, 488.861, 13.1275, 76.4251, 1, 0, 0, 0, 'LSPD'),
(9, 1318, 895.282, 7.8421, 1405.69, 0, 2575.93, -2415.99, 22.4946, 266.065, 0, 0, 0, 0, 'SFPD'),
(10, 1318, 2290.2, 2431.63, 10.8203, 176.424, 1471.15, -1773.88, 2342.15, 180, 0, 3, 0, 1, 'LVPD'),
(11, 1318, 546.172, 348.444, 1205.62, 357.641, 0, 0, 0, 0, -1, 0, 0, 0, 'LSPD лифт. Офис.'),
(12, 1318, -958.196, 27.0175, 1205.02, 0, 0, 0, 0, 0, -1, 0, 0, 0, 'LSPD лифт. 2этаж.'),
(13, 1318, 164.812, 1278.37, 5.6389, 167.005, 0, 0, 0, 0, -1, 0, 0, 0, 'LSPD лифт. Гараж.'),
(14, 1318, 2571.22, -2426.75, 24.9185, 0, 0, 0, 0, 0, -1, 0, 0, 0, 'SFPD лифт. Гараж.'),
(15, 1318, 2297.02, 2451.34, 10.8203, 0, 0, 0, 0, 0, -1, 0, 0, 0, 'LVPD лифт. Гараж.'),
(16, 19134, 713.972, 1047.59, 11.8978, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Авторынок. Биз'),
(17, 1247, 901.436, 4.5417, 1405.69, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'LSPD услуги'),
(18, 1275, 917.788, 2.3486, 1405.67, 0, 0, 0, 0, 0, -1, -1, -1, 0, 'Раздевалка LSPD'),
(19, 1242, 919.145, 6.7015, 1405.67, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Оружейка PD'),
(20, 1318, -286.678, 577.702, 12.843, 72.2423, 1802.18, -110.736, 1400.98, 0, 0, 0, 0, 0, 'LSMC'),
(21, 1318, 2113, -2391.93, 23.0851, 175.854, 1802.18, -110.736, 1400.98, 90, 0, 2, 0, 1, 'SFMC'),
(22, 1318, 1607.39, 1815.35, 10.8203, 358.326, 1172.65, -1324.55, 1015.41, 90, 0, 3, 0, 1, 'LVMC'),
(23, 1318, 1151.55, -1333.36, 1015.41, 0, 0, 0, 0, 0, -1, 0, 1, 0, 'MC лифт. 1 этаж'),
(24, 1318, 1177.37, -1319.12, 2015.41, 0, 0, 0, 0, 0, -1, 0, 1, 0, 'MC лифт. 2 этаж'),
(25, 1241, 1809.8, -115.817, 1400.98, 0, 0, 0, 0, 0, -1, 0, -1, 0, 'Болька рецепшн пикап'),
(26, 1275, 1805.54, -160.067, 1400.98, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка MC'),
(27, 1318, -1579.08, 467.112, 43.3883, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Подвал домашний'),
(28, 1318, 318.631, 1114.59, 1083.88, 357.92, 2165.95, -1671.34, 15.0733, 218.531, 1, 0, 5, 0, 'Crack house'),
(29, 1318, 1701.47, 259.122, 1401, 86.3551, -1064.16, 2207.9, 38.0946, 171.807, 1, 0, 1, 0, 'Завод'),
(30, 1318, 772.379, -5.40099, 1000.73, 13.9955, 2229.75, -1721.33, 13.5619, 129.809, 1, 0, 5, 0, 'Gym LS'),
(31, 1318, -2270.56, -156.024, 35.3203, 261.673, 772.379, -5.40099, 1000.73, 13.9955, 0, 2, 0, 5, 'Gym SF'),
(32, 1318, 1968.74, 2295.76, 16.4559, 176.534, 772.379, -5.40099, 1000.73, 13.9955, 0, 3, 0, 5, 'LV Gym'),
(33, 1318, 2425.87, -1905.14, 1519.2, 267.059, 2495.4, -1691.03, 14.7656, 356.104, 1, 0, 1, 0, 'Grove'),
(34, 1318, 1939.08, -1114.59, 27.4523, 175.552, 2425.87, -1905.18, 1519.2, 266.498, 0, 2, 0, 1, 'Ballas'),
(35, 1318, 2425.88, -1905.15, 1519.2, 264.302, 2770.57, -1628.61, 12.1775, 357.857, 3, 0, 1, 0, 'Vagos'),
(36, 1318, 2425.88, -1905.15, 1519.2, 264.302, 2736.65, -1952.45, 13.5469, 88.4691, 4, 0, 1, 0, 'Rifa'),
(37, 1318, 2425.88, -1905.15, 1519.2, 264.302, 2185.81, -1815.11, 13.5469, 355.321, 5, 0, 1, 0, 'Aztecas'),
(38, 1318, -1026.71, -2611.65, 18.6245, 176.561, 0, 0, 0, 0, -1, -1, -1, -1, 'Домашний гараж'),
(39, 1318, -362.224, -10.616, 1200.98, 0, 1911.51, 2227.81, 16.0172, 0, 1, 0, 0, 0, 'Driving School'),
(40, 19094, 376.557, -67.4527, 1001.51, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Бургер шот'),
(41, 19094, 249.29, 103, 1201.97, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Пиццерия'),
(42, 19094, 369.441, -6.0282, 1001.85, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Cluckin Bell'),
(43, 19094, -203.343, 389.205, 1202.12, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Goodman Cafe'),
(44, 1520, 499.514, -20.7501, 1000.68, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Бар альхамбра'),
(45, 1520, 497.155, -76.0391, 998.758, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Бар'),
(46, 1520, 1215.17, -13.3507, 1000.92, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Стрип бар'),
(47, 1520, -2652.78, 1410.26, 906.273, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Джиззи бар'),
(48, 2485, 542.349, -1293.04, 17.2422, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Автосалон LS'),
(49, 2485, -1969.16, 294, 35.1719, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Автосалон SF'),
(50, 2485, 2200.78, 1394.24, 11.0625, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Автосалон LV'),
(51, 1318, 274.488, 1827.32, 18.0252, 175.13, 292.792, 1815.4, 18.0252, 359.397, 0, 0, 0, 0, 'ARMY'),
(52, 1318, 123.618, 1932.43, 19.3594, 263.546, 141.778, 1949.49, 19.4994, 85.2865, 0, 0, 0, 0, 'ARMY'),
(53, 1239, -369.305, 3.5366, 1201.02, 0, 0, 0, 0, 0, 1, 0, 0, 0, 'Автошкола'),
(55, 1318, 2127.87, -1961.65, 20.3203, 45, 787.925, -782.497, 998.008, 270, 0, 2, 0, 0, 'National Public Radio  РИТМ'),
(56, 367, 809.106, -789.294, 998.008, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Radio - пикап фотоаппарата'),
(57, 1318, 849.43, -344.84, -1201.86, 90, 1223.83, -1929.93, 2029.75, 264.842, 1, 0, 1, 0, 'Ammo LSPD'),
(58, 1318, 1462.63, -1780.14, 2784.05, 90, -1606.2, 672.167, -4.90625, 355.619, 2, 0, 1, 0, 'Ammo SFPD'),
(59, 1318, 1462.63, -1780.14, 2784.05, 90, 2296.84, 2468.7, 10.8203, 84.3087, 3, 0, 1, 0, 'Ammo LVPD'),
(60, 1318, 1682.7, -2337.9, -33.5734, 175.806, 1685.68, -2335.36, 13.5469, -355.725, 1, 1, 0, 0, 'AERO'),
(61, 1318, 1971.21, 1493.47, 1001, 2.5818, 1907.04, -2230.12, 11.9824, 355.327, -1, 0, 0, 0, 'Мэрия Los Santos [вход / выход]'),
(62, 1318, 725.728, -1440.35, 13.5391, 354.659, 744.713, -1424.61, 1500.95, 86.2174, 0, 2, 0, 1, 'Boat School'),
(63, 1239, 734.688, -1425.02, 1500.95, 0, 0, 0, 0, 0, 2, 0, 0, 0, 'Водная школа'),
(64, 1239, 734.688, -1425.02, 1500.95, 0, 0, 0, 0, 0, 3, 0, 0, 0, 'Аэро школа'),
(65, 1318, 349.854, 2540.72, 16.8427, 84.6723, 744.72, -1424.6, 1500.95, 85.8558, 0, 3, 0, 1, 'Fly School'),
(66, 1318, 972.753, -468.481, 1015.4, 180, 405.943, 627.42, 13.0703, 90, 1, 0, 0, 0, 'Bank Арзамас'),
(67, 1318, 972.753, -468.481, 1015.4, 180, 2376.75, -2140.1, 21.9735, 90, 0, 2, 0, 0, 'Bank Южный'),
(68, 1318, -89.0847, 722.974, 1600.2, 180, 1850.43, 2035.01, 16.9742, 90, 3, 0, 0, 0, 'Bank Батырево'),
(69, 1274, 991.431, -470.516, 1015.4, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Банк. Окно'),
(70, 1274, 991.431, -470.516, 1015.4, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Банк. Окно'),
(71, 1274, 991.431, -470.516, 1015.4, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Банк. Окно'),
(72, 1318, 2292.25, -1722.8, 13.5469, 170.501, 2274.09, 952.121, 1526.72, 263.914, 0, 1, 0, 1, 'Ammo Ben'),
(73, 1318, 2097.36, -1195.89, 23.8598, 356.461, 2274.1, 952.201, 1526.72, 262.81, 0, 2, 0, 1, 'Miko ammo'),
(74, 1318, 2442.39, -1981.72, 13.5469, 353.529, 2274.11, 952.232, 1526.72, 264.305, 0, 3, 0, 1, 'Emmet Ammo'),
(75, 1242, 2276.63, 951.237, 1526.72, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Gang Ammo'),
(76, 1275, 1977.19, 1507.81, 1001, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Мэрия Los Santos [раздевалка]'),
(77, 1275, 756.366, 5.199, 1000.7, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка спортзал'),
(78, 1239, 1987.75, 1497.04, 1001, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Трудоустройство'),
(79, 1318, -1119.26, -371.804, 1401.14, 175.624, 2385.26, 1685.52, 0, 83.3355, 1, 0, 1, 0, 'Mine'),
(80, 1314, 1980.77, 1494.46, 1001, 0, 0, 0, 0, 0, -1, 0, -1, 0, 'Мэрия Los Santos [архив семей]'),
(81, 1318, -812.454, 303.23, 1451, 0, 1819.07, 2095.81, 16.1642, 268, -1, 0, 0, 0, 'FBI (Вход/Выход)'),
(84, 1318, -2514.49, -634.812, 1328, 90, -2536.64, -627.92, 1846.25, 180, 2, 2, 1, 1, 'FBI (Оружейка)'),
(85, 1318, -122.51, -26.8147, 1298.01, 45, -110.529, 986.158, 12.7537, 90, 1, 0, 0, 0, 'Casino'),
(86, 1318, 1108.8, 2170.26, 1501.09, 173.228, 2639.18, -2428.96, 13.2651, 266.253, 1, 0, 1, 0, 'PORT'),
(87, 1275, 1963.69, 1063.25, 994.469, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка казино'),
(88, 1275, 1109.82, 2164, 1501.09, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка порт'),
(89, 1318, 161.82, 1261.16, 22.623, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'LSPD lift'),
(90, 1318, 2279.71, 2458.31, 38.6837, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'LVPD lift'),
(91, 1318, 1413.11, -1789.98, 15.4347, 87.2708, 1464.64, -1803.89, 33.4235, 84.5775, 0, 0, 0, 0, 'city hall'),
(92, 1318, 215.968, 14.4828, 2.5708, 274.917, 692.373, -825.517, 1501.09, 175.595, 0, 1, 0, 1, 'PINE'),
(93, 1239, -487.029, 904.641, 12.1426, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа'),
(94, 1239, 1009.9, -1354.17, 13.863, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа'),
(95, 1239, 1676.61, -2347.76, -33.5625, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа'),
(96, 1239, 2639.97, -2424.84, 13.2651, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа порт'),
(97, 1318, -1400.71, 281.462, 1401, 261.389, 1624.84, 1798.19, 16.3203, 352.525, 1, 0, 1, 0, 'army'),
(98, 1242, -1391.49, 290.231, 1401, 0, 0, 0, 0, 0, 5, -1, -1, 1, 'Оружейка армия'),
(99, 1275, -1409.3, 302.408, 1401, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка армия'),
(100, 1318, 1862.53, 1343.5, 2211.61, 355.034, 116.072, 1863.34, 18.2049, 266.605, 1, 0, 1, 0, 'army hosp'),
(101, 1239, 2380.4, 1705.39, -2.2312, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа шахта'),
(102, 1239, -46.8845, -275.02, 5.4297, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа завод'),
(103, 1239, -1093.03, -1654.58, 76.3739, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа лесопилка'),
(104, 1318, 1293.44, -1342.73, 35.8093, 174.158, 1310.18, -1366.99, 13.5146, 177.092, 5, 0, 0, 0, 'internet'),
(105, 1239, 1292.46, -1361, 35.8143, 0, 0, 0, 0, 0, 5, 0, 0, 0, 'Интернет салон'),
(106, 19134, 1866.89, 2246.42, 15.274, 0, 0, 0, 0, 0, -1, 0, 0, 0, 'Мопед аренда'),
(107, 19134, -482.593, 914.261, 12.1426, 0, 0, 0, 0, 0, -1, 0, 0, 0, 'Мопед аренда'),
(108, 19134, 2747.3, -2438.74, 21.6969, 0, 0, 0, 0, 0, -1, 0, 0, 0, 'Мопед аренда'),
(109, 1275, 1448.77, -1065.17, 1718.01, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка news'),
(110, 1275, -782.932, 296.88, 1451, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Раздевалка FBI'),
(111, 1242, -785.811, 312.004, 1451, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Оружейка FBI'),
(112, 19134, -2479.18, 2846.42, 37.634, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Мопед аренда'),
(113, 19134, -41.1355, -302.644, 5.4297, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Мопед аренда'),
(114, 19134, 1818.3, 2511.88, 15.661, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Мопед аренда'),
(115, 19134, 2616.18, -2389.41, 13.625, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Мопед аренда'),
(116, 1318, 1387.04, -13.6, 1001.01, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Яхта'),
(117, 2485, 2890.65, -365.08, 8.138, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Катерная база'),
(118, 1242, 2460.25, -2120.61, 13.553, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Тренировочный комплекс'),
(119, 1318, 2031.15, -2034.48, 1074.19, 262.921, 2634.49, 1824.23, 11.0161, 90, 1, 0, 1, 0, 'Yakuza'),
(120, 1318, -1486.03, 324.524, 1064.45, 266.629, 1455.67, 751.011, 11.0234, 90, 1, 0, 1, 0, 'LCN'),
(121, 1318, -2628.15, 39.2373, 1961.13, 87.1847, 937.376, 1733.22, 8.8516, 270, 1, 0, 1, 0, 'RM'),
(122, 1318, -2460.67, 523.238, 51.0638, 83.2684, -2447.15, 523.046, 30.326, 267.341, 0, 0, 0, 0, 'fbi vert'),
(123, 2485, -1397.35, -542.386, 14.1484, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Катерная база'),
(124, 1242, 676.414, -18.9522, 1206.37, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Мэрия Los Santos [снаряжение]'),
(125, 1318, 315.566, 2043.61, 17.6406, 180, 2154.88, -774.297, 1412.17, 90, 0, 5, 0, 1, 'Оружейка Армия (склад с оружием)'),
(127, 1241, 839.048, -33.4245, 2016.43, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Аптека'),
(128, 1239, 742.603, -1416.07, 1500.95, 0, 0, 0, 0, 0, 3, 0, 0, 0, 'Авиашкола (проверка скилла)'),
(129, 1239, 742.603, -1416.07, 1500.95, 0, 0, 0, 0, 0, 2, 0, 0, 0, 'Аэрошкола (проверка скилла)'),
(130, 1239, 742.6, -1413.37, 1500.95, 0, 0, 0, 0, 0, 3, 0, 0, 0, 'Аэрошкола (проверка скилла)'),
(131, 1239, 742.6, -1413.37, 1500.95, 0, 0, 0, 0, 0, 2, 0, 0, 0, 'Водная школа (проверка скилла)'),
(132, 1318, 1177.34, -1330.72, 3015.41, 0, 0, 0, 0, 0, -1, 0, 1, 0, 'MC лифт. 3 этаж'),
(133, 1318, 2000.05, 1506.72, 1601, 89.6652, 1794.93, 2036.98, 15.8672, 183.576, 0, 0, 3, 0, 'rieltor'),
(134, 1314, 2000.02, 1498.42, 1601, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Риелторка'),
(135, 1318, -1831.1, 573.024, 35.1668, 241.011, 2012.02, 1319.93, 1501.09, 87.1211, 0, 0, 0, 16, 'Фотограф'),
(136, 1275, 2008.76, 1325.65, 1501.09, 0, 0, 0, 0, 0, -1, -1, 16, -1, 'Инвайт на работу фотографа'),
(137, 1276, 2006.79, 1328.42, 1501.52, 0, 0, 0, 0, 0, -1, -1, 16, -1, 'Выдача фотика'),
(138, 19605, 1995.87, 1324.46, 1499.61, 0, 0, 0, 0, 0, -1, -1, 16, -1, 'Квест для печати (фотограф)'),
(139, 1274, 2003.61, 1328.36, 1501.52, 0, 0, 0, 0, 0, -1, -1, 16, -1, 'Выдача ЗП (фотограф)'),
(140, 1318, 0, 0, 0, 0, 1883, -1896.67, 15.6273, 90, 1, 1, 1, 1, '1'),
(141, 1239, 2001.74, 1322.18, 1501.09, 0, 0, 0, 0, 0, -1, -1, -1, 16, 'информация о работе фотографа '),
(142, 1318, 1180.37, 3532.01, 4.85207, 357.17, 1211.94, 962.241, 953.341, 268.167, 0, 1, 0, 2, 'Семейный остров №1 | Баня'),
(143, 1318, 1685.69, 3563, 5.24662, 1.83088, 1211.94, 962.241, 953.341, 268.167, 0, 2, 0, 2, 'Семейный остров №2 | Баня'),
(144, 1318, 2262.13, 3560.35, 4.96191, 2.66337, 1211.94, 962.241, 953.341, 268.167, 0, 3, 0, 2, 'Семейный остров №3 | Баня'),
(145, 1318, 2979, 3585.58, 4.07027, 359.168, 1211.94, 962.241, 953.341, 268.167, 0, 4, 0, 2, 'Семейный остров №4 | Баня'),
(146, 1318, 3558.66, 3642.06, 4.19488, 356.671, 1211.94, 962.241, 953.341, 268.167, 0, 5, 0, 2, 'Семейный остров №5 | Баня'),
(147, 1318, 3649.72, 4160.05, 4.2449, 357.17, 1211.94, 962.241, 953.341, 268.167, 0, 6, 0, 2, 'Семейный остров №6 | Баня'),
(148, 1318, 4381.81, 4023.96, 4.53434, 356.729, 1211.94, 962.241, 953.341, 268.167, 0, 7, 0, 2, 'Семейный остров №7 | Баня'),
(149, 1318, -4069, 564.273, 5.47256, 264.233, 1211.94, 962.241, 953.341, 268.167, 0, 8, 0, 2, 'Семейный остров №8 | Баня'),
(150, 1318, -3822.5, 1157.82, 5.75084, 268.561, 1211.94, 962.241, 953.341, 268.167, 0, 9, 0, 2, 'Семейный остров №9 | Баня'),
(151, 1318, -3918.18, 1671.72, 5.4036, 267.448, 1211.94, 962.241, 953.341, 268.167, 0, 10, 0, 2, 'Семейный остров №10 | Баня'),
(152, 1318, -3802.35, 2310.36, 5.07605, 267.282, 1211.94, 962.241, 953.341, 268.167, 0, 11, 0, 2, 'Семейный остров №11 | Баня'),
(153, 1318, -3717.45, 2835.74, 5.7071, 267.894, 1211.94, 962.241, 953.341, 268.167, 0, 12, 0, 2, 'Семейный остров №12 | Баня'),
(154, 1318, -3742.6, 3455.63, 5.16284, 266.946, 1211.94, 962.241, 953.341, 268.167, 0, 13, 0, 2, 'Семейный остров №13 | Баня'),
(155, 1318, 3972.97, 2623.82, 2.58454, 356.011, 1211.94, 962.241, 953.341, 268.167, 0, 14, 0, 2, 'Семейный остров №14 | Баня'),
(156, 1318, 4285.61, 2149.87, 2.7054, 2.58195, 1211.94, 962.241, 953.341, 268.167, 0, 15, 0, 2, 'Семейный остров №15 | Баня'),
(157, 1318, 4518.85, 1283.11, 2.77098, 0.92196, 1211.94, 962.241, 953.341, 268.167, 0, 16, 0, 2, 'Семейный остров №16 | Баня'),
(158, 1318, 4818.31, 751.739, 2.96074, 358.002, 1211.94, 962.241, 953.341, 268.167, 0, 17, 0, 2, 'Семейный остров №17 | Баня'),
(159, 1318, 5167.2, 237.432, 2.78132, 358.602, 1211.94, 962.241, 953.341, 268.167, 0, 18, 0, 2, 'Семейный остров №18 | Баня'),
(160, 1318, 5538.25, -386.728, 2.99977, 357.281, 1211.94, 962.241, 953.341, 268.167, 0, 19, 0, 2, 'Семейный остров №19 | Баня'),
(161, 1275, 1215.76, 957.222, 953.341, 0, 0, 0, 0, 0, -1, -1, 2, 2, 'Баня [раздевалка]'),
(162, 2247, 1213.28, 957.288, 953.341, 0, 0, 0, 0, 0, -1, -1, 2, 2, 'Баня [банный веник]'),
(163, 1274, 1379.22, -24.442, 1000.93, 0, 0, 0, 0, 0, -1, -1, 22, 22, 'Магазин электроники'),
(164, 1239, 1815.31, 2526.3, 15.8682, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа'),
(165, 1239, -2464.4, 2842.23, 38.4074, 0, 0, 0, 0, 0, -1, -1, -1, -1, 'Хелпа'),
(167, 1275, -979.283, -3.5479, 1205.02, 0, 0, 0, 0, 0, 0, -1, -1, -1, 'Раздевалка SFPD');

-- --------------------------------------------------------

--
-- Структура таблицы `testing_codes`
--

CREATE TABLE `testing_codes` (
  `tc_id` int(6) NOT NULL,
  `tc_name` varchar(24) CHARACTER SET utf8 NOT NULL,
  `tc_code` varchar(16) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `time_promocodes`
--

CREATE TABLE `time_promocodes` (
  `promo_id` int(6) NOT NULL,
  `promo_text` varchar(32) NOT NULL,
  `promo_used` int(9) NOT NULL DEFAULT 0,
  `promo_exp` int(9) NOT NULL DEFAULT 0,
  `promo_money` int(9) NOT NULL DEFAULT 0,
  `promo_drivelic` int(6) NOT NULL DEFAULT 1,
  `promo_gunlic` int(6) NOT NULL DEFAULT 1,
  `promo_boatlic` int(6) NOT NULL DEFAULT 1,
  `promo_flylic` int(6) NOT NULL DEFAULT 1,
  `promo_skill_silenced` int(6) NOT NULL DEFAULT 100,
  `promo_skill_deagle` int(6) NOT NULL DEFAULT 100,
  `promo_skill_shotgun` int(6) NOT NULL DEFAULT 100,
  `promo_skill_mp5` int(6) NOT NULL DEFAULT 100,
  `promo_skill_ak47` int(6) NOT NULL DEFAULT 100,
  `promo_skill_m4` int(6) NOT NULL DEFAULT 100,
  `promo_skill_rifle` int(6) NOT NULL DEFAULT 100
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `unitpay_payments`
--

CREATE TABLE `unitpay_payments` (
  `id` int(10) NOT NULL,
  `unitpayId` varchar(255) NOT NULL,
  `account` varchar(255) NOT NULL,
  `sum` float NOT NULL,
  `itemsCount` int(11) NOT NULL DEFAULT 1,
  `dateCreate` datetime NOT NULL,
  `dateComplete` datetime DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `u_id` int(12) NOT NULL,
  `u_name` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `u_password` varchar(32) CHARACTER SET cp1251 COLLATE cp1251_bin NOT NULL,
  `u_ip_registration` varchar(18) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `u_last_ip` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '127.0.0.1',
  `u_date_registration` date NOT NULL,
  `u_last_date` date NOT NULL,
  `u_online` int(3) NOT NULL DEFAULT 0,
  `u_referal` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `u_email` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `u_level` int(4) NOT NULL DEFAULT 1,
  `u_exp` int(4) NOT NULL DEFAULT 0,
  `u_age` int(4) NOT NULL DEFAULT 0,
  `u_national` int(4) NOT NULL DEFAULT 0,
  `u_gender` int(3) NOT NULL,
  `u_skin` int(4) NOT NULL DEFAULT 0,
  `u_org_skin` int(6) NOT NULL DEFAULT 0,
  `u_money` int(4) NOT NULL DEFAULT 250,
  `u_health` float NOT NULL DEFAULT 100,
  `u_settings` varchar(16) CHARACTER SET utf8 NOT NULL DEFAULT '1|1|1|1',
  `u_enhancements` varchar(10) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0',
  `u_warn` int(3) NOT NULL DEFAULT 0,
  `u_unwarntime` int(6) NOT NULL DEFAULT 0,
  `u_mute` int(6) NOT NULL DEFAULT 0,
  `u_house` int(5) NOT NULL DEFAULT -1,
  `u_renthouse` int(5) NOT NULL DEFAULT -1,
  `u_rent_price` int(6) NOT NULL DEFAULT 0,
  `u_rent_days` int(6) NOT NULL DEFAULT -1,
  `u_business` int(6) NOT NULL DEFAULT -1,
  `u_member` int(4) NOT NULL DEFAULT 0,
  `u_leader` int(4) NOT NULL DEFAULT 0,
  `u_rank` int(4) NOT NULL DEFAULT 0,
  `u_fraction_date` date NOT NULL,
  `u_wanted` int(4) NOT NULL DEFAULT 0,
  `u_bail` int(9) NOT NULL DEFAULT 0,
  `u_jail` int(6) NOT NULL DEFAULT 0,
  `u_jailed` int(6) NOT NULL DEFAULT 0,
  `u_bank` int(9) NOT NULL DEFAULT 0,
  `u_number` int(9) NOT NULL DEFAULT 0,
  `u_phohe_balance` int(9) NOT NULL DEFAULT 0,
  `u_phone_names` varchar(260) CHARACTER SET utf8 NOT NULL DEFAULT '-|-|-|-|-|-|-|-|-|-',
  `u_phone_nums` varchar(70) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0',
  `u_job` int(4) NOT NULL DEFAULT 0,
  `u_salary` int(11) NOT NULL DEFAULT 0,
  `u_skills` varchar(36) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0|0|0',
  `u_radio` int(6) NOT NULL DEFAULT 0,
  `u_drive_lic` int(6) NOT NULL DEFAULT 0,
  `u_fly_lic` int(6) NOT NULL DEFAULT 0,
  `u_boat_lic` int(6) NOT NULL DEFAULT 0,
  `u_gun_lic` int(6) NOT NULL DEFAULT 0,
  `u_tskill` int(9) NOT NULL DEFAULT 0,
  `u_capture_kills` int(6) NOT NULL DEFAULT 0,
  `u_capture_start` int(6) NOT NULL DEFAULT 0,
  `u_captures` int(6) NOT NULL DEFAULT 0,
  `u_drugs` int(6) NOT NULL DEFAULT 0,
  `u_ammo` int(6) NOT NULL DEFAULT 0,
  `u_guns` int(6) NOT NULL DEFAULT 0,
  `u_tempskin` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0',
  `u_hunger` int(6) NOT NULL DEFAULT 100,
  `u_hungerimmune` int(3) NOT NULL DEFAULT 0,
  `u_direct` int(6) NOT NULL DEFAULT 0,
  `u_aidkit` int(6) NOT NULL DEFAULT 0,
  `u_bandage` int(6) NOT NULL DEFAULT 0,
  `u_schiene` int(6) NOT NULL DEFAULT 0,
  `u_aspirin` int(6) NOT NULL DEFAULT 0,
  `u_morphine` int(6) NOT NULL DEFAULT 0,
  `u_adrenalin` int(6) NOT NULL DEFAULT 0,
  `u_repairkit` int(6) NOT NULL DEFAULT 0,
  `u_gps_tracker` int(6) NOT NULL DEFAULT 0,
  `u_mask` int(6) NOT NULL DEFAULT 0,
  `u_rope` int(6) NOT NULL DEFAULT 0,
  `u_canister` int(6) NOT NULL DEFAULT 0,
  `u_fight_skill` int(6) NOT NULL DEFAULT 0,
  `u_fight_style` int(6) NOT NULL DEFAULT 0,
  `u_seed` int(6) NOT NULL DEFAULT 0,
  `u_graph_code` int(6) NOT NULL DEFAULT 0,
  `u_vk_id` int(12) NOT NULL DEFAULT 0,
  `u_vk_code` int(12) NOT NULL DEFAULT 0,
  `u_googleauth` varchar(17) NOT NULL,
  `u_googleauth_status` int(1) NOT NULL DEFAULT 0,
  `u_graph_code_status` int(3) NOT NULL DEFAULT 0,
  `u_vk_id_status` int(6) NOT NULL DEFAULT 0,
  `u_hour_played` int(9) NOT NULL DEFAULT 0,
  `u_tax` int(9) NOT NULL DEFAULT 0,
  `u_family` int(6) NOT NULL DEFAULT 0,
  `u_family_rank` int(6) NOT NULL DEFAULT 0,
  `u_vote` int(4) NOT NULL DEFAULT 0,
  `u_f_warning` int(6) NOT NULL DEFAULT 0,
  `u_accessories` varchar(68) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `u_accessories_used` varchar(68) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `pSlotItem` varchar(129) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,',
  `u_spawnchange` int(3) NOT NULL DEFAULT 0,
  `u_donate` int(9) NOT NULL DEFAULT 0,
  `u_donateall` int(9) NOT NULL DEFAULT 0,
  `u_maxveh` int(6) NOT NULL DEFAULT 2,
  `u_donatetax` int(6) NOT NULL DEFAULT 1,
  `u_status` int(6) NOT NULL DEFAULT 0,
  `u_promo` varchar(64) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0',
  `u_droulette` int(6) NOT NULL DEFAULT 0,
  `u_activity` float NOT NULL DEFAULT 0,
  `u_lot` int(6) NOT NULL DEFAULT 0,
  `u_teams` varchar(16) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0',
  `u_team_0` int(6) NOT NULL DEFAULT 0,
  `u_team_1` int(6) NOT NULL DEFAULT 0,
  `u_team_2` int(6) NOT NULL DEFAULT 0,
  `u_promomoney` int(12) NOT NULL DEFAULT 0,
  `u_vip` int(1) NOT NULL DEFAULT 0,
  `u_walkstyle` int(2) NOT NULL DEFAULT 0,
  `u_textstyle` int(1) NOT NULL DEFAULT 0,
  `u_fmute` int(6) NOT NULL DEFAULT 0,
  `u_hospital` int(1) NOT NULL DEFAULT 1,
  `u_moneycase` int(1) NOT NULL DEFAULT 0,
  `u_newbiejob` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0',
  `u_quest_status` varchar(68) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `u_quest_progress` varchar(68) CHARACTER SET utf8 NOT NULL DEFAULT '0|0|0|0|0|0|0|0',
  `u_cellar` int(6) NOT NULL DEFAULT -1,
  `u_promo_today` int(9) NOT NULL DEFAULT 0,
  `u_family_mute` int(6) NOT NULL DEFAULT 0,
  `u_family_date` date NOT NULL,
  `u_island` int(3) NOT NULL DEFAULT -1,
  `u_load_textures` int(3) NOT NULL,
  `u_phone` int(3) NOT NULL,
  `u_tester_status` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`u_id`, `u_name`, `u_password`, `u_ip_registration`, `u_last_ip`, `u_date_registration`, `u_last_date`, `u_online`, `u_referal`, `u_email`, `u_level`, `u_exp`, `u_age`, `u_national`, `u_gender`, `u_skin`, `u_org_skin`, `u_money`, `u_health`, `u_settings`, `u_enhancements`, `u_warn`, `u_unwarntime`, `u_mute`, `u_house`, `u_renthouse`, `u_rent_price`, `u_rent_days`, `u_business`, `u_member`, `u_leader`, `u_rank`, `u_fraction_date`, `u_wanted`, `u_bail`, `u_jail`, `u_jailed`, `u_bank`, `u_number`, `u_phohe_balance`, `u_phone_names`, `u_phone_nums`, `u_job`, `u_salary`, `u_skills`, `u_radio`, `u_drive_lic`, `u_fly_lic`, `u_boat_lic`, `u_gun_lic`, `u_tskill`, `u_capture_kills`, `u_capture_start`, `u_captures`, `u_drugs`, `u_ammo`, `u_guns`, `u_tempskin`, `u_hunger`, `u_hungerimmune`, `u_direct`, `u_aidkit`, `u_bandage`, `u_schiene`, `u_aspirin`, `u_morphine`, `u_adrenalin`, `u_repairkit`, `u_gps_tracker`, `u_mask`, `u_rope`, `u_canister`, `u_fight_skill`, `u_fight_style`, `u_seed`, `u_graph_code`, `u_vk_id`, `u_vk_code`, `u_googleauth`, `u_googleauth_status`, `u_graph_code_status`, `u_vk_id_status`, `u_hour_played`, `u_tax`, `u_family`, `u_family_rank`, `u_vote`, `u_f_warning`, `u_accessories`, `u_accessories_used`, `pSlotItem`, `u_spawnchange`, `u_donate`, `u_donateall`, `u_maxveh`, `u_donatetax`, `u_status`, `u_promo`, `u_droulette`, `u_activity`, `u_lot`, `u_teams`, `u_team_0`, `u_team_1`, `u_team_2`, `u_promomoney`, `u_vip`, `u_walkstyle`, `u_textstyle`, `u_fmute`, `u_hospital`, `u_moneycase`, `u_newbiejob`, `u_quest_status`, `u_quest_progress`, `u_cellar`, `u_promo_today`, `u_family_mute`, `u_family_date`, `u_island`, `u_load_textures`, `u_phone`, `u_tester_status`) VALUES
(1, 'Arthur_Shelby', '93279e3308bdbbeed946fc965017f67a', '2.57.97.134', '127.0.0.1', '2021-12-08', '2022-02-16', 0, 'n', '@.', 1, 0, 21, 1, 0, 252, 265, 6502000, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, 140, 0, 0, 0, '2021-12-19', 0, 0, 0, 0, 24000, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '14|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 906, 114514, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.1, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(2, 'Thomas_Shelby', '51ba809c3e1545e3a3b9ea0ab140a0f9', '2.57.97.134', '2.57.97.206', '2021-12-08', '2022-02-18', 0, 'n', '@.', 3, 0, 21, 1, 0, 252, 265, 278900, 100, '1|1|1|1', '1|1|0|0', 0, 0, 0, -1, -1, 0, -1, 149, 5, 5, 13, '2022-02-13', 0, 0, 0, 0, 142600, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '1|0|0|0|4|100|0', 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '14|0|0|0|0', 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 965, 144301, 1, 3, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '0,0,0,0,0', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '1|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '2021-12-12', -1, 0, 0, 0),
(3, 'Thomas_Wlacker', '51ba809c3e1545e3a3b9ea0ab140a0f9', '176.98.225.97', '2.57.97.187', '2021-12-29', '2022-01-29', 0, 'n', '@.', 1, 0, 21, 1, 0, 236, 0, 200, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '236|0|0|0|0', 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 1249, 388650, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(4, 'Thomas_Shelbybssh', '7a12a47984333222320df4510947fbdd', '176.98.225.38', '176.98.225.38', '2022-01-24', '2022-01-24', 0, 'n', '@.', 1, 0, 21, 1, 0, 235, 0, 250, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '235|0|0|0|0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 61, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '0,0,0,0,0', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(5, 'Thomas_Arlan', '93279e3308bdbbeed946fc965017f67a', '176.98.225.158', '176.98.225.158', '2022-02-08', '2022-02-08', 0, 'n', 'wada@.', 1, 0, 21, 1, 0, 236, 0, 250, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '236|0|0|0|0', 99, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 40, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(8, 'Thomas_Shelbygssg', '51ba809c3e1545e3a3b9ea0ab140a0f9', '176.98.225.32', '176.98.225.32', '2022-02-17', '2022-02-17', 0, 'n', '@.', 1, 0, 21, 1, 0, 234, 0, 250, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 58, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(9, 'Lincoln_Mullerov', '51ba809c3e1545e3a3b9ea0ab140a0f9', '2.57.97.9', '2.57.97.9', '2023-01-09', '2023-01-09', 0, 'n', '@.', 1, 0, 21, 1, 0, 236, 0, 23000000, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '236|0|0|0|0', 91, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 715, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(10, 'Lincoln_Muller', 'f9a594d62058c8f105d7ceb6613ec865', '146.59.45.82', '91.226.254.126', '2023-01-09', '2023-01-27', 0, 'n', 'susjsjsj@mail.ru', 25, 0, 21, 1, 0, 235, 105, 229230197, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, 3, 18, 18, 10, '2023-01-14', 0, 0, 0, 0, 26900, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '235|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 520, 3441, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', -1, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(11, 'Lincoln_Mullers', 'f9a594d62058c8f105d7ceb6613ec865', '91.242.194.62', '91.242.194.62', '2023-01-13', '2023-01-23', 0, 'n', 'susjsjsj@mail.ru', 25, 0, 21, 1, 0, 234, 0, 957044650, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '100|0|0|0|0|0|0', 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 228, 1916, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 10000, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(13, 'Leonid_Petruhin', '1c2f97a881f62cec32b6992bfff1f4ec', '80.80.195.23', '178.178.87.1', '2023-01-30', '2023-02-17', 0, 'n', 'petruhinls2010@gmail.com', 4, 0, 24, 1, 0, 234, 0, 59949, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, 1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 17000, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 3081, 850, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(14, 'Strong_Ramirez', '061ee38379fa1c6e8dacca81949f7a4d', '2.60.63.234', '90.188.151.144', '2023-01-31', '2023-02-28', 0, 'n', 'strong@mail.ru', 43, 12, 22, 1, 0, 31, 265, 0, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, 9, -1, 0, -1, 4, 5, 5, 13, '2023-02-19', 0, 0, 0, 0, 73562, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '235|264|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 4630, 894142, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 98850, 10000, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(16, 'Tony_Prins', '5e6ba9c3d58f62a48aafbccc0d121c01', '178.91.15.202', '2.132.84.4', '2023-01-31', '2023-02-04', 0, 'n', 'alanzhakupov02@gmail.com', 50, 0, 21, 1, 0, 86, 0, 999999999, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '234|291|292|0|0', 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 832, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 99249, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(17, 'Maksim_Bodakin', 'c1ba3cc97dc28c41850802d19fdbe7ca', '85.115.248.31', '94.233.241.219', '2023-01-31', '2023-02-25', 0, 'n', '@maksdzanaev084071@gmail.com ', 3, 4, 23, 1, 0, 280, 118, 30149, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '2023-02-25', 0, 0, 0, 0, 3500, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|20|0|3|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 1033, 175, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', -1, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.1, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(18, 'Developer', 'af66e49fc6fc5ba169c4bc004b8b6a36', '178.120.20.218', '176.60.52.127', '2023-02-01', '2023-03-08', 0, 'n', 'ermalinski@xuy.com', 17171717, 48, 21, 1, 0, 68, 265, 479920111, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 4, 4, 13, '2023-03-04', 0, 0, 0, 0, 17255, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|4|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '264|0|0|0|291', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 563, 1156, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 1000000000, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.15, 0, '0|0|0', 0, 0, 0, 0, 1, 0, 2, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(19, 'Wiliam_Wilson', 'e10adc3949ba59abbe56e057f20f883e', '92.38.47.240', '92.38.47.240', '2023-02-03', '2023-02-03', 0, 'n', 'hshsbsb@gmail.com', 1, 0, 21, 1, 0, 52, 61, 49999950, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 8, 8, 12, '2023-02-03', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 86, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 954, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(20, 'Makaka_Ramirez', 'f2c0b0c3244c9ab6f16fa172b5be8c36', '2.79.188.59', '185.113.37.247', '2023-02-04', '2023-02-21', 0, 'n', 'akkbaur6773@gmail.com', 2, 4, 22, 1, 0, 96, 0, 399819450, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 25375, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '235|0|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 4225, 1959, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 530, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 1, 9, 4, 0, 1, 0, '0|0|0|0', '0|2|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(21, 'Badim_Pehkov', '5e5f0e47f3692effc326a3920f3a2890', '2.134.203.64', '2.134.203.64', '2023-02-04', '2023-02-04', 0, 'n', 'saduovernur93@gmail.com', 1, 0, 21, 1, 0, 234, 0, 200, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 68, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 2053, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(22, 'Ramirez', '061ee38379fa1c6e8dacca81949f7a4d', '176.210.84.140', '176.210.84.140', '2023-02-07', '2023-02-07', 0, 'n', 'monf@inbox.ru', 1, 0, 21, 1, 0, 234, 0, 250, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 96, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 320, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(23, 'Andrei_Logunov', '4297f44b13955235245b2497399d7a93', '195.149.196.211', '195.149.196.211', '2023-02-15', '2023-02-15', 0, 'n', 'vamaser4@gmail.com', 1, 0, 21, 1, 0, 234, 0, 250, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 97, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 169, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(24, 'Aladin_Zloy', 'e10adc3949ba59abbe56e057f20f883e', '95.158.254.192', '95.158.254.192', '2023-02-15', '2023-02-15', 0, 'n', 'djfeifehfehuh@gmail.com', 1, 0, 21, 1, 0, 86, 287, 1000100000, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 8, 8, 12, '2023-02-15', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|86|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 1501, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 19150, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 1, 0, 0),
(25, 'Test_Aladin', 'e10adc3949ba59abbe56e057f20f883e', '95.158.254.192', '95.158.254.192', '2023-02-15', '2023-02-18', 0, 'n', 'dfnndfnfn@gmail.com', 4, 0, 24, 1, 0, 276, 211, 705152504, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 7, 7, 12, '2023-02-16', 0, 0, 0, 0, 62633, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '100|100|100|100|100|100|100', 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 675, 3050, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 89084, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(26, 'Egor_Vinogradovi', '22af180c73172ecb17dcc2079060899e', '95.29.6.178', '95.29.6.178', '2023-02-19', '2023-02-19', 0, 'n', 'vin.egor2011@gmail.com', 50, 17, 21, 1, 0, 6, 265, 99999999, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '2023-02-19', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '100|0|0|0|0|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '234|293|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 593, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 2, 150, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|1|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(30, 'Hanty', 'd123b6ba95de11e7a92de7e938a2a4ac', '80.70.70.22', '80.70.70.22', '2023-02-19', '2023-02-26', 0, 'n', 'lolkekcheb08@gmail.com', 1, 0, 21, 1, 0, 183, 285, 123456789, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '235|0|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 2797, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 6800, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 1, 13, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(31, 'Ruslan_Bezobid', '5d5cf8e2f846f35a0990efc80a4dad5e', '84.54.78.30', '84.54.120.85', '2023-02-20', '2023-03-08', 0, 'n', 'ruslankim2525@gmail.com', 7, 24, 27, 1, 0, 29, 265, 99075000, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, 1, -1, 0, -1, -1, 4, 4, 13, '2023-02-25', 0, 0, 0, 0, 110000, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|1|0|0|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 2620, 20905, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 1, 400, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.3, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 1, 0, 0),
(32, 'Abduazim_Bezobid', '37b696c08439c317920e4644387c49f9', '213.230.74.8', '213.230.88.128', '2023-02-20', '2023-03-02', 0, 'n', 'abduazimxayrullaev@gmail.com', 7, 12, 27, 1, 0, 185, 265, 999574999, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, 2, -1, 0, -1, -1, 0, 0, 0, '2023-02-26', 0, 0, 0, 0, 28976, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|2|0', 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, '236|0|0|0|0', 100, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 587, 510380, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 1, 200, 0, 3, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(33, 'Alex_Buhonov', '3035b57ec4a2f34f3e1d69970b171a56', '188.162.177.139', '188.162.177.139', '2023-02-21', '2023-02-21', 0, 'n', 'auea1386@gmail.com', 1, 0, 21, 1, 0, 234, 0, 200, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 683, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(34, 'Zahar_Ermalinski', 'af66e49fc6fc5ba169c4bc004b8b6a36', '178.120.70.45', '178.120.70.45', '2023-02-28', '2023-02-28', 0, 'n', 'Ermalinskijzahar8@gmail.com ', 1, 0, 21, 1, 0, 234, 0, 200, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '234|0|0|0|0', 99, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 75, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(35, 'Artem_Ermalinski', 'f379eaf3c831b04de153469d1bec345e', '178.120.21.127', '178.120.21.127', '2023-03-02', '2023-03-02', 0, 'n', 'iend@gmail.com', 1, 0, 21, 1, 0, 236, 0, 800000000, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 0, 0, 0, '0000-00-00', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '0|0|0|0|3|0|0', 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, '236|0|0|0|0', 74, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 1702, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 5000, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0),
(36, 'Michel_Coodu', 'a7f88b7bd845a8525225fe28ca449bb0', '188.19.174.29', '188.19.174.29', '2023-03-08', '2023-03-08', 0, 'n', '@Sacha186az.09@gmail.com ', 1, 0, 21, 1, 0, 163, 265, 250, 100, '1|1|1|1', '0|0|0|0', 0, 0, 0, -1, -1, 0, -1, -1, 4, 4, 13, '2023-03-08', 0, 0, 0, 0, 0, 0, 0, '-|-|-|-|-|-|-|-|-|-', '0|0|0|0|0|0|0|0|0|0', 0, 0, '100|100|100|100|100|100|100', 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, '235|0|0|0|0', 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 4802, 0, 0, 0, 0, 0, '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', '-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,', 0, 0, 0, 2, 1, 0, '0|0|0|0|0|0|0|0|0|0', 0, 0.05, 0, '0|0|0', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '0|0|0|0', '0|0|0|0|0|0|0|0', '0|0|0|0|0|0|0|0', -1, 0, 0, '0000-00-00', -1, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users_admins`
--

CREATE TABLE `users_admins` (
  `u_a_id` int(3) NOT NULL,
  `u_a_name` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `u_a_level` int(6) NOT NULL,
  `u_a_password` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT 'n',
  `u_a_reports` int(9) NOT NULL DEFAULT 0,
  `u_a_date` datetime NOT NULL,
  `u_a_online` int(12) NOT NULL DEFAULT 0,
  `u_a_jails` int(6) NOT NULL DEFAULT 0,
  `u_a_warns` int(6) NOT NULL DEFAULT 0,
  `u_a_bans` int(6) NOT NULL DEFAULT 0,
  `u_a_kicks` int(6) NOT NULL DEFAULT 0,
  `u_a_mute` int(6) NOT NULL DEFAULT 0,
  `admin_played` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users_admins`
--

INSERT INTO `users_admins` (`u_a_id`, `u_a_name`, `u_a_level`, `u_a_password`, `u_a_reports`, `u_a_date`, `u_a_online`, `u_a_jails`, `u_a_warns`, `u_a_bans`, `u_a_kicks`, `u_a_mute`, `admin_played`) VALUES
(2, 'Thomas_Shelby', 8, '123321', 0, '2022-02-18 06:09:31', 47236, 15, 0, 0, 1, 0, 0),
(3, 'Arthur_Shelby', 8, '121212', 0, '2022-02-16 20:37:00', 25253, 0, 0, 0, 1, 0, 0),
(4, 'Lincoln_Muller', 8, '1111', 0, '2023-01-27 12:22:36', 15525, 0, 0, 0, 0, 0, 0),
(5, 'Lincoln_Mullerov', 8, '1111', 0, '2023-01-09 21:40:16', 1090, 0, 0, 0, 0, 0, 0),
(6, 'Lincoln_Mullers', 7, '111111', 0, '2023-01-23 13:03:45', 6422, 0, 0, 0, 0, 0, 0),
(12, 'Zahar_Ermalinski', 8, '1234', 1, '2023-01-31 18:44:27', 13142, 0, 0, 0, 0, 0, 0),
(14, 'Strong_Ramirez', 8, '121212', 3, '2023-02-28 13:22:20', 41674, 1, 0, 0, 1, 0, 0),
(16, 'Bauka_Croos', 7, '123456', 0, '2023-02-01 07:27:09', 1070, 0, 0, 0, 0, 0, 0),
(17, 'Tony_Prins', 7, '1012580', 0, '2023-01-31 18:54:44', 430, 0, 0, 0, 0, 0, 0),
(18, 'Developer', 8, 'zahar17', 0, '2023-03-08 16:53:45', 14449, 0, 0, 0, 0, 0, 0),
(19, 'Leonid_Petruhin', 8, '5555', 0, '2023-02-17 07:27:30', 5900, 0, 0, 0, 0, 0, 0),
(20, 'Wiliam_Wilson', 6, '123456', 0, '2023-02-03 12:13:42', 606, 0, 0, 0, 0, 0, 0),
(21, 'Makaka_Ramirez', 8, '123456', 0, '2023-02-21 22:42:34', 8413, 1, 0, 0, 0, 0, 0),
(22, 'Aladin_Zloy', 7, '1234567', 0, '2023-02-15 15:43:46', 1292, 0, 0, 0, 1, 0, 0),
(23, 'Test_Aladin', 7, '123456', 0, '2023-02-18 14:05:45', 9305, 1, 0, 0, 3, 0, 0),
(24, 'Yura_Bezobid', 7, 'paradises3698', 0, '2023-02-19 18:29:24', 886, 0, 0, 0, 0, 0, 0),
(25, 'Egor_Vinogradovi', 7, '123456', 0, '2023-02-19 21:01:48', 1116, 0, 0, 0, 0, 0, 0),
(26, 'Yura', 7, 'paradises', 0, '2023-02-19 23:08:25', 1116, 1, 0, 0, 0, 0, 0),
(27, 'Ruslan_Bezobid', 7, '3222245', 1, '2023-03-08 17:43:45', 28470, 1, 0, 1, 1, 0, 0),
(29, 'Hanty', 7, 'paradises', 0, '2023-02-26 16:41:09', 2426, 0, 0, 0, 0, 0, 0),
(30, 'Maksim_Bodakin', 7, '116321', 0, '2023-02-25 18:53:48', 6132, 2, 0, 0, 0, 0, 0),
(33, 'Abduazim_Bezobid', 5, '050608', 0, '2023-03-02 14:02:22', 13585, 0, 0, 0, 0, 0, 0),
(35, 'Sasha_Bezobid', 6, 'n', 0, '2023-02-26 16:46:23', 2411, 0, 0, 0, 0, 0, 0),
(36, 'Artem_Ermalinski', 6, '666666', 0, '2023-03-02 21:56:36', 1702, 0, 0, 0, 0, 0, 0),
(37, 'Michel_Coodu', 6, '19845Micheltop', 0, '2023-03-08 18:25:30', 4802, 1, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users_bans`
--

CREATE TABLE `users_bans` (
  `u_b_name` varchar(32) NOT NULL,
  `u_b_admin` varchar(32) NOT NULL,
  `u_b_date` datetime NOT NULL,
  `u_b_reason` varchar(64) NOT NULL,
  `u_b_ndate` datetime NOT NULL,
  `u_b_days` int(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `users_complaints`
--

CREATE TABLE `users_complaints` (
  `u_id` int(11) NOT NULL,
  `u_fromname` varchar(24) NOT NULL,
  `u_toname` varchar(24) NOT NULL,
  `u_reason` varchar(64) NOT NULL,
  `u_fraction` int(2) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `users_duels`
--

CREATE TABLE `users_duels` (
  `d_id` int(11) NOT NULL,
  `d_player` int(11) NOT NULL,
  `d_playername` varchar(32) NOT NULL,
  `d_money` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `users_history`
--

CREATE TABLE `users_history` (
  `uh_id` int(11) NOT NULL,
  `uh_user` int(11) NOT NULL,
  `uh_ip` varchar(16) CHARACTER SET utf8 NOT NULL,
  `uh_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `users_history`
--

INSERT INTO `users_history` (`uh_id`, `uh_user`, `uh_ip`, `uh_date`) VALUES
(2, 2, '5.29.164.67', '2021-12-01 16:28:14'),
(3, 2, '5.29.164.67', '2021-12-01 16:32:00'),
(4, 2, '5.29.164.67', '2021-12-01 16:43:13'),
(5, 4, '5.29.164.67', '2021-12-01 17:00:46'),
(6, 5, '2.57.97.6', '2021-12-01 17:13:26'),
(7, 5, '2.57.97.233', '2021-12-07 15:34:04'),
(8, 5, '2.57.97.233', '2021-12-07 15:42:31'),
(9, 5, '176.64.10.243', '2021-12-08 06:48:53'),
(10, 5, '2.57.97.134', '2021-12-08 11:54:08'),
(11, 5, '2.57.97.134', '2021-12-08 12:13:20'),
(12, 5, '2.57.97.134', '2021-12-08 12:17:30'),
(13, 5, '2.57.97.134', '2021-12-08 12:23:12'),
(14, 5, '2.57.97.134', '2021-12-08 12:29:19'),
(15, 2, '2.57.97.134', '2021-12-08 13:56:25'),
(16, 2, '2.57.97.134', '2021-12-08 14:03:58'),
(17, 1, '2.57.97.134', '2021-12-08 14:06:28'),
(18, 2, '2.57.97.134', '2021-12-08 14:11:12'),
(19, 2, '2.57.97.134', '2021-12-08 14:14:54'),
(20, 1, '2.57.97.134', '2021-12-08 14:16:05'),
(21, 2, '2.57.97.134', '2021-12-08 14:25:23'),
(22, 1, '2.57.97.134', '2021-12-08 14:28:27'),
(23, 2, '2.57.97.134', '2021-12-08 14:54:28'),
(24, 1, '2.57.97.134', '2021-12-08 14:58:18'),
(25, 1, '2.57.97.134', '2021-12-08 14:58:43'),
(26, 2, '2.57.97.134', '2021-12-08 15:08:58'),
(27, 1, '2.57.97.134', '2021-12-08 15:10:57'),
(28, 2, '2.57.97.134', '2021-12-08 15:19:02'),
(29, 1, '2.57.97.134', '2021-12-08 15:19:32'),
(30, 2, '2.57.97.134', '2021-12-08 15:24:55'),
(31, 1, '176.98.225.155', '2021-12-08 18:14:18'),
(32, 2, '176.98.225.155', '2021-12-08 18:17:03'),
(33, 2, '2.57.97.134', '2021-12-08 18:42:13'),
(34, 1, '2.57.97.134', '2021-12-08 18:59:52'),
(35, 2, '2.57.97.134', '2021-12-08 19:11:31'),
(36, 2, '2.57.97.134', '2021-12-08 19:18:17'),
(37, 2, '2.57.97.134', '2021-12-08 19:30:51'),
(38, 1, '2.57.97.134', '2021-12-08 19:33:41'),
(39, 2, '2.57.97.134', '2021-12-08 19:45:06'),
(40, 2, '2.57.97.134', '2021-12-08 19:48:37'),
(41, 2, '2.57.97.134', '2021-12-08 19:52:24'),
(42, 1, '2.57.97.134', '2021-12-08 19:59:22'),
(43, 2, '2.57.97.134', '2021-12-08 20:01:43'),
(44, 2, '2.57.97.134', '2021-12-08 20:08:44'),
(45, 2, '2.57.97.134', '2021-12-08 20:15:04'),
(46, 2, '2.57.97.134', '2021-12-08 20:33:05'),
(47, 2, '2.57.97.134', '2021-12-08 20:41:36'),
(48, 2, '2.57.97.134', '2021-12-08 20:49:35'),
(49, 2, '176.98.225.52', '2021-12-09 12:29:41'),
(50, 1, '176.98.225.52', '2021-12-09 12:35:32'),
(51, 2, '176.98.225.52', '2021-12-09 12:52:29'),
(52, 1, '176.98.225.52', '2021-12-09 12:58:52'),
(53, 1, '176.98.225.52', '2021-12-09 13:03:18'),
(54, 1, '176.98.225.52', '2021-12-09 13:04:54'),
(55, 2, '176.98.225.52', '2021-12-09 13:05:15'),
(56, 2, '176.98.225.52', '2021-12-09 13:29:32'),
(57, 1, '176.98.225.52', '2021-12-09 13:30:05'),
(58, 2, '176.98.225.52', '2021-12-09 13:39:28'),
(59, 2, '176.98.225.52', '2021-12-09 13:40:49'),
(60, 1, '176.98.225.52', '2021-12-09 13:50:34'),
(61, 1, '176.98.225.52', '2021-12-09 14:15:16'),
(62, 1, '176.98.225.52', '2021-12-09 14:19:14'),
(63, 1, '176.98.225.52', '2021-12-09 14:21:23'),
(64, 2, '176.98.225.52', '2021-12-09 14:26:04'),
(65, 2, '176.98.225.52', '2021-12-09 14:27:28'),
(66, 1, '176.98.225.52', '2021-12-09 14:30:07'),
(67, 2, '176.98.225.52', '2021-12-09 14:39:47'),
(68, 2, '176.98.225.52', '2021-12-09 14:42:09'),
(69, 2, '176.98.225.52', '2021-12-09 20:42:54'),
(70, 2, '176.98.225.34', '2021-12-10 11:35:05'),
(71, 1, '176.98.225.34', '2021-12-10 11:37:28'),
(72, 2, '176.98.225.34', '2021-12-10 11:42:41'),
(73, 2, '176.98.225.34', '2021-12-10 11:47:35'),
(74, 2, '176.98.225.34', '2021-12-10 11:48:29'),
(75, 2, '176.98.225.34', '2021-12-10 12:10:17'),
(76, 2, '176.98.225.34', '2021-12-10 12:50:57'),
(77, 2, '176.98.225.34', '2021-12-10 15:49:07'),
(78, 1, '176.98.225.34', '2021-12-10 16:17:05'),
(79, 2, '176.98.225.34', '2021-12-10 16:18:45'),
(80, 2, '176.98.225.34', '2021-12-10 16:22:20'),
(81, 2, '176.98.225.34', '2021-12-10 16:33:01'),
(82, 1, '176.98.225.34', '2021-12-10 16:46:07'),
(83, 2, '176.98.225.34', '2021-12-10 17:51:11'),
(84, 2, '176.98.225.34', '2021-12-10 17:57:55'),
(85, 2, '176.98.225.34', '2021-12-10 18:07:09'),
(86, 2, '176.98.225.34', '2021-12-10 18:34:44'),
(87, 2, '176.98.225.34', '2021-12-10 18:36:51'),
(88, 1, '176.98.225.34', '2021-12-10 18:39:49'),
(89, 2, '176.98.225.34', '2021-12-10 18:43:35'),
(90, 2, '176.98.225.34', '2021-12-10 18:50:14'),
(91, 2, '176.98.225.34', '2021-12-10 19:08:01'),
(92, 2, '176.98.225.34', '2021-12-10 19:23:12'),
(93, 2, '176.98.225.34', '2021-12-10 19:29:54'),
(94, 2, '176.98.225.34', '2021-12-10 19:37:23'),
(95, 2, '176.98.225.34', '2021-12-10 19:40:39'),
(96, 1, '176.98.225.34', '2021-12-10 19:41:39'),
(97, 2, '176.98.225.34', '2021-12-10 19:49:31'),
(98, 1, '176.98.225.34', '2021-12-10 21:49:08'),
(99, 2, '176.98.225.34', '2021-12-10 21:51:00'),
(100, 1, '176.98.225.34', '2021-12-10 22:03:48'),
(101, 2, '176.98.225.34', '2021-12-10 22:09:27'),
(102, 1, '176.98.225.34', '2021-12-10 22:42:40'),
(103, 2, '176.98.225.34', '2021-12-10 23:04:29'),
(104, 2, '176.98.225.83', '2021-12-11 14:43:27'),
(105, 2, '176.98.225.83', '2021-12-11 14:51:37'),
(106, 1, '176.98.225.83', '2021-12-11 14:53:23'),
(107, 2, '176.98.225.83', '2021-12-11 14:57:55'),
(108, 1, '176.98.225.83', '2021-12-11 14:57:59'),
(109, 2, '176.98.225.83', '2021-12-11 15:03:52'),
(110, 1, '176.98.225.83', '2021-12-11 15:04:20'),
(111, 2, '176.98.225.83', '2021-12-11 15:14:12'),
(112, 1, '176.98.225.83', '2021-12-11 15:14:32'),
(113, 1, '176.98.225.83', '2021-12-11 15:23:41'),
(114, 2, '176.98.225.83', '2021-12-11 15:24:30'),
(115, 1, '176.98.225.83', '2021-12-11 15:26:12'),
(116, 2, '176.98.225.83', '2021-12-11 15:26:22'),
(117, 1, '176.98.225.83', '2021-12-11 15:27:52'),
(118, 2, '176.98.225.83', '2021-12-11 15:28:04'),
(119, 2, '176.98.225.83', '2021-12-11 15:33:00'),
(120, 1, '176.98.225.83', '2021-12-11 15:33:14'),
(121, 1, '176.98.225.83', '2021-12-11 15:35:13'),
(122, 2, '176.98.225.83', '2021-12-11 15:43:35'),
(123, 1, '176.98.225.83', '2021-12-11 15:43:48'),
(124, 1, '176.98.225.83', '2021-12-11 16:06:24'),
(125, 2, '176.98.225.83', '2021-12-11 16:24:47'),
(126, 2, '176.98.225.83', '2021-12-11 16:31:02'),
(127, 1, '176.98.225.83', '2021-12-11 16:32:03'),
(128, 2, '176.98.225.83', '2021-12-11 16:41:00'),
(129, 1, '176.98.225.83', '2021-12-11 16:43:02'),
(130, 2, '176.98.225.83', '2021-12-11 17:18:07'),
(131, 2, '176.98.225.83', '2021-12-11 17:22:51'),
(132, 2, '176.98.225.83', '2021-12-11 17:27:41'),
(133, 1, '176.98.225.83', '2021-12-11 17:30:38'),
(134, 2, '176.98.225.83', '2021-12-11 17:39:13'),
(135, 1, '176.98.225.83', '2021-12-11 17:47:21'),
(136, 1, '176.98.225.83', '2021-12-11 20:29:04'),
(137, 1, '176.98.225.83', '2021-12-11 20:36:53'),
(138, 1, '176.98.225.83', '2021-12-11 20:37:19'),
(139, 1, '176.98.225.83', '2021-12-11 21:08:15'),
(140, 1, '176.98.225.83', '2021-12-11 21:12:22'),
(141, 1, '176.98.225.83', '2021-12-11 21:21:25'),
(142, 2, '176.98.225.83', '2021-12-11 21:50:29'),
(143, 2, '176.98.225.83', '2021-12-11 22:37:01'),
(144, 1, '176.98.225.83', '2021-12-11 22:37:27'),
(145, 2, '176.98.225.83', '2021-12-11 22:46:07'),
(146, 1, '176.98.225.83', '2021-12-11 22:46:16'),
(147, 2, '176.98.225.83', '2021-12-11 23:05:10'),
(148, 2, '176.98.225.83', '2021-12-11 23:08:37'),
(149, 1, '176.98.225.83', '2021-12-11 23:14:08'),
(150, 2, '176.98.225.83', '2021-12-11 23:22:12'),
(151, 1, '176.98.225.83', '2021-12-11 23:23:45'),
(152, 2, '176.98.225.83', '2021-12-11 23:36:56'),
(153, 2, '176.98.225.83', '2021-12-11 23:40:43'),
(154, 2, '176.98.225.83', '2021-12-11 23:42:08'),
(155, 1, '176.98.225.83', '2021-12-11 23:43:13'),
(156, 2, '176.98.225.83', '2021-12-11 23:57:27'),
(157, 2, '176.98.225.83', '2021-12-12 00:06:52'),
(158, 2, '176.98.225.32', '2021-12-12 11:35:45'),
(159, 2, '176.98.225.32', '2021-12-12 15:07:31'),
(160, 1, '176.98.225.32', '2021-12-12 15:09:57'),
(161, 2, '176.98.225.32', '2021-12-12 15:26:14'),
(162, 1, '176.98.225.32', '2021-12-12 15:49:40'),
(163, 1, '176.98.225.32', '2021-12-12 15:50:59'),
(164, 1, '176.98.225.32', '2021-12-12 16:27:26'),
(165, 2, '176.98.225.32', '2021-12-12 16:44:10'),
(166, 2, '176.98.225.32', '2021-12-12 17:02:07'),
(167, 2, '176.98.225.32', '2021-12-12 17:22:03'),
(168, 2, '176.98.225.32', '2021-12-12 17:28:04'),
(169, 2, '176.98.225.32', '2021-12-12 17:54:02'),
(170, 1, '176.98.225.32', '2021-12-12 17:57:40'),
(171, 2, '176.98.225.32', '2021-12-12 18:00:54'),
(172, 1, '176.98.225.32', '2021-12-12 18:01:00'),
(173, 1, '2.57.97.65', '2021-12-14 16:13:14'),
(174, 1, '2.57.97.65', '2021-12-14 16:32:25'),
(175, 2, '2.57.97.65', '2021-12-14 16:34:30'),
(176, 1, '2.57.97.65', '2021-12-14 16:48:20'),
(177, 2, '2.57.97.65', '2021-12-14 16:48:47'),
(178, 1, '2.57.97.65', '2021-12-14 16:57:00'),
(179, 2, '2.57.97.65', '2021-12-14 16:57:05'),
(180, 1, '2.57.97.65', '2021-12-14 17:10:14'),
(181, 2, '2.57.97.65', '2021-12-14 17:10:18'),
(182, 1, '2.57.97.65', '2021-12-14 17:12:14'),
(183, 2, '2.57.97.65', '2021-12-14 17:42:38'),
(184, 2, '2.57.97.65', '2021-12-14 17:46:01'),
(185, 2, '2.57.97.108', '2021-12-16 17:28:19'),
(186, 1, '127.0.0.1', '2021-12-19 17:05:38'),
(187, 1, '127.0.0.1', '2021-12-19 17:07:47'),
(188, 2, '2.57.97.163', '2021-12-19 23:17:16'),
(189, 2, '176.98.225.184', '2021-12-20 17:07:37'),
(190, 2, '176.98.225.184', '2021-12-20 17:16:14'),
(191, 2, '176.98.225.184', '2021-12-20 17:33:13'),
(192, 2, '176.98.225.184', '2021-12-20 17:35:36'),
(193, 2, '176.98.225.184', '2021-12-20 17:49:25'),
(194, 2, '176.98.225.184', '2021-12-20 18:22:51'),
(195, 2, '176.98.225.184', '2021-12-20 18:27:17'),
(196, 2, '176.98.225.184', '2021-12-20 18:49:29'),
(197, 2, '176.98.225.184', '2021-12-20 18:56:40'),
(198, 2, '176.98.225.184', '2021-12-20 19:03:07'),
(199, 2, '176.98.225.184', '2021-12-20 19:04:18'),
(200, 1, '127.0.0.1', '2021-12-23 13:30:38'),
(201, 1, '127.0.0.1', '2021-12-23 13:35:54'),
(202, 1, '127.0.0.1', '2021-12-23 13:50:21'),
(203, 1, '127.0.0.1', '2021-12-23 13:54:34'),
(204, 1, '127.0.0.1', '2021-12-23 13:55:16'),
(205, 1, '127.0.0.1', '2021-12-23 14:35:18'),
(206, 1, '127.0.0.1', '2021-12-23 14:36:37'),
(207, 1, '127.0.0.1', '2021-12-23 14:37:25'),
(208, 1, '127.0.0.1', '2021-12-23 14:38:07'),
(209, 1, '127.0.0.1', '2021-12-23 15:28:09'),
(210, 1, '127.0.0.1', '2021-12-23 15:47:47'),
(211, 1, '127.0.0.1', '2021-12-23 15:49:06'),
(212, 1, '127.0.0.1', '2021-12-23 15:49:17'),
(213, 1, '127.0.0.1', '2021-12-23 15:49:28'),
(214, 2, '176.98.225.178', '2021-12-23 15:55:05'),
(215, 2, '176.98.225.178', '2021-12-23 16:06:51'),
(216, 1, '127.0.0.1', '2021-12-23 16:30:40'),
(217, 2, '176.98.225.178', '2021-12-23 16:34:25'),
(218, 2, '176.98.225.178', '2021-12-23 17:16:14'),
(219, 2, '176.98.225.178', '2021-12-23 17:22:01'),
(220, 2, '176.98.225.178', '2021-12-23 17:49:11'),
(221, 2, '176.98.225.178', '2021-12-23 17:52:34'),
(222, 2, '2.57.97.135', '2021-12-23 21:07:48'),
(223, 2, '2.57.97.135', '2021-12-23 21:16:27'),
(224, 1, '2.57.97.135', '2021-12-23 21:25:57'),
(225, 2, '2.57.97.135', '2021-12-23 21:28:02'),
(226, 1, '2.57.97.135', '2021-12-23 21:35:28'),
(227, 1, '2.57.97.135', '2021-12-23 21:41:23'),
(228, 1, '127.0.0.1', '2021-12-23 21:51:41'),
(229, 1, '127.0.0.1', '2021-12-23 21:52:55'),
(230, 2, '2.57.97.135', '2021-12-23 22:04:21'),
(231, 2, '2.57.97.135', '2021-12-23 22:07:07'),
(232, 1, '127.0.0.1', '2021-12-23 22:09:07'),
(233, 2, '2.57.97.135', '2021-12-23 22:10:13'),
(234, 2, '2.57.97.135', '2021-12-23 23:40:27'),
(235, 2, '2.57.97.135', '2021-12-23 23:48:15'),
(236, 2, '2.57.97.135', '2021-12-23 23:56:52'),
(237, 1, '127.0.0.1', '2021-12-24 10:21:44'),
(238, 1, '127.0.0.1', '2021-12-24 10:33:30'),
(239, 1, '127.0.0.1', '2021-12-24 10:34:30'),
(240, 1, '127.0.0.1', '2021-12-24 10:44:30'),
(241, 1, '127.0.0.1', '2021-12-24 10:51:35'),
(242, 1, '127.0.0.1', '2021-12-24 10:55:43'),
(243, 1, '127.0.0.1', '2021-12-24 11:10:12'),
(244, 1, '127.0.0.1', '2021-12-24 12:52:23'),
(245, 2, '2.57.97.135', '2021-12-24 12:57:13'),
(246, 2, '2.57.97.135', '2021-12-24 13:19:17'),
(247, 2, '2.57.97.135', '2021-12-24 13:32:57'),
(248, 2, '2.57.97.135', '2021-12-24 13:34:20'),
(249, 1, '2.57.97.135', '2021-12-24 13:43:45'),
(250, 2, '2.57.97.135', '2021-12-24 13:47:23'),
(251, 3, '176.98.225.97', '2021-12-29 23:03:00'),
(252, 2, '176.98.225.97', '2021-12-29 23:05:56'),
(253, 2, '176.98.225.21', '2021-12-30 21:21:52'),
(254, 2, '176.98.225.21', '2021-12-30 21:28:27'),
(255, 2, '176.98.225.51', '2021-12-31 10:23:49'),
(256, 2, '176.98.225.51', '2021-12-31 10:25:57'),
(257, 2, '176.98.225.51', '2021-12-31 12:24:08'),
(258, 1, '176.98.225.51', '2021-12-31 16:36:42'),
(259, 1, '176.98.225.133', '2022-01-01 22:09:07'),
(260, 1, '176.98.225.79', '2022-01-02 12:06:56'),
(261, 2, '176.98.225.117', '2022-01-13 18:19:56'),
(262, 2, '2.57.97.147', '2022-01-18 14:34:29'),
(263, 2, '2.57.97.147', '2022-01-18 14:38:25'),
(264, 2, '2.57.97.147', '2022-01-18 14:47:45'),
(265, 2, '2.57.97.147', '2022-01-18 15:02:24'),
(266, 2, '2.57.97.147', '2022-01-18 15:26:15'),
(267, 2, '2.57.97.147', '2022-01-18 15:31:44'),
(268, 2, '2.57.97.38', '2022-01-20 23:03:08'),
(269, 2, '2.57.97.38', '2022-01-21 09:22:44'),
(270, 2, '2.57.97.36', '2022-01-21 10:53:53'),
(271, 2, '176.98.225.38', '2022-01-24 06:41:02'),
(272, 1, '127.0.0.1', '2022-01-24 11:55:55'),
(273, 1, '127.0.0.1', '2022-01-24 11:58:38'),
(274, 1, '127.0.0.1', '2022-01-24 12:22:48'),
(275, 2, '176.98.225.104', '2022-01-24 13:06:38'),
(276, 2, '176.98.225.104', '2022-01-24 13:13:29'),
(277, 1, '176.98.225.104', '2022-01-24 14:49:46'),
(278, 1, '176.98.225.104', '2022-01-24 15:01:44'),
(279, 1, '176.98.225.104', '2022-01-24 15:02:04'),
(280, 1, '176.98.225.104', '2022-01-24 15:13:54'),
(281, 1, '176.98.225.104', '2022-01-24 15:19:10'),
(282, 1, '127.0.0.1', '2022-01-24 17:30:15'),
(283, 1, '127.0.0.1', '2022-01-24 17:31:34'),
(284, 2, '176.98.225.104', '2022-01-24 23:13:43'),
(285, 2, '176.98.225.104', '2022-01-25 07:53:54'),
(286, 2, '176.98.225.104', '2022-01-25 08:03:31'),
(287, 2, '176.98.225.0', '2022-01-25 14:57:51'),
(288, 2, '176.98.225.0', '2022-01-25 16:04:16'),
(289, 1, '127.0.0.1', '2022-01-26 20:31:34'),
(290, 2, '2.57.97.235', '2022-01-26 20:37:51'),
(291, 2, '2.57.97.235', '2022-01-26 20:41:21'),
(292, 2, '2.57.97.235', '2022-01-26 20:43:20'),
(293, 2, '2.57.97.235', '2022-01-26 20:47:45'),
(294, 2, '2.57.97.235', '2022-01-26 20:51:56'),
(295, 2, '2.57.97.235', '2022-01-26 20:59:37'),
(296, 1, '2.57.97.235', '2022-01-27 09:27:07'),
(297, 3, '2.57.97.187', '2022-01-29 16:52:22'),
(298, 2, '2.57.97.187', '2022-01-29 17:31:53'),
(299, 2, '2.57.97.187', '2022-01-29 19:13:19'),
(300, 2, '2.57.97.187', '2022-01-29 20:57:39'),
(301, 2, '2.57.97.187', '2022-01-29 21:35:20'),
(302, 2, '2.57.97.187', '2022-01-29 21:44:28'),
(303, 2, '2.57.97.135', '2022-01-30 08:40:07'),
(304, 2, '2.57.97.135', '2022-01-30 09:32:28'),
(305, 2, '2.57.97.135', '2022-01-30 22:45:36'),
(306, 2, '2.57.97.135', '2022-01-30 22:54:17'),
(307, 1, '2.57.97.237', '2022-01-31 10:04:26'),
(308, 1, '2.57.97.237', '2022-01-31 10:07:32'),
(309, 1, '2.57.97.237', '2022-01-31 10:14:24'),
(310, 1, '2.57.97.237', '2022-01-31 10:56:41'),
(311, 1, '2.57.97.237', '2022-01-31 11:24:14'),
(312, 1, '2.57.97.237', '2022-01-31 11:32:16'),
(313, 1, '2.57.97.237', '2022-01-31 11:32:58'),
(314, 1, '2.57.97.237', '2022-01-31 12:12:47'),
(315, 1, '2.57.97.237', '2022-01-31 12:17:07'),
(316, 1, '2.57.97.237', '2022-01-31 13:30:02'),
(317, 1, '2.57.97.237', '2022-01-31 15:35:52'),
(318, 1, '2.57.97.237', '2022-01-31 15:54:19'),
(319, 1, '2.57.97.237', '2022-01-31 16:24:12'),
(320, 1, '2.57.97.237', '2022-01-31 16:27:35'),
(321, 2, '2.57.97.237', '2022-01-31 17:53:56'),
(322, 2, '2.57.97.237', '2022-01-31 18:53:26'),
(323, 2, '2.57.97.237', '2022-01-31 18:54:57'),
(324, 2, '2.57.97.237', '2022-01-31 19:20:18'),
(325, 1, '2.57.97.254', '2022-02-01 13:31:57'),
(326, 2, '2.57.97.113', '2022-02-02 10:22:48'),
(327, 1, '2.57.97.113', '2022-02-02 15:07:58'),
(328, 1, '2.57.97.113', '2022-02-02 15:08:28'),
(329, 1, '176.98.225.198', '2022-02-03 11:32:54'),
(330, 1, '176.98.225.158', '2022-02-08 10:53:13'),
(331, 1, '176.98.225.158', '2022-02-08 12:57:50'),
(332, 1, '176.98.225.158', '2022-02-08 14:04:26'),
(333, 1, '176.98.225.158', '2022-02-08 19:02:58'),
(334, 1, '176.98.225.158', '2022-02-08 20:01:04'),
(335, 2, '2.57.97.156', '2022-02-09 13:45:21'),
(336, 1, '2.57.97.156', '2022-02-09 13:52:59'),
(337, 2, '2.57.97.156', '2022-02-09 13:53:23'),
(338, 2, '2.57.97.156', '2022-02-09 13:55:17'),
(339, 2, '2.57.97.156', '2022-02-09 13:58:57'),
(340, 2, '2.57.97.156', '2022-02-09 14:01:33'),
(341, 2, '2.57.97.156', '2022-02-09 14:03:16'),
(342, 2, '2.57.97.156', '2022-02-09 14:04:34'),
(343, 2, '2.57.97.156', '2022-02-09 14:05:49'),
(344, 2, '2.57.97.156', '2022-02-09 14:07:03'),
(345, 2, '2.57.97.156', '2022-02-09 14:23:23'),
(346, 2, '2.57.97.156', '2022-02-09 15:21:34'),
(347, 2, '2.57.97.156', '2022-02-09 15:29:41'),
(348, 2, '2.57.97.156', '2022-02-09 15:30:41'),
(349, 2, '2.57.97.156', '2022-02-09 15:32:29'),
(350, 2, '176.98.225.167', '2022-02-10 09:18:50'),
(351, 2, '176.98.225.167', '2022-02-10 09:19:17'),
(352, 2, '176.98.225.167', '2022-02-10 11:28:58'),
(353, 2, '176.98.225.167', '2022-02-10 18:56:53'),
(354, 2, '176.98.225.167', '2022-02-10 18:58:08'),
(355, 2, '176.98.225.167', '2022-02-10 19:09:53'),
(356, 2, '176.98.225.167', '2022-02-10 19:11:00'),
(357, 2, '176.98.225.167', '2022-02-10 19:36:05'),
(358, 2, '176.98.225.167', '2022-02-10 19:49:30'),
(359, 2, '176.98.225.167', '2022-02-10 20:19:04'),
(360, 2, '176.98.225.167', '2022-02-10 20:21:59'),
(361, 2, '176.98.225.167', '2022-02-10 20:24:27'),
(362, 2, '176.98.225.167', '2022-02-10 20:39:30'),
(363, 2, '176.98.225.167', '2022-02-10 20:43:09'),
(364, 2, '176.98.225.167', '2022-02-10 20:52:18'),
(365, 2, '176.98.225.167', '2022-02-10 21:00:36'),
(366, 1, '176.98.225.88', '2022-02-11 06:49:33'),
(367, 2, '176.98.225.88', '2022-02-11 09:23:09'),
(368, 2, '176.98.225.88', '2022-02-11 09:26:44'),
(369, 2, '176.98.225.88', '2022-02-11 09:27:30'),
(370, 2, '176.98.225.88', '2022-02-11 09:38:59'),
(371, 2, '176.98.225.88', '2022-02-11 13:41:32'),
(372, 2, '176.98.225.88', '2022-02-11 16:19:24'),
(373, 2, '176.98.225.88', '2022-02-11 16:32:02'),
(374, 2, '176.98.225.88', '2022-02-11 16:39:44'),
(375, 2, '176.98.225.88', '2022-02-11 17:02:26'),
(376, 2, '176.98.225.88', '2022-02-11 17:03:03'),
(377, 2, '176.98.225.88', '2022-02-11 17:03:48'),
(378, 2, '176.98.225.88', '2022-02-11 17:20:34'),
(379, 2, '176.98.225.88', '2022-02-11 17:21:48'),
(380, 2, '176.98.225.88', '2022-02-11 18:11:30'),
(381, 2, '176.98.225.88', '2022-02-11 18:24:27'),
(382, 2, '176.98.225.88', '2022-02-11 18:29:28'),
(383, 2, '176.98.225.88', '2022-02-11 18:47:42'),
(384, 2, '176.98.225.88', '2022-02-11 18:48:55'),
(385, 2, '176.98.225.88', '2022-02-11 19:03:51'),
(386, 2, '176.98.225.88', '2022-02-11 19:18:37'),
(387, 2, '176.98.225.88', '2022-02-11 19:33:32'),
(388, 2, '176.98.225.88', '2022-02-11 22:38:26'),
(389, 2, '2.57.97.14', '2022-02-12 11:08:12'),
(390, 2, '2.57.97.14', '2022-02-12 12:51:09'),
(391, 2, '2.57.97.14', '2022-02-12 12:52:44'),
(392, 2, '2.57.97.14', '2022-02-12 12:53:08'),
(393, 2, '2.57.97.14', '2022-02-12 15:14:14'),
(394, 2, '2.57.97.14', '2022-02-12 15:14:46'),
(395, 2, '2.57.97.14', '2022-02-12 15:15:10'),
(396, 2, '2.57.97.14', '2022-02-12 18:43:58'),
(397, 2, '2.57.97.14', '2022-02-12 18:44:12'),
(398, 2, '2.57.97.14', '2022-02-12 18:45:31'),
(399, 2, '2.57.97.14', '2022-02-12 18:46:02'),
(400, 2, '2.57.97.14', '2022-02-12 18:46:35'),
(401, 2, '2.57.97.14', '2022-02-12 18:49:43'),
(402, 2, '2.57.97.14', '2022-02-12 18:50:08'),
(403, 2, '2.57.97.14', '2022-02-12 18:51:08'),
(404, 2, '2.57.97.14', '2022-02-12 18:58:15'),
(405, 2, '2.57.97.14', '2022-02-12 18:58:45'),
(406, 2, '2.57.97.14', '2022-02-12 21:20:00'),
(407, 2, '2.57.97.14', '2022-02-12 21:21:14'),
(408, 2, '2.57.97.14', '2022-02-12 21:22:44'),
(409, 2, '2.57.97.14', '2022-02-12 21:32:28'),
(410, 2, '2.57.97.14', '2022-02-12 21:49:08'),
(411, 2, '2.57.97.14', '2022-02-12 22:15:09'),
(412, 2, '2.57.97.14', '2022-02-12 22:15:33'),
(413, 2, '2.57.97.14', '2022-02-12 22:21:06'),
(414, 2, '2.57.97.14', '2022-02-12 22:26:13'),
(415, 2, '2.57.97.14', '2022-02-12 22:33:39'),
(416, 2, '2.57.97.14', '2022-02-12 22:44:06'),
(417, 2, '2.57.97.14', '2022-02-12 23:55:47'),
(418, 2, '176.98.225.143', '2022-02-13 13:25:52'),
(419, 2, '176.98.225.143', '2022-02-13 13:29:58'),
(420, 2, '176.98.225.143', '2022-02-13 13:42:05'),
(421, 2, '176.98.225.143', '2022-02-13 13:53:27'),
(422, 2, '176.98.225.143', '2022-02-13 15:33:30'),
(423, 2, '176.98.225.143', '2022-02-13 17:41:39'),
(424, 2, '176.98.225.143', '2022-02-13 17:49:32'),
(425, 2, '176.98.225.143', '2022-02-13 17:58:50'),
(426, 2, '176.98.225.143', '2022-02-13 18:14:34'),
(427, 2, '176.98.225.143', '2022-02-13 18:50:02'),
(428, 2, '176.98.225.143', '2022-02-13 18:57:13'),
(429, 2, '176.98.225.143', '2022-02-13 19:12:48'),
(430, 2, '176.98.225.241', '2022-02-14 13:24:58'),
(431, 2, '176.98.225.241', '2022-02-14 14:24:43'),
(432, 1, '127.0.0.1', '2022-02-14 18:23:58'),
(433, 1, '127.0.0.1', '2022-02-14 18:26:37'),
(434, 1, '127.0.0.1', '2022-02-14 18:31:27'),
(435, 1, '127.0.0.1', '2022-02-14 18:49:30'),
(436, 1, '127.0.0.1', '2022-02-14 18:52:11'),
(437, 1, '127.0.0.1', '2022-02-14 19:27:43'),
(438, 1, '127.0.0.1', '2022-02-14 19:39:58'),
(439, 1, '127.0.0.1', '2022-02-15 14:53:17'),
(440, 1, '127.0.0.1', '2022-02-15 15:11:48'),
(441, 1, '127.0.0.1', '2022-02-15 15:15:11'),
(442, 1, '127.0.0.1', '2022-02-15 15:37:53'),
(443, 1, '127.0.0.1', '2022-02-15 15:39:02'),
(444, 1, '127.0.0.1', '2022-02-15 15:41:59'),
(445, 1, '127.0.0.1', '2022-02-15 15:43:46'),
(446, 1, '127.0.0.1', '2022-02-15 15:44:55'),
(447, 1, '127.0.0.1', '2022-02-15 15:45:59'),
(448, 2, '176.98.225.178', '2022-02-15 15:55:02'),
(449, 2, '176.98.225.178', '2022-02-15 15:58:08'),
(450, 2, '176.98.225.178', '2022-02-15 16:00:19'),
(451, 2, '176.98.225.178', '2022-02-15 16:02:27'),
(452, 2, '176.98.225.178', '2022-02-15 16:08:38'),
(453, 2, '176.98.225.178', '2022-02-15 16:09:49'),
(454, 2, '176.98.225.178', '2022-02-15 16:11:01'),
(455, 2, '176.98.225.178', '2022-02-15 16:17:52'),
(456, 2, '176.98.225.178', '2022-02-15 16:20:48'),
(457, 2, '176.98.225.178', '2022-02-15 16:22:09'),
(458, 2, '176.98.225.178', '2022-02-15 16:59:48'),
(459, 1, '176.98.225.178', '2022-02-15 17:01:34'),
(460, 2, '176.98.225.178', '2022-02-15 17:02:53'),
(461, 2, '176.98.225.178', '2022-02-15 17:13:36'),
(462, 2, '176.98.225.178', '2022-02-15 17:20:15'),
(463, 2, '176.98.225.178', '2022-02-15 17:53:31'),
(464, 1, '127.0.0.1', '2022-02-15 20:10:18'),
(465, 2, '176.98.225.178', '2022-02-15 20:15:55'),
(466, 1, '127.0.0.1', '2022-02-16 11:55:36'),
(467, 1, '127.0.0.1', '2022-02-16 12:07:02'),
(468, 1, '127.0.0.1', '2022-02-16 12:09:22'),
(469, 1, '127.0.0.1', '2022-02-16 12:26:11'),
(470, 1, '127.0.0.1', '2022-02-16 12:26:41'),
(471, 1, '127.0.0.1', '2022-02-16 12:30:51'),
(472, 2, '2.57.97.50', '2022-02-16 12:41:23'),
(473, 2, '2.57.97.50', '2022-02-16 12:43:40'),
(474, 2, '2.57.97.50', '2022-02-16 12:44:34'),
(475, 2, '2.57.97.50', '2022-02-16 12:47:54'),
(476, 2, '2.57.97.50', '2022-02-16 12:52:38'),
(477, 2, '2.57.97.50', '2022-02-16 18:24:23'),
(478, 2, '2.57.97.50', '2022-02-16 19:45:55'),
(479, 2, '2.57.97.50', '2022-02-16 19:56:10'),
(480, 2, '2.57.97.50', '2022-02-16 19:57:27'),
(481, 2, '2.57.97.50', '2022-02-16 20:09:01'),
(482, 2, '2.57.97.50', '2022-02-16 20:10:30'),
(483, 2, '2.57.97.50', '2022-02-16 20:29:53'),
(484, 2, '2.57.97.50', '2022-02-16 20:33:30'),
(485, 1, '127.0.0.1', '2022-02-16 20:35:56'),
(486, 2, '2.57.97.50', '2022-02-16 20:38:06'),
(487, 2, '2.57.97.50', '2022-02-16 20:44:08'),
(488, 2, '2.57.97.50', '2022-02-16 20:45:03'),
(489, 2, '2.57.97.50', '2022-02-16 20:52:59'),
(490, 2, '2.57.97.50', '2022-02-16 20:57:21'),
(491, 2, '2.57.97.50', '2022-02-16 21:07:33'),
(492, 2, '2.57.97.50', '2022-02-16 21:09:06'),
(493, 2, '2.57.97.50', '2022-02-16 21:10:53'),
(494, 2, '2.57.97.50', '2022-02-16 21:15:29'),
(495, 2, '2.57.97.50', '2022-02-16 21:22:22'),
(496, 2, '2.57.97.50', '2022-02-16 21:26:04'),
(497, 2, '2.57.97.50', '2022-02-16 21:27:37'),
(498, 2, '2.57.97.50', '2022-02-16 21:32:27'),
(499, 2, '2.57.97.50', '2022-02-16 21:37:04'),
(500, 2, '2.57.97.50', '2022-02-16 21:44:21'),
(501, 2, '2.57.97.50', '2022-02-16 21:49:10'),
(502, 2, '2.57.97.50', '2022-02-16 21:50:00'),
(503, 2, '2.57.97.50', '2022-02-16 21:52:03'),
(504, 2, '2.57.97.50', '2022-02-16 21:55:09'),
(505, 2, '2.57.97.50', '2022-02-16 22:00:14'),
(506, 2, '2.57.97.50', '2022-02-16 22:04:04'),
(507, 2, '2.57.97.50', '2022-02-16 22:19:51'),
(508, 2, '2.57.97.50', '2022-02-16 22:20:29'),
(509, 2, '2.57.97.50', '2022-02-16 22:22:50'),
(510, 2, '2.57.97.50', '2022-02-16 22:24:16'),
(511, 2, '2.57.97.50', '2022-02-16 22:24:54'),
(512, 2, '2.57.97.50', '2022-02-16 22:26:30'),
(513, 2, '2.57.97.50', '2022-02-16 22:27:48'),
(514, 2, '2.57.97.50', '2022-02-16 22:30:32'),
(515, 2, '2.57.97.50', '2022-02-16 22:32:33'),
(516, 2, '2.57.97.50', '2022-02-16 22:34:51'),
(517, 2, '2.57.97.50', '2022-02-16 22:39:30'),
(518, 2, '176.64.34.81', '2022-02-17 08:03:26'),
(519, 2, '176.98.225.32', '2022-02-17 13:49:17'),
(520, 2, '176.98.225.32', '2022-02-17 13:52:01'),
(521, 2, '176.98.225.32', '2022-02-17 13:58:33'),
(522, 2, '176.98.225.32', '2022-02-17 14:01:44'),
(523, 2, '176.98.225.32', '2022-02-17 14:02:10'),
(524, 2, '176.98.225.32', '2022-02-17 14:02:27'),
(525, 2, '176.98.225.32', '2022-02-17 14:03:21'),
(526, 2, '176.98.225.32', '2022-02-17 14:23:51'),
(527, 2, '176.98.225.32', '2022-02-17 14:29:06'),
(528, 2, '176.98.225.32', '2022-02-17 14:31:04'),
(529, 2, '176.98.225.32', '2022-02-17 14:32:57'),
(530, 2, '176.98.225.32', '2022-02-17 14:39:56'),
(531, 2, '176.98.225.32', '2022-02-17 14:41:26'),
(532, 2, '176.98.225.32', '2022-02-17 14:44:08'),
(533, 2, '176.98.225.32', '2022-02-17 14:50:50'),
(534, 2, '176.98.225.32', '2022-02-17 14:54:03'),
(535, 2, '176.98.225.32', '2022-02-17 14:54:38'),
(536, 2, '176.98.225.32', '2022-02-17 15:13:30'),
(537, 2, '176.98.225.32', '2022-02-17 15:18:45'),
(538, 2, '176.98.225.32', '2022-02-17 15:26:05'),
(539, 2, '176.98.225.32', '2022-02-17 15:27:50'),
(540, 2, '176.98.225.32', '2022-02-17 15:28:28'),
(541, 2, '176.98.225.32', '2022-02-17 15:30:08'),
(542, 2, '176.64.34.81', '2022-02-18 06:05:36'),
(543, 2, '2.57.97.206', '2022-02-18 14:29:24'),
(544, 10, '146.59.45.82', '2023-01-09 19:12:59'),
(545, 10, '146.59.45.82', '2023-01-09 19:15:27'),
(546, 10, '146.59.45.82', '2023-01-09 19:17:06'),
(547, 10, '91.242.196.62', '2023-01-09 21:01:01'),
(548, 9, '2.57.97.9', '2023-01-09 21:06:39'),
(549, 9, '2.57.97.9', '2023-01-09 21:11:56'),
(550, 9, '2.57.97.9', '2023-01-09 21:14:40'),
(551, 10, '91.242.196.62', '2023-01-09 21:16:59'),
(552, 9, '2.57.97.9', '2023-01-09 21:17:03'),
(553, 10, '91.242.196.62', '2023-01-09 21:17:55'),
(554, 9, '2.57.97.9', '2023-01-09 21:18:35'),
(555, 10, '91.242.196.62', '2023-01-09 21:21:43'),
(556, 9, '2.57.97.9', '2023-01-09 21:21:46'),
(557, 9, '2.57.97.9', '2023-01-09 21:22:06'),
(558, 10, '91.242.196.62', '2023-01-09 21:22:20'),
(559, 9, '2.57.97.9', '2023-01-09 21:34:39'),
(560, 10, '91.242.196.62', '2023-01-09 21:47:16'),
(561, 10, '91.242.196.62', '2023-01-09 21:48:15'),
(562, 10, '91.242.196.62', '2023-01-09 21:55:39'),
(563, 10, '91.242.196.62', '2023-01-09 22:14:24'),
(564, 10, '91.242.196.62', '2023-01-09 22:32:36'),
(565, 10, '37.52.12.182', '2023-01-10 16:28:36'),
(566, 10, '37.52.12.182', '2023-01-10 16:31:03'),
(567, 10, '91.242.194.62', '2023-01-13 19:50:59'),
(568, 10, '91.242.194.62', '2023-01-13 19:52:09'),
(569, 10, '91.242.194.62', '2023-01-13 19:59:13'),
(570, 10, '91.242.194.62', '2023-01-13 20:14:52'),
(571, 10, '91.242.194.62', '2023-01-13 20:21:13'),
(572, 10, '91.242.194.62', '2023-01-13 20:36:31'),
(573, 10, '91.242.194.62', '2023-01-13 21:05:15'),
(574, 10, '91.242.194.62', '2023-01-13 21:06:22'),
(575, 10, '91.242.194.62', '2023-01-13 21:09:40'),
(576, 10, '91.242.194.62', '2023-01-13 21:11:31'),
(577, 10, '91.242.194.62', '2023-01-13 21:30:39'),
(578, 10, '91.242.194.62', '2023-01-13 21:40:54'),
(579, 10, '91.242.194.62', '2023-01-13 21:51:05'),
(580, 10, '91.242.194.62', '2023-01-13 22:07:12'),
(581, 10, '91.242.194.62', '2023-01-13 22:43:54'),
(582, 10, '91.242.194.62', '2023-01-13 22:49:53'),
(583, 10, '91.242.194.62', '2023-01-13 22:57:37'),
(584, 10, '91.242.194.62', '2023-01-13 23:14:40'),
(585, 10, '91.242.194.62', '2023-01-13 23:37:15'),
(586, 11, '51.15.127.160', '2023-01-14 12:00:15'),
(587, 10, '91.242.194.62', '2023-01-14 14:16:52'),
(588, 11, '91.242.194.62', '2023-01-14 14:27:20'),
(589, 10, '91.242.194.62', '2023-01-14 14:43:01'),
(590, 10, '91.242.194.62', '2023-01-14 15:10:11'),
(591, 10, '91.242.194.62', '2023-01-14 15:42:30'),
(592, 11, '91.242.194.62', '2023-01-14 15:50:42'),
(593, 10, '91.242.194.62', '2023-01-14 15:51:20'),
(594, 10, '91.242.194.62', '2023-01-14 22:24:31'),
(595, 10, '91.242.194.62', '2023-01-14 22:32:55'),
(596, 10, '91.242.194.62', '2023-01-14 23:13:16'),
(597, 10, '91.242.194.62', '2023-01-14 23:15:59'),
(598, 10, '91.242.194.62', '2023-01-14 23:17:07'),
(599, 11, '91.242.194.62', '2023-01-14 23:17:14'),
(600, 11, '91.242.194.62', '2023-01-14 23:24:56'),
(601, 11, '91.242.194.62', '2023-01-14 23:31:26'),
(602, 10, '91.242.194.62', '2023-01-14 23:53:15'),
(603, 11, '51.38.130.102', '2023-01-16 19:29:50'),
(604, 11, '51.38.130.102', '2023-01-16 19:57:01'),
(605, 11, '51.38.130.102', '2023-01-16 20:03:03'),
(606, 11, '91.242.194.62', '2023-01-16 22:23:05'),
(607, 11, '146.59.45.82', '2023-01-17 00:43:13'),
(608, 11, '91.242.194.62', '2023-01-18 16:50:29'),
(609, 11, '91.242.194.62', '2023-01-18 23:36:43'),
(610, 11, '91.242.194.62', '2023-01-19 00:09:39'),
(611, 11, '91.242.194.62', '2023-01-19 00:16:18'),
(612, 11, '91.242.194.62', '2023-01-19 00:18:30'),
(613, 11, '91.242.194.62', '2023-01-19 17:30:03'),
(614, 11, '91.242.194.62', '2023-01-19 17:32:31'),
(615, 11, '91.242.194.62', '2023-01-19 17:56:12'),
(616, 11, '91.242.194.62', '2023-01-19 18:19:14'),
(617, 11, '91.242.194.62', '2023-01-19 18:23:27'),
(618, 11, '91.242.194.62', '2023-01-19 18:33:13'),
(619, 11, '91.242.194.62', '2023-01-19 18:39:30'),
(620, 11, '91.242.194.62', '2023-01-19 23:26:08'),
(621, 11, '91.242.194.62', '2023-01-19 23:52:36'),
(622, 11, '91.242.194.62', '2023-01-20 16:16:09'),
(623, 11, '91.242.194.62', '2023-01-20 16:17:47'),
(624, 11, '91.242.194.62', '2023-01-20 16:45:33'),
(625, 11, '91.242.194.62', '2023-01-20 21:21:30'),
(626, 11, '91.242.194.62', '2023-01-21 18:23:12'),
(627, 11, '91.242.194.62', '2023-01-23 12:58:39'),
(628, 11, '91.242.194.62', '2023-01-23 13:02:24'),
(629, 10, '91.242.194.62', '2023-01-23 19:36:30'),
(630, 10, '91.242.196.62', '2023-01-25 16:00:38'),
(631, 10, '91.242.196.62', '2023-01-25 16:56:56'),
(632, 10, '91.242.196.62', '2023-01-27 12:21:26'),
(633, 10, '91.226.254.126', '2023-01-27 22:48:57'),
(634, 14, '2.60.63.234', '2023-01-31 00:14:21'),
(635, 14, '2.60.63.234', '2023-01-31 00:39:14'),
(636, 14, '2.60.63.234', '2023-01-31 00:43:09'),
(637, 14, '2.60.63.234', '2023-01-31 00:59:59'),
(638, 14, '2.60.63.234', '2023-01-31 01:00:35'),
(639, 14, '2.60.63.234', '2023-01-31 01:05:23'),
(640, 14, '2.60.63.234', '2023-01-31 01:06:14'),
(641, 14, '2.60.63.234', '2023-01-31 01:07:46'),
(642, 14, '2.60.63.234', '2023-01-31 01:17:26'),
(643, 14, '2.60.63.234', '2023-01-31 01:19:14'),
(644, 14, '2.60.63.234', '2023-01-31 01:20:29'),
(645, 14, '2.60.63.234', '2023-01-31 01:27:36'),
(646, 13, '178.176.64.109', '2023-01-31 07:58:25'),
(647, 12, '176.60.5.97', '2023-01-31 10:25:26'),
(648, 12, '176.60.5.97', '2023-01-31 10:31:03'),
(649, 12, '176.60.5.97', '2023-01-31 10:32:39'),
(650, 12, '176.60.5.97', '2023-01-31 10:36:01'),
(651, 15, '185.113.37.247', '2023-01-31 10:41:15'),
(652, 12, '178.120.17.154', '2023-01-31 11:07:04'),
(653, 12, '178.120.17.154', '2023-01-31 11:11:13'),
(654, 12, '178.120.17.154', '2023-01-31 11:13:06'),
(655, 12, '178.120.17.154', '2023-01-31 11:15:09'),
(656, 12, '178.120.17.154', '2023-01-31 11:19:35'),
(657, 12, '178.120.17.154', '2023-01-31 11:20:37'),
(658, 12, '178.120.17.154', '2023-01-31 11:21:21'),
(659, 12, '178.120.17.154', '2023-01-31 11:26:26'),
(660, 12, '178.120.17.154', '2023-01-31 12:10:38'),
(661, 12, '178.120.17.154', '2023-01-31 12:13:56'),
(662, 15, '95.82.96.9', '2023-01-31 12:41:08'),
(663, 12, '178.120.17.154', '2023-01-31 12:43:43'),
(664, 12, '178.120.17.154', '2023-01-31 12:46:52'),
(665, 15, '95.82.96.9', '2023-01-31 12:47:37'),
(666, 14, '2.60.63.234', '2023-01-31 14:21:35'),
(667, 14, '2.60.63.234', '2023-01-31 14:31:34'),
(668, 14, '2.60.63.234', '2023-01-31 14:32:22'),
(669, 14, '2.60.63.234', '2023-01-31 14:56:38'),
(670, 16, '2.132.237.132', '2023-01-31 15:08:14'),
(671, 13, '178.176.64.109', '2023-01-31 17:15:31'),
(672, 13, '178.176.64.109', '2023-01-31 17:16:49'),
(673, 13, '178.176.64.109', '2023-01-31 17:21:45'),
(674, 12, '178.120.20.218', '2023-01-31 18:15:05'),
(675, 12, '178.120.20.218', '2023-01-31 18:17:35'),
(676, 16, '2.132.237.132', '2023-01-31 18:17:57'),
(677, 12, '178.120.20.218', '2023-01-31 18:22:28'),
(678, 12, '178.120.20.218', '2023-01-31 18:38:03'),
(679, 14, '2.60.63.234', '2023-01-31 18:41:49'),
(680, 14, '2.60.63.234', '2023-01-31 18:50:08'),
(681, 16, '2.132.237.132', '2023-01-31 18:51:56'),
(682, 16, '2.132.237.132', '2023-01-31 18:55:02'),
(683, 16, '2.132.237.132', '2023-01-31 18:55:43'),
(684, 16, '2.132.237.132', '2023-01-31 18:56:39'),
(685, 16, '2.132.237.132', '2023-01-31 18:57:11'),
(686, 16, '2.132.237.132', '2023-01-31 18:58:16'),
(687, 16, '2.132.237.132', '2023-01-31 18:58:53'),
(688, 16, '2.132.237.132', '2023-01-31 19:01:25'),
(689, 14, '2.60.63.234', '2023-01-31 19:30:21'),
(690, 14, '2.60.63.234', '2023-01-31 19:31:31'),
(691, 14, '2.60.63.234', '2023-01-31 19:36:49'),
(692, 12, '178.120.20.218', '2023-01-31 20:19:54'),
(693, 12, '178.120.20.218', '2023-01-31 20:20:24'),
(694, 12, '178.120.20.218', '2023-01-31 20:21:08'),
(695, 12, '178.120.20.218', '2023-01-31 20:25:26'),
(696, 14, '2.60.63.234', '2023-01-31 20:26:47'),
(697, 16, '2.132.237.132', '2023-01-31 20:34:26'),
(698, 12, '176.60.5.120', '2023-01-31 20:35:42'),
(699, 14, '2.60.63.234', '2023-01-31 20:35:52'),
(700, 12, '176.60.5.120', '2023-01-31 20:43:50'),
(701, 12, '176.60.5.120', '2023-01-31 20:49:12'),
(702, 12, '176.60.5.120', '2023-01-31 20:54:02'),
(703, 13, '178.176.64.109', '2023-01-31 20:57:02'),
(704, 13, '178.176.64.109', '2023-01-31 21:02:08'),
(705, 12, '176.60.5.120', '2023-01-31 21:04:31'),
(706, 12, '176.60.5.120', '2023-01-31 21:04:57'),
(707, 12, '176.60.5.120', '2023-01-31 21:22:50'),
(708, 12, '178.120.20.218', '2023-01-31 22:17:54'),
(709, 12, '178.120.20.218', '2023-01-31 23:00:42'),
(710, 16, '145.255.171.39', '2023-02-01 06:01:32'),
(711, 16, '145.255.171.39', '2023-02-01 07:13:36'),
(712, 15, '185.113.37.247', '2023-02-01 07:14:55'),
(713, 12, '178.120.20.218', '2023-02-01 10:02:44'),
(714, 12, '178.120.20.218', '2023-02-01 10:03:13'),
(715, 14, '2.60.63.234', '2023-02-01 10:10:54'),
(716, 14, '2.60.63.234', '2023-02-01 10:12:34'),
(717, 14, '2.60.63.234', '2023-02-01 10:14:30'),
(718, 14, '2.60.63.234', '2023-02-01 10:16:54'),
(719, 15, '185.113.37.247', '2023-02-01 10:17:28'),
(720, 16, '145.255.171.39', '2023-02-01 10:17:57'),
(721, 15, '185.113.37.247', '2023-02-01 10:18:37'),
(722, 15, '185.113.37.247', '2023-02-01 10:19:44'),
(723, 12, '178.120.20.218', '2023-02-01 10:23:54'),
(724, 12, '178.120.20.218', '2023-02-01 10:24:47'),
(725, 14, '2.60.63.234', '2023-02-01 10:30:28'),
(726, 14, '2.60.63.234', '2023-02-01 10:48:54'),
(727, 18, '178.120.20.218', '2023-02-01 10:52:24'),
(728, 18, '178.120.20.218', '2023-02-01 10:53:17'),
(729, 18, '178.120.20.218', '2023-02-01 10:56:05'),
(730, 18, '178.120.20.218', '2023-02-01 10:58:42'),
(731, 14, '2.60.63.234', '2023-02-01 11:13:02'),
(732, 18, '178.120.20.218', '2023-02-01 11:41:12'),
(733, 13, '178.176.67.148', '2023-02-01 12:02:00'),
(734, 18, '178.120.20.218', '2023-02-01 12:06:22'),
(735, 18, '178.120.20.218', '2023-02-01 12:07:54'),
(736, 13, '178.176.67.148', '2023-02-01 12:08:43'),
(737, 18, '178.120.20.218', '2023-02-01 12:43:08'),
(738, 13, '178.176.67.148', '2023-02-01 12:51:24'),
(739, 13, '178.176.67.148', '2023-02-01 12:56:07'),
(740, 13, '178.176.67.148', '2023-02-01 14:34:38'),
(741, 13, '178.176.67.148', '2023-02-01 15:43:22'),
(742, 13, '178.176.67.148', '2023-02-01 15:55:20'),
(743, 13, '178.176.67.148', '2023-02-01 15:58:10'),
(744, 13, '178.176.67.148', '2023-02-01 16:37:46'),
(745, 14, '2.60.63.234', '2023-02-01 16:39:15'),
(746, 13, '178.176.67.148', '2023-02-01 16:39:25'),
(747, 13, '178.176.67.148', '2023-02-01 16:45:08'),
(748, 13, '178.176.67.148', '2023-02-01 16:46:20'),
(749, 14, '2.60.63.234', '2023-02-01 16:48:09'),
(750, 13, '178.176.67.148', '2023-02-01 16:49:12'),
(751, 13, '178.176.67.148', '2023-02-01 16:50:13'),
(752, 14, '2.60.63.234', '2023-02-01 16:50:38'),
(753, 14, '2.60.63.234', '2023-02-01 16:51:46'),
(754, 16, '145.255.171.39', '2023-02-01 17:59:03'),
(755, 14, '2.60.63.234', '2023-02-01 18:34:28'),
(756, 13, '178.176.67.148', '2023-02-01 18:37:34'),
(757, 14, '2.60.63.234', '2023-02-01 18:40:14'),
(758, 14, '2.60.63.234', '2023-02-01 18:43:05'),
(759, 14, '2.60.63.234', '2023-02-01 18:44:26'),
(760, 14, '2.60.63.234', '2023-02-01 18:50:29'),
(761, 13, '178.176.67.148', '2023-02-01 18:52:09'),
(762, 14, '2.60.63.234', '2023-02-01 19:02:10'),
(763, 14, '2.60.63.234', '2023-02-01 19:04:44'),
(764, 14, '2.60.63.234', '2023-02-01 19:08:17'),
(765, 14, '2.60.63.234', '2023-02-01 19:41:54'),
(766, 18, '178.120.20.26', '2023-02-01 21:40:15'),
(767, 18, '178.120.20.26', '2023-02-01 21:41:33'),
(768, 18, '176.60.52.15', '2023-02-01 22:09:15'),
(769, 18, '178.120.20.26', '2023-02-01 22:53:36'),
(770, 13, '178.178.84.86', '2023-02-02 07:59:01'),
(771, 13, '178.178.84.86', '2023-02-02 08:07:53'),
(772, 13, '178.178.84.86', '2023-02-02 08:09:49'),
(773, 13, '178.178.84.86', '2023-02-02 08:50:54'),
(774, 13, '178.178.84.86', '2023-02-02 08:53:36'),
(775, 18, '178.120.20.26', '2023-02-02 11:19:21'),
(776, 18, '178.120.20.26', '2023-02-02 11:41:22'),
(777, 18, '178.120.20.26', '2023-02-02 11:44:01'),
(778, 18, '178.120.20.26', '2023-02-02 11:48:01'),
(779, 16, '2.132.236.79', '2023-02-02 17:12:54'),
(780, 14, '176.210.10.164', '2023-02-02 19:52:39'),
(781, 14, '176.210.10.164', '2023-02-02 19:54:48'),
(782, 14, '176.210.10.164', '2023-02-02 19:57:11'),
(783, 13, '80.80.195.23', '2023-02-02 21:39:45'),
(784, 13, '80.80.195.23', '2023-02-02 21:58:18'),
(785, 13, '80.80.195.23', '2023-02-02 22:28:01'),
(786, 13, '80.80.195.23', '2023-02-02 22:33:24'),
(787, 14, '176.210.10.164', '2023-02-03 08:57:23'),
(788, 18, '178.120.22.90', '2023-02-03 10:59:03'),
(789, 18, '178.120.22.90', '2023-02-03 11:01:00'),
(790, 18, '178.120.22.90', '2023-02-03 11:06:16'),
(791, 18, '178.120.22.90', '2023-02-03 11:59:40'),
(792, 18, '178.120.22.90', '2023-02-03 12:00:40'),
(793, 19, '92.38.47.240', '2023-02-03 12:00:54'),
(794, 19, '92.38.47.240', '2023-02-03 12:09:50'),
(795, 19, '92.38.47.240', '2023-02-03 12:33:16'),
(796, 15, '2.79.65.99', '2023-02-03 13:25:06'),
(797, 19, '92.38.47.240', '2023-02-03 13:35:39'),
(798, 18, '176.60.52.99', '2023-02-03 21:34:35'),
(799, 18, '178.120.20.90', '2023-02-03 21:38:37'),
(800, 15, '2.79.188.59', '2023-02-04 00:48:28'),
(801, 18, '176.60.46.100', '2023-02-04 09:34:27'),
(802, 20, '2.79.188.59', '2023-02-04 09:34:51'),
(803, 20, '2.79.188.59', '2023-02-04 10:30:09'),
(804, 18, '176.60.46.100', '2023-02-04 10:51:12'),
(805, 16, '2.132.84.4', '2023-02-04 11:34:57'),
(806, 21, '2.134.203.64', '2023-02-04 14:51:00'),
(807, 21, '2.134.203.64', '2023-02-04 15:36:23'),
(808, 21, '85.117.113.77', '2023-02-04 16:32:50'),
(809, 18, '178.120.20.90', '2023-02-04 16:50:51'),
(810, 18, '178.120.20.90', '2023-02-04 16:55:18'),
(811, 18, '178.120.20.90', '2023-02-04 17:07:21'),
(812, 21, '2.134.203.64', '2023-02-04 18:02:31'),
(813, 21, '2.134.203.64', '2023-02-04 20:22:05'),
(814, 13, '80.80.195.23', '2023-02-05 22:55:13'),
(815, 13, '80.80.195.23', '2023-02-05 22:56:55'),
(816, 13, '80.80.195.23', '2023-02-05 22:58:38'),
(817, 13, '80.80.195.23', '2023-02-05 23:02:06'),
(818, 14, '176.210.84.140', '2023-02-06 10:23:43'),
(819, 13, '83.149.45.24', '2023-02-06 20:04:47'),
(820, 13, '83.149.45.24', '2023-02-06 20:05:30'),
(821, 13, '83.149.45.24', '2023-02-06 20:12:11'),
(822, 18, '176.60.53.85', '2023-02-06 21:57:42'),
(823, 13, '83.149.46.14', '2023-02-06 22:52:31'),
(824, 13, '83.149.46.14', '2023-02-06 22:54:25'),
(825, 20, '2.79.149.186', '2023-02-07 04:11:33'),
(826, 13, '178.176.64.187', '2023-02-07 09:27:33'),
(827, 18, '176.60.5.158', '2023-02-07 09:28:42'),
(828, 18, '176.60.5.158', '2023-02-07 09:47:40'),
(829, 18, '176.60.5.158', '2023-02-07 09:49:31'),
(830, 14, '176.210.84.140', '2023-02-07 10:03:30'),
(831, 14, '176.210.84.140', '2023-02-07 10:07:27'),
(832, 18, '176.60.5.158', '2023-02-07 12:02:27'),
(833, 14, '176.210.84.140', '2023-02-08 16:05:31'),
(834, 14, '176.210.84.140', '2023-02-08 16:06:52'),
(835, 14, '176.210.84.140', '2023-02-08 16:08:12'),
(836, 14, '176.210.84.140', '2023-02-08 16:10:41'),
(837, 14, '176.210.84.140', '2023-02-08 16:12:37'),
(838, 13, '80.80.195.23', '2023-02-08 22:06:18'),
(839, 18, '178.120.57.169', '2023-02-08 22:36:50'),
(840, 13, '83.149.46.88', '2023-02-09 08:55:08'),
(841, 13, '83.149.46.88', '2023-02-09 08:59:02'),
(842, 13, '83.149.47.127', '2023-02-10 09:19:52'),
(843, 13, '83.149.47.127', '2023-02-10 10:12:46'),
(844, 14, '176.210.84.140', '2023-02-10 16:16:35'),
(845, 14, '176.210.84.140', '2023-02-10 16:20:51'),
(846, 14, '176.210.84.140', '2023-02-10 16:22:11'),
(847, 14, '176.210.84.140', '2023-02-10 16:29:32'),
(848, 14, '176.210.84.140', '2023-02-10 17:03:30'),
(849, 14, '176.210.84.140', '2023-02-10 17:04:16'),
(850, 14, '176.210.84.140', '2023-02-10 17:05:37'),
(851, 14, '176.210.84.140', '2023-02-10 17:06:15'),
(852, 14, '176.210.84.140', '2023-02-10 17:09:07'),
(853, 14, '176.210.84.140', '2023-02-10 17:09:43'),
(854, 14, '176.210.84.140', '2023-02-10 17:15:23'),
(855, 14, '176.210.84.140', '2023-02-10 19:41:11'),
(856, 18, '178.120.66.12', '2023-02-11 12:50:27'),
(857, 18, '178.120.66.12', '2023-02-11 12:54:05'),
(858, 18, '178.120.66.12', '2023-02-11 12:55:46'),
(859, 13, '80.80.195.23', '2023-02-12 20:02:38'),
(860, 13, '80.80.195.23', '2023-02-12 20:08:18'),
(861, 13, '83.149.45.27', '2023-02-13 08:05:05'),
(862, 13, '83.149.45.27', '2023-02-13 10:36:42'),
(863, 13, '178.176.65.160', '2023-02-13 16:24:29'),
(864, 13, '178.176.230.206', '2023-02-13 19:42:53'),
(865, 13, '178.176.230.206', '2023-02-13 20:04:52'),
(866, 13, '178.176.230.206', '2023-02-13 20:06:24'),
(867, 13, '178.176.230.206', '2023-02-13 20:12:53'),
(868, 13, '178.176.230.206', '2023-02-13 20:14:04'),
(869, 13, '178.176.230.206', '2023-02-13 20:53:19'),
(870, 13, '178.176.230.206', '2023-02-13 20:54:22'),
(871, 13, '178.176.230.206', '2023-02-13 20:56:29'),
(872, 18, '176.60.52.143', '2023-02-13 21:16:06'),
(873, 23, '195.149.196.211', '2023-02-15 13:27:03'),
(874, 14, '176.210.84.140', '2023-02-15 14:25:04'),
(875, 14, '176.210.84.140', '2023-02-15 15:29:15'),
(876, 14, '176.210.84.140', '2023-02-15 15:33:02'),
(877, 24, '95.158.254.192', '2023-02-15 15:50:26'),
(878, 14, '176.210.84.140', '2023-02-15 16:09:41'),
(879, 25, '95.158.254.192', '2023-02-15 16:32:33'),
(880, 25, '95.158.254.192', '2023-02-15 18:30:55'),
(881, 25, '95.158.254.192', '2023-02-15 18:47:06'),
(882, 14, '176.210.84.140', '2023-02-15 18:53:08'),
(883, 14, '176.210.84.140', '2023-02-15 19:04:42'),
(884, 14, '176.210.84.140', '2023-02-15 22:05:47'),
(885, 14, '176.210.84.140', '2023-02-15 22:11:49'),
(886, 14, '176.210.84.140', '2023-02-15 22:24:56'),
(887, 14, '176.210.84.140', '2023-02-15 22:46:17'),
(888, 14, '176.210.84.140', '2023-02-15 22:58:36'),
(889, 14, '176.210.84.140', '2023-02-15 22:59:50'),
(890, 18, '178.120.48.81', '2023-02-15 23:01:36'),
(891, 14, '176.210.84.140', '2023-02-16 11:17:56'),
(892, 25, '95.158.254.192', '2023-02-16 16:25:22'),
(893, 25, '95.158.254.192', '2023-02-16 19:49:34'),
(894, 14, '176.210.84.140', '2023-02-17 01:45:48'),
(895, 13, '178.178.87.1', '2023-02-17 07:23:32'),
(896, 13, '178.178.87.1', '2023-02-17 07:24:10'),
(897, 13, '178.178.87.1', '2023-02-17 07:24:57'),
(898, 13, '178.178.87.1', '2023-02-17 07:26:02'),
(899, 13, '178.178.87.1', '2023-02-17 07:28:03'),
(900, 25, '95.158.254.192', '2023-02-17 15:02:50'),
(901, 14, '90.188.151.144', '2023-02-17 15:50:47'),
(902, 14, '90.188.151.144', '2023-02-17 15:57:22'),
(903, 14, '90.188.151.144', '2023-02-18 10:36:19'),
(904, 14, '90.188.151.144', '2023-02-18 11:09:45'),
(905, 18, '176.60.52.178', '2023-02-18 12:45:21'),
(906, 25, '95.158.254.192', '2023-02-18 13:54:39'),
(907, 14, '90.188.151.144', '2023-02-18 21:50:25'),
(908, 20, '185.113.37.247', '2023-02-18 22:10:27'),
(909, 20, '185.113.37.247', '2023-02-18 22:11:59'),
(910, 18, '176.60.53.123', '2023-02-19 10:24:52'),
(911, 18, '176.60.53.123', '2023-02-19 10:29:17'),
(912, 14, '90.188.151.144', '2023-02-19 10:35:43'),
(913, 18, '176.60.53.123', '2023-02-19 10:39:37'),
(914, 14, '90.188.151.144', '2023-02-19 12:22:58'),
(915, 18, '178.120.15.210', '2023-02-19 15:48:48'),
(916, 18, '176.60.48.48', '2023-02-19 15:56:46'),
(917, 26, '95.29.6.178', '2023-02-19 17:06:16'),
(918, 26, '95.29.6.178', '2023-02-19 17:12:05'),
(919, 20, '185.113.37.247', '2023-02-19 17:25:03'),
(920, 26, '95.29.6.178', '2023-02-19 17:33:21'),
(921, 18, '178.120.15.210', '2023-02-19 18:04:58'),
(922, 20, '185.113.37.247', '2023-02-19 18:06:04'),
(923, 20, '185.113.37.247', '2023-02-19 18:07:00'),
(924, 20, '185.113.37.247', '2023-02-19 18:08:17'),
(925, 27, '5.252.195.27', '2023-02-19 18:14:04'),
(926, 20, '185.113.37.247', '2023-02-19 18:14:22'),
(927, 18, '178.120.15.210', '2023-02-19 18:19:08'),
(928, 27, '5.252.195.27', '2023-02-19 18:20:36'),
(929, 20, '185.113.37.247', '2023-02-19 18:22:30'),
(930, 20, '185.113.37.247', '2023-02-19 18:40:35'),
(931, 26, '95.29.6.178', '2023-02-19 19:24:28'),
(932, 18, '178.120.15.210', '2023-02-19 19:36:35'),
(933, 14, '90.188.151.144', '2023-02-19 19:36:54'),
(934, 20, '185.113.37.247', '2023-02-19 19:36:58'),
(935, 26, '95.29.6.178', '2023-02-19 19:39:15'),
(936, 26, '95.29.6.178', '2023-02-19 19:45:38'),
(937, 26, '95.29.6.178', '2023-02-19 19:55:31'),
(938, 18, '178.120.15.210', '2023-02-19 19:56:32'),
(939, 18, '178.120.15.210', '2023-02-19 20:20:59'),
(940, 26, '95.29.6.178', '2023-02-19 21:00:19'),
(941, 18, '176.60.53.40', '2023-02-19 22:34:13'),
(942, 18, '176.60.53.40', '2023-02-19 22:37:22'),
(943, 20, '185.113.37.247', '2023-02-19 22:38:46'),
(944, 27, '80.70.70.22', '2023-02-19 22:42:16'),
(945, 18, '176.60.53.40', '2023-02-19 22:42:21'),
(946, 20, '185.113.37.247', '2023-02-19 22:42:59'),
(947, 27, '80.70.70.22', '2023-02-19 22:43:05'),
(948, 27, '80.70.70.22', '2023-02-19 22:43:53'),
(949, 27, '80.70.70.22', '2023-02-19 22:44:22'),
(950, 27, '5.252.195.27', '2023-02-19 22:45:41'),
(951, 29, '80.70.70.22', '2023-02-19 23:08:47'),
(952, 30, '80.70.70.22', '2023-02-19 23:22:26'),
(953, 18, '176.60.5.45', '2023-02-20 00:33:35'),
(954, 31, '84.54.78.30', '2023-02-20 04:49:24'),
(955, 31, '84.54.78.30', '2023-02-20 04:50:45'),
(956, 14, '90.188.151.144', '2023-02-20 06:35:22'),
(957, 31, '95.214.210.142', '2023-02-20 07:10:30'),
(958, 31, '95.214.210.142', '2023-02-20 07:14:03'),
(959, 20, '185.113.37.247', '2023-02-20 07:24:02'),
(960, 31, '95.214.210.142', '2023-02-20 07:38:23'),
(961, 20, '185.113.37.247', '2023-02-20 07:50:33'),
(962, 31, '95.214.210.142', '2023-02-20 08:40:58'),
(963, 31, '95.214.210.142', '2023-02-20 08:45:35'),
(964, 31, '95.214.210.142', '2023-02-20 09:28:19'),
(965, 31, '95.214.210.142', '2023-02-20 09:29:47'),
(966, 31, '95.214.210.142', '2023-02-20 09:32:00'),
(967, 31, '95.214.210.142', '2023-02-20 09:44:26'),
(968, 31, '95.214.210.142', '2023-02-20 10:21:23'),
(969, 31, '95.214.210.142', '2023-02-20 10:25:34'),
(970, 31, '95.214.210.142', '2023-02-20 10:52:16'),
(971, 30, '80.70.70.22', '2023-02-20 12:06:22'),
(972, 31, '84.54.78.30', '2023-02-20 12:46:05'),
(973, 32, '213.230.74.8', '2023-02-20 12:50:36'),
(974, 14, '90.188.151.144', '2023-02-20 12:57:13'),
(975, 31, '84.54.78.30', '2023-02-20 13:09:48'),
(976, 32, '213.230.74.8', '2023-02-20 13:10:34'),
(977, 31, '84.54.78.30', '2023-02-20 13:11:08'),
(978, 32, '213.230.74.8', '2023-02-20 13:11:41'),
(979, 31, '84.54.78.30', '2023-02-20 13:12:09'),
(980, 32, '213.230.74.8', '2023-02-20 13:13:02'),
(981, 31, '84.54.78.30', '2023-02-20 13:15:42'),
(982, 30, '80.70.70.22', '2023-02-20 13:16:48'),
(983, 20, '95.82.96.187', '2023-02-20 13:16:49'),
(984, 31, '84.54.78.30', '2023-02-20 13:20:22'),
(985, 20, '95.82.96.187', '2023-02-20 13:27:23'),
(986, 20, '95.82.96.187', '2023-02-20 13:28:58'),
(987, 20, '95.82.98.187', '2023-02-20 13:38:26'),
(988, 32, '185.139.137.98', '2023-02-20 13:39:10'),
(989, 30, '80.70.70.22', '2023-02-20 13:47:33'),
(990, 31, '84.54.78.30', '2023-02-20 13:50:41'),
(991, 32, '185.139.137.98', '2023-02-20 13:52:01'),
(992, 31, '84.54.78.30', '2023-02-20 13:55:45'),
(993, 31, '84.54.78.30', '2023-02-20 14:09:05'),
(994, 32, '213.230.74.8', '2023-02-20 16:39:00'),
(995, 32, '213.230.74.8', '2023-02-20 16:40:18'),
(996, 31, '84.54.78.30', '2023-02-20 16:51:20'),
(997, 31, '84.54.78.30', '2023-02-20 16:54:07'),
(998, 32, '213.230.74.8', '2023-02-20 17:06:24'),
(999, 32, '213.230.74.8', '2023-02-20 17:12:26'),
(1000, 32, '213.230.74.8', '2023-02-20 17:16:40'),
(1001, 32, '213.230.74.8', '2023-02-20 17:47:30'),
(1002, 31, '84.54.78.30', '2023-02-20 18:24:05'),
(1003, 32, '185.139.137.35', '2023-02-20 18:24:30'),
(1004, 32, '213.230.74.8', '2023-02-20 20:12:36'),
(1005, 18, '176.60.52.168', '2023-02-20 22:45:00'),
(1006, 30, '80.70.70.22', '2023-02-21 01:34:21'),
(1007, 31, '37.110.211.48', '2023-02-21 07:35:09'),
(1008, 32, '213.230.74.8', '2023-02-21 12:20:36'),
(1009, 32, '213.230.74.8', '2023-02-21 12:52:26'),
(1010, 14, '90.188.151.144', '2023-02-21 17:06:31'),
(1011, 30, '80.70.70.22', '2023-02-21 17:07:55'),
(1012, 14, '90.188.151.144', '2023-02-21 17:09:57'),
(1013, 32, '213.230.74.8', '2023-02-21 17:10:36'),
(1014, 32, '213.230.74.8', '2023-02-21 17:19:03'),
(1015, 18, '176.60.5.91', '2023-02-21 21:21:46'),
(1016, 17, '5.138.30.152', '2023-02-21 22:36:33'),
(1017, 20, '185.113.37.247', '2023-02-21 22:36:54'),
(1018, 30, '80.70.70.22', '2023-02-21 22:38:18'),
(1019, 20, '185.113.37.247', '2023-02-21 22:39:28'),
(1020, 30, '80.70.70.22', '2023-02-21 22:39:33'),
(1021, 17, '5.138.30.152', '2023-02-21 22:39:33'),
(1022, 17, '85.115.248.65', '2023-02-21 22:40:19'),
(1023, 31, '37.110.215.141', '2023-02-22 08:37:32'),
(1024, 32, '213.230.74.8', '2023-02-22 11:57:01'),
(1025, 32, '213.230.74.8', '2023-02-22 16:35:56'),
(1026, 32, '213.230.74.8', '2023-02-22 19:21:52'),
(1027, 32, '213.230.74.8', '2023-02-22 19:30:52'),
(1028, 31, '37.110.214.247', '2023-02-23 09:11:21'),
(1029, 14, '90.188.151.144', '2023-02-24 13:28:19'),
(1030, 14, '90.188.151.144', '2023-02-24 13:31:07'),
(1031, 32, '213.230.88.128', '2023-02-24 16:43:35'),
(1032, 32, '213.230.88.128', '2023-02-24 16:49:38'),
(1033, 32, '213.230.88.128', '2023-02-24 16:53:10'),
(1034, 32, '213.230.88.128', '2023-02-24 17:10:21'),
(1035, 32, '213.230.88.128', '2023-02-24 17:13:30'),
(1036, 32, '213.230.88.128', '2023-02-24 17:20:25'),
(1037, 17, '94.233.241.219', '2023-02-25 15:39:13'),
(1038, 31, '91.90.219.59', '2023-02-25 15:40:12'),
(1039, 32, '213.230.88.128', '2023-02-25 15:40:24'),
(1040, 17, '94.233.241.219', '2023-02-25 15:51:11'),
(1041, 32, '213.230.88.128', '2023-02-25 15:51:35'),
(1042, 32, '213.230.88.128', '2023-02-25 15:53:16'),
(1043, 31, '91.90.219.59', '2023-02-25 16:04:50'),
(1044, 32, '213.230.88.128', '2023-02-25 16:06:42'),
(1045, 17, '94.233.241.219', '2023-02-25 16:11:34'),
(1046, 17, '94.233.241.219', '2023-02-25 16:12:36'),
(1047, 17, '94.233.241.219', '2023-02-25 16:15:48'),
(1048, 32, '213.230.88.128', '2023-02-25 16:22:16');
INSERT INTO `users_history` (`uh_id`, `uh_user`, `uh_ip`, `uh_date`) VALUES
(1049, 31, '91.90.219.59', '2023-02-25 16:27:07'),
(1050, 31, '91.90.219.59', '2023-02-25 16:46:06'),
(1051, 31, '91.90.219.59', '2023-02-25 17:14:19'),
(1052, 32, '213.230.88.128', '2023-02-25 17:17:53'),
(1053, 31, '91.90.219.59', '2023-02-25 17:24:41'),
(1054, 17, '94.233.241.219', '2023-02-25 17:26:41'),
(1055, 17, '94.233.241.219', '2023-02-25 17:32:57'),
(1056, 17, '94.233.241.219', '2023-02-25 17:34:20'),
(1057, 17, '94.233.241.219', '2023-02-25 17:36:10'),
(1058, 17, '94.233.241.219', '2023-02-25 17:39:58'),
(1059, 31, '91.90.219.59', '2023-02-25 17:42:34'),
(1060, 17, '94.233.241.219', '2023-02-25 17:45:52'),
(1061, 31, '91.90.219.59', '2023-02-25 17:45:57'),
(1062, 17, '94.233.241.219', '2023-02-25 17:47:28'),
(1063, 31, '91.90.219.59', '2023-02-25 17:49:48'),
(1064, 17, '94.233.241.219', '2023-02-25 17:58:45'),
(1065, 31, '91.90.219.59', '2023-02-25 17:58:45'),
(1066, 31, '91.90.219.59', '2023-02-25 18:14:27'),
(1067, 32, '213.230.88.128', '2023-02-25 18:14:58'),
(1068, 31, '91.90.219.59', '2023-02-25 18:28:43'),
(1069, 32, '213.230.88.128', '2023-02-25 18:30:41'),
(1070, 17, '94.233.241.219', '2023-02-25 18:31:30'),
(1071, 17, '94.233.241.219', '2023-02-25 18:38:00'),
(1072, 17, '94.233.241.219', '2023-02-25 18:43:37'),
(1073, 17, '94.233.241.219', '2023-02-25 18:44:57'),
(1074, 32, '213.230.88.128', '2023-02-25 18:45:26'),
(1075, 31, '91.90.219.59', '2023-02-25 18:45:29'),
(1076, 17, '94.233.241.219', '2023-02-25 18:46:06'),
(1077, 31, '91.90.219.59', '2023-02-25 18:48:29'),
(1078, 17, '94.233.241.219', '2023-02-25 18:52:33'),
(1079, 32, '213.230.88.128', '2023-02-25 18:56:00'),
(1080, 31, '91.90.219.59', '2023-02-25 19:21:15'),
(1081, 31, '91.90.219.59', '2023-02-25 21:40:52'),
(1082, 31, '91.90.219.59', '2023-02-25 21:47:28'),
(1083, 31, '91.90.219.59', '2023-02-25 21:50:19'),
(1084, 31, '91.90.219.59', '2023-02-25 21:56:56'),
(1085, 32, '213.230.88.128', '2023-02-26 03:56:00'),
(1086, 32, '213.230.88.128', '2023-02-26 08:16:40'),
(1087, 32, '213.230.88.128', '2023-02-26 08:50:14'),
(1088, 32, '213.230.88.128', '2023-02-26 08:58:04'),
(1089, 32, '213.230.88.128', '2023-02-26 09:41:34'),
(1090, 31, '213.230.102.121', '2023-02-26 10:44:44'),
(1091, 32, '213.230.88.128', '2023-02-26 14:15:21'),
(1092, 14, '90.188.151.144', '2023-02-26 16:10:44'),
(1093, 32, '213.230.88.128', '2023-02-26 16:24:13'),
(1094, 31, '84.54.80.147', '2023-02-26 16:24:39'),
(1095, 32, '213.230.88.128', '2023-02-26 16:25:24'),
(1096, 30, '80.70.70.22', '2023-02-26 16:30:27'),
(1097, 14, '90.188.151.144', '2023-02-26 16:34:15'),
(1098, 30, '80.70.70.22', '2023-02-26 16:36:24'),
(1099, 32, '213.230.88.128', '2023-02-26 17:06:02'),
(1100, 14, '90.188.151.144', '2023-02-26 17:09:20'),
(1101, 32, '213.230.88.128', '2023-02-26 17:10:39'),
(1102, 14, '90.188.151.144', '2023-02-26 23:46:23'),
(1103, 14, '90.188.151.144', '2023-02-26 23:49:10'),
(1104, 32, '213.230.88.128', '2023-02-27 17:19:46'),
(1105, 14, '90.188.151.144', '2023-02-28 13:15:50'),
(1106, 18, '178.120.70.45', '2023-02-28 13:16:01'),
(1107, 18, '178.120.70.45', '2023-02-28 13:17:46'),
(1108, 31, '213.230.118.31', '2023-02-28 18:18:16'),
(1109, 18, '178.120.65.45', '2023-02-28 19:22:10'),
(1110, 18, '178.120.65.45', '2023-02-28 21:07:46'),
(1111, 32, '213.230.88.128', '2023-02-28 21:22:34'),
(1112, 18, '178.120.65.45', '2023-02-28 23:02:26'),
(1113, 31, '37.110.210.84', '2023-03-01 07:01:45'),
(1114, 31, '37.110.210.84', '2023-03-01 07:04:22'),
(1115, 18, '178.120.65.45', '2023-03-01 10:10:38'),
(1116, 18, '178.120.69.45', '2023-03-01 20:37:40'),
(1117, 32, '213.230.88.128', '2023-03-02 13:53:04'),
(1118, 18, '178.120.21.127', '2023-03-02 20:45:39'),
(1119, 18, '178.120.21.127', '2023-03-02 20:49:06'),
(1120, 18, '178.120.21.127', '2023-03-02 20:52:05'),
(1121, 18, '178.120.21.127', '2023-03-02 21:27:56'),
(1122, 18, '178.120.21.127', '2023-03-02 21:39:48'),
(1123, 35, '178.120.21.127', '2023-03-02 21:39:52'),
(1124, 18, '178.120.17.127', '2023-03-04 00:19:04'),
(1125, 18, '178.120.21.127', '2023-03-04 15:50:06'),
(1126, 18, '178.120.21.127', '2023-03-04 15:52:34'),
(1127, 18, '178.120.21.127', '2023-03-04 20:55:58'),
(1128, 18, '178.120.21.127', '2023-03-05 19:35:32'),
(1129, 31, '84.54.120.85', '2023-03-08 16:27:42'),
(1130, 31, '84.54.120.85', '2023-03-08 16:28:50'),
(1131, 31, '84.54.120.85', '2023-03-08 16:38:44'),
(1132, 18, '176.60.52.127', '2023-03-08 16:51:26'),
(1133, 31, '84.54.120.85', '2023-03-08 16:57:38'),
(1134, 31, '84.54.120.85', '2023-03-08 17:08:27'),
(1135, 31, '84.54.120.85', '2023-03-08 17:09:28'),
(1136, 31, '84.54.120.85', '2023-03-08 17:14:38'),
(1137, 31, '84.54.120.85', '2023-03-08 17:38:47'),
(1138, 36, '188.19.174.29', '2023-03-08 17:40:34'),
(1139, 36, '188.19.174.29', '2023-03-08 17:50:04'),
(1140, 36, '188.19.174.29', '2023-03-08 17:53:31'),
(1141, 36, '188.19.174.29', '2023-03-08 18:00:38'),
(1142, 36, '188.19.174.29', '2023-03-08 18:12:09');

-- --------------------------------------------------------

--
-- Структура таблицы `users_jobinfo`
--

CREATE TABLE `users_jobinfo` (
  `ji_id` int(9) NOT NULL,
  `ji_uid` int(9) NOT NULL,
  `ji_date_invite` date NOT NULL,
  `ji_date_uninvite` date NOT NULL,
  `ji_fraction` int(6) NOT NULL DEFAULT 0,
  `ji_reason` varchar(64) CHARACTER SET latin1 NOT NULL,
  `ji_fwarnings` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users_jobinfo`
--

INSERT INTO `users_jobinfo` (`ji_id`, `ji_uid`, `ji_date_invite`, `ji_date_uninvite`, `ji_fraction`, `ji_reason`, `ji_fwarnings`) VALUES
(1, 107, '2020-09-21', '2020-09-21', 18, 'poka', 0),
(2, 560, '2020-09-26', '2020-09-26', 25, '!', 0),
(3, 599, '2020-09-26', '2020-09-26', 25, '!', 0),
(4, 101, '2020-09-26', '2020-09-26', 4, '????.??????????', 0),
(5, 7, '2020-09-26', '2020-09-26', 20, '???????.', 0),
(6, 700, '2020-09-26', '2020-09-26', 21, '???????.', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users_medcards`
--

CREATE TABLE `users_medcards` (
  `mc_id` int(6) NOT NULL,
  `mc_result` int(6) NOT NULL,
  `mc_dname` varchar(24) CHARACTER SET utf8 NOT NULL,
  `mc_owner` int(6) NOT NULL,
  `mc_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `users_medcards`
--

INSERT INTO `users_medcards` (`mc_id`, `mc_result`, `mc_dname`, `mc_owner`, `mc_date`) VALUES
(1, 2, 'Сотрудник', 1, '2021-12-11'),
(2, 2, 'Сотрудник', 10, '2023-01-14');

-- --------------------------------------------------------

--
-- Структура таблицы `users_phonebook`
--

CREATE TABLE `users_phonebook` (
  `u_id` int(11) NOT NULL,
  `u_phone_name` varchar(24) CHARACTER SET utf8 NOT NULL,
  `u_phone_num` int(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `users_tickets`
--

CREATE TABLE `users_tickets` (
  `t_id` int(6) NOT NULL,
  `t_player` int(6) NOT NULL,
  `t_player_name` varchar(24) CHARACTER SET utf8 NOT NULL,
  `t_cop_name` varchar(24) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `t_count` int(11) NOT NULL,
  `t_reason` varchar(64) CHARACTER SET utf8 NOT NULL,
  `t_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `users_tickets`
--

INSERT INTO `users_tickets` (`t_id`, `t_player`, `t_player_name`, `t_cop_name`, `t_count`, `t_reason`, `t_date`) VALUES
(1, 17, 'Maksim_Bodakin', 'Ruslan_Bezobid', 100000, 'ÎËÓÕ', '2023-02-25');

-- --------------------------------------------------------

--
-- Структура таблицы `users_vehicles`
--

CREATE TABLE `users_vehicles` (
  `v_id` int(6) NOT NULL,
  `v_model` int(6) NOT NULL,
  `v_owner` int(4) NOT NULL,
  `v_plate` varchar(12) NOT NULL DEFAULT 'Transit',
  `v_fuel` float NOT NULL DEFAULT 60,
  `v_color_1` int(4) NOT NULL DEFAULT 0,
  `v_color_2` int(4) NOT NULL DEFAULT 0,
  `v_pos_x` float NOT NULL,
  `v_pos_y` float NOT NULL,
  `v_pos_z` float NOT NULL,
  `v_pos_a` float NOT NULL,
  `v_millage` float NOT NULL DEFAULT 0,
  `v_buydate` date NOT NULL,
  `v_engine_boost` float NOT NULL DEFAULT 0,
  `v_brake_boost` float NOT NULL DEFAULT 0,
  `v_stability_boost` float NOT NULL DEFAULT 0,
  `v_type` int(6) NOT NULL DEFAULT 0,
  `v_eng_details` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0',
  `v_brake_details` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0',
  `v_stab_details` varchar(16) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '0|0|0|0|0',
  `v_components` varchar(128) NOT NULL DEFAULT '0|0|0|0|0|0|0|0|0|0',
  `v_sell_price` int(6) NOT NULL DEFAULT 0,
  `v_sell_slot` int(6) NOT NULL DEFAULT 0,
  `v_sell_carmarket` int(6) NOT NULL DEFAULT 0,
  `v_gps_tracker` int(6) NOT NULL DEFAULT 0,
  `v_vw` int(6) NOT NULL DEFAULT 0,
  `v_int` int(6) NOT NULL DEFAULT 0,
  `v_paint` int(6) NOT NULL DEFAULT 3,
  `v_fine` int(6) NOT NULL DEFAULT 0,
  `c_toner` varchar(64) NOT NULL DEFAULT '0|0|0',
  `c_vinil` int(11) NOT NULL DEFAULT 0,
  `c_strobs` int(11) NOT NULL DEFAULT 0,
  `c_lights` varchar(64) NOT NULL DEFAULT '255|255|255',
  `c_is_lights` int(11) NOT NULL DEFAULT 0,
  `c_neon` int(11) NOT NULL DEFAULT -1,
  `v_tuning` varchar(128) NOT NULL DEFAULT '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users_vehicles`
--

INSERT INTO `users_vehicles` (`v_id`, `v_model`, `v_owner`, `v_plate`, `v_fuel`, `v_color_1`, `v_color_2`, `v_pos_x`, `v_pos_y`, `v_pos_z`, `v_pos_a`, `v_millage`, `v_buydate`, `v_engine_boost`, `v_brake_boost`, `v_stability_boost`, `v_type`, `v_eng_details`, `v_brake_details`, `v_stab_details`, `v_components`, `v_sell_price`, `v_sell_slot`, `v_sell_carmarket`, `v_gps_tracker`, `v_vw`, `v_int`, `v_paint`, `v_fine`, `c_toner`, `c_vinil`, `c_strobs`, `c_lights`, `c_is_lights`, `c_neon`, `v_tuning`) VALUES
(3, 507, 20, 'J247WK', 60, 0, 0, 439.363, 326.993, 12.039, 343.11, 2.4686, '2023-01-13', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '10|10|10', 13, 1, '255|0|0', 1, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(4, 421, 11, 'Transit', 88.8105, 0, 0, 2321.19, -1818.49, 22.453, 86.706, 6.70726, '2023-01-14', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '23|23|23', 0, 0, '255|0|0', 1, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(5, 551, 11, 'Transit', 92.0503, 0, 0, 2465.67, -760.795, 12.107, 0.375, 6.01867, '2023-01-16', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '20|20|20', 0, 0, '255|0|0', 1, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(7, 507, 14, 'J247WK', 28.591, 0, 0, 439.363, 326.993, 12.039, 343.11, 11.4331, '2023-01-13', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '10|10|10', 13, 1, '255|0|0', 1, 0, '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(8, 466, 12, 'Transit', 100, 0, 0, 2148.7, 1397.73, 10.555, 180, 4.08762, '2023-01-31', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(9, 419, 14, 'Transit', 86.4706, 0, 0, 2148.7, 1397.73, 10.555, 180, 1.3287, '2023-01-31', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 1, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(10, 421, 14, 'J604LF', 81.7308, 0, 0, 2321.19, -1818.49, 22.453, 86.706, 5.6809, '2023-01-14', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '23|23|23', 0, 0, '255|0|0', 1, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(11, 551, 20, 'Transit', 100, 0, 0, 2136.04, 1397.73, 10.563, 180, 0, '2023-02-04', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(12, 422, 25, 'Transit', 100, 0, 0, 2123.17, 1397.73, 10.555, 180, 0, '2023-02-15', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 1, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(13, 551, 14, 'H458WI', 90.4304, 0, 0, 2465.67, -760.795, 12.107, 0.375, 5.83098, '2023-01-16', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '20|20|20', 0, 0, '255|0|0', 1, -1, '-1,1,1,1,1,1,1,1,1,1,1,1,1,1,1'),
(14, 580, 18, 'Transit', 100, 0, 0, 2142.28, 1397.73, 10.555, 180, 0, '2023-02-20', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 0, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(15, 489, 31, 'Transit', 100, 0, 0, 2142.28, 1397.73, 10.555, 180, 0, '2023-02-20', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 1, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'),
(16, 466, 31, 'Transit', 100, 0, 0, 2148.7, 1397.73, 10.555, 180, 5.73496, '2023-02-20', 0, 0, 0, 0, '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0', '0|0|0|0|0|0|0|0|0|0', 0, 0, 0, 0, 0, 0, 3, 1, '0|0|0', 0, 0, '255|255|255', 0, -1, '-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0');

-- --------------------------------------------------------

--
-- Структура таблицы `users_warns`
--

CREATE TABLE `users_warns` (
  `w_id` int(6) NOT NULL,
  `w_owner` int(6) NOT NULL,
  `w_admin_name` varchar(32) NOT NULL,
  `w_reason` varchar(64) CHARACTER SET cp1251 COLLATE cp1251_bin NOT NULL,
  `w_date` datetime NOT NULL,
  `w_end` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `anticheat_settings`
--
ALTER TABLE `anticheat_settings`
  ADD UNIQUE KEY `ac_code` (`ac_code`);

--
-- Индексы таблицы `atm`
--
ALTER TABLE `atm`
  ADD PRIMARY KEY (`atm_id`);

--
-- Индексы таблицы `bon`
--
ALTER TABLE `bon`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `businesses`
--
ALTER TABLE `businesses`
  ADD PRIMARY KEY (`b_id`),
  ADD KEY `b_id` (`b_id`);

--
-- Индексы таблицы `businesses_history`
--
ALTER TABLE `businesses_history`
  ADD PRIMARY KEY (`bh_id`);

--
-- Индексы таблицы `businesses_orders`
--
ALTER TABLE `businesses_orders`
  ADD PRIMARY KEY (`bo_id`);

--
-- Индексы таблицы `cellars`
--
ALTER TABLE `cellars`
  ADD PRIMARY KEY (`cl_id`);

--
-- Индексы таблицы `debtor_message`
--
ALTER TABLE `debtor_message`
  ADD PRIMARY KEY (`dm_id`);

--
-- Индексы таблицы `deposit_boxes`
--
ALTER TABLE `deposit_boxes`
  ADD PRIMARY KEY (`db_id`);

--
-- Индексы таблицы `deposit_logs`
--
ALTER TABLE `deposit_logs`
  ADD PRIMARY KEY (`dl_id`);

--
-- Индексы таблицы `dm_teams`
--
ALTER TABLE `dm_teams`
  ADD PRIMARY KEY (`t_id`);

--
-- Индексы таблицы `elections`
--
ALTER TABLE `elections`
  ADD PRIMARY KEY (`e_id`);

--
-- Индексы таблицы `everest`
--
ALTER TABLE `everest`
  ADD PRIMARY KEY (`vkid`);

--
-- Индексы таблицы `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`fam_id`);

--
-- Индексы таблицы `family_blacklist`
--
ALTER TABLE `family_blacklist`
  ADD PRIMARY KEY (`bl_id`);

--
-- Индексы таблицы `family_island`
--
ALTER TABLE `family_island`
  ADD PRIMARY KEY (`fi_id`);

--
-- Индексы таблицы `family_vehicles`
--
ALTER TABLE `family_vehicles`
  ADD PRIMARY KEY (`sv_id`);

--
-- Индексы таблицы `fractions`
--
ALTER TABLE `fractions`
  ADD PRIMARY KEY (`f_id`);

--
-- Индексы таблицы `fractions_blacklist`
--
ALTER TABLE `fractions_blacklist`
  ADD PRIMARY KEY (`bl_id`);

--
-- Индексы таблицы `gangzones`
--
ALTER TABLE `gangzones`
  ADD PRIMARY KEY (`gz_id`);

--
-- Индексы таблицы `houses`
--
ALTER TABLE `houses`
  ADD PRIMARY KEY (`h_id`);

--
-- Индексы таблицы `logs_family`
--
ALTER TABLE `logs_family`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `money_logs`
--
ALTER TABLE `money_logs`
  ADD PRIMARY KEY (`log_id`);

--
-- Индексы таблицы `nickname_history`
--
ALTER TABLE `nickname_history`
  ADD PRIMARY KEY (`nh_id`),
  ADD UNIQUE KEY `nh_id_3` (`nh_id`),
  ADD KEY `nh_id` (`nh_id`),
  ADD KEY `nh_id_2` (`nh_id`),
  ADD KEY `nh_owner` (`nh_owner`);

--
-- Индексы таблицы `photographer_job_cooldown`
--
ALTER TABLE `photographer_job_cooldown`
  ADD PRIMARY KEY (`user_id`),
  ADD KEY `id` (`id`);

--
-- Индексы таблицы `safa_rooster`
--
ALTER TABLE `safa_rooster`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `server_exams`
--
ALTER TABLE `server_exams`
  ADD PRIMARY KEY (`e_id`);

--
-- Индексы таблицы `server_promocodes`
--
ALTER TABLE `server_promocodes`
  ADD PRIMARY KEY (`promo_id`);

--
-- Индексы таблицы `server_variables`
--
ALTER TABLE `server_variables`
  ADD PRIMARY KEY (`var_id`);

--
-- Индексы таблицы `server_vehicles`
--
ALTER TABLE `server_vehicles`
  ADD PRIMARY KEY (`sv_id`);

--
-- Индексы таблицы `teleport_areas`
--
ALTER TABLE `teleport_areas`
  ADD PRIMARY KEY (`area_id`);

--
-- Индексы таблицы `testing_codes`
--
ALTER TABLE `testing_codes`
  ADD PRIMARY KEY (`tc_id`);

--
-- Индексы таблицы `time_promocodes`
--
ALTER TABLE `time_promocodes`
  ADD PRIMARY KEY (`promo_id`);

--
-- Индексы таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`u_id`);

--
-- Индексы таблицы `users_admins`
--
ALTER TABLE `users_admins`
  ADD PRIMARY KEY (`u_a_id`);

--
-- Индексы таблицы `users_bans`
--
ALTER TABLE `users_bans`
  ADD PRIMARY KEY (`u_b_date`);

--
-- Индексы таблицы `users_complaints`
--
ALTER TABLE `users_complaints`
  ADD PRIMARY KEY (`u_id`);

--
-- Индексы таблицы `users_duels`
--
ALTER TABLE `users_duels`
  ADD PRIMARY KEY (`d_id`);

--
-- Индексы таблицы `users_history`
--
ALTER TABLE `users_history`
  ADD PRIMARY KEY (`uh_id`);

--
-- Индексы таблицы `users_jobinfo`
--
ALTER TABLE `users_jobinfo`
  ADD PRIMARY KEY (`ji_id`);

--
-- Индексы таблицы `users_medcards`
--
ALTER TABLE `users_medcards`
  ADD PRIMARY KEY (`mc_id`);

--
-- Индексы таблицы `users_tickets`
--
ALTER TABLE `users_tickets`
  ADD PRIMARY KEY (`t_id`);

--
-- Индексы таблицы `users_vehicles`
--
ALTER TABLE `users_vehicles`
  ADD PRIMARY KEY (`v_id`);

--
-- Индексы таблицы `users_warns`
--
ALTER TABLE `users_warns`
  ADD PRIMARY KEY (`w_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `atm`
--
ALTER TABLE `atm`
  MODIFY `atm_id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT для таблицы `bon`
--
ALTER TABLE `bon`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `businesses`
--
ALTER TABLE `businesses`
  MODIFY `b_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `businesses_history`
--
ALTER TABLE `businesses_history`
  MODIFY `bh_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=218;

--
-- AUTO_INCREMENT для таблицы `businesses_orders`
--
ALTER TABLE `businesses_orders`
  MODIFY `bo_id` int(9) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `cellars`
--
ALTER TABLE `cellars`
  MODIFY `cl_id` int(5) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `debtor_message`
--
ALTER TABLE `debtor_message`
  MODIFY `dm_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `deposit_boxes`
--
ALTER TABLE `deposit_boxes`
  MODIFY `db_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT для таблицы `deposit_logs`
--
ALTER TABLE `deposit_logs`
  MODIFY `dl_id` int(9) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `dm_teams`
--
ALTER TABLE `dm_teams`
  MODIFY `t_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `elections`
--
ALTER TABLE `elections`
  MODIFY `e_id` int(6) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `everest`
--
ALTER TABLE `everest`
  MODIFY `vkid` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `family`
--
ALTER TABLE `family`
  MODIFY `fam_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `family_blacklist`
--
ALTER TABLE `family_blacklist`
  MODIFY `bl_id` int(12) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `family_island`
--
ALTER TABLE `family_island`
  MODIFY `fi_id` int(5) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `family_vehicles`
--
ALTER TABLE `family_vehicles`
  MODIFY `sv_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `fractions`
--
ALTER TABLE `fractions`
  MODIFY `f_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT для таблицы `fractions_blacklist`
--
ALTER TABLE `fractions_blacklist`
  MODIFY `bl_id` int(12) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `houses`
--
ALTER TABLE `houses`
  MODIFY `h_id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `logs_family`
--
ALTER TABLE `logs_family`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `money_logs`
--
ALTER TABLE `money_logs`
  MODIFY `log_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=318;

--
-- AUTO_INCREMENT для таблицы `nickname_history`
--
ALTER TABLE `nickname_history`
  MODIFY `nh_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `photographer_job_cooldown`
--
ALTER TABLE `photographer_job_cooldown`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `safa_rooster`
--
ALTER TABLE `safa_rooster`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `server_exams`
--
ALTER TABLE `server_exams`
  MODIFY `e_id` int(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `server_promocodes`
--
ALTER TABLE `server_promocodes`
  MODIFY `promo_id` int(6) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `server_variables`
--
ALTER TABLE `server_variables`
  MODIFY `var_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `server_vehicles`
--
ALTER TABLE `server_vehicles`
  MODIFY `sv_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=340;

--
-- AUTO_INCREMENT для таблицы `teleport_areas`
--
ALTER TABLE `teleport_areas`
  MODIFY `area_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=168;

--
-- AUTO_INCREMENT для таблицы `testing_codes`
--
ALTER TABLE `testing_codes`
  MODIFY `tc_id` int(6) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `time_promocodes`
--
ALTER TABLE `time_promocodes`
  MODIFY `promo_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `u_id` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT для таблицы `users_admins`
--
ALTER TABLE `users_admins`
  MODIFY `u_a_id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT для таблицы `users_complaints`
--
ALTER TABLE `users_complaints`
  MODIFY `u_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users_duels`
--
ALTER TABLE `users_duels`
  MODIFY `d_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users_history`
--
ALTER TABLE `users_history`
  MODIFY `uh_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1143;

--
-- AUTO_INCREMENT для таблицы `users_jobinfo`
--
ALTER TABLE `users_jobinfo`
  MODIFY `ji_id` int(9) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `users_medcards`
--
ALTER TABLE `users_medcards`
  MODIFY `mc_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `users_tickets`
--
ALTER TABLE `users_tickets`
  MODIFY `t_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `users_vehicles`
--
ALTER TABLE `users_vehicles`
  MODIFY `v_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `users_warns`
--
ALTER TABLE `users_warns`
  MODIFY `w_id` int(6) NOT NULL AUTO_INCREMENT;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `photographer_job_cooldown`
--
ALTER TABLE `photographer_job_cooldown`
  ADD CONSTRAINT `photographer_job_cooldown_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`u_id`);

--
-- Ограничения внешнего ключа таблицы `safa_rooster`
--
ALTER TABLE `safa_rooster`
  ADD CONSTRAINT `safa_rooster_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`u_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
