#define object_bus_station 	2121
#define object_atm			14389

#define object_atm_tinkoff	14389

#define udochka_object		18183
#define jbl_object			14170

#define city_prise			"г. Южный"
#define city_war			"г. Южный"

#define garden_interior		12

#define skin_miner			241
#define skin_factory		250
#define skin_sawmill		249

/*

	Регистрация

*/

new Text:td_regskins [ 22 ] ;
new registration_skins [ 3 ] [ 2 ] [ 5 ] =
{
	{ { 1, 2, 4, 6, 17 }, { 9, 11, 13, 53, 55 } },
	{ { 1, 2, 4, 6, 17 }, { 9, 11, 13, 53, 55 } },
	{ { 1, 2, 4, 6, 17 }, { 9, 11, 13, 53, 55 } }
} ;

const registration_interior = 15 ;
new Float: registration_skin_position [ 4 ] = { 2698.7070, 303.2422, 1401.0000, 224.5035 } ;
new Float: registration_camera_pos [ 6 ] = { 2701.6162, 301.5572, 1403.0000, 2698.7070, 303.2422, 1401.0000 } ;

/*

	spawn

*/

new Float:newbie_spawn_pos [ 5 ] [ 3 ] [ 4 ] =
{
	{
		{ -493.2795, 910.1484, 12.1425, 277.6495 }, // Арзамас
		{ -492.8713, 914.8031, 12.1425, 259.3829 },
		{ -489.4476, 911.9022, 12.1425, 272.5690 }
	},
	{
		{ 2094.4473, 1844.9922, 15.8055, 359.3828 }, // Батырево
		{ 2098.2581, 1844.9830, 15.8055, 4.2351 },
		{ 2099.9658, 1848.3192, 15.8055, 38.5326 }
	},
	{
		{ 2670.4065, -1613.5676, 22.4526, 90.9216 }, // Южный
		{ 2670.3965, -1617.3838, 22.4526, 90.5005 },
		{ 2668.2483, -1610.2491, 22.4526, 125.3927 }
	},
	{ // доп. спавны
		{ 2094.4473, 1844.9922, 15.8055, 359.3828 }, // Батырево
		{ 2098.2581, 1844.9830, 15.8055, 4.2351 },
		{ 2099.9658, 1848.3192, 15.8055, 38.5326 }
	},
	{
		{ 466.7198, 1666.0468, 12.1797, 80.7351 }, // Вокзал
		{ 466.7295, 1670.8531, 12.1797, 78.2879 },
		{ 466.7177, 1675.5985, 12.1871, 81.45577 }
	}
} ;

new newbie_spawn_data [ 5 ] [ 3 ] [ 2 ] =
{
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	}
} ;

#define MAX_DECORATION 8

enum _actor_decoration
{
	actor_skin,
	
	Float:actor_pos [ 4 ],
	actor_interior,
	actor_world,
	
	actor_anim [ 32 ],
	actor_anim_lib [ 32 ]
} ;

new actor_decor [ MAX_DECORATION ] [ _actor_decoration ] =
{
	{ 184, { 2657.7265, -1610.2951, 22.4525, 281.7540 }, 0, 0, "ON_LOOKERS", "WAVE_OUT" },
	{ 184, { -493.7932, 921.3504, 12.1476, 213.7004 }, 0, 0, "ON_LOOKERS", "WAVE_OUT" },
	{ 250, { -1068.0258, 2207.6081, 38.0899, 193.6846 }, 0, 0, "DEALER", "Dealer_idle" }, // Завод
	{ 241, { 2388.9108, 1704.6280, -2.2295, 66.0685 }, 0, 0, "DEALER", "Dealer_idle" }, // Шахта
	{ 249, { 1573.2747, 2870.8962, 11.7187, 137.3054 }, 0, 0, "DEALER", "Dealer_idle" }, // Лесопилка
	
	{ 11, { 767.3677, -1436.8871, 3003.5764, 119.8285 }, 1, 1, "ped", "SEAT_IDLE" }, // Автошкола
	{ 171, { 767.3585, -1432.9622, 3003.5764, 120.0345 }, 1, 1, "ped", "SEAT_IDLE" }, // Автошкола
	{ 172, { 767.3545, -1428.8624, 3003.5764, 121.2407 }, 1, 1, "ped", "SEAT_IDLE" } // Автошкола
} ;

enum _object_decoration
{
	object_decor_id,
	Float: object_pos [ 6 ],
	object_int,
	object_world
} ;

new object_decor [ MAX_DECORATION ] [ _object_decoration ] =
{
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 }
} ;

new mayor_bots_skin [ 4 ] = { 108, 147, 202, 202 } ;
new Float: mayor_bots_position [ 4 ] [ 4 ] =
{
    { 690.5120, -10.9502, 1201.8580, 177.1642 },
    { 687.1762, -10.9317, 1201.8580, 178.5578 },
    { 691.4867, -26.7801, 1201.8580, 91.9240 },
    { 684.5968, -18.8556, 1201.8580, 268.9387 }
} ;

new police_bots_skin [ 4 ] = { 280, 282, 280, 282 } ;
new Float: police_bots_position [ 4 ] [ 4 ] =
{
    { 899.7410,2.4865,1405.6897,356.4056 },
    { 902.3462,2.4865,1405.6897,359.4938 },
    { 904.8976,2.4865,1405.6897,359.4938 },
    { 912.2140,13.2540,1399.9978,178.0685 }
} ;

new hospital_bots_skin [ 2 ] = { 70, 274 } ;
new Float: hospital_bots_position [ 2 ] [ 4 ] =
{
    { 1812.1480, -118.4538, 1400.9849, 88.5746 },
    { 1812.1480, -115.8226, 1400.9849, 89.6328 }
} ;

/*

	Аренда мопеда

*/

new Float:faggio_spawn [ 9 ] [ 4 ] =
{
	{ -477.8312, 917.7540, 11.5595, 269.9855 }, // Арзамас
	{ 2657.5469, -1621.5603, 22.4526, 179.7177 }, // Южный
	{ 2086.3511, 1861.7897, 15.2493, 0.6033 }, // Батырево
	{ 458.1781, 1669.4586, 11.6272, 351.0675 }, // Эдово
	{ 2348.4772, 2012.0286, 15.5894, 90.1084 }, // Завод
	{ -1383.8876, 2633.3864, 39.9876, 322.9427 }, // Шахта
	{ -1050.3405, -2460.5905, 28.2838, 292.3938 }, // Лесопилка
	{ 2306.9555, -1921.9207, 21.4283, 178.9094 }, // Доставщик
	{ 587.9086, 1784.5119, 21.3771, 70.7088 } // Больница
} ;


/*

	gps

*/

enum _gps
{
	Float:position [ 3 ],
	loc_name [ 48 ]
} ;

new gps_important_place [ 8 ] [ _gps ] =
{
    { { -317.8642, 725.5924, 12.0625 }, "Мэрия г. Арзамас" },
    { { 404.2164, 622.2126, 12.0000 }, "Сбербанк г. Арзамас" },
    { { 1852.1787, 2046.4801, 15.8853 }, "Тинькофф" },
    { { 2376.5012, -2144.1728, 21.9664 }, "Сбербанк г. Южный" },
    { { -286.5593, 583.0414, 12.1202 }, "Больница г. Арзамас" },
    { { 1899.6993, 2227.5906, 15.7058 }, "Автошкола" },
	{ { 1846.3168, 198.1339, 7.8828 }, "Центр воздушного транспорта" },
	{ { 2802.0457, -2552.1052, 10.5201 }, "Центр водного транспорта" }
} ;
new gps_important_place_items [ 48 * ( sizeof ( gps_important_place ) + 1 ) + 1 ] ;
 
new gps_job_place [ 12 ] [ _gps ] =
{
    { { 2384.2039, 1706.0043, -2.2312 }, "Шахта" },
    { { -1065.4392, 2202.4592, 38.0931 }, "Завод" },
    { { 1569.1626, 2869.4167, 11.7188 }, "Лесопилка" },
    { { 1798.6024, 2734.0966, 13.8925 }, "Склад продуктов" },
    { { 1729.3286, 2664.8525, 13.8925 }, "Топливная база" },
    { { 219.2581, 417.0141, 11.6346 }, "Стоянка автобусов" },
    { { 2345.0419, -2627.8171, 21.8114 }, "Стоянка механиков" },
    { { 1798.3466, 2501.4289, 15.8329 }, "Стоянка такси" },
    { { 468.751, 1872.22, 12.893 }, "ТК DHL" },
    { { 1810.22, 2624.68, 13.893 }, "ТК Деловые Линии" },
    { { 780.158, 752.165, 12.927 }, "ТК FedEx" },
    { { 2310.2084, -1926.4329, 21.9588 }, "Доставка" }
} ;
new gps_job_place_items [ 48 * ( sizeof ( gps_job_place ) + 1 ) + 1 ] ;
 
new gps_govorg_place [ 8 ] [ _gps ] =
{
    { { -317.8642, 725.5924, 12.0625 }, "Мэрия г. Арзамас" },
    { { 2412.2810, -1849.9652, 21.8573 }, "Федеральная Служба Безопасности" },
    { { 1903.0008, 1722.3802, 15.9925 }, "Сухопутные Войска" },
    { { 211.6654, 1379.4928, 11.9219 }, "Полиция г. Арзамас" },
    { { 2581.6452, -2434.9899, 21.7972 }, "Полиция г. Южный" },
    { { -286.5593, 583.0414, 12.1202 }, "Больница г. Арзамас" },
    { { 1826.2534, 2095.8588, 15.8540 }, "Радиоцентр" },
    { { 1907.7779, -2239.8271, 11.0595 }, "Правительство" }
} ;
new gps_govorg_place_items [ 48 * ( sizeof ( gps_govorg_place ) + 1 ) + 1 ] ;
 
new gps_auto_place [ 10 ] [ _gps ] =
{
    { { 2476.02, -716.021, 12.437 }, "Автосалон MEDIUM" },
    { { 447.073, 378.701, 12.14 }, "Автосалон PREMIUM" },
    { { 2328.9482, -1783.2218, 22.4531 }, "Автосалон AUTOSHOP" },
    { { 705.4224, 1054.2010, 11.8992 }, "Авторынок г. Арзамас" }, 
    { { -469.9402, 759.6970, 11.9936 }, "Авторынок г. Арзамас" },
    { { 2430.39, -2312.57, 21.942 }, "Автосервис" }, 
    { { -2013.57, -163.348, 29.203 }, "Автосервис" },
    { { 1754.79, 2251.94, 15.8567 }, "Perfomance сервис" },
    { { 222.785, 1474.08, 11.922 }, "Perfomance сервис" },
    { { -341.214, 338.38, 12.625 }, "Pantera Security" } 
} ;
new gps_auto_place_items [ 48 * ( sizeof ( gps_auto_place ) + 1 ) + 1 ] ;
 
new gps_other_place [ 11 ] [ _gps ] =
{
    { { 1969.94, -2603.91, 11.486 }, "Штрафстоянка №1" },
    { { -40.7030, 1361.3315, 12.8816 }, "Штрафстоянка №2" },
    { { 1865.2268, 1886.3151, 13.2188 }, "Семейный торговец" },
    { { 1864.0474, 1892.3818, 13.2188 }, "Семейные задания" },
    { { -432.1726, -1719.1553, 44.1259 }, "Городской склад №1" },
    { { -2738.7571, -1149.0155, 10.5207 }, "Городской склад №2" },
    { { -1510.3588, 1614.3621, 36.7767 }, "Центр развлечений" },
    { { -2287.6931, -1004.0552, 36.5713 }, "Рыбацкое озеро" },
    { { 1442.9283, -859.5132, 40.8571 }, "Охотничьи угодья" },
    { { 1918.0828, 2073.2488, 15.7031 }, "Event Pass торговец" },
    { { 2181.7795, -1837.9807, 18.8188 }, "Тренировочный центр" }
} ;
new gps_other_place_items [ 48 * ( sizeof ( gps_other_place ) + 1 ) + 1 ] ;

new gps_quests_place [ 2 ] [ _gps ] =
{
	/*{ { 2594.6833, 2787.5974, 10.8203 }, "Ограбление" },
	{ { 2594.6731, 2793.6741, 10.8203 }, "Граффити" },
	{ { 1357.3638, -1021.4371, 21.0000 }, "Сено" },
	{ { 1315.0041, -993.5960, 21.0000 }, "Сбор яиц" },
	{ { 2133.1914, 1792.6624, 31.0000 }, "Дойка коров" },
	{ { 1319.6794, -908.4382, 21.0000 }, "Фермер" },
	{ { 1319.4278, -933.1977, 21.0000 }, "Мясокомбинат" },
	{ { 1316.2607, -968.3598, 21.0000 }, "Кормление коров" },
	{ { 2129.9936, 1817.5139, 31.0000 }, "Сбор фруктов" },*/
	{ { -2248.0346, -815.4050, 29.5322 }, "Черепахи" },
	{ { -2193.6640, -793.3474, 29.3472 }, "Жемчуг" }
} ;
new gps_quests_place_items [ 48 * ( sizeof ( gps_other_place ) + 1 ) + 1 ] ;

/*new gps_truck_loading [ 3 ] [ _gps ] =
{
	{ { 655.3007, 869.1117, -42.0791 }, "Шахта" },
	{ { 1025.9675, -358.8767, 74.6368 }, "Лесопилка" },
	{ { -117.2966, -320.5717, 1.4219 }, "Завод" }
} ;
new gps_truck_loading_items [ 48 * ( sizeof ( gps_truck_loading ) + 1 ) + 1 ] ;

new gps_truck_unloading [ 2 ] [ _gps ] =
{
	{ { -18.8481, -272.7238, 5.4297 }, "Завод" },
	{ { -2125.3994, -250.1821, 36.5619 }, "Оружейный завод" }
} ;
new gps_truck_unloading_items [ 48 * ( sizeof ( gps_truck_unloading ) + 1 ) + 1 ] ;*/

/*

	Наркоферма

*/

new Float: priton_position [ 3 ] = { -2801.8647, -656.4426, 7.9977 } ;
new Float: priton_pos_info [ 3 ] = { -2805.6486, -669.3335, 8.3406 } ;

/*

	Охота

*/

new Float:DeerPoint [ MAX_DEER ] [ 3 ] =
{
	{ 1190.9134, -750.9113, 41.0302 },
	{ 1291.2386, -756.0845, 40.1471 },
	{ 1218.2579, -847.9108, 40.7595 },
	{ 1338.2962, -781.8313, 40.3861 },
	{ 1369.0949, -718.3385, 41.3110 },
	{ 1449.0401, -760.8986, 41.3128 },
	{ 1328.5195, -913.3916, 40.9542 },
	{ 1257.1456, -1028.3773, 40.4320 },
	{ 1339.3642, -1019.3239, 41.2013 },
	{ 1440.9826, -974.0575, 39.5905 },
	{ 1470.1749, -893.8711, 40.4951 },
	{ 1401.0742, -745.1386, 40.8770 },
	{ 1465.4992, -750.1921, 41.2255 },
	{ 1390.2452, -697.0460, 41.3371 },
	{ 1502.5235, -742.1928, 40.9286 },
	{ 1592.8151, -808.0327, 41.4756 },
	{ 1564.1431, -925.2969, 40.0444 },
	{ 1552.5245, -812.3044, 41.8802 },
	{ 1444.5390, -942.9514, 40.6094 },
	{ 1442.9283, -859.5132, 40.8571 }
} ;

new Float:ForestPoint [ MAX_FOREST ] [ 4 ] =
{
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
 	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 },
	{ 1095.7764, -1231.5413, 1753.2166, -641.2542 }
} ;

/*

	Рынок

*/

#define MAX_MARKET 11
new Float: market_seller_pickup [ MAX_MARKET ] [ 3 ] =
{
	{ 2151.9262, -1772.0544, 18.9604 },
	{ 2143.9082, -1771.6112, 18.9616 },
	{ 2135.5373, -1771.6932, 18.9677 },
	{ 2127.9418, -1771.7335, 18.9733 },
	{ 2124.6579, -1782.4707, 18.9757 },
	{ 2124.5551, -1790.7969, 18.9758 },
	{ 2124.5122, -1799.2878, 18.9655 },
	{ 2136.2551, -1785.9608, 18.9849 },
	{ 2144.7170, -1785.7998, 18.9603 },
	{ 2143.7375, -1790.8825, 18.9586 },
	{ 2135.8979, -1790.9492, 18.9698 }
} ;

new Float: market_buyer_pickup [ MAX_MARKET ] [ 3 ] =
{
	{ 2152.1293, -1775.2204, 18.9829 },
	{ 2144.0593, -1775.1112, 18.9615 },
	{ 2135.5756, -1775.2529, 18.9677 },
	{ 2127.8554, -1775.2695, 18.9734 },
	{ 2127.9570, -1782.3037, 18.9733 },
	{ 2128.3710, -1790.9780, 18.9844 },
	{ 2128.2922, -1799.6293, 18.9571 },
	{ 2136.3522, -1782.3806, 18.9671 },
	{ 2144.7177, -1782.3100, 18.9799 },
	{ 2143.9724, -1794.3383, 18.9578 },
	{ 2135.6420, -1794.7032, 18.9537 }
} ;

#define MAX_MARKET_OBJECT 20
enum _market
{
	m_id,
	m_seller_id,
	m_accesories_id [ MAX_MARKET_OBJECT ],
	m_skins_id [ MAX_MARKET_OBJECT ],
	m_object_id [ MAX_MARKET_OBJECT ],
	m_accesories [ MAX_MARKET_OBJECT ],
	m_skins [ MAX_MARKET_OBJECT ],
	m_object [ MAX_MARKET_OBJECT ],
	m_accesories_price [ MAX_MARKET_OBJECT ],
	m_skins_price [ MAX_MARKET_OBJECT ],
	m_object_price [ MAX_MARKET_OBJECT ],
	m_seller_pickup,
	m_buyer_pickup,
	m_area
} ;
new market_info [ MAX_MARKET ] [ _market ] ;

/*

	Jack Car

*/

new model_ls_skill [ ] = { 412, 419, 439, 466, 467, 474, 475, 516, 517, 518, 534, 535, 536, 542, 549 } ;
new Float: model_ls_pos [ 15 ] [ 4 ] =
{
	{ 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 },
	{ -63.9655, 1282.1570, 12.3280, 135.3701 },
	{ -302.2317, 837.3225, 13.4444, 147.5916 },
	{ -2485.2029, 2922.6770, 37.9126, 270.7184 },
	{ -2433.5530, 2883.7871, 38.0209, 179.7215 }
} ;
new bool: ls_place_toggled [ sizeof model_ls_pos ] = { false, ... } ;

new model_sf_skill [ ] = { 400, 405, 421, 426, 445, 458, 507, 550, 551, 555, 558, 559, 560, 565, 579 } ;
new Float: model_sf_pos [ 11 ] [ 4 ] =
{
    { 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 }

} ;
new bool: sf_place_toggled [ sizeof model_sf_pos ] = { false, ... } ;

new model_lv_skill [ ] = { 402, 424, 429, 477, 490, 506, 562, 580 } ;
new Float: model_lv_pos [ 14 ] [ 4 ] =
{
	{ 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 },
	{ -63.9655, 1282.1570, 12.3280, 135.3701 },
	{ -302.2317, 837.3225, 13.4444, 147.5916 },
	{ -2485.2029, 2922.6770, 37.9126, 270.7184 }
} ;
new bool: lv_place_toggled [ sizeof model_lv_pos ] = { false, ... } ;

new model_premium_skill [ ] = { 411, 415, 429, 451, 480, 494, 495, 541 } ;
new Float: model_premium_pos [ 12 ] [ 4 ] =
{
	{ 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 },
	{ -63.9655, 1282.1570, 12.3280, 135.3701 }
} ;
new bool: premium_place_toggled [ sizeof model_premium_pos ] = { false, ... } ;

/*

	airdrop

*/

new air_info [ MAX_POSITION_AIRDROP ] [ _air_info ] =
{
	{ "д. Корякино", { 1075.6875, -1405.0867, 150.1070,	0.0000, 0.0000, 0.0000 }, { 1075.6875, -1405.0867, 40.6672,   0.00, 0.00, 0.00 } },
	{ "острова", { -2563.0915, -2231.3417, 150.4510,	0.0000, 0.0000, 0.0000 }, { -2563.0915, -2231.3417, 12.4565,   0.00, 0.00, 0.00 } },
	{ "г. Арзамас", { -623.6829, 1638.4628, 190.7308,	0.0000, 0.0000, 0.0000 }, { -623.6829, 1638.4628, 17.7989,   0.00, 0.00, 0.00 } }
} ;

/*

	Jack Car (заказ)

*/

new Float: urgent_position [ MAX_URGENT_POSITION ] [ 3 ] =
{
	{ -1106.7509, 2202.9082, 37.9341 },
	{ -1051.6173, 2203.7514, 38.1177 }
} ;

/*

	кража боеприпасов

*/

new army_mats [ MAX_ARMY_MATS ] [ _mats ] =
{
    { 8, 14319, { 1621.9070,1813.7855,16.3077 }, 0, 0 },
	{ 8, 14319, { 1330.7899,1640.7856,16.3250 }, 0, 0 },
	{ 8, 14319, { 1214.3555,1594.3479,16.3558 }, 0, 0 },
	{ 8, 14319, { 1473.2474,1594.4364,16.3594 }, 0, 0 },
	{ 8, 14319, { 1586.0925,1646.1206,15.9701 }, 0, 0 },
	{ 9, 14319, { -1298.2877, 505.6084, 11.1953 }, 0, 0 },
	{ 9, 14319, { -1396.6760, 498.4873, 11.2026 }, 0, 0 },
	{ 9, 14319, { -1255.4607, 449.3180, 7.2065 }, 0, 0 }
} ;

/*

	submarine

*/

new sub_info [ MAX_POSITION_SUBMARINE ] [ _sub_info ] =
{
	{ "г. Лыткарино", { -2785.93726, -86.56967, 4.25420,   0.00000, 0.00000, 0.42000 }, 19379, { -2779.01733, -76.28094, 1.08974,   0.00000, 1000.00000, 0.00000 } },
	{ "г. Арзамас", { -567.31335, 1086.02429, 6.15229,   0.00000, 0.00000, 95.45999 }, 19379, { -575.89258, 1078.91821, 3.86154,   0.00000, 90.00000, 7.50000 } },
	{ "г. Южный", { 1061.22095, -2329.25562, 5.59327,   0.00000, 0.00000, -18.18000 }, 19379, { 1051.85596, -2335.23730, 1.98849,   0.00000, 75.00000, -18.72000 } }
};

new Float:army_container_pos [ MAX_POSITION_SUBMARINE * 2 ] [ 6 ] =
{
	{ -2742.62134, -24.14433, 2.29288,   0.00000, 0.00000, 0.42000 },
	{ -2757.79663, -24.14430, 2.29290,   0.00000, 0.00000, 0.42000 },
	{ -536.19897, 1041.59290, 12.35194,   0.00000, 0.00000, 0.00000 },
	{ -520.46802, 1041.59290, 12.35190,   0.00000, 0.00000, 0.00000 },
	{ 1040.47485, -2303.21802, 3.42987,   0.00000, 0.00000, 73.86005 },
	{ 1040.47485, -2290.56909, 3.63106,   0.00000, 0.00000, 73.86010 }
} ;

new Float: pickup_submarine [ MAX_POSITION_SUBMARINE ] [ 3 ] =
{
	{ -2785.8491, -106.6059, 3.6755 },
	{ -549.3521, 1087.8944, 5.5525 },
	{ 1054.8079, -2348.4790, 5.0038 }
} ;

/*

    Конфискация

*/

new Float: quad_lcn [ 4 ] ;
new Float: quad_rm [ 4 ] ;
new Float: quad_yakuza [ 4 ] ;

new Float: quad_drugs_farm [ 4 ] = { -1238.28125, -1410.15625, -937.5, -886.71875 } ;
new Float: quad_gun_factory [ 4 ] = { -2199.21875, -289.0625, -2078.125, -70.3125 } ;

/*

	Quest

*/

enum actor_quest
{
	actor_skin,
	actor_name [ 24 ],
	
	Float:actor_pos [ 4 ],
	actor_interior,
	actor_world,
	actor_type,
	
	actor_anim [ 32 ],
	actor_anim_lib [ 32 ]
} ;

#define MAX_QUEST_ACTORS 11
new quest_actor [ MAX_QUEST_ACTORS ] [ actor_quest ] =
{
    { 26, "Винстон Буст", { -482.9159, 906.1972, 12.1425, 59.7371 }, 0, 0, 0, "none",  "none" },
	{ 26, "Варфоломеев Буст", { 2657.7715, -1615.6810, 22.4526, 270.8208 }, 0, 0, 0, "none",  "none" },
	{ 26, "Варфоломеев Буст", { 2096.8694, 1857.3972, 15.8055, 177.9579 }, 0, 0, 0, "none",  "none" },
	{ 26, "Винстон Буст", { 460.5936, 1673.3455, 12.1797, 270.5401 }, 0, 0, 0, "none",  "none" },
	{ 175, "Марасиньо Шракур", { 2169.5967, -1687.6171, 15.0859, 342.8485 }, 0, 0, 1, "DEALER",  "DEALER_IDLE" },
	{ 43, "Цветочник Джое", { 1920.3387, 2105.4924, 15.7163, 108.5376 }, 0, 0, 2, "DEALER",  "DEALER_IDLE" },
	{ 113, "Дон Карлеоне", { 1865.2268, 1886.3151, 13.2188, 314.8987 }, 0, 0, 3, "DEALER",  "DEALER_IDLE" },
	{ 47, "Торфин Жёсткий", { -427.6315, 1037.5460, 12.0115, 286.1413 }, 0, 0, 4, "DEALER",  "DEALER_IDLE" },
	{ 46, "Дик Рук Западный", { 1864.0474, 1892.3818, 13.2188, 252.9935 }, 0, 0, 5, "none",  "none" },
	{ 29, "Тощий Пит", { -2812.1596, -670.4925, 8.6173, 180.0989 }, 0, 0, 20, "DEALER",  "DEALER_IDLE" },
	{ 29, "Хантел Чтотокрад", { 2182.3017, -1856.5260, 18.8189, 37.1952 }, 0, 0, 21, "DEALER",  "DEALER_IDLE" }
} ;

new quest_actor_area [ MAX_QUEST_ACTORS ] ;

/*

	miner

*/

new Float: miner_cp [ 11 ] [ 3 ] =
{
	{ -1099.7990, -348.7245, 1395.9835 },
	{ -1100.2843, -352.0152, 1395.9030 },
	{ -1107.6046, -325.6720, 1397.5681 },
	{ -1108.0033, -323.2995, 1397.6132 },
	{ -1127.2749, -311.3306, 1398.1993 },
	{ -1129.9337, -309.7675, 1398.2343 },
	{ -1116.1293, -330.2281, 1409.6229 },
	{ -1115.0909, -324.5461, 1408.9136 },
	{ -1119.7144, -330.4829, 1409.6995 },
	{ -1120.0090, -324.4146, 1408.8445 },
	{ -1118.1940, -369.5938, 1401.2341 }
} ;

new Float: miner_unload_position [ 3 ] = { -1119.4636, -360.9237, 1401.7491 } ;
new Float: miner_zone_position [ 3 ] = { -1119.4636, -360.9237, 1401.7491 } ;

/*

	factory

*/

#define MAX_GUNWORK_TABLE 9

new table_area [ MAX_GUNWORK_TABLE ] ;
new table_area_toggled [ MAX_GUNWORK_TABLE ] ;

new bool:have_factory_box [ MAX_PLAYERS ] = { false, ... },
    factory_table_id [ MAX_PLAYERS char ] = { 0, ... } ;

new factory_take_area ;

new Float: table_areas_pos [ MAX_GUNWORK_TABLE ] [ 3 ] =
{	
	{ 1706.1085, 304.9668, 1401.0000 },
	{ 1708.2327, 318.5704, 1401.0000 },
	{ 1713.7305, 300.5636, 1401.0000 },
	{ 1701.9356, 296.3287, 1401.0000 },
	{ 1691.9495, 293.8544, 1401.0000 },
	{ 1700.1573, 300.9678, 1401.0000 },
	{ 1695.1503, 314.3629, 1401.0000 },
	{ 1709.5289, 296.3645, 1401.0000 },
	{ 1691.9822, 297.2607, 1401.0000 }
} ;

new Float: factory_box_unload [ 3 ] = { 1701.4378, 334.5983, 1401.0000 } ;
new Float: factory_box_position [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;
new Float: factory_take_position [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;
new Float: factory_pickup_boxes [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;
new Float: factory_zone_position [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;

/*

	sawmil

*/

new Float:tree_positions [ 17 ] [ 6 ] = // 618
{
	{ 1494.9351, 2823.2109, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1501.2811, 2808.0549, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1496.6313, 2796.1801, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1496.6522, 2778.8647, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1510.9093, 2772.8237, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1521.7133, 2782.7351, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1525.3884, 2797.5122, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1530.9440, 2813.4729, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1543.1014, 2822.5270, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1560.4030, 2822.6047, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1557.1866, 2811.5534, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1547.8372, 2795.0976, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1544.7932, 2780.7106, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1542.0635, 2766.5407, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1558.9392, 2764.9785, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1567.5589, 2778.3808, 11.6875,   0.00000, 0.00000, 0.00000 },
	{ 1569.9671, 2791.2573, 11.6875,   0.00000, 0.00000, 0.00000 }
} ;

new Float: tree_unload_position [ 3 ] = { 1499.9731, 2868.1442, 11.8671 } ;

/*

	Bank Robbery

*/

new Float: bank_robbery_pick [ MAX_BANKS ] [ 3 ] =
{
    { 980.6726, -476.5360, 1008.9092 },
	{ 979.1316, -475.2167, 1008.9092 },
	{ 979.3150, -471.8606, 1008.9092 }
} ;

new bank_names [ MAX_BANKS ] [ 16 ] =
{
	"Сбер Арзамас",
	"Тинькофф",
	"Сбер Южный"
} ;

new Float: bank_progress_checkpoint [ MAX_BANKS ] [ 3 ] =
{
	{ 1907.7779, -2239.8271, 11.0595 },
	{ 1903.0008, 1722.3802, 15.9925 },
	{ 1903.0008, 1722.3802, 15.9925 }
} ;

new Float: bank_vehicle_pos [ MAX_BANK_GZ ] [ 4 ] =
{
   	{ -2599.1132, 2802.5219, 37.8291, 358.4070 },
	{ -1494.7735, 1544.1082, 36.4899, 270.4045 },
	{ 2485.2744, -201.6959, 2.5809, 168.7185 },
	{ 535.2778, -1229.6591, 40.7058, 161.9521 },
	{ 2315.5058, -2327.3596, 21.9660, 180.4908 },
	{ 153.9726, 1710.2375, 12.1298, 168.7470 }
} ;

new Float: robbery_doors [ MAX_BANKS ] [ 6 ] =
{
    { 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 },
	{ 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 },
	{ 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 }
} ;

/*

	Откат ограбления

*/

#define MAX_ROBBERY_POSITION 2
new Float: robbery_position [ MAX_ROBBERY_POSITION ] [ 3 ] =
{
	{ -1106.7509, 2202.9082, 37.9341 },
	{ -1051.6173, 2203.7514, 38.1177 }
} ;

/*

	Family Quest

*/

new Float: fam_con_buritto [ 4 ] = { 1869.3351, 1900.7021, 13.2229, 275.1915 } ;

new fam_con_pickup ;
new Float: fam_con_position [ 3 ] = { -1783.6271, -1105.7000, 49.1617 } ;
new Float: fam_con_gps [ 2 ] [ 3 ] =
{
	{ -1783.6271, -1105.7000, 49.1617 },
	{ 1836.3229, 2160.9033, 15.6397 }
} ;

new ink_quest_pickup [ 3 ] ;
new Float: ink_quest_enter [ 3 ] [ 3 ] =
{
	{ 1831.1251, 2038.3938, 15.8850 },
	{ 421.5002, 619.5287, 12.0000 },
	{ 2376.5864, -2129.4839, 22.1167 }
} ;

new Float: ink_car_position [ 3 ] [ 4 ] =
{
	{ 1818.4205, 2039.4039, 16.0819, 270.1484 },
	{ 428.0262, 614.2616, 12.0748, 130.3902  },
	{ 2388.4038, -2124.3062, 21.9676, 91.0207 }
} ;

new Float: ink_quest_position [ 3 ] [ 3 ] =
{
	{ 2388.4038, -2124.3062, 21.9676 },
 	{ 1818.4205, 2039.4039, 16.0819 },
	{ 421.5002, 619.5287, 12.0000 }
} ;

/*

	Boxing Spawn

*/

new Float:boxing_spawn [ 3 ] [ 4 ] =
{
	{ 1997.9544, 2010.8920, 1499.3984, 311.9240 },
	{ 2002.1077, 2015.5246, 1499.3984, 110.9596 },
	{ 1994.9169, 2018.1477, 1498.7265, 186.5323 }
} ;

/*

	Cellar

*/

#define cellar_interior 6
new Float: cellar_table_pos [ 3 ] = { 1497.8924, 2499.3320, 1601.0000 } ;
new Float: cellar_text_pos [ 3 ] = { 1500.0668, 2496.2875, 1601.0000 } ;
new Float: cellar_enter_pos [ 4 ] = { 1498.4794, 2503.9855, 1601.0000, 146.0584 } ;
new Float: cellar_player_spawn [ 4 ] = { 1502.6672, 2503.0375, 1601.0000, 129.7407 } ;
new Float: cellar_veh_garage [ 4 ] = { 1499.9361, 2499.7351, 1600.8255, 180.8342 } ;

/*

	Hotel

*/

// чтоб всё было окей у отелей, они должны находиться друг от друга, минимум, в 10и идах (бизнес)

#define MAX_ROOMS   12
new Float:rooms_position [ MAX_ROOMS ] [ 4 ] =
{
	{ -1889.0400, 1983.4067, 1165.4636, 267.3506 },
	{ -1889.0317, 1980.8937, 1165.4636, 266.7804 },
	{ -1889.0377, 1978.3229, 1165.4636, 269.3013 },
	{ -1889.0334, 1975.7653, 1165.4636, 269.3289 },
	{ -1889.0405, 1973.1080, 1165.4636, 268.3386 },
	{ -1889.0308, 1970.5614, 1165.4636, 269.2615 },
	{ -1884.7073, 1970.5327, 1165.4636, 89.7877 },
	{ -1884.7056, 1973.1754, 1165.4636, 90.1290 },
	{ -1884.7108, 1975.7376, 1165.4636, 88.7815 },
	{ -1884.7032, 1978.3273, 1165.4636, 91.2003 },
	{ -1884.7116, 1980.8820, 1165.4636, 89.8233 },
	{ -1884.7021, 1983.4189, 1165.4636, 87.7758 }
} ;

new Float: hotel_exit_pickup [ 4 ] = { -2030.6610, 1973.7435, 1164.0964, 0.8170 } ;
new Float: position_spawn_hotel [ 4 ] = { -2031.3840, 1980.7836, 1164.0964, 168.0294 } ;

/*
	
	Parking
	
*/

#define parking_interior 21
new Float: position_player_parking [ 4 ] = { 941.9621, -29.0439, 787.7415, 278.7233 } ;
new Float: position_text_parking [ 3 ] = { 957.3778, -30.7134, 787.1038 } ;
new Float: position_vehicle_parking [ 4 ] = { 973.6870, -16.0773, 786.6587, 270.6184 } ;

/*

	House

*/

#define HINTS_COUNT 7

enum _house_int
{
	hint_class,
	Float:hint_position [ 4 ],
	Float:hspawn_position [ 4 ],
	hint_int,
	hint_description [ 54 ]
};

new bool: create_pick_house_exit [ HINTS_COUNT ] = { false, ... } ;
new house_int [ HINTS_COUNT ] [ _house_int ] =
{
	{ 3, { 2415.5083, 286.3436, 1401.0000, 355.5837 }, { 2394.2592, 289.1534, 1401.0000, 311.6602 }, 9, "Квартира (Москоу сити)"},
	{ 1, { 1397.7495, 290.2237, 1401.0000, 353.6212 }, { 1391.3106, 298.3734, 1401.0000, 265.4133 }, 8, "2ух этажная квартира"},
	{ 2, { 1397.7495, 290.2237, 1401.0000, 353.6212 }, { 1391.3106, 298.3734, 1401.0000, 265.4133 }, 8, "2ух этажный дом"},
	{ 3, { 2415.5083, 286.3436, 1401.0000, 355.5837 }, { 2394.2592, 289.1534, 1401.0000, 311.6602 }, 9, "Пентхаус, люкс интерьер"},
	{ 1, { 1097.9675, 293.9834, 1401.0000, 354.2443 }, { 1102.1008, 306.5283, 1401.0000, 177.4632 }, 7, "3ёх комнатный дом"},
	{ 0, { 1097.9675, 293.9834, 1401.0000, 354.2443 }, { 1102.1008, 306.5283, 1401.0000, 177.4632 }, 7, "Старая квартира"},
	{ 1, { 1097.9675, 293.9834, 1401.0000, 354.2443 }, { 1102.1008, 306.5283, 1401.0000, 177.4632 }, 7, "Маленькая квартира с ремонтом"}
};

new Float:house_safe_pos [ HINTS_COUNT ] [ 6 ] =
{
	{ 2399.1176, 292.6497, 1401.0000, 0.0000, 0.0000, 90.0 },
	{ 1398.4273, 291.8314, 1401.0000, 0.0000, 0.0000, 180.0 },
	{ 1398.4273, 291.8314, 1401.0000, 0.0000, 0.0000, 0.0 },
	{ 2399.1176, 292.6497, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1101.4908, 306.4855, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1101.4908, 306.4855, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1101.4908, 306.4855, 1401.0000, 0.0000, 0.0000, -90.0 }
};

new Float:house_freeze_pos [ HINTS_COUNT ] [ 6 ] =
{
	{ 2403.1240, 307.4076, 1401.0000, 0.0000, 0.0000, 90.0 },
	{ 1399.8908, 309.5599, 1401.0000, 0.0000, 0.0000, 180.0 },
	{ 1399.8908, 309.5599, 1401.0000, 0.0000, 0.0000, 0.0 },
	{ 2403.1240, 307.4076, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1096.5185, 300.0601, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1096.5185, 300.0601, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1096.5185, 300.0601, 1401.0000, 0.0000, 0.0000, -90.0 }
};

new Float:house_veh_garage [ max_class ] [ 4 ] =
{
	{ 1499.9361, 2499.7351, 1600.8255, 180.8342 },
	{ 1499.9361, 2499.7351, 1600.8255, 180.8342 },
	{ 499.1057, 1991.3969, 1547.9420, 295.9618 },
	{ 499.1057, 1991.3969, 1547.9420, 295.9618 }
} ;

new house_garage_interior [ max_class ] = { 6, 6, 1, 1 } ;
new Float:house_garage_position [ max_class ] [ 4 ] =
{
	{ 1498.4794, 2503.9855, 1601.0000, 146.0584 },
	{ 1498.4794, 2503.9855, 1601.0000, 146.0584 },
	{ 496.4140, 2014.7678, 1547.8515, 177.8924 },
	{ 496.4140, 2014.7678, 1547.8515, 177.8924 }
} ;

new Float:house_garage_text [ max_class ] [ 4 ] =
{
	{ 1500.0668, 2496.2875, 1601.0000, 175.6883 },
	{ 1500.0668, 2496.2875, 1601.0000, 175.6883 },
	{ 493.0792, 1989.0706, 1547.6866, 97.9286 },
	{ 493.0792, 1989.0706, 1547.6866, 97.9286 }
} ;

new Float: house_cellar_position [ 4 ] = { 499.6892, 2496.1872, 1503.7264, 92.6199 } ;
new Float: house_cellar_text [ 3 ] = { 498.1103, 2502.9570, 1500.9956 } ;
#define house_cellar_int 1

#define yacht_interior 11
new Float: yacht_freeze [ 3 ] = { 295.6707, 1002.4004, 999.5312 } ;
new Float: yacht_clothes [ 3 ] = { 300.3798, 994.7538, 999.5312 } ;
new Float: yacht_spawn [ 4 ] = { 301.2443, 997.4320, 999.5312, 72.6010 } ;
new Float: yacht_enter [ 4 ] = { 299.5769, 1005.6893, 999.5386, 176.3741 } ;

/*

	duels
	
*/

new Float: duels_pos [ 6 ] [ 4 ] =
{
	{ 201.8062, 89.8162, 42.9854, 271.7700 },
	{ 85.4893, 91.5027, 42.9854, 90.5370 },
	
	{ 1717.5389, -2557.5913, 11.2748, 2.0126 },
	{ 1711.8566, -2451.0737, 9.5063, 226.0120 },
	
	{ -2414.9753, 1678.7813, 53.0214, 121.9914 },
	{ -2504.8813, 1560.1192, 53.0214, 29.6862 }
} ;

new duels_interior [ 3 ] = { 0, 0, 0 } ;

/*

	Gym

*/

#define gym_interior 5

new bool:SimulatorUse [ MAX_BUSINESS ] [ 5 + 8 + 2 + 3 ] ;

#define max_gym_bike 5
new Float: gym_bike_position [ max_gym_bike ] [ 4 ] =
{
	{ 1992.4897, 2010.7996, 1498.7265, 79.2709 },
	{ 1992.4122, 2012.2374, 1498.7265, 86.2848 },
	{ 1992.4166, 2013.7410, 1498.7265, 62.3246 },
	{ 2007.8300, 2001.5379, 1498.7265, 242.6216 },
	{ 2007.6741, 2002.9858, 1498.7265, 251.2684 }
} ;

#define max_gym_thread 8
new Float: gym_thread_position [ max_gym_thread ] [ 4 ] =
{
	{ 2006.6093, 2004.8414, 1498.7265, 281.7438 },
	{ 2006.5444, 2007.4865, 1498.7265, 270.1540 },
	{ 2006.8149, 2009.8514, 1498.7265, 265.9346 },
	{ 2006.8647, 2012.5960, 1498.7265, 268.3707 },
	{ 1993.4630, 2008.9815, 1498.7265, 89.5462 },
	{ 1993.6064, 2006.2154, 1498.7265, 92.7958 },
	{ 1993.7169, 2003.9088, 1498.7265, 90.4394 },
	{ 1993.7763, 2001.1262, 1498.7265, 90.2000 }
} ;

#define max_gym_bar 3
new Float: gym_bar_position [ max_gym_bar ] [ 4 ] =
{
	{ 2008.1435, 1991.3890, 1498.7265, 183.5687 },
	{ 1997.6160, 2006.6156, 1498.7265, 290.8833 },
	{ 2002.3204, 2006.5960, 1498.7265, 87.4815 }
} ;

#define max_gym_dumbbells 2
new Float: gym_dumbbells_position [ max_gym_dumbbells ] [ 4 ] =
{
	{ 1992.7711, 1991.3720, 1498.7812, 275.2420 },
	{ 1992.8363, 1994.3310, 1498.7812, 253.4648 }
} ;

#define max_gym_pear 2
new Float: gym_pear_position [ max_gym_pear ] [ 3 ] =
{
	{ 2007.6162, 1999.5728, 1498.7265 },
	{ 2007.2841, 1996.5406, 1498.7265 }
} ;

/*

	Vehicles

*/

new vehicle_name [ 212 ] [ 32 ] =
{
	"BMW X6 F16","Alfa Romeo 33","Tesla Model S","DAF XF","Lamborghini LM002","Audi Rs7","BelAZ","Firetruck","Nissan 240SX","Toyota Land Cruiser 200","LADA Priora",
	"Ford Mustang Boss 200", "Dodge Coronet 1967","BMW 535I E34","Gazel","Audi R8","Mercedes-Benz Sprinter Hospital","Leviathan","Volga","Lada Vesta","Vaz 2114","Mercedes-Benz S600","Molniya Maqueen","BMW 750IL E38",
	"Zaporozech","Hunter","Vaz 2107","Chevrolet Camaro ZL1","Chevrolet Camaro ZR1","Mercedes-Benz C63s W205 Coupe","Predator","Bus MAZ","Rhino","KamAZ","Porche Panamera Turbo S","Article Trailer","Ford Sierra R5","Dodge Challenger SRT","Kia Rio",
	"Volvo 244","Pegout 406","RC Bandit","Vaz 2101","Packer","Renault Megane","Kia Stinger","Squalo","Seasparrow","Pizzaboy","Trailer","Article Trailler 2","Dodge SRT Demon","Speeder",
	"Reefer","Tropic","UAZ Hunter","Vaz 2110","Volkswagen Golf II GTI","Cadilac Escalade","Volkswagen Polo","Skimmer","Freeway DPS","Faggio","Bike Skeletone","RC Baron","RC Raider",
	"BMW M5 F90","Skoda Ocvatia","Sanchez","Sparrow","Lada Niva Urban","Quad","Coastguard","Dinghy","Moskvich","Lamborghini Urus","Rustler","Lamborghini Countach","GAZ Tigr","Toyota Camry",
	"Bentley Continental","BMX","GMC Vandura","AZLK 2141","Marquise","Mercedes-Benz 200 W240","Dozer","Maverick","Maverick San-News","Renault Logan","Mercedes-Benz G63","Aston Martin","Nissan Skyline",
	"Jetmax","Buggati Chiron","Mercedes-Benz 6x6","Honda Civic","Maverick Police","Lexus LS 500","Jeep Grand Cherokee SRT8","Daewoo Lanos","RC Goblin","Nissan GTR R35","BMW I8",
	"Mercedes-Benz GT 63 S","Mercedes-Benz ","Porche 911SS","BMW 50D E39","Mercedes-Benz CLS63","Bike","Mountain Bike","Beagle","Cropduster","Stuntplane","Tanker","KamAZ MAZ",
	"Audi 100 c4","Mercedes-Benz C63 AMG","Toyota Mark 2","Shamal","Ducati 848","FCR-900","NGR-500","HPV100","Cement Truck","Towtruck","BMW M2","Lada 2119","ZIL Police",
	"Honda Accord","Forklift","Tractor","Combine Harvester","Subaru Impreza STI","BMW M3","Slamvan","Ford Mustang GT","None","None","Vortex","Kia Ceed","Acura NSX","Tesla Cyber Truck",
	"Toyota Supra","Firetruck LA","Audi RS6","Intruder","Primo","Cargobob","Ferrari La-Ferarri","Sunrise","Mercedes-Benz Maybach S650","Utility Van","Nevada","Yosemite","Windsor","Monster A",
	"Monster B","1111 OKA","Jester","Subaru BRZ","Stratum","Nissan Silvia","Raindance","RC Tiger","Jaguar F-Type","Jeep GrandCherokee V8","Audi Q7","Bandito","None","None",
	"Kart","Mower","Dune","Sweeper","McLaren P1","Mitsubishi Evolution","AT-400","DFT-30","Lexus LS500","Rolls-Royce Wraith","BF-400","Fiat Tinkoff","Tug","Petlor Trailer","Emperor",
	"Wayfarer","Mercedes-Benz CLS63 AMG","Mercedes-Benz GTRK Ritm","Volkswagen Golf STI","None","Article Trailer 3","Andromada","Dodo","RC Cam","Launch","Lada Priora DPS","Police Car(SFPD)",
	"Police Car(LVPD)","UAZ Hunter","Picador","S.W.A.T","Lamborghini Huracan","BMW M8","Glendale Shit","L Trailer","L Trailer A","Baggage Trailer B",
	"Tug Stailers Trailer","Boxville","Farm Trailer","U Trailer"
} ;

stock max_veh_speed ( model )
{
	new _v_speed ;
	switch ( model )
	{
		case 400: _v_speed = 250 ;
		case 401: _v_speed = 186 ;
		case 402: _v_speed = 350 ;
		case 403: _v_speed = 85 ;
		case 404: _v_speed = 201 ;
		case 405: _v_speed = 250 ;
		case 406: _v_speed = 110 ;
		case 407: _v_speed = 113 ;
		case 408: _v_speed = 240 ;
		case 409: _v_speed = 195 ;
		case 410: _v_speed = 195 ;
		case 411: _v_speed = 190 ;
		case 412: _v_speed = 210 ;
		case 413: _v_speed = 232 ;
		case 414: _v_speed = 100 ;
		case 415: _v_speed = 340 ;
		case 416: _v_speed = 170 ;
		case 417: _v_speed = 200 ;
		case 418: _v_speed = 175 ;
		case 419: _v_speed = 193 ;
		case 420: _v_speed = 165 ;
		case 421: _v_speed = 250 ;
		case 422: _v_speed = 440 ;
		case 423: _v_speed = 250 ;
		case 424: _v_speed = 118 ;
		case 425: _v_speed = 170 ;
		case 426: _v_speed = 155 ;
		case 427: _v_speed = 310 ;
		case 428: _v_speed = 315 ;
		case 429: _v_speed = 290 ;
		case 430: _v_speed = 114 ;
		case 431: _v_speed = 106 ;
		case 432: _v_speed = 87 ;
		case 433: _v_speed = 163 ;
		case 434: _v_speed = 315 ;
		case 435: _v_speed = 197 ;
		case 436: _v_speed = 152 ;
		case 437: _v_speed = 270 ;
		case 438: _v_speed = 183 ;
		case 439: _v_speed = 165 ;
		case 440: _v_speed = 240 ;
		case 441: _v_speed = 150 ;
		case 442: _v_speed = 140 ;
		case 443: _v_speed = 160 ;
		case 444: _v_speed = 169 ;
		case 445: _v_speed = 270 ;
		case 446: _v_speed = 200 ;
		case 447: _v_speed = 190 ;
		case 448: _v_speed = 150 ;
		case 449: _v_speed = 306 ;
		case 450: _v_speed = 240 ;
		case 451: _v_speed = 270 ;
		case 452: _v_speed = 190 ;
		case 453: _v_speed = 190 ;
		case 454: _v_speed = 160 ;
		case 455: _v_speed = 130 ;
		case 456: _v_speed = 170 ;
		case 457: _v_speed = 208 ;
		case 458: _v_speed = 180 ;
		case 459: _v_speed = 190 ;
		case 460: _v_speed = 160 ;
		case 461: _v_speed = 190 ;
		case 462: _v_speed = 120 ;
		case 463: _v_speed = 280 ;
		case 464: _v_speed = 75 ;
		case 465: _v_speed = 251 ;
		case 466: _v_speed = 305 ;
		case 467: _v_speed = 210 ;
		case 468: _v_speed = 190 ;
		case 469: _v_speed = 185 ;
		case 470: _v_speed = 137 ;
		case 471: _v_speed = 160 ;
		case 472: _v_speed = 190 ;
		case 473: _v_speed = 156 ;
		case 474: _v_speed = 150 ;
		case 475: _v_speed = 305 ;
		case 476: _v_speed = 241 ;
		case 477: _v_speed = 307 ;
		case 478: _v_speed = 170 ;
		case 479: _v_speed = 220 ;
		case 480: _v_speed = 335 ;
		case 481: _v_speed = 120 ;
		case 482: _v_speed = 150 ;
		case 483: _v_speed = 170 ;
		case 484: _v_speed = 301 ;
		case 485: _v_speed = 209 ;
		case 486: _v_speed = 200 ;
		case 487: _v_speed = 200 ;
		case 488: _v_speed = 166 ;
		case 489: _v_speed = 172 ;
		case 490: _v_speed = 220 ;
		case 491: _v_speed = 295 ;
		case 492: _v_speed = 315 ;
		case 493: _v_speed = 235 ;
		case 494: _v_speed = 420 ;
		case 495: _v_speed = 260 ;
		case 496: _v_speed = 270 ;
		case 497: _v_speed = 250 ;
		case 498: _v_speed = 250 ;
		case 499: _v_speed = 257 ;
		case 500: _v_speed = 172 ;
		case 501: _v_speed = 177 ;
		case 502: _v_speed = 315 ;
		case 503: _v_speed = 307 ;
		case 504: _v_speed = 315 ;
		case 505: _v_speed = 170 ;
		case 506: _v_speed = 320 ;
		case 507: _v_speed = 206 ;
		case 508: _v_speed = 250 ;
		case 509: _v_speed = 140 ;
		case 510: _v_speed = 200 ;
		case 511: _v_speed = 200 ;
		case 512: _v_speed = 87 ;
		case 513: _v_speed = 120 ;
		case 514: _v_speed = 251 ;
		case 515: _v_speed = 163 ;
		case 516: _v_speed = 210 ;
		case 517: _v_speed = 250 ;
		case 518: _v_speed = 280 ;
		case 519: _v_speed = 330 ;
		case 520: _v_speed = 217 ;
		case 521: _v_speed = 200 ;
		case 522: _v_speed = 160 ;
		case 523: _v_speed = 160 ;
		case 524: _v_speed = 160 ;
		case 525: _v_speed = 213 ;
		case 526: _v_speed = 250 ;
		case 527: _v_speed = 190 ;
		case 528: _v_speed = 85 ;
		case 529: _v_speed = 207 ;
		case 530: _v_speed = 160 ;
		case 531: _v_speed = 160 ;
		case 532: _v_speed = 251 ;
		case 533: _v_speed = 255 ;
		case 534: _v_speed = 237 ;
		case 535: _v_speed = 160 ;
		case 536: _v_speed = 372 ;
		case 537: _v_speed = 110 ;
		case 538: _v_speed = 110 ;
		case 539: _v_speed = 251 ;
		case 540: _v_speed = 183 ;
		case 541: _v_speed = 306 ;
		case 542: _v_speed = 170 ;
		case 543: _v_speed = 265 ;
		case 544: _v_speed = 122 ;
		case 545: _v_speed = 265 ;
		case 546: _v_speed = 285 ;
		case 547: _v_speed = 160 ;
		case 548: _v_speed = 197 ;
		case 549: _v_speed = 340 ;
		case 550: _v_speed = 305 ;
		case 551: _v_speed = 260 ;
		
		case 552: _v_speed = 160 ;
		case 553: _v_speed = 200 ;
		case 554: _v_speed = 275 ;
		case 555: _v_speed = 110 ;
		case 556: _v_speed = 170 ;
		case 557: _v_speed = 251 ;
		case 558: _v_speed = 130 ;
		case 559: _v_speed = 210 ;
		case 560: _v_speed = 226 ;
		case 561: _v_speed = 197 ;
		case 562: _v_speed = 210 ;
		case 563: _v_speed = 200 ;
		case 564: _v_speed = 237 ;
		case 565: _v_speed = 321 ;
		case 566: _v_speed = 267 ;
		case 567: _v_speed = 225 ;
		case 568: _v_speed = 170 ;
		case 569: _v_speed = 110 ;
		case 570: _v_speed = 110 ;
		case 571: _v_speed = 90 ;
		case 572: _v_speed = 60 ;
		case 573: _v_speed = 110 ;
		case 574: _v_speed = 184 ;
		case 575: _v_speed = 357 ;
		case 576: _v_speed = 253 ;
		case 577: _v_speed = 200 ;
		case 578: _v_speed = 305 ;
		case 579: _v_speed = 250 ;
		case 580: _v_speed = 290 ;
		case 581: _v_speed = 158 ;
		case 582: _v_speed = 160 ;
		case 583: _v_speed = 170 ;
		case 584: _v_speed = 240 ;
		case 585: _v_speed = 165 ;
		case 586: _v_speed = 296 ;
		case 587: _v_speed = 329 ;
		case 588: _v_speed = 190 ;
		case 589: _v_speed = 265 ;
		case 590: _v_speed = 110 ;
		case 591: _v_speed = 120 ;
		case 592: _v_speed = 200 ;
		case 593: _v_speed = 200 ;
		case 594: _v_speed = 60 ;
		case 595: _v_speed = 190 ;
		case 596: _v_speed = 166 ;
		case 597: _v_speed = 201 ;
		case 598: _v_speed = 251 ;
		case 599: _v_speed = 130 ;
		case 600: _v_speed = 178 ;
		case 601: _v_speed = 110 ;
		case 602: _v_speed = 320 ;
		case 603: _v_speed = 305 ;
		case 604: _v_speed = 231 ;
		case 605: _v_speed = 165 ;
		case 606: _v_speed = 160 ;
		case 607: _v_speed = 160 ;
		case 608: _v_speed = 160 ;
		case 609: _v_speed = 140 ;
		case 610: _v_speed = 160 ;
		case 611: _v_speed = 160 ;
		
		default: _v_speed = 200 ;
	}
	return _v_speed ;
}

/*

	Training

*/

const interior_training = 30 ;
new Float: training_pickup_exit [ max_maps ] [ 4 ] =
{
	{ 60.3501, 615.0355, 1011.0000, 294.3141 },
	{ 337.4527, 752.7503, 1011.0000, 93.7341 }
} ;

/*

	Mafia Factory

*/

new Float:InFactorySF [ ] [ 3 ] =
{
	{ -2157.1682, -248.9834, 36.5156 },
	{ -2157.1736, -247.0755, 36.5156 },
	{ -2160.8301, -247.0759, 36.5156 },
	{ -2160.7249, -248.9828, 36.5156 },
	{ -2164.0405, -248.9827, 36.5156 },
	{ -2164.2017, -247.0761, 36.5156 },
	{ -2167.7698, -247.0759, 36.5156 },
	{ -2167.7573, -248.9828, 36.5156 },
	{ -2171.2109, -248.9825, 36.5156 },
	{ -2171.2607, -247.0756, 36.5156 },
	{ -2174.9988, -247.0750, 36.5156 },
	{ -2174.6753, -248.9835, 36.5156 }
};

new Float:rent_position [ 5 ] [ 3 ] =
{
    { -2155.5325, -264.1970, 36.5156 },
	{ -2158.9153, -264.2672, 36.5156 },
	{ -2162.3665, -264.2671, 36.5156 },
	{ -2165.8293, -264.2680, 36.5156 },
	{ -2169.3394, -264.2683, 36.5156 }
} ;

/*

	Jail

*/

const jail_interior = 1 ;

#define MAX_JAIL_SPAWN 10
new Float:jail_spawn [ MAX_JAIL_SPAWN ] [ 4 ] =
{
	{ 913.7928, 4.3062, 1399.9978, 86.6297 },
	{ 913.9542, 1.4708, 1399.9978, 87.7527 },
	{ 914.3837, -1.3761, 1399.9978, 77.9264 },
	{ 913.8224, -4.5742, 1399.9978, 81.1549 },
	{ 913.9264, -7.4955, 1399.9978, 74.9176 },
	{ 907.7309, -7.2247, 1399.9978, 275.7327 },
	{ 907.6371, -4.6182, 1400.0052, 279.8035 },
	{ 907.5487, -1.5340, 1400.0052, 269.9773 },
	{ 907.2159, 1.1629, 1399.9978, 277.6978 },
	{ 908.0001, 4.3279, 1399.9978, 273.9077 }
} ;

#define MAX_AREA_JAIL 1
new Float:jail_arrest [ MAX_AREA_JAIL ] [ 4 ] =
{
	{ 910.7253, -0.7746, 1400.0052 }
} ;

new Float:exit_jail_player [ 4 ] = { 910.7464, -7.9931, 1400.0052, 1.4404 } ;
/*

	Buy Cars

*/

new player_shop_vehicle [ MAX_PLAYERS ] ;
new player_shop_select [ MAX_PLAYERS char ] ;
new player_shop_list [ MAX_PLAYERS char ] ;

#define car_shop_interior 21

new Float:t_shop_pos [ 11 ] [ 7 ] =
{
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },// transport last
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },// transport donate
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 },// transport donate
	{ 2853.8699, -2566.6111, -0.4129, 318.8221, 2860.7688, -2565.8760, 6.7646 },
	{ 1794.3092, 215.1184, 8.3334, 309.0842, 1807.4655, 215.5959, 10.7542 }
} ;

new Float: player_exit_salon [ 5 ] [ 4 ] =
{
	{ -7.4777, 808.1842, 501.0000, 222.5906 },
	{ -7.4777, 808.1842, 501.0000, 222.5906 },
	{ -7.4777, 808.1842, 501.0000, 222.5906 },
	{ 2437.6696, 1396.0258, 11.6057, 173.9431 },
	{ 1845.8660, 205.2610, 7.8828, 231.0067 }
} ;

// 1,2,3,4,5,6 - auto| 7 - moto | 8 - boat | 9 - air
new Float:t_shop_respawn [ 6 ] [ 5 ] [ 4 ] =
{
	{
		// 1 autosalon | Medium
		{ 2516.7261,-741.3741,12.1817,180.0778 },
		{ 2510.2258,-741.6595,12.1786,179.1435 },
		{ 2503.3591,-741.2247,12.1818,180.6669 },
		{ 2496.5435,-741.8356,12.1810,180.2539 },
		{ 2489.6494,-741.6521,12.1811,180.2325 }
	},
	{
		// 2 autosalon | Premium
		{ 418.1292,400.9328,12.1128,162.1140 },
		{ 423.8583,399.0459,12.1129,162.9944 },
		{ 429.6279,397.1036,12.1127,161.6112 },
		{ 435.5108,395.1590,12.1130,162.2532 },
		{ 441.2678,393.4161,12.1127,162.9778 }
	},
	{
		// 3 autosalon | Medium
		{ 2319.9848, -1818.5169, 22.5263, 89.2557 },
		{ 2308.5075, -1814.4067, 22.5262, 269.4673 },
		{ 2319.9750, -1810.4722, 22.5279, 89.7182 },
		{ 2308.1040, -1806.5782, 22.5278, 269.9608 },
		{ 2320.1657, -1802.6275, 22.5279, 90.6050 }
	},
	{
		// boat
		{ 2853.8699, -2566.6111, -0.4129, 318.8221 },
		{ 2853.8699, -2566.6111, -0.4129, 318.8221 },
		{ 2853.8699, -2566.6111, -0.4129, 318.8221 },
		{ 2853.8699, -2566.6111, -0.4129, 318.8221 },
		{ 2853.8699, -2566.6111, -0.4129, 318.8221 }
	},
	{
		// aircraft
		{ 1782.3496, 185.8615, 8.3323, 320.7852 },
		{ 1798.9061, 172.2416, 8.3323, 321.3466 },
		{ 1815.3430, 158.4985, 8.3323, 319.9428 },
		{ 1831.7932, 144.7311, 8.3323, 317.9775 },
		{ 1835.8468, 183.0257, 8.3323, 321.2060 }
	},
	{
		// casino | Premium
		{ 2516.7261,-741.3741,12.1817,180.0778 },
		{ 2510.2258,-741.6595,12.1786,179.1435 },
		{ 2503.3591,-741.2247,12.1818,180.6669 },
		{ 2496.5435,-741.8356,12.1810,180.2539 },
		{ 2489.6494,-741.6521,12.1811,180.2325 }
	}
} ;

new Float: car_shop_player_position [ 3 ] [ 3 ] = 
{ 
	{ 0.7734, 799.3925, 501.0000 },
	{ 2860.7688, -2565.8760, 3.7646 },
	{ 1807.4655, 215.5959, 7.7542 }
} ;

enum
{
	CLASS_NOPE = 0,
	CLASS_MIDDLE,
	CLASS_HIGH,
	CLASS_LUXURY,
	
	CLASS_DONATE
} ;

enum
{
	TYPE_JEEP = 0,
	TYPE_CUPE,
	TYPE_PICKUP,
	TYPE_SEDAN,
	TYPE_UNIVERSAL,
	TYPE_FURGON,
	TYPE_MOTO,
	TYPE_DONATE,
	TYPE_DONATE_2,
	TYPE_BOAT,
	TYPE_FLYING
} ;

enum _T_SHOP_MODELS
{
	m_id,
	m_class,
	m_type
} ;

new _t_shop_models [ ] [ _T_SHOP_MODELS ] =
{
    { 400, CLASS_LUXURY, TYPE_JEEP },
    { 455, CLASS_NOPE, TYPE_JEEP },
    { 458, CLASS_HIGH, TYPE_JEEP },
    { 470, CLASS_NOPE, TYPE_JEEP },
    //{ 490, CLASS_LUXURY, TYPE_JEEP },
    //{ 499, CLASS_LUXURY, TYPE_JEEP },
    //{ 566, CLASS_LUXURY, TYPE_JEEP },
    //{ 567, CLASS_MIDDLE, TYPE_JEEP },

    //{ 411, CLASS_HIGH, TYPE_CUPE },
    //{ 412, CLASS_HIGH, TYPE_CUPE },
    //{ 415, CLASS_LUXURY, TYPE_CUPE },
    { 424, CLASS_NOPE, TYPE_CUPE },
    //{ 427, CLASS_LUXURY, TYPE_CUPE },
    //{ 428, CLASS_LUXURY, TYPE_CUPE },
    { 429, CLASS_HIGH, TYPE_CUPE },
    { 436, CLASS_HIGH, TYPE_CUPE },
    //{ 451, CLASS_LUXURY, TYPE_CUPE },
    { 457, CLASS_MIDDLE, TYPE_CUPE },
    //{ 477, CLASS_LUXURY, TYPE_CUPE },
    //{ 480, CLASS_LUXURY, TYPE_CUPE },
    { 491, CLASS_LUXURY, TYPE_CUPE },
    //{ 492, CLASS_MIDDLE, TYPE_CUPE },
    //{ 494, CLASS_LUXURY, TYPE_CUPE },
    { 496, CLASS_HIGH, TYPE_CUPE },
    { 502, CLASS_LUXURY, TYPE_CUPE },
    //{ 503, CLASS_LUXURY, TYPE_CUPE },
    { 506, CLASS_LUXURY, TYPE_CUPE },
    { 526, CLASS_HIGH, TYPE_CUPE },
    { 536, CLASS_LUXURY, TYPE_CUPE },
    //{ 541, CLASS_LUXURY, TYPE_CUPE },
    { 543, CLASS_MIDDLE, TYPE_CUPE },
    //{ 549, CLASS_LUXURY, TYPE_CUPE },
    //{ 558, CLASS_NOPE, TYPE_CUPE },
    //{ 560, CLASS_MIDDLE, TYPE_CUPE },
    //{ 562, CLASS_MIDDLE, TYPE_CUPE },
    //{ 565, CLASS_HIGH, TYPE_CUPE },
    //{ 575, CLASS_LUXURY, TYPE_CUPE },
    //{ 580, CLASS_LUXURY, TYPE_CUPE },
    //{ 602, CLASS_LUXURY, TYPE_CUPE },
	
    { 404, CLASS_LUXURY, TYPE_PICKUP },
    //{ 495, CLASS_LUXURY, TYPE_PICKUP },
    { 505, CLASS_LUXURY, TYPE_PICKUP },
    //{ 542, CLASS_LUXURY, TYPE_PICKUP },
	
    { 401, CLASS_HIGH, TYPE_SEDAN },
    //{ 402, CLASS_LUXURY, TYPE_SEDAN },
    { 405, CLASS_MIDDLE, TYPE_SEDAN },
    { 408, CLASS_MIDDLE, TYPE_SEDAN },
    { 410, CLASS_NOPE, TYPE_SEDAN },
    { 413, CLASS_HIGH, TYPE_SEDAN },
    { 418, CLASS_NOPE, TYPE_SEDAN },
    { 420, CLASS_NOPE, TYPE_SEDAN },
    { 421, CLASS_HIGH, TYPE_SEDAN },
    { 423, CLASS_HIGH, TYPE_SEDAN },
    { 426, CLASS_NOPE, TYPE_SEDAN },
    { 434, CLASS_LUXURY, TYPE_SEDAN },
    //{ 437, CLASS_LUXURY, TYPE_SEDAN },
    { 438, CLASS_MIDDLE, TYPE_SEDAN },
    { 439, CLASS_MIDDLE, TYPE_SEDAN },
    { 440, CLASS_MIDDLE, TYPE_SEDAN },
    { 442, CLASS_NOPE, TYPE_SEDAN },
    { 445, CLASS_MIDDLE, TYPE_SEDAN },
    { 456, CLASS_NOPE, TYPE_SEDAN },
    { 459, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 466, CLASS_LUXURY, TYPE_SEDAN },
    { 467, CLASS_MIDDLE, TYPE_SEDAN },
    { 474, CLASS_NOPE, TYPE_SEDAN },
    //{ 475, CLASS_LUXURY, TYPE_SEDAN },
    { 479, CLASS_HIGH, TYPE_SEDAN },
    { 483, CLASS_NOPE, TYPE_SEDAN },
    { 485, CLASS_MIDDLE, TYPE_SEDAN },
    { 489, CLASS_MIDDLE, TYPE_SEDAN },
    { 498, CLASS_HIGH, TYPE_SEDAN },
    { 500, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 504, CLASS_LUXURY, TYPE_SEDAN },
    //{ 507, CLASS_HIGH, TYPE_SEDAN },
    //{ 508, CLASS_LUXURY, TYPE_SEDAN },
    //{ 516, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 518, CLASS_HIGH, TYPE_SEDAN },
    //{ 527, CLASS_NOPE, TYPE_SEDAN },
    //{ 529, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 533, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 540, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 551, CLASS_LUXURY, TYPE_SEDAN },
    //{ 576, CLASS_HIGH, TYPE_SEDAN },
    //{ 579, CLASS_HIGH, TYPE_SEDAN },
    //{ 587, CLASS_LUXURY, TYPE_SEDAN },
    //{ 589, CLASS_MIDDLE, TYPE_SEDAN },
    //{ 603, CLASS_LUXURY, TYPE_SEDAN },
	
    { 545, CLASS_MIDDLE, TYPE_UNIVERSAL },
	
    { 545, CLASS_MIDDLE, TYPE_FURGON },
	
    //{ 522, CLASS_LUXURY, TYPE_MOTO },     
    //{ 521, CLASS_MIDDLE, TYPE_MOTO },  
    { 468, CLASS_NOPE, TYPE_MOTO },  
    //{ 463, CLASS_NOPE, TYPE_MOTO },  
    { 462, CLASS_NOPE, TYPE_MOTO },  
    { 461, CLASS_MIDDLE, TYPE_MOTO },  
    { 471, CLASS_MIDDLE, TYPE_MOTO },
    { 581, CLASS_MIDDLE, TYPE_MOTO },
    { 586, CLASS_MIDDLE, TYPE_MOTO },

    { 446, CLASS_HIGH, TYPE_BOAT },
    { 452, CLASS_HIGH, TYPE_BOAT },
    { 453, CLASS_HIGH, TYPE_BOAT },
    { 454, CLASS_HIGH, TYPE_BOAT },
    { 472, CLASS_HIGH, TYPE_BOAT },
    { 473, CLASS_HIGH, TYPE_BOAT },
    { 493, CLASS_HIGH, TYPE_BOAT },

    { 469, CLASS_HIGH, TYPE_FLYING },
    { 447, CLASS_HIGH, TYPE_FLYING },
    { 487, CLASS_HIGH, TYPE_FLYING },
    { 513, CLASS_HIGH, TYPE_FLYING },
    { 593, CLASS_HIGH, TYPE_FLYING },
	
    { 411, CLASS_DONATE, TYPE_DONATE },
    { 412, CLASS_DONATE, TYPE_DONATE },
    { 415, CLASS_DONATE, TYPE_DONATE },
	{ 466, CLASS_LUXURY, TYPE_DONATE },
    { 480, CLASS_DONATE, TYPE_DONATE },
	{ 490, CLASS_DONATE, TYPE_DONATE },
    { 503, CLASS_DONATE, TYPE_DONATE },
	{ 542, CLASS_DONATE, TYPE_DONATE },
	{ 603, CLASS_DONATE, TYPE_DONATE },
	
	{ 475, CLASS_LUXURY, TYPE_DONATE_2 },
    { 477, CLASS_DONATE, TYPE_DONATE_2 },
    { 494, CLASS_DONATE, TYPE_DONATE_2 },
	{ 495, CLASS_DONATE, TYPE_DONATE_2 },
	{ 463, CLASS_LUXURY, TYPE_DONATE_2 },
	{ 444, CLASS_DONATE, TYPE_DONATE_2 }
} ;

#define MAX_T_SHOP_MODELS 100
new t_shop_models [ MAX_T_SHOP_MODELS ] [ 11 ] ;

stock GetModelPrice ( model )
{
 	new model_price ;
 	switch ( model )
 	{
	    // Вертолёты
		case 447: model_price = 15000000; // Seasparrow
		case 469: model_price = 20000000; // Sparrow
		case 487: model_price = 30000000; // Maverick
		case 488: model_price = 30000000; // Maverick San-News
	    case 497: model_price = 15000000; // Maverick Police
		case 563: model_price = 100000; // Raindance
		case 417: model_price = 100000; // Leviathan
		case 548: model_price = 100000; // Cargobob

		// Самолёты
	    case 519: model_price = 100000; // Shamal
		case 592: model_price = 100000; // Andromada
        case 593: model_price = 100000; // Dodo 
		case 553: model_price = 100000; // Nevada
		case 460: model_price = 100000; // Skimmer
		case 476: model_price = 100000; // Rustler
		case 577: model_price = 100000; // AT-400
		case 511: model_price = 100000; // Beagle
        case 512: model_price = 100000; // Cropduster
        case 513: model_price = 100000; // Stuntplane
		
		// Лодки
		case 446: model_price = 1700000; // Squalo
		case 452: model_price = 7500000; // Speeder
		case 453: model_price = 5000000; // Reefer
		case 454: model_price = 15000000; // Tropic
		case 473: model_price = 1500000; // Dinghy
		case 472: model_price = 4100000; // Coastguard
		case 493: model_price = 1000000; // Jetmax
		case 484: model_price = 6000000; // Marquise
        case 595: model_price = 100000; // Launch
        case 430: model_price = 100000; // Predator

		
		// Мотоциклы
		case 462: model_price = 100000; // Faggio
		case 463: model_price = 1750000; // Bike Skeletone
		case 581: model_price = 100000; // BF-400
        case 521: model_price = 900000; // FCR-900
        case 522: model_price = 2500000; // NRG-500
        case 523: model_price = 100000; // HPV100
		case 468: model_price = 100000; // Sanchez
		case 471: model_price = 100000; // Quad
		case 586: model_price = 100000; // Wayfarer
		case 448: model_price = 100000; // Pizzaboy

		
		// Велосипеды
		case 509: model_price = 100000; // Bike 
        case 510: model_price = 100000; // Mountain Bike
		case 481: model_price = 400000; // BMX
		
		// ППС
        case 528: model_price = 100000; // ZIL Police
		case 599: model_price = 100000; // УАЗ Хантер 
		
		// ДПС
		case 461: model_price = 100000; // Freeway DPS
		case 596: model_price = 100000; // Lada Priora DPS

        // Радио
		case 588: model_price = 100000; // Mercedes-Benz GTRK Ritm
		
		// Такси
		case 419: model_price = 900000; // Lada Vesta
		case 444: model_price = 800000; // Renault Megane

		// ФСБ
		case 409: model_price = 5465000; // Toyota Land Cruiser 200
		case 517: model_price = 1800000; // Mercedes-Benz C63 AMG

        // Развозчик продуктов
		case 414: model_price = 120000; // GAZEL

		// Армия
		case 433: model_price = 900000; // KamAZ
		case 478: model_price = 8000000; // GAZ Tigr

        // Автобус
		case 431: model_price = 230000; // Bus MAZ
		
		// Скорая помощь
		case 416: model_price = 100000; // Mercedes-Benz Sprinter Hospital
		
		// Инкассатор
		case 582: model_price = 100000; // Fiat Tinkoff
		
		// Фуры дальнобойщиков
		case 403: model_price = 4300000; // DAF XF
		case 515: model_price = 7000000; // KamAZ MAZ
		
		case 400: model_price = 2200000; // BMW X6 F16
		case 401: model_price = 125000; // Alfa Romeo 33
		case 402: model_price = 11000000; // Tesla Model S
		case 404: model_price = 30000000; // Lamborghini LM002
		case 405: model_price = 10300000; // Audi Rs7
		case 408: model_price = 700000; // Nissan 240SX
		case 410: model_price = 424900; // LADA Priora
		case 411: model_price = 450000; // Ford Mustang Boss 200
		case 412: model_price = 6250000; // Dodge Coronet 1967
		case 413: model_price = 250000; // BMW 535I E34
		case 415: model_price = 11200000; // Audi R8
		case 418: model_price = 140000; // Volga
		case 420: model_price = 108000; // Vaz 2114	
		case 421: model_price = 6500000; // Mercedes-Benz S600
		case 422: model_price = 9000000; // Molniya Maqueen
		case 423: model_price = 168000; // BMW 750IL E38
		case 424: model_price = 80000; // Zaporozech
		case 426: model_price = 86000; // Vaz 2107
		case 427: model_price = 10600000; // Chevrolet Camaro ZL1
		case 428: model_price = 12600000; // Chevrolet Corvette 
		case 429: model_price = 8110000; // Mercedes-Benz C63s W205 Coupe
		case 434: model_price = 6500000; // Porche Panamera Turbo S
		case 436: model_price = 200000; // Ford Sierra R5
		case 437: model_price = 11000000; // Dodge Challenger SRT
		case 438: model_price = 1200000; // Kia Rio
		case 439: model_price = 60000; // Volvo 244
		case 440: model_price = 75000; // Pegout 406
		case 442: model_price = 25000; // Vaz 2101
		case 445: model_price = 2700000; // Kia Stinger
		case 451: model_price = 6500000; // Dodge SRT Demon
		case 455: model_price = 765000; // UAZ Hunter
		case 456: model_price = 122000; // Vaz 2110
		case 457: model_price = 220000; // Volkswagen Golf II GTI
		case 458: model_price = 11500000; // Cadilac Escalade
		case 459: model_price = 1160000; // Volkswagen Polo
		case 466: model_price = 9400000; // BMW M5 F90 
		case 467: model_price = 1670000; // Skoda Ocvatia
		case 470: model_price = 500000; // Lada Niva Urban
		case 474: model_price = 50000; // Moskvich
		case 475: model_price = 16500000; // Lamborghini Urus
		case 477: model_price = 15000000; // Lamborghini Countach
		case 479: model_price = 3800000; // Toyota Camry 3.5
		case 480: model_price = 29900000; // Bentley Continental
		case 482: model_price = 40000; // GMC Vandura
		case 483: model_price = 120000; // AZLK 2141
		case 485: model_price = 599000; // Mercedes-Benz 200 W240
		case 489: model_price = 1100000; // Renault Logan
		case 490: model_price = 14000000; // Mercedes-Benz G63
		case 491: model_price = 17500000; // Aston Martin DBS
		case 492: model_price = 800000; // Nissan Skyline R34
		case 494: model_price = 70000000; // Buggati Chiron
        case 495: model_price = 28660000; // Mercedes-Benz 6x6
        case 496: model_price = 800000; // Honda Civic
        case 498: model_price = 11000000; // Lexus LS 500
        case 499: model_price = 3900000; // Jeep Grand Cherokee SRT8
        case 500: model_price = 80000; // Daewoo Lanos
        case 502: model_price = 6000000; // Nissan GTR R35
        case 503: model_price = 11500000; // BMW I8
        case 504: model_price = 20000000; // Mercedes-Benz GT 63S
        case 505: model_price = 3200000; // Mercedes-Benz X-Class
        case 506: model_price = 9100000; // Porche 911SS
        case 507: model_price = 200000; // BMW 50D E39
        case 508: model_price = 5400000; // Mercedes-Benz CLS63
        case 516: model_price = 120000; // Audi 100 c4
        case 518: model_price = 190000; // Toyota Mark 2
        case 520: model_price = 515000; // Ducati 848
        case 526: model_price = 6300000; // BMW M2
        case 527: model_price = 50000; // Lada 2119
        case 529: model_price = 1100000; // Honda Accord
        case 533: model_price = 3700000; // Subaru Impreza STI
        case 534: model_price = 8900000; // BMW M3
        case 536: model_price = 1350000; // Ford Mustang GT
        case 540: model_price = 2200000; // Kia Ceed
        case 541: model_price = 21000000; // Acura NSX
        case 542: model_price = 13600000; // Tesla CyberTruck
        case 543: model_price = 1900000; // Toyota Supra A80
        case 545: model_price = 9800000; // Audi RS6
        case 549: model_price = 70000000; // Ferrari La-Ferarri
        case 551: model_price = 40000000; // Mercedes-Benz Maybach S650
        case 556: model_price = 50000000; // Monster A
        case 557: model_price = 50000000; // Monster B
		case 558: model_price = 40000; // 1111 OKA
        case 560: model_price = 2700000; // Subaru BRZ
        case 562: model_price = 600000; // Nissan Silvia
        case 565: model_price = 2700000; // Jaguar F-Type
        case 566: model_price = 4000000; // Jeep GrandCherokee V8
        case 567: model_price = 6000000; // Audi Q7
        case 575: model_price = 80000000; // McLaren P1
        case 576: model_price = 2100000; // Mitsubishi Evolution
        case 579: model_price = 12000000; // Lexus LS500
        case 580: model_price = 90000000; // Rolls-Royce Wraith
        case 587: model_price = 6700000; // Mercedes-Benz CLS63 AMG
        case 589: model_price = 2500000; // Volkswagen Golf STI
        case 602: model_price = 100000000; // Lamborghini Huracan
        case 603: model_price = 14000000; // BMW M8
		
		// Samp Standart
		case 406: model_price = 450000; // BelAZ
		case 609: model_price = 100000; // Boxville
        case 597: model_price = 100000; // Police Car(SFPD)
        case 598: model_price = 100000; // Police Car(LVPD)
        case 600: model_price = 100000; // Picador
        case 601: model_price = 100000; // S.W.A.T
		case 578: model_price = 100000; // DFT-30
		case 604: model_price = 100000; // Glendale Shit
		case 585: model_price = 100000; // Emperor
		case 571: model_price = 100000; // Kart
        case 572: model_price = 100000; // Mower
        case 573: model_price = 100000; // Dune
        case 574: model_price = 100000; // Sweeper
		case 552: model_price = 100000; // Utility Van
		case 555: model_price = 100000; // Windsor
		case 407: model_price = 7500000; // Firetruck
		case 561: model_price = 100000; // Stratum
		case 530: model_price = 100000; // Forklift
        case 531: model_price = 100000; // Tractor
        case 532: model_price = 100000; // Combine Harvester
	    case 435: model_price = 100000; // Article Trailer
		case 550: model_price = 100000; // Sunrise
		case 568: model_price = 100000; // Bandito
		case 546: model_price = 100000; // Intruder
        case 547: model_price = 100000; // Primo
        case 559: model_price = 100000; // Jester
		case 514: model_price = 100000; // Tanker
		case 539: model_price = 100000; // Vortex
		case 535: model_price = 100000; // Slamvan
        case 544: model_price = 100000; // Firetruck LA
		case 486: model_price = 100000; // Dozer
		case 443: model_price = 100000; // Packer
        case 554: model_price = 100000; // Yosemite

		// NonSpawn, Trailers, RC и т.д.
		case 605: model_price = 100000; // L Trailer
        case 606: model_price = 100000; // L Trailer A
        case 607: model_price = 100000; // Baggage Trailer B
        case 608: model_price = 100000; // Tug Stailers Trailer
        case 610: model_price = 100000; // Farm Trailer
		case 590: model_price = 100000; // None
		case 591: model_price = 100000; // Article Trailer 3
		case 564: model_price = 100000; // RC Tiger
		case 594: model_price = 100000; // RC Cam
		case 583: model_price = 100000; // Tug
        case 584: model_price = 100000; // Petlor Trailer
		case 569: model_price = 100000; // None
        case 570: model_price = 100000; // None
		case 501: model_price = 100000; // RC Goblin
		case 441: model_price = 100000; // RC Bandit
		case 425: model_price = 100000; // Hunter
		case 449: model_price = 100000; // Trailer
		case 450: model_price = 100000; // Article Trailler 2
		case 464: model_price = 100000; // RC Baron
		case 465: model_price = 100000; // RC Raider

		default: model_price = 0;
 	}
 	return model_price;
}

new model_business [ 3 ] [ 15 ] =
{
	{ 401, 405, 408, 410, 413, 423, 438, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 582, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 414, 514, 515, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
} ;

new model_change [ 10 ] [ 15 ] =
{
	{ 461, 528, 596, 599, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 409, 461, 517, 528, 596, 599, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 409, 517, 579, 487, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 416, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 405, 408, 413, 423, 482, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 405, 408, 413, 423, 482, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

	{ 548, 433, 478, 487, 431, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 548, 433, 478, 487, 431, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 588, 487, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 409, 517, 579, 487, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
} ;

/*

	Tuning

*/

new Float: tuning_camera_positions [ 2 ] [ 12 ] [ 6 ] =
{
	{
	    { -197.1585,171.6603,1206.0000, -202.3425,169.8239,1201.0734 }, //цвет/дефолт
		{ -197.1585,171.6603,1206.0000, -202.3425,169.8239,1201.0734 }, //покрасочные работы
		{ -207.8931,172.9828,1206.0000, -202.3425,169.8239,1201.0734 }, //выхлоп
		{ -198.9032,167.0161,1206.0000, -202.3425,169.8239,1201.0734 }, //кенгурятник
		{ -198.9032,167.0161,1206.0000, -202.3425,169.8239,1201.0734 }, //Крыша
		{ -196.9078,168.2502,1201.0000, -202.3425,169.8239,1201.0734 }, //передний бампер
		{ -207.8931,172.9828,1206.0000, -202.3425,169.8239,1201.0734 }, //задний бампер
		{ -207.8931,172.9828,1206.0000, -202.3425,169.8239,1201.0734 }, //спойлер
		{ -198.9032,167.0161,1206.0000, -202.3425,169.8239,1201.0734 }, //боковые юбки
		{ -198.9032,167.0161,1206.0000, -202.3425,169.8239,1201.0734 }, //колёса
		{ -198.9032,167.0161,1206.0000, -202.3425,169.8239,1201.0734 }, //Гидравлика
		{ -207.8931,172.9828,1206.0000, -202.3425,169.8239,1201.0734 } // Нитро
	},
	{
		{ -198.6777,164.4617,1206.0000, -202.5693,161.1509,1201.0764 }, //цвет/дефолт
		{ -198.6777,164.4617,1206.0000, -202.5693,161.1509,1201.0764 }, //покрасочные работы
		{ -208.9037,161.5008,1206.0000, -202.5693,161.1509,1201.0764 }, //выхлоп
		{ -197.2849,160.4412,1206.0000, -202.5693,161.1509,1201.0764 }, //кенгурятник
		{ -197.2849,160.4412,1206.0000, -202.5693,161.1509,1201.0764 }, //Крыша
		{ -197.8618,162.5383,1201.0000, -202.5693,161.1509,1201.0764 }, // передний бампер
		{ -208.9037,161.5008,1206.0000, -202.5693,161.1509,1201.0764 }, //задний бампер
		{ -208.9037,161.5008,1206.0000, -202.5693,161.1509,1201.0764 }, //спойлер
		{ -197.2849,160.4412,1206.0000, -202.5693,161.1509,1201.0764 }, //боковые юбки
		{ -197.2849,160.4412,1206.0000, -202.5693,161.1509,1201.0764 }, //колёса
		{ -197.2849,160.4412,1206.0000, -202.5693,161.1509,1201.0764 }, //Гидравлика
		{ -208.9037,161.5008,1206.0000, -202.5693,161.1509,1201.0764 } // Нитро
	}
} ;
 
new Float: tuning_position [ 2 ] [ 4 ] =
{
    { -202.3425, 169.8239, 1201.0734, 254.9382 },
	{ -202.5693, 161.1509, 1201.0764, 286.5285 }
} ;

new Float: position_text_exit_tuning [ 2 ] [ 3 ] =
{
	{ -199.0709, 174.9819, 1201.0000 },
	{ -199.0709, 174.9819, 1201.0000 }
} ;

#define tuning_interior			24

#define type_default_tuning 	1
#define type_perfromance 		2
#define type_pantera_security	3

enum _tuning
{
	Float: t_pos [ 3 ],
	Float: t_exit_pos [ 4 ],
	t_b_id,
	t_type,
	t_area
} ;

#define MAX_BUSINESS_TUNING 6
new Float: tuning_info [ MAX_BUSINESS_TUNING ] [ _tuning ] =
{
	{ { 2429.2937, -2307.0330, 21.9400 }, { 2425.7493, -2301.6592, 22.0140, 91.6745 }, 1, type_default_tuning },
	{ { -2015.7323, -158.9904, 29.2034 }, { -2017.3889, -152.6859, 29.2763, 78.6954 }, 2, type_default_tuning },
	{ { 2346.6987, -2610.1125, 21.7845 }, { 2348.7939, -2625.4025, 22.1669, 347.8219 }, 120, type_default_tuning },
	
	{ { 2466.3884, 323.2685, 29.4920 }, { 2460.4680, 318.8875, 29.8994, 198.9520 }, 3, type_perfromance },
	{ { 221.5415, 1479.5183, 11.9219 }, { 219.4406, 1485.2623, 11.9971, 83.2117 }, 110, type_perfromance },
	
	{ { -352.7830, 340.4959, 12.6250 }, { -366.7623, 335.6057, 12.7000, 2.5296 }, 4, type_pantera_security }
} ;

stock switch_camera ( playerid, cam_pos, select_cam )
{
	new _position ;
	if ( p_t_info [ playerid ] [ tune_pos ] [ 0 ] ) _position = 0 ;
	else _position = 1 ;
    InterpolateCameraPos ( playerid, tuning_camera_positions [ _position ] [ cam_pos ] [ 0 ], tuning_camera_positions [ _position ] [ cam_pos ] [ 1 ], tuning_camera_positions [ _position ] [ cam_pos ] [ 2 ], tuning_camera_positions [ _position ] [ select_cam ] [ 0 ], tuning_camera_positions [ _position ] [ select_cam ] [ 1 ], tuning_camera_positions [ _position ] [ select_cam ] [ 2 ], 10000, CAMERA_MOVE ) ;
	InterpolateCameraLookAt ( playerid, tuning_camera_positions [ _position ] [ cam_pos ] [ 3 ], tuning_camera_positions [ _position ] [ cam_pos ] [ 4 ], tuning_camera_positions [ _position ] [ cam_pos ] [ 5 ], tuning_camera_positions [ _position ] [ select_cam ] [ 3 ], tuning_camera_positions [ _position ] [ select_cam ] [ 4 ], tuning_camera_positions [ _position ] [ select_cam ] [ 5 ], 10000, CAMERA_MOVE ) ;
	return 1 ;
}

/*

	Hospital
			
*/

new player_death_id [ MAX_PLAYERS ] ;

new Float:hospital_spawn [ 4 ] [ 4 ] =
{
	{ 1786.1586, -130.7799, 1400.9849, 168.8627 },
	{ 1786.0537, -146.1514, 1400.9849, 355.1973 },
	{ 1796.2896, -142.6599, 1400.9849, 141.1933 },
	{ 1796.0621, -133.7328, 1400.9849, 40.6281 }
} ;

#define H_BED_AMOUNT 12
new player_use_bed_world [ MAX_PLAYERS char ] ;
new player_use_bed [ MAX_PLAYERS char ] ;
new hospital_area [ H_BED_AMOUNT ] ;
new bool: h_bed_toggled [ H_BED_AMOUNT ] [ 3 ] ;
new Float:h_bed_position [ H_BED_AMOUNT ] [ 4 ] =
{	
	{ 1792.7237, -129.7092, 1401.8052, 284.0781 },
	{ 1797.3725, -130.1002, 1401.8052, 268.8907 },
	{ 1797.7792, -146.6145, 1401.8052, 103.9290 },
	{ 1792.9852, -145.9605, 1401.8052, 88.3830 },
	{ 1789.1832, -141.8487, 1401.8052, 172.8151 },
	{ 1789.3181, -146.0430, 1401.8052, 353.6228 },
	{ 1783.4093, -145.6264, 1401.8052, 173.2580 },
	{ 1783.6707, -142.1018, 1401.8052, 6.1570 },
	{ 1783.2980, -134.4489, 1401.8052, 3.1922 },
	{ 1783.5898, -130.2143, 1401.8052, 189.4622 },
	{ 1789.1549, -130.2401, 1401.8052, 179.1817 },
	{ 1789.1381, -134.1786, 1401.8052, 339.0032 }
} ;

/*

	army hospital

*/

#define army_interior	18
new Float:army_hospital_spawn [ 4 ] = { -1413.0517, 304.2385, 1401.0000, 262.0823 } ;

/*

	army gate

*/

new army_gate [ 5 ] ;
new bool: armdoor [ 2 ] = false ;
new Float:army_gate_controler_pos [ 5 ] [ 3 ] =
{
	{ 1891.72168, 1722.09558, 16.17106 },
	{ 141.8920, 1947.0181, 19.3628 },
	{ 277.1204, 1827.4163, 17.6406 },
	{ 290.2414, 1815.2545, 17.6406 },
    { -1527.1021, 481.7894, 7.2660 }
} ;

/*

	Exam

*/

#define vehicle_exam_drive	426
#define vehicle_exam_boat 	473
#define vehicle_exam_fly	487

#define int_exam_drive		1
#define virt_exam_drive		1

#define int_exam_boat		1
#define virt_exam_boat		1

#define int_exam_fly		1
#define virt_exam_fly		1

new exam_cp_number [ MAX_PLAYERS char ] ;
new bool: exam_start [ MAX_PLAYERS ] ;
new exam_vehicle [ MAX_PLAYERS ] ;
new Float:ds_checkpoints [ 33 ] [ 3 ] =
{
	{ 1897.6697, 2246.5720, 15.4017 },
	{ 1882.1855, 2229.3115, 15.5082 },
	{ 1768.4443, 2215.5408, 15.5126 },
	{ 1782.8396, 2052.4355, 15.5422 },
	{ 1962.0815, 2012.6504, 15.5236 },
	{ 1977.7338, 1901.6615, 15.1380 },
	{ 2216.2185, 1903.1713, 15.5180 },
	{ 2363.6375, 1928.9557, 15.5321 },
	{ 2346.9924, 2128.3076, 11.8548 },
	{ 2346.6262, 2323.9797, 11.8548 },
	{ 2283.0674, 2346.7456, 11.8548 },
	{ 2164.5208, 2355.4858, 11.8629 },
	{ 2088.5000, 2469.9783, 13.3981 },
	{ 2067.6267, 2569.9678, 13.3447 },
	{ 2075.9045, 2567.6853, 13.3448 },
	{ 2028.9202, 2532.0583, 13.3448 },
	{ 1970.7991, 2588.4111, 13.9803 },
	{ 1922.3638, 2674.1267, 14.8242 },
	{ 2033.6453, 2832.6362, 13.8207 },
	{ 2075.0571, 2944.1682, 11.5131 },
	{ 2056.2258, 2967.7917, 11.9647 },
	{ 1797.8000, 2967.6516, 11.6145 },
	{ 1782.2489, 2937.6563, 11.7077 },
	{ 1775.9072, 2842.2075, 11.7167 },
	{ 1599.5195, 2842.1682, 11.7157 },
	{ 1778.9358, 2837.3215, 11.6993 },
	{ 1800.8418, 2952.6277, 11.6145 },
	{ 2069.3164, 2942.8291, 11.4694 },
	{ 1873.0796, 2629.9368, 14.8229 },
	{ 1831.7207, 2389.1204, 15.5571 },
	{ 1887.2543, 2284.8723, 15.5676 },
	{ 1903.5026, 2246.5564, 15.3292 },
	{ 1932.4703, 2249.0227, 15.3255 }
} ;

new Float:bs_checkpoints [ 17 ] [ 3 ] =
{
	{ 2852.3945, -2546.0815, -0.0830 },
	{ 2876.6980, -2569.6550, -0.4391 },
	{ 2903.7793, -2653.2397, -0.7401 },
	{ 2866.3704, -2766.0601, 0.4409 },
	{ 2725.4351, -2817.4866, 0.3810 },
	{ 2557.2686, -2820.2878, -0.3937 },
	{ 2402.3982, -2827.2542, -0.4509 },
	{ 2265.1157, -2831.6165, -0.6667 },
	{ 2153.9175, -2826.9246, -0.7116 },
	{ 2058.6406, -2857.1353, -0.3866 },
	{ 2153.5061, -2905.1411, 0.2480 },
	{ 2303.5552, -2900.6953, -0.2531 },
	{ 2416.8809, -2904.4617, 0.1782 },
	{ 2507.0242, -2913.5713, 0.4829 },
	{ 2636.3132, -2912.9216, 0.4158 },
	{ 2815.9246, -2875.0569, -0.8249 },
	{ 2845.3953, -2549.0569, -0.1445 }
} ;

new Float:ps_checkpoints [ 15 ] [ 3 ] =
{
	{ 1858.5020, 212.0582, 115.3868 },
	{ 1805.7715, 429.1734, 126.5238 },
	{ 1757.0668, 688.3719, 123.5294 },
	{ 1751.1394, 1181.7412, 106.1125 },
	{ 1484.4012, 1407.5286, 105.5369 },
	{ 1146.9193, 1199.1251, 105.0154 },
	{ 980.7827, 956.0674, 110.4021 },
	{ 808.2227, 741.7266, 106.3817 },
	{ 893.6891, 503.0087, 113.0904 },
	{ 1168.2244, 407.9733, 124.8170 },
	{ 1401.4301, 301.8726, 145.4609 },
	{ 1618.2480, 140.1903, 140.6468 },
	{ 1752.1870, 99.6070, 122.8391 },
	{ 1844.9404, 137.8696, 79.8629 },
	{ 1876.2151, 148.1551, 14.0823 }
} ;

new Float: exam_start_pos [ 3 ] [ 4 ] =
{
	{ 0.0, 0.0, 0.0, 0.0 },
	{ 2836.4966, -2546.8652, -0.1317, 273.3148 },
	{ 1847.3391, 129.9388, 8.3330, 319.9091 }
} ;
new Float: autoschool_exam_pos [ 3 ] = { 5.0771, 11.7030, 1731.1362 } ;
new Float: autoschool_parking_pos [ 3 ] = { 1919.6520, 2228.3386, 15.7109 } ;

new Float: exam_player_pos [ 4 ] = { -31.8521, -0.3679, 1730.9799, 349.3462 } ;

/*

	Кости

*/

#define MAX_BONE 3
new Float: dice_positions [ MAX_BONE ] [ 3 ] =
{
	{ -126.4065, -35.2416, 1298.72651 },
	{ -121.8388, -32.4263, 1298.7265 },
	{ -111.9764, -35.2842, 1298.7265 }
} ;

/*

	Рулетка

*/

#define MAX_ROULETTE 1
new Float: roulette_positions [ MAX_ROULETTE ] [ 6 ] =
{
	{ 2001.97058, 955.33722, 1019.87030,   0.00000, 0.00000, -90.00000 }
} ;

/*new Float: drum_positions [ MAX_ROULETTE ] [ 6 ] =
{
	{ 2003.31763, 955.52991, 1019.83093,   0.00000, 0.00000, 0.00000 }
} ;*/

/*

		CAMIKAZE
		
*/

#define cm_count 2
new cm_area [ cm_count ] ;
new Float: cm_coord [ cm_count ] [ 3 ] =
{
	{ -112.0443, -34.0013, 1301.1093 },
	{ -115.7074, -34.3554, 1301.1093 }
} ;

#define binary_count 1
new binary_area [ binary_count ] ;
new Float: binary_coord [ binary_count ] [ 3 ] =
{
	{ -118.6941, -34.0919, 1301.1093 }
} ;

#define roulette_count 1
new roulette_area [ roulette_count ] ;
new Float: roulette_coord [ roulette_count ] [ 3 ] =
{
	{ -122.2499, -34.2086, 1301.1093 }
} ;

#define MAX_CASINO_CAR 9
new casino_car [ MAX_CASINO_CAR ] = { 405, 495, 415, 426, 466, 458, 451, 500, 551 } ;

/*

	ворота/шлагбаумы

*/

#define MAX_BARRIERS 3
new bool: barrier_status [ MAX_BARRIERS ] ;
new barrier_area [ MAX_BARRIERS ] ;
new barrier_object [ MAX_BARRIERS ] ;
new Float: barrier_pos [ MAX_BARRIERS ] [ 2 ] [ 6 ] =
{
	{ { -1.0, -1.0, -10000.0, 0.0, 0.0, 0.0 }, { -1.0, -1.0, -10000.0, 0.0, 0.0, 0.0 } },
	{ { -1.0, -1.0, -10000.0, 0.0, 0.0, 0.0 }, { -1.0, -1.0, -10000.0, 0.0, 0.0, 0.0 } },
	{ { -1.0, -1.0, -10000.0, 0.0, 0.0, 0.0 }, { -1.0, -1.0, -10000.0, 0.0, 0.0, 0.0 } }
} ;

#define MAX_DOORS 7
new bool: door_status [ MAX_DOORS ] ;
new door_area [ MAX_DOORS ] ;
new door_object [ MAX_DOORS ] ;
new Float: door_pos [ MAX_DOORS ] [ 2 ] [ 6 ] =
{
	{ {597.2094, 2.2534, 1021.8394,		0.0000, 0.0000, 16.1400}, {597.209350, 2.253350, 1021.839416,	0.000000, 0.000000, -90.000000} },
	{ {588.5001, -4.3132, 1021.8394,	0.0000, 0.0000, 104.9400}, {588.5001, -4.3132, 1021.8394,	0.0000, 0.0000, 0.0000} },
	{ {1341.4039, 1179.0470, 1700.4849,	0.0000, 0.0000, 213.7801}, {1341.589111, 1178.969848, 1700.484863, 0.000000, 0.000000, 90.000000} }, //правительство
	{ {2357.8501, 1984.3400, 12.4533,	0.0000, 0.0000, 10.0000}, {2357.8501, 1984.3400, 15.0500, 0.0000, 0.0000, 10.0000} }, //семейный центр
	{ {2543.7361, 2350.7458, 2336.4487,	0.0000, 0.0000, 195.0600}, {2543.835449, 2350.630859, 2336.448730, 0.000000, 0.000000, 90.000000} }, //фотограф
	{ {637.0900, 1409.7600, 1113.7200,	0.0000, 0.0000, 0.2400}, {637.0900, 1409.7600, 1113.7200, 0.0000, 0.0000, 90.0000} }, // Оружейка Армия
	{ {637.0900, 1409.7600, 1113.7200,	0.0000, 0.0000, 0.2400}, {637.0900, 1409.7600, 1113.7200, 0.0000, 0.0000, 90.0000} } // Оружейка Армия
} ;

/* 

	anti DM zones 
	
*/

new Text:zz_td [ 15 ] ;
new PlayerText: custom_zz_td [ MAX_PLAYERS ] [ 2 ] ;

#define MAX_DM_ZONE	29
new Float:anti_dm_pos [ MAX_DM_ZONE ] [ 5 ] =
{
	{ -590.4393, 835.7374, -392.5235, 986.0483 }, // Спавн Арзамас
	{ 2451.2473, -1817.3842, 2851.2473, -1417.3842 }, // Спавн Южный
	{ 1896.5842, 1653.6564, 2296.5842, 2053.6564 }, // Спавн Батырево
	{ 245.8847, 1473.5052, 645.8847, 1873.5052 }, // Спавн Эдово
	{ -967.3302, 1138.9241, -827.2811, 1199.2756 }, // Авторынок Арзамас
	{ 1729.5560, -2309.9453, 1832.0037, -2220.6115 }, // Авторынок Южный
	//{ 2257.0434, 1977.6138, 2391.3063, 2144.8906 }, // Завод экстерьер
    //{ -1404.1159, 2487.5583, -1382.5051, 2721.8244 }, // Шахта экстерьер
    //{ -1149.6396, -2557.0886, -965.8488, -2408.6982 }, // Лесопилка экстерьер
    { -637.7767, -1935.9996, -237.7767, -1535.9996 }, // Контейнеры экстерьер
	{ -2896.9956, -1248.6145, -2496.9956, -848.6145 }, // Контейнеры экстерьер
    { 1930.2950, -2556.6826, 2087.7817, -2673.4519 }, // TowCar экстерьер
    { -240.7030, 1161.3299, 159.2969, 1561.3299 }, // TowCar 2 экстерьер
    { 237.5264, 189.7162, 637.5264, 589.7163 }, // Автосалон экстерьер
    { 2275.9914, -919.6683, 2675.9914, -519.6683 }, // Автосалон экстерьер
    { 1723.0256, 2035.3686, 2123.0256, 2435.3686 }, // Автошкола экстерьер
    { 376.0902, 740.8290, 401.7876, 825.2216 }, // Автосервис экстерьер
    { 2036.5374, 1848.9660, 2079.5156, 1906.4348 }, // Автосервис экстерьер
    { 1719.8878, 2239.3576, 1803.6607, 2316.3623 }, // Perfomance экстерьер
    { 1790.1390, 1304.2734, 2190.1391, 1704.2734 }, // Мэрия интерьер
    { 2215.5676, -2019.8002, 2615.5676, -1619.8002 }, // ФСБ Экстерьер
    { 715.6669, -194.4724, 1115.6669, 205.5275 }, // Полиция 2 этаж интерьер LS
    { 715.6669, -194.4724, 1115.6669, 205.5275 }, // Полиция 2 этаж интерьер SF
    { 1601.5251, -337.4377, 2001.5251, 62.5622 }, // Больница интерьер
	{ 590.3100, -1000.5375, 990.3100, -600.5375 }, // Радиоцентр интерьер
    { -204.0876, 595.6997, 195.9123, 995.6997 }, // Автосалон интерьер
	{ 2151.6784, -1787.7387, 18.9632, 148.8024 }, // Рынок
	{ -1090.5965, 1794.9842, -690.5965, 2194.9843 }, // Perfomance экстерьер
	{ -517.9415, 617.1256, -117.9415, 1017.1256 }, // Риелторка Арзамас экстерьер
	{ 932.6988, 2454.0334, 1332.6988, 2854.0334 }, // Аммунация Лион
	{ 9.4723, 1175.2156, 409.4723, 1575.2156 }, // Полиция Арзамаса Экстерьер
	{ -477.5317, 355.9041, -77.5317, 755.9041 } // Больница экстерьер
} ;

new anti_dm_data [ MAX_DM_ZONE ] [ 2 ] =
{
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	//{ 0, 0 },
	//{ 0, 0 },
	//{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 13, -1 },
	{ 0, 0 },
	{ 1, 1 },
	{ 1, 2 },
	{ 2, -1 },
	{ 10, 2 },
	{ 21, -1 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 }
};

new anti_dm_area [ MAX_DM_ZONE ] ;

new anti_dm_warning [ MAX_PLAYERS char ] ;
new anti_db_warning [ MAX_PLAYERS char ] ;

new is_player_in_dmzone [ MAX_PLAYERS char ] ;

/* nonparking zones */
new Text:np_td [ 6 ] ;
new PlayerText: custom_np_td [ MAX_PLAYERS ] [ 2 ] ;

#define MAX_NONPARKING_ZONES 21
new non_parking_area [ MAX_NONPARKING_ZONES ] ;
new Float:non_parking_pos [ MAX_NONPARKING_ZONES ] [ 4 ] =
{
	{ -590.4393, 835.7374, -392.5235, 986.0483 }, // Спавн Арзамас
	{ 2451.2473, -1817.3842, 2851.2473, -1417.3842 }, // Спавн Южный
	{ 1896.5842, 1653.6564, 2296.5842, 2053.6564 }, // Спавн Батырево
	{ 245.8847, 1473.5052, 645.8847, 1873.5052 }, // Спавн Эдово
	{ -967.3302, 1138.9241, -827.2811, 1199.2756 }, // Авторынок Арзамас
	{ 1729.5560, -2220.6115, 1832.0037, -2309.9453 }, // Авторынок Южный
	//{ 2257.0434, 1977.6138, 2391.3063, 2144.8906 }, // Завод экстерьер
    //{ -1404.1159, 2487.5583, -1382.5051, 2721.8244 }, // Шахта экстерьер
    //{ -1149.6396, -2557.0886, -965.8488, -2408.6982 }, // Лесопилка экстерьер
    { -637.7767, -1935.9996, -237.7767, -1535.9996 }, // Контейнеры экстерьер
	{ -2896.9956, -1248.6145, -2496.9956, -848.6145 }, // Контейнеры экстерьер
    { 1930.2950, -2673.4519, 2087.7817, -2556.6826 }, // TowCar экстерьер
    { -240.7030, 1161.3299, 159.2969, 1561.3299 }, // TowCar 2 экстерьер
    { 237.5264, 189.7162, 637.5264, 589.7163 }, // Автосалон экстерьер
    { 2275.9914, -919.6683, 2675.9914, -519.6683 }, // Автосалон экстерьер
    { 1723.0256, 2035.3686, 2123.0256, 2435.3686 }, // Автошкола экстерьер
    { 376.0902, 740.8290, 401.7876, 825.2216 }, // Автосервис экстерьер
    { 2036.5374, 1848.9660, 2079.5156, 1906.4348 }, // Автосервис экстерьер
    { 1719.8878, 2239.3576, 1803.6607, 2316.3623 }, // Perfomance экстерьер
	{ 2151.6784, -1787.7387, 18.9632, 148.8024 }, // Рынок
	{ 9.4723, 1175.2156, 409.4723, 1575.2156 }, // Полиция Арзамас экстерьер
	{ 1603.7050, 1542.2421, 2003.7050, 1942.2421 }, // Сухопутные войска экстерьер
    { 2215.5676, -2019.8002, 2615.5676, -1619.8002 }, // ФСБ Экстерьер
	{ -517.9415, 617.1256, -117.9415, 1017.1256 } // Риелторка Арзамас экстерьер
} ;

new is_player_nonpark_zone [ MAX_PLAYERS char ] ;

/* 

	Штрафстоянка 
	
*/

new Float:fine_pos [ 2 ] [ 4 ] [ 4 ] =
{
	{
		{ 2009.3795, -2581.7380, 11.2227, 180.0523 },
		{ 2002.6379, -2581.6877, 11.2135, 180.3594 },
		{ 1995.8305, -2581.6765, 11.2226, 180.4615 },
		{ 1988.9157, -2581.9365, 11.2142, 179.5117 }
	},
	{
		{ -38.2886, 1400.4451, 13.7379, 248.8697 },
		{ -40.1023, 1393.3902, 13.3078, 246.2878 },
		{ -41.4072, 1386.4732, 13.0283, 245.4378 },
		{ -43.2682, 1379.2653, 12.7138, 239.1890 }
	}
} ;

/*

	Аксесуары + скины

*/

#define MAX_SKIN_IN_SHOP 72

new shop_skins [ 2 ] [ MAX_SKIN_IN_SHOP ] =
{
    {
		1, 2, 4, 6, 7, 17, 18, 19, 21, 22, 23, 24, 26, 27, 28, 29, 30, 33, 34, 35, 36, 37, 42, 43, 44, 45, 47, 48, 49, 50, 51, 52, 57, 58,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
	},
    {
		9, 11, 12, 13, 40, 41, 53, 63, 75, 76, 85, 87, 88, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
	}
} ;

new shop_skins_price [ 2 ] [ MAX_SKIN_IN_SHOP ] =
{
    { 7000, 11000, 15000, 5000, 5000, 7500, 20000, 9000, 9000, 6000, 10000, 15000, 9000, 11000, 2000, 9000, 7000, 11000, 30000, 15000, 16000,
    9000, 60000, 13000, 24000, 7000, 13000, 3000, 3000, 20000, 8000, 7000, 6000, 13000, 13000, 14000, 2000, 4000, 3000, 3000, 7000, 8000, 3000, 
    7000, 7000, 8000, 9000, 11000, 7000, 13000, 8000, 50000, 1_000_000, 1_000_000, 1_000_000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 
    { 3000, 5000, 10000, 30000, 4000, 6000, 8000, 7000, 9000, 7000, 11000, 7000, 9000, 5000, 13000, 13000, 11000, 30000, 3000, 3000, 4000, 9000,
    9000, 8000, 5000, 8000, 9000, 15000, 20000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
} ;

new Float: position_skin_shop [ 4 ] = { 2698.7070, 303.2422, 1401.0000, 224.5035 } ;
new Float: camera_position_skin_shop [ 6 ] = { 2701.6162, 301.5572, 1403.0000, 2698.7070, 303.2422, 1401.0000 } ;

new Float: accessories_camera_positions [ 3 ] [ 6 ] =
{
	{ 2701.6162, 301.5572, 1403.0000, 2698.7070, 303.2422, 1401.0000 }, // наушники
	{ 2696.2141, 305.1310, 1403.0000, 2698.7070, 303.2422, 1401.0000 }, //часы
	{ 2695.9780, 302.0278, 1403.0000, 2698.7070, 303.2422, 1401.0000 } // портфели
} ;

/*new Float: position_skin_shop [ 4 ] = { -50.4988, 956.1966, 1597.9787, 141.4894 } ;
new Float: camera_position_skin_shop [ 6 ] = { -52.5169, 951.5756, 1600.0740, -50.4988, 956.1966, 1597.9787 } ;

new Float: accessories_camera_positions [ 3 ] [ 6 ] =
{
	{ -51.4315, 954.4996, 1599.2109, -50.4988, 956.1966, 1597.9787 }, // наушники
	{ -52.2926, 955.6592, 1598.7863, -50.4988, 956.1966, 1597.9787 }, //часы
	{ -49.4342, 957.7579, 1598.7863, -50.4988, 956.1966, 1597.9787 } // портфели
} ;

[14:30:36] [SAVED] { -1466.6072, -1289.8629, 1387.7010, 4.2101 } (clothes)
[14:30:53] [SAVED] { -1466.3430, -1271.0021, 1387.7010, 346.4686 } (pick)
[14:31:10] [SAVED] { -1452.6391, -1266.4696, 1387.7010, 114.4080 } (player)
[14:31:25] [SAVED] { -1455.3717, -1268.3111, 1387.7010, 314.5522 } (cam)
[14:31:32] [SAVED] { -1452.7761, -1268.9368, 1387.7010, 354.3699 } (cam1)
[14:31:38] [SAVED] { -1450.1066, -1264.9243, 1387.7010, 108.8377 } (cam1)*/

/*

	paintball

*/

#define paint_interior 0

new SkinPaint [ 2 ] [ 2 ] =
{
	{ 47, 48 },
	{ 55, 56 }
} ;

new Float:SpawnBlueTeam [ 2 ] [ 2 ] [ 4 ] =
{
	{
		{ 1738.8603, -2426.5380, 10.9703, 185.0785 },
		{ 1701.9056, -2427.4252, 11.0005, 184.0965 }
	},
	{
	    { -132.7875, 420.8446, 13.0228, 74.2197 },
		{ -130.1514, 436.9424, 13.0554, 344.1335 }
	}
} ;

new Float:SpawnRedTeam [ 2 ] [ 2 ] [ 4 ] =
{
	{
		{ 1702.5109, -2554.2480, 11.0819, 347.9646 },
		{ 1777.2631, -2551.4079, 11.0005, 35.5587 }
	},
	{
		{ -222.2040, 489.1200, 12.8196, 268.8248 },
		{ -202.7733, 517.9824, 12.8830, 204.6310 }
	}
} ;

/*

	Businesses

*/

enum _busines_int
{
	i_interior,
	Float: i_position [ 4 ],
	i_map_icon
} ;

#define max_interior            29
new bool: create_pick_bizz_exit [ max_interior ] = { false, ... } ;
new b_interior [ max_interior ] [ _busines_int ] =
{
	{ 3, { 2098.9743, -4.3693, 1398.8626, 8.7793 }, 17 },//24/7
	{ 5, { 17.5948, -1114.4359, 1029.7817, 335.5659 }, 18 },//ammo
	{ 21, { -14.6586, 790.8205, 501.0000, 267.5117 }, 55 },//car shop
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, 14 }, //Cluckin Bell
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, 29 }, //Pizza
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, 10 }, //Burger Shot
	{ 15, { 2698.2543, 295.6882, 1401.0000, 5.4650 }, 45 }, //clothes shop
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, 17 }, // cafe.int
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, 48 }, //Alhambra
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, 49 }, //BAR
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, 48 },//strip
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, 49 },//Джиззи
	{ 3, { 2098.9743, -4.3693, 1398.8626, 8.7793 }, 22 },//аптека
	{ 22, { -100.7394, -26.4781, 1298.0078, 181.4513 }, 25 },//Casino
	{ 5, { 1987.7821, 1995.9537, 1498.7265, 193.8429 }, 54 },//Спортивный зал
	{ 25, { -110.4756, 252.6027, 1201.0783, 278.9470 }, 34 },//Риэлторское агенство
	{ 3, { -2721.6037, -1761.1633, 2.3055, 86.5605 }, 35 },//Отель
	{ 1, { 624.4999,-28.2754,3002.8833,357.1800 }, 51 },//Аренда транспорта
	{ 24, { -196.9943, 155.1898, 1201.0000, 357.9921 }, 27 },//Автомастерские
	{ 26, { -110.4756, 252.6027, 1201.0783, 278.9470 }, 37 }, //SIM-карты
	{ 1, { 0.0, 0.0, 0.0, 0.0 }, 27 },//TowCar
	{ 11, { 972.3325, -468.4626, 1015.4014, 306.2096 }, 52 },//Банк
	{ 3, { 2098.9743, -4.3693, 1398.8626, 8.7793 }, 9 },//Охота и рыбалка
	{ 0, { 0.0, 0.0, 0.0, 0.0 }, 10 },//Ларёк с едой
	{ 21, { -14.6586, 790.8205, 501.0000, 267.5117 }, 51 },//Автосалон
	{ 21, { -14.6586, 790.8205, 501.0000, 267.5117 }, 51 },//Автосалон
	{ 0, { 0.0, 0.0, 0.0, 0.0 }, 51 },//Аэросалон
	{ 0, { 0.0, 0.0, 0.0, 0.0 }, 51 },//Боатсалон
	{ 11, { -2129.13,-188.362,35.3203,83.879 }, 23 }//Оружейный завод
} ;

new Float: strip_actor_position [ 5 ] [ 4 ] =
{
	{ 807.0740, -798.4188, 1798.9687, 113.9852 },
	{ 806.9464, -792.0521, 1798.9687, 96.7424 },
	{ 804.5762, -795.5242, 1798.0234, 101.2054 }, // охранник
	{ 808.5623, -803.5466, 1798.0234, 62.2185 },
	{ 796.1598, -801.8287, 1798.0234, 327.1965 } // охранник
} ;

/*

	Delivery Load

*/

new Float: delivery_loaded [ 3 ] = { 1780.6839, 2713.9484, 13.8925 } ;

new Float: spawn_trailer_delivery [ 4 ] = { 1758.9499, 2649.5366, 15.0926, 42.7152 } ;
new Float: fuel_delivery_loaded [ 3 ] = { 1751.2965, 2681.8454, 13.8925 } ;

/*

	Авторынок

*/

#define CAR_MARKET_SLOTS 	22
#define MAX_CAR_MARKET 		2
new carmarket_integr_id [ 3 ] ;
new car_market_area [ MAX_CAR_MARKET ] [ CAR_MARKET_SLOTS ] ;
new bool: car_market_slotes_toggled [ MAX_CAR_MARKET ] [ CAR_MARKET_SLOTS ] ;
new Float:car_market_pos [ MAX_CAR_MARKET ] [ CAR_MARKET_SLOTS ] [ 4 ] =
{
	{
		{ 674.6074, 1059.4849, 11.9732, 249.6945 },
		{ 672.1573, 1053.1856, 11.9716, 248.6549 },
		{ 669.7837, 1046.5745, 11.9728, 249.5404 },
		{ 667.3760, 1040.1425, 11.9731, 250.3180 },
		{ 665.0457, 1033.7239, 11.9732, 251.0140 },
		{ 662.8092, 1027.2850, 11.9716, 249.4372 },
		{ 660.3543, 1020.8878, 11.9700, 249.9458 },
		{ 684.1784, 1027.5866, 11.9723, 0.4874 },
		{ 690.9632, 1027.4886, 11.9716, 0.2617 },
		{ 697.8453, 1027.5017, 11.9733, 359.5798 },
		{ 704.6920, 1027.5673, 11.9736, 0.0000 },
		{ 711.7147, 1027.4467, 11.9725, 0.2755 },
		{ 718.4163, 1027.4620, 11.9717, 0.5818 },
		{ 725.1896, 1027.5107, 11.9730, 0.2967 },
		{ 623.6701, 1004.3137, 11.9723, 0.0560 },
		{ 630.5718, 1004.3322, 11.9723, 359.4285 },
		{ 637.3651, 1004.3913, 11.9733, 0.0000 },
		{ 644.2913, 1004.4550, 11.9730, 0.4710 },
		{ 651.0368, 1004.3116, 11.9732, 359.9476 },
		{ 658.0458, 1004.3336, 11.9716, 0.0685 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	},
	{
		{ -467.7309, 741.4683, 12.0734, 269.6248 },
		{ -467.7849, 733.6251, 12.0743, 270.1442 },
		{ -467.5613, 725.3939, 12.0735, 268.4670 },
		{ -467.8390, 717.9335, 12.0747, 267.8015 },
		{ -460.9868, 697.5864, 12.0743, 358.8046 },
		{ -453.8528, 697.2698, 12.0753, 354.4696 },
		{ -445.9406, 697.2441, 12.0750, 355.7756 },
		{ -438.2706, 697.3155, 12.0734, 356.0742 },
		{ -430.5540, 697.4254, 12.0747, 355.4678 },
		{ -422.1894, 697.4643, 12.0741, 359.2834 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	}
} ;

/*

	Аксессуары

*/

new accessories_items [ ] [ ] =
{
	{ 19421,19422,19423,19424,1}, // наушники
	{ 19069,19068,19067,19554,18953,18954,1}, // шапки
	{ 18968,18967,18969,1}, // панамы
	{ 18955,18956,18957,18959,18926,18927,18928,18929,18930,18931,18932,18933,1,1,1,1,1}, // кепки
	{ 19104,19105,19106,19107,19108,19109,1}, // каски
	{ 18925,18922,18923,18924,18921,1}, // береты
	{ 19519,19274,1}, // парики
	{ 19011,19012,19013,19014,19015,19016,19017,19018,19019,19024,19027,19028,19029,19022,19035,19031,19032,19033,1}, // очки
	{ 18911,18912,18913,18914,18915,18916,18917,18918,18919,18920,1 }, // повязки
	{ 18947,18948,18949,18950,18951,1 }, // шляпы
	{ 19042,19041,19040,19039,19043,19044,19045,19046,19048,19049,19050,19051,19053,1 }, // часы
	{ 3026,371,19559,1,1,1,1,1,1,1 }, // портфели
	{ 18910,18909,18908,18907,18906,1 }, // банданы
	{ 19624,11745,1 } // сумки
} ;

new accessories_items_price [ ] [ ] =
{
	{ 5000,5000,5000,5000,1},
	{ 4500,4500,5000,7000,4000,5000,1},
	{ 3000,3000,3000,1},
	{ 2500,2500,2500,3500,3500,2500,6000,6000,4000,3500,3500,5000,1,1,1,1,1},
	{ 3500,3500,3500,3500,3500,3500,1},
	{ 3000,3200,3200,3500,4000,1},
	{ 4000,4000,1},
	{ 1500,3000,1500,1700,2200,2800,3800,3800,3800,4000,4000,4000,4000,4000,3000,3100,3100,5000,1},
	{ 3000,2000,2000,2700,2700,2700,2300,2000,2000,2700,1 },
	{ 3100,3100,3100,3100,3100,1 },
	{ 40000,30000,45000,50000,60000,6000,6000,6000,6000,6500,6000,6200,6400,1 },
	{ 2500,1800,2200,1,1,1,1,1,1,1 },
	{ 3000,3000,3000,3000,3000,1 },
	{ 5500,7500,1 }
} ;

/*

	Donate

*/

new donate_cars [ 12 ] [ 2 ] =
{
	{ 402, 1000 },
	{ 411, 500 },
	{ 412, 500 },
	{ 415, 1000 },
	{ 437, 300 },
	{ 451, 300 },
	{ 466, 1500 },
	{ 480, 2000 },
	{ 490, 2000 },
	{ 503, 1500 },
	{ 542, 1000 },
	{ 603, 1800 }
} ;

new donate_cars_2 [ 6 ] [ 2 ] =
{
	{ 475, 3000 },
	{ 477, 3000 },
	{ 494, 3000 },
	{ 495, 3000 },
	{ 463, 3000 },
	{ 444, 5000 }
} ;

new donate_cars_3 [ 5 ] [ 2 ] =
{
	{ 469, 1500 },
	{ 447, 2000 },
	{ 487, 3000 },
	{ 513, 800 },
	{ 593, 800 }
} ;

new donate_acessories [ 10 ] [ 2 ] =
{
	{ 12635, 500 },
	{ 12636, 750 },
	{ 12637, 500 },
	{ 12638, 750 },
	{ 12640, 1000 },
	{ 12650, 1000 },
	{ 12659, 1500 },
	{ 12660, 1500 },
	{ 12662, 2500 },
	{ 12664, 2500 }
} ;

new donate_skin [ 24 ] [ 3 ] =
{
	{ 81, 1500, 0 },
	{ 138, 1000, 0 },
	{ 146, 750, 0 },
	{ 154, 500, 0 },
	{ 155, 500, 0 },
	{ 156, 1000, 0 },
	{ 160, 1500, 0 },
	{ 177, 1000, 0 },
	{ 188, 2500, 1 },
	{ 189, 750, 1 },
	{ 190, 750, 1 },
	{ 191, 750, 1 },
	{ 192, 750, 1 },
	{ 193, 750, 1 },
	{ 194, 1500, 1 },
	{ 195, 1500, 1 },
	{ 196, 1500, 1 },
	{ 197, 1500, 1 },
	{ 198, 5000, 1 },
	{ 276, 2500, 0 },
	{ 278, 1000, 0 },
	{ 279, 500, 0 },
	{ 284, 500, 0 },
	{ 38, 500, 0 }
} ;

/*

	Admin Zone

*/

#define admin_interior	21
new Float: spawn_admin_zone [ 4 ] = { -14.6586, 790.8205, 501.0000, 267.5117 } ;

/*
	
	roulette
	
*/

new dr_skin [ 12 ] = { 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 94, 95 } ;
new dr_accesories [ 8 ] = { 19319, 19318, 19317, 19472, 19142, 1276, 19079, 19137 } ;
new dr_veh_models [ 8 ] [ 6 ] =
{
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 },
	{ 462, 401, 400, 405, 408, 410 }
} ;