#define object_bus_station 	2121
#define object_atm			14389

#define object_atm_tinkoff	14389

#define udochka_object		14097
#define jbl_object			14170

#define city_prise			"г. Южный"
#define city_war			"г. Южный"

#define garden_interior		12

#define skin_miner			241
#define skin_factory		250
#define skin_sawmill		249

#define faggio_model		462

/*

	Регистрация

*/

new Text:td_regskins [ 22 ] ;
new registration_skins [ 3 ] [ 2 ] [ 5 ] =
{
	{ { 1, 2, 4, 6, 17 }, { 9, 11, 13, 53, 55 } },
	{ { 1, 2, 4, 6, 17 }, { 9, 11, 13, 53, 55 } },
	{ { 1, 2, 4, 6, 17 }, { 9, 11, 13, 53, 55 } }
} ;

const registration_interior = 15 ;
new Float: registration_skin_position [ 4 ] = { 2698.7070, 303.2422, 1401.0000, 224.5035 } ;
new Float: registration_camera_pos [ 6 ] = { 2701.6162, 301.5572, 1403.0000, 2698.7070, 303.2422, 1401.0000 } ;

/*

	spawn

*/

new Float:newbie_spawn_pos [ 5 ] [ 3 ] [ 4 ] =
{
	{
		{ -493.2795, 910.1484, 12.1425, 277.6495 }, // Арзамас
		{ -492.8713, 914.8031, 12.1425, 259.3829 },
		{ -489.4476, 911.9022, 12.1425, 272.5690 }
	},
	{
		{ 464.275, 1693.570, 12.180, 110.475 }, // Арзамас
		{ 462.830, 1674.303, 12.180, 80.936 },
		{ 461.976, 1652.925, 12.180, 41.167 }
	},
	{
		{ 2734.399, -2443.610, 22.406, 268.071 }, // Южный
		{ 2740.365, -2437.939, 21.891, 240.288 },
		{ 2740.333, -2447.864, 21.891, 306.960 }
	},
	{ // доп. спавны
		{ 1826.6081, 2526.8164, 15.8020, 127.7137 }, // Батырево
		{ 1821.9678, 2528.5041, 15.8020, 137.2312 },
		{ 1827.8651, 2521.6933, 15.8020, 105.0332 }
	},
	{
		{ -866.6192, -1072.8952, 62.1950, 349.2527 }, // Stone Island
		{ -860.9122, -1071.8891, 62.1950, 341.8059 },
		{ -869.9878, -1068.8148, 62.1950, 332.6950 }
	}
} ;

new newbie_spawn_data [ 5 ] [ 3 ] [ 2 ] =
{
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	},
	{
		{ 0, 0 },
		{ 0, 0 },
		{ 0, 0 }
	}
} ;

#define MAX_DECORATION 9

enum _actor_decoration
{
	actor_skin,
	
	Float:actor_pos [ 4 ],
	actor_interior,
	actor_world,
	
	actor_anim [ 32 ],
	actor_anim_lib [ 32 ]
} ;

new actor_decor [ MAX_DECORATION ] [ _actor_decoration ] =
{
	{ 184, { 2745.167, -2437.699, 21.897, 142.962 }, 0, 0, "ON_LOOKERS", "WAVE_OUT" },
	{ 184, { -494.1727, 921.5417, 12.1425, 216.8076 }, 0, 0, "ON_LOOKERS", "WAVE_OUT" },
	{ 184, { 465.381, 1680.411, 12.180, 78.950 }, 0, 0, "ON_LOOKERS", "WAVE_OUT" },
	{ 260, { 695.0010, 1280.1274, 1746.4183, 353.1761 }, 6, 1, "DEALER", "Dealer_idle" }, // Завод
	{ 260, { -1364.0767, 2647.4089, 40.5531, 143.0405 }, 0, 0, "DEALER", "Dealer_idle" }, // Шахта
	{ 260, { -1051.6323, -2480.8884, 28.5195, 281.8397 }, 0, 0, "DEALER", "Dealer_idle" }, // Лесопилка
	
	{ 11, { 767.3677, -1436.8871, 3003.5764, 119.8285 }, 1, 1, "ped", "SEAT_IDLE" }, // Автошкола
	{ 171, { 767.3585, -1432.9622, 3003.5764, 120.0345 }, 1, 1, "ped", "SEAT_IDLE" }, // Автошкола
	{ 172, { 767.3545, -1428.8624, 3003.5764, 121.2407 }, 1, 1, "ped", "SEAT_IDLE" } // Автошкола
} ;

enum _object_decoration
{
	object_decor_id,
	Float: object_pos [ 6 ],
	object_int,
	object_world
} ;

new object_decor [ MAX_DECORATION ] [ _object_decoration ] =
{
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 },
	{ -1, { 0.00000, 0.00000, 0.00000,   0.00000, 0.00000, 0.00000 }, 0, 0 }
} ;

new mayor_bots_skin [ 4 ] = { 108, 147, 202, 202 } ;
new Float: mayor_bots_position [ 4 ] [ 4 ] =
{
    { 690.5120, -10.9502, 1201.8580, 177.1642 },
    { 687.1762, -10.9317, 1201.8580, 178.5578 },
    { 691.4867, -26.7801, 1201.8580, 91.9240 },
    { 684.5968, -18.8556, 1201.8580, 268.9387 }
} ;

new police_bots_skin [ 4 ] = { 280, 280, 280, 280 } ;
new Float: police_bots_position [ 4 ] [ 4 ] =
{
    { 899.7410,2.4865,1405.6897,356.4056 },
    { 902.3462,2.4865,1405.6897,359.4938 },
    { 904.8976,2.4865,1405.6897,359.4938 },
    { 912.2140,13.2540,1399.9978,178.0685 }
} ;

new hospital_bots_skin [ 2 ] = { 70, 274 } ;
new Float: hospital_bots_position [ 2 ] [ 4 ] =
{
    { 1812.1480, -118.4538, 1400.9849, 88.5746 },
    { 1812.1480, -115.8226, 1400.9849, 89.6328 }
} ;

/*

	Аренда мопеда

*/

new Float:faggio_spawn [ 11 ] [ 4 ] =
{
	{ -477.8312, 917.7540, 11.5595, 269.9855 }, // Арзамас
	{ 454.357, 1650.590, 11.625, 338.662 }, // Арзамас
	{ 2747.596, -2429.270, 21.328, 181.265 }, // Южный
	{ -2473.7841, 2835.7282, 37.2313, 180.5337 }, // Эдово
	{ -1050.793, 2200.076, 37.792, 128.717 }, // Завод
	{ 2386.249, 1722.388, -2.567, 3.871 }, // Шахта
	{ 1541.215, 2899.020, 11.634, 255.385 }, // Лесопилка
	{ 2306.9555, -1921.9207, 21.4283, 178.9094 }, // Доставщик
	{ -298.644, 582.036, 11.775, 82.844 }, // Больница
	{ -1762.6124, -2768.8354, 12.6577, 335.9034 }, // Тюрьма
	{ -854.3197, -1059.2172, 62.0085, 347.7807 } // Stone Island
} ;

/*

	gps

*/

enum _gps
{
	Float: position [ 3 ],
	loc_name [ 100 ]
} ;

new gps_important_place [ 20 ] [ _gps ] =
{
    { { -317.8642, 725.5924, 12.0625 }, "Мэрия г. Арзамас\t{33AAFF}Устройство на работу, создание семьи{"#cWH"}" },
    { { 404.2164, 622.2126, 12.0000 }, "Сбербанк г. Арзамас\t{"#cOR"}Переводы, кредиты, создание карт{"#cWH"}" },
    { { 1852.1787, 2046.4801, 15.8853 }, "Тинькофф\t{"#cOR"}Переводы, кредиты, создание карт{"#cWH"}" },
    { { 2376.5012, -2144.1728, 21.9664 }, "Сбербанк г. Южный\t{"#cOR"}Переводы, кредиты, создание карт{"#cWH"}" },
    { { -286.5593, 583.0414, 12.1202 }, "Больница г. Арзамас\t{33AAFF}Мед. карта, мед. обследование{"#cWH"}" },
    { { 1899.6993, 2227.5906, 15.7058 }, "Автошкола\t{33AAFF}Получение лицензий{"#cWH"}" },
	{ { 1846.3168, 198.1339, 7.8828 }, "Центр воздушного транспорта\t " },
	{ { 2802.0457, -2552.1052, 10.5201 }, "Центр водного транспорта\t " },
	{ { 211.6654, 1379.4928, 11.9219 }, "Получение номерных знаков\t " },

	{ { 2260.9, -2100.17, 21.9798 }, "Всё для охоты и рыбалки\t{"#cGRDialog"}Покупка ружья, удочки, наживки{"#cWH"}" },
	{ { 2240.95, 1369.24, 11.357 }, "Охотничьи угодья\t{"#cGRDialog"}Требуется ружьё{"#cWH"}" },
	{ { -2240.15, -830.431, 29.5832 }, "Рыбацкое озеро\t{"#cGRDialog"}Требуется удочка и наживка{"#cWH"}" },
    { { 1969.94, -2603.91, 11.486 }, "Штрафстоянка №1\t " },
    { { -40.7030, 1361.3315, 12.8816 }, "Штрафстоянка №2\t " },
    { { -432.1726, -1719.1553, 44.1259 }, "Склад контейнеров\t{"#cLY"}Аукцион контейнеров{"#cWH"}" },
    { { -2747.308, -1143.274, 10.648 }, "Свалка контейнеров\t{"#cLY"}Аукцион контейнеров{"#cWH"}" },
    { { -317.882, 816.332, 13.059 }, "Риэлторское агентство №1\t{"#cOR"}Обмен имуществом, инфо. о недвижимости{"#cWH"}" },
    { { 2577.57, -2377.65, 22.939 }, "Риэлторское агентство №2\t{"#cOR"}Обмен имуществом, инфо. о недвижимости{"#cWH"}" },
    { { 1795.05, 2036.55, 15.868 }, "Риэлторское агентство №3\t{"#cOR"}Обмен имуществом, инфо. о недвижимости{"#cWH"}" },
    { { -401.6563, 776.3588, 12.0689 }, "Центральный рынок\t{"#cLY"}Продажа / покупка предметов для крафта{"#cWH"}" }
} ;
new gps_important_place_items = sizeof gps_important_place ;

new gps_job_place [ 13 ] [ _gps ] =
{
    { { 2384.2039, 1706.0043, -2.2312 }, "Шахта\t{"#cLY"}Начальная работа{"#cWH"}" },
    { { -1065.4392, 2202.4592, 38.0931 }, "Завод\t{"#cLY"}Начальная работа{"#cWH"}" },
    { { 1569.1626, 2869.4167, 11.7188 }, "Лесопилка\t{"#cLY"}Начальная работа{"#cWH"}" },
    { { 1798.6024, 2734.0966, 13.8925 }, "Склад продуктов\t{"#cGN"}Продукты в бизнесы{"#cWH"}" },
    { { 1729.3286, 2664.8525, 13.8925 }, "Топливная база\t{"#cGN"}Бензин на заправки{"#cWH"}" },
    { { 219.2581, 417.0141, 11.6346 }, "Стоянка автобусов\t{"#cGN"}Вод. права{"#cWH"}" },
    { { 2345.0419, -2627.8171, 21.8114 }, "Стоянка механиков\t{"#cGN"}Вод. права{"#cWH"}" },
    { { 1822.457, 2509.445, 15.664 }, "Стоянка такси\t{"#cGN"}Вод. права{"#cWH"}" },
    { { 468.751, 1872.22, 12.893 }, "ТК DHL\t{"#cOR"}Трудоустроиться дальнобойщиком{"#cWH"}" },
    { { 1810.22, 2624.68, 13.893 }, "ТК Деловые Линии\t{"#cOR"}Трудоустроиться дальнобойщиком{"#cWH"}" },
    { { 780.158, 752.165, 12.927 }, "ТК FedEx\t{"#cOR"}Трудоустроиться дальнобойщиком{"#cWH"}" },
    { { 2310.2084, -1926.4329, 21.9588 }, "Доставка пиццы\t " },

    { { 2182.3017, -1856.5260, 18.8189 }, "Вор деталей\t{33AAFF}Банды и мафии{"#cWH"}" }
} ;
new gps_job_place_items = sizeof gps_job_place ;
 
new gps_govorg_place [ 8 ] [ _gps ] =
{
    { { -317.8642, 725.5924, 12.0625 }, "Мэрия г. Арзамас\t{33AAFF}Устройство на работу, создание семьи{"#cWH"}" },
    { { 2412.2810, -1849.9652, 21.8573 }, "Федеральная Служба Безопасности\t " },
    { { -1773.6077, -2770.5070, 13.9966 }, "Исправительная колония\t " },
    { { 1903.0008, 1722.3802, 15.9925 },"Сухопутные Войска\t " },
    { { 211.6654, 1379.4928, 11.9219 }, "Полиция г. Арзамас\t{33AAFF}Получение номерных знаков{"#cWH"}" },
    { { 2581.6452, -2434.9899, 21.7972 }, "Полиция г. Южный\t{33AAFF}Получение номерных знаков{"#cWH"}" },
    { { -286.5593, 583.0414, 12.1202 }, "Больница г. Арзамас\t{33AAFF}Мед. карта, мед. обследование{"#cWH"} " },
    { { 1826.2534, 2095.8588, 15.8540 }, "Радиоцентр\t{"#cGRDialog"}/ad для подачи объявления{"#cWH"}" }
} ;
new gps_govorg_place_items = sizeof gps_govorg_place ;
 
new gps_nelegal_place [ 4 ] [ _gps ] =
{
    { { 0.0, 0.0, 0.0 }, "La Cosa Nostra\t{"#cGRDialog"}/contract для заказа убийства{"#cWH"}" },
    { { 0.0, 0.0, 0.0 }, "Русская мафия\t{"#cGRDialog"}/contract для заказа убийства{"#cWH"}" },
    { { 0.0, 0.0, 0.0 }, "Yakuza\t{"#cGRDialog"}/contract для заказа убийства{"#cWH"}" },
    { { -2812.1596, -670.4925, 8.6173 }, "Притон\t{33AAFF}Покупка наркотиков{"#cWH"}" }
    //{ { -1050.3795, -1334.8831, 130.1056 }, "Наркоферма\t{33AAFF}Производство наркотиков{"#cWH"}" },
    //{ { -2161.3943, -218.2833, 35.3263 }, "Оружейный завод\t{33AAFF}Производство оружия{"#cWH"}" },
    //{ { -422.6177, 1038.4544, 12.0000 }, "Автомойка\t " }
} ;
new gps_nelegal_place_items = sizeof gps_nelegal_place ;

new gps_auto_place [ 10 ] [ _gps ] =
{
    { { 2476.02, -716.021, 12.437 }, "Автосалон Эконом\t " },
    { { 447.073, 378.701, 12.14 }, "Автосалон Средний\t " },
    { { 1847.647, 195.381, 7.883 }, "Автосалон Премиум\t " },
    { { -2103.139, -365.604, 26.728 }, "Мотосалон\t " },
    { { 705.4224, 1054.2010, 11.8992 }, "Авторынок г. Арзамас\t " },
    { { 2429.2937, -2307.0330, 21.9400 }, "Автосервис г. Арзамас\t{"#cLY"}Внешний вид{"#cWH"}" }, 
    { { -2015.7323, -158.9904, 29.2034 }, "Автосервис пгт. Батырево\t{"#cLY"}Внешний вид{"#cWH"}" },
    { { 2346.6987, -2610.1125, 21.7845 }, "Автосервис г. Южный\t{"#cLY"}Внешний вид{"#cWH"}" },
    { { 1751.417, 2264.377, 15.697 }, "Perfomance пгт. Батырево\t{"#cOR"}Скорость, стабилизация и т.п.{"#cWH"}" },
    { { 221.5415, 1479.5183, 11.9219 }, "Perfomance г. Арзамас\t{"#cOR"}Скорость, стабилизация и т.п.{"#cWH"}" }
} ;
new gps_auto_place_items = sizeof gps_auto_place ;
 
new gps_other_place [ 14 ] [ _gps ] =
{
    { { 1865.2268, 1886.3151, 13.2188 }, "Семейный торговец\t{33AAFF}Обмен "family_title"{"#cWH"}" },
    { { 1864.0474, 1892.3818, 13.2188 }, "Семейные задания\t " },
    { { -1510.3588, 1614.3621, 36.7767 }, "Центр развлечений\t{"#cLY"}PaintBall, гонки{"#cWH"}" },

	{ { 2260.9, -2100.17, 21.9798 }, "Всё для охоты и рыбалки\t{"#cGRDialog"}Покупка ружья, удочки, наживки{"#cWH"}" },
	
	{ { 2240.95, 1369.24, 11.357 }, "Охотничьи угодья\t{"#cGRDialog"}Требуется ружьё{"#cWH"}" },
	{ { -2287.6931, -1004.0552, 36.5713 }, "Рыбацкое озеро\t{"#cGRDialog"}Требуется удочка и наживка{"#cWH"}" },
    { { 1969.94, -2603.91, 11.486 }, "Штрафстоянка №1\t " },
    { { -40.7030, 1361.3315, 12.8816 }, "Штрафстоянка №2\t " },
    { { -432.1726, -1719.1553, 44.1259 }, "Склад контейнеров\t{"#cLY"}Аукцион контейнеров{"#cWH"}" },
    { { -2747.308, -1143.274, 10.648 }, "Свалка контейнеров\t{"#cLY"}Аукцион контейнеров{"#cWH"}" },
    { { 2181.7795, -1837.9807, 18.8188 }, "Тренировочный центр\t{"#cLY"}Дуэли{"#cWH"}" },

    { { -2747.308, -1143.274, 10.648 }, "Свалка\t{"#cLY"}Предметы для крафта{"#cWH"}" },
    { { -401.6563, 776.3588, 12.0689 }, "Центральный рынок\t{"#cLY"}Продажа / покупка предметов для крафта{"#cWH"}" },
	
	{ { 1918.0828, 2073.2488, 15.7031 }, "{"#cLY"}Обменник Battle Coins\t{903464}Во время действия Battle Pass{"#cWH"}" }
} ;
new gps_other_place_items = sizeof gps_other_place ;

new gps_quests_place [ 10 ] [ _gps ] =
{
	{ { -482.9159, 906.1972, 12.1425 }, "Задания г. Арзамас\t{"#cGN"}Начальный{"#cWH"}" },
	{ { 2744.725, -2448.744, 21.897 }, "Задания г. Южный\t{"#cGN"}Начальный{"#cWH"}" },
	{ { 1815.0227, 2524.3146, 15.8020 }, "Задания г. Батырево\t{"#cGN"}Начальный{"#cWH"}" },
	{ { 464.849, 1689.856, 12.180 }, "Шейх г. Stone Island\t{"#cGN"}Начальный{"#cWH"}" },
	{ { -318.9356, 658.3504, 12.2208 }, "S1mple\t{"#cLY"}Продолжение начального{"#cWH"}" },
	{ { -1298.4938, -1035.2062, 63.5412 }, "Хасбулла\t{"#cLY"}Продолжение начального{"#cWH"}" },
	{ { 1920.3387, 2105.4924, 15.7163 }, "Цветочник Джое\t{33AAFF}Банды и мафии{"#cWH"}" },
	{ { 1155.3819, 2673.0395, 12.1015 }, "Дон Карлеоне\t{33AAFF}Семьи{"#cWH"}" },
	/*{ { 2594.6833, 2787.5974, 10.8203 }, "Ограбление" },
	{ { 2594.6731, 2793.6741, 10.8203 }, "Граффити" },
	{ { 1357.3638, -1021.4371, 21.0000 }, "Сено" },
	{ { 1315.0041, -993.5960, 21.0000 }, "Сбор яиц" },
	{ { 2133.1914, 1792.6624, 31.0000 }, "Дойка коров" },
	{ { 1319.6794, -908.4382, 21.0000 }, "Фермер" },
	{ { 1319.4278, -933.1977, 21.0000 }, "Мясокомбинат" },
	{ { 1316.2607, -968.3598, 21.0000 }, "Кормление коров" },
	{ { 2129.9936, 1817.5139, 31.0000 }, "Сбор фруктов" },*/
	{ { -2248.0346, -815.4050, 29.5322 }, "Черепахи\t{"#cGRDialog"}Побочный{"#cWH"}" },
	{ { -2193.6640, -793.3474, 29.3472 }, "Жемчуг\t{"#cGRDialog"}Побочный{"#cWH"}" }
} ;
new gps_quests_place_items = sizeof gps_quests_place ;

/*new gps_truck_loading [ 3 ] [ _gps ] =
{
	{ { 655.3007, 869.1117, -42.0791 }, "Шахта" },
	{ { 1025.9675, -358.8767, 74.6368 }, "Лесопилка" },
	{ { -117.2966, -320.5717, 1.4219 }, "Завод" }
} ;
new gps_truck_loading_items [ 48 * ( sizeof ( gps_truck_loading ) + 1 ) + 1 ] ;

new gps_truck_unloading [ 2 ] [ _gps ] =
{
	{ { -18.8481, -272.7238, 5.4297 }, "Завод" },
	{ { -2125.3994, -250.1821, 36.5619 }, "Оружейный завод" }
} ;
new gps_truck_unloading_items [ 48 * ( sizeof ( gps_truck_unloading ) + 1 ) + 1 ] ;*/

/*

	Наркоферма

*/

new Float: priton_position [ 3 ] = { -2801.8647, -656.4426, 7.9977 } ;
new Float: priton_pos_info [ 3 ] = { -2805.6486, -669.3335, 8.3406 } ;

/*

	Охота

*/

new Float:DeerPoint [ MAX_DEER ] [ 3 ] =
{
	{ 1190.9134, -750.9113, 41.0302 },
	{ 1291.2386, -756.0845, 40.1471 },
	{ 1218.2579, -847.9108, 40.7595 },
	{ 1338.2962, -781.8313, 40.3861 },
	{ 1369.0949, -718.3385, 41.3110 },
	{ 1449.0401, -760.8986, 41.3128 },
	{ 1328.5195, -913.3916, 40.9542 },
	{ 1257.1456, -1028.3773, 40.4320 },
	{ 1339.3642, -1019.3239, 41.2013 },
	{ 1440.9826, -974.0575, 39.5905 },
	{ 1470.1749, -893.8711, 40.4951 },
	{ 1401.0742, -745.1386, 40.8770 },
	{ 1465.4992, -750.1921, 41.2255 },
	{ 1390.2452, -697.0460, 41.3371 },
	{ 1502.5235, -742.1928, 40.9286 },
	{ 1592.8151, -808.0327, 41.4756 },
	{ 1564.1431, -925.2969, 40.0444 },
	{ 1552.5245, -812.3044, 41.8802 },
	{ 1444.5390, -942.9514, 40.6094 },
	{ 1442.9283, -859.5132, 40.8571 }
} ;

new Float:ForestPoint [ MAX_FOREST ] [ 4 ] =
{
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 },
	{ 1126.7448, -969.9370, 1597.5355, -774.4888 }
} ;

/*

	Jack Car

*/

new model_ls_skill [ ] = { 412, 419, 439, 466, 467, 474, 475, 516, 517, 518, 534, 535, 536, 542, 549 } ;
new Float: model_ls_pos [ 15 ] [ 4 ] =
{
	{ 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 },
	{ -63.9655, 1282.1570, 12.3280, 135.3701 },
	{ -302.2317, 837.3225, 13.4444, 147.5916 },
	{ -2485.2029, 2922.6770, 37.9126, 270.7184 },
	{ -2433.5530, 2883.7871, 38.0209, 179.7215 }
} ;
new bool: ls_place_toggled [ sizeof model_ls_pos ] = { false, ... } ;

new model_sf_skill [ ] = { 400, 405, 421, 426, 445, 458, 507, 550, 551, 555, 558, 559, 560, 565, 579 } ;
new Float: model_sf_pos [ 11 ] [ 4 ] =
{
    { 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 }

} ;
new bool: sf_place_toggled [ sizeof model_sf_pos ] = { false, ... } ;

new model_lv_skill [ ] = { 402, 424, 429, 477, 490, 506, 562, 580 } ;
new Float: model_lv_pos [ 14 ] [ 4 ] =
{
	{ 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 },
	{ -63.9655, 1282.1570, 12.3280, 135.3701 },
	{ -302.2317, 837.3225, 13.4444, 147.5916 },
	{ -2485.2029, 2922.6770, 37.9126, 270.7184 }
} ;
new bool: lv_place_toggled [ sizeof model_lv_pos ] = { false, ... } ;

new model_premium_skill [ ] = { 411, 415, 429, 451, 480, 494, 495, 541 } ;
new Float: model_premium_pos [ 12 ] [ 4 ] =
{
	{ 1767.4025, -2468.5840, 11.2091, 269.6551 },
	{ 2031.8457, -2691.6284, 11.3568, 270.2198 },
	{ 2086.8560, -2309.4714, 22.2168, 180.5139 },
	{ 2254.8701, -2134.8367, 22.3546, 34.3172 },
	{ 2337.4534, -1950.7502, 22.1449, 90.6632 },
	{ -11.5002, 963.4276, 12.0839, 253.9960 },
	{ 118.0820, 1054.4807, 12.3861, 348.1208 },
	{ 307.0013, 1037.5585, 12.3891, 83.4229 },
	{ 312.6053, 1553.7733, 12.3806, 309.1004 },
	{ 175.7901, 1730.5424, 12.3767, 81.7775 },
	{ 50.7603, 1734.5822, 9.7941, 182.7802 },
	{ -63.9655, 1282.1570, 12.3280, 135.3701 }
} ;
new bool: premium_place_toggled [ sizeof model_premium_pos ] = { false, ... } ;

/*

	airdrop

*/

new air_info [ MAX_POSITION_AIRDROP ] [ _air_info ] =
{
	{ "д. Корякино", { 1075.6875, -1405.0867, 150.1070,	0.0000, 0.0000, 0.0000 }, { 1075.6875, -1405.0867, 40.6672,   0.00, 0.00, 0.00 } },
	{ "острова", { -2563.0915, -2231.3417, 150.4510,	0.0000, 0.0000, 0.0000 }, { -2563.0915, -2231.3417, 12.4565,   0.00, 0.00, 0.00 } },
	{ "г. Арзамас", { -623.6829, 1638.4628, 190.7308,	0.0000, 0.0000, 0.0000 }, { -623.6829, 1638.4628, 17.7989,   0.00, 0.00, 0.00 } }
} ;

/*

	Jack Car (заказ)

*/

new Float: urgent_position [ MAX_URGENT_POSITION ] [ 3 ] =
{
	{ -1106.7509, 2202.9082, 37.9341 },
	{ -1051.6173, 2203.7514, 38.1177 }
} ;

/*

	кража боеприпасов

*/

new army_mats [ MAX_ARMY_MATS ] [ _mats ] =
{
    { 8, 2061, { 1621.9070,1813.7855,16.3077 }, 0, 0 },
	{ 8, 2061, { 1330.7899,1640.7856,16.3250 }, 0, 0 },
	{ 8, 2061, { 1214.3555,1594.3479,16.3558 }, 0, 0 },
	{ 8, 2061, { 1473.2474,1594.4364,16.3594 }, 0, 0 },
	{ 8, 2061, { 1586.0925,1646.1206,15.9701 }, 0, 0 },
	{ 9, 2061, { -1298.2877, 505.6084, 11.1953 }, 0, 0 },
	{ 9, 2061, { -1396.6760, 498.4873, 11.2026 }, 0, 0 },
	{ 9, 2061, { -1255.4607, 449.3180, 7.2065 }, 0, 0 }
} ;

/*

	submarine

*/

new sub_info [ MAX_POSITION_SUBMARINE ] [ _sub_info ] =
{
	{ "г. Лыткарино", { -2785.93726, -86.56967, 4.25420,   0.00000, 0.00000, 0.42000 }, 19379, { -2779.01733, -76.28094, 1.08974,   0.00000, 1000.00000, 0.00000 } },
	{ "г. Арзамас", { -567.31335, 1086.02429, 6.15229,   0.00000, 0.00000, 95.45999 }, 19379, { -575.89258, 1078.91821, 3.86154,   0.00000, 90.00000, 7.50000 } },
	{ "г. Южный", { 1061.22095, -2329.25562, 5.59327,   0.00000, 0.00000, -18.18000 }, 19379, { 1051.85596, -2335.23730, 1.98849,   0.00000, 75.00000, -18.72000 } }
};

new Float:army_container_pos [ MAX_POSITION_SUBMARINE * 2 ] [ 6 ] =
{
	{ -2742.62134, -24.14433, 2.29288,   0.00000, 0.00000, 0.42000 },
	{ -2757.79663, -24.14430, 2.29290,   0.00000, 0.00000, 0.42000 },
	{ -536.19897, 1041.59290, 12.35194,   0.00000, 0.00000, 0.00000 },
	{ -520.46802, 1041.59290, 12.35190,   0.00000, 0.00000, 0.00000 },
	{ 1040.47485, -2303.21802, 3.42987,   0.00000, 0.00000, 73.86005 },
	{ 1040.47485, -2290.56909, 3.63106,   0.00000, 0.00000, 73.86010 }
} ;

new Float: pickup_submarine [ MAX_POSITION_SUBMARINE ] [ 3 ] =
{
	{ -2785.8491, -106.6059, 3.6755 },
	{ -549.3521, 1087.8944, 5.5525 },
	{ 1054.8079, -2348.4790, 5.0038 }
} ;

/*

    Конфискация

*/

new Float: quad_lcn [ 4 ] ;
new Float: quad_rm [ 4 ] ;
new Float: quad_yakuza [ 4 ] ;

new Float: quad_drugs_farm [ 4 ] = { -1238.28125, -1410.15625, -937.5, -886.71875 } ;
new Float: quad_gun_factory [ 4 ] = { -2199.21875, -289.0625, -2078.125, -70.3125 } ;

/*

	Quest

*/

enum actor_quest
{
	actor_skin,
	actor_name [ 24 ],
	
	Float:actor_pos [ 4 ],
	actor_interior,
	actor_world,
	actor_type,
	
	actor_anim [ 32 ],
	actor_anim_lib [ 32 ]
} ;

#define MAX_QUEST_ACTORS 13
new quest_actor [ MAX_QUEST_ACTORS ] [ actor_quest ] =
{
    { 171, "Квестовый персонаж", { -482.9159, 906.1972, 12.1425, 59.7371 }, 0, 0, 0, "none",  "none" },
	{ 272, "Квестовый персонаж", { 2744.725, -2448.744, 21.897, 59.548 }, 0, 0, 0, "none",  "none" },
	{ 104, "Квестовый персонаж", { 1815.0227, 2524.3146, 15.8020, 302.4845 }, 0, 0, 0, "none",  "none" },
	{ 278, "Квестовый персонаж", { 464.849, 1689.856, 12.180, 85.372 }, 0, 0, 0, "none",  "none" },
	{ 276, "S1mple", { -318.9356, 658.3504, 12.2208, 177.0264 }, 0, 0, 6, "none",  "none" },
	{ 186, "Хасбулла", { -1298.4938, -1035.2062, 63.5412, 355.6412 }, 0, 0, 7, "none",  "none" },
	{ 175, "Марасиньо Шракур", { 2169.5967, -1687.6171, 15.0859, 342.8485 }, 0, 0, 1, "DEALER",  "DEALER_IDLE" },
	{ 43, "Цветочник Джое", { 1920.3387, 2105.4924, 15.7163, 108.5376 }, 0, 0, 2, "DEALER",  "DEALER_IDLE" },
	{ 113, "Дон Карлеоне", { 1865.2268, 1886.3151, 13.2188, 314.8987 }, 0, 0, 3, "DEALER",  "DEALER_IDLE" },
	{ 47, "Торфин Жёсткий", { -427.6315, 1037.5460, 12.0115, 286.1413 }, 0, 0, 4, "DEALER",  "DEALER_IDLE" },
	{ 46, "Дик Рук Западный", { 1864.0474, 1892.3818, 13.2188, 252.9935 }, 0, 0, 5, "none",  "none" },
	{ 29, "Тощий Пит", { -2812.1596, -670.4925, 8.6173, 180.0989 }, 0, 0, 20, "DEALER",  "DEALER_IDLE" },
	{ 29, "Хантел Чтотокрад", { 2182.3017, -1856.5260, 18.8189, 37.1952 }, 0, 0, 21, "DEALER",  "DEALER_IDLE" }
} ;

new quest_actor_area [ MAX_QUEST_ACTORS ] ;

/*

	miner

*/

new Float: miner_cp [ 11 ] [ 3 ] =
{
	{ -1099.7990, -348.7245, 1395.9835 },
	{ -1100.2843, -352.0152, 1395.9030 },
	{ -1107.6046, -325.6720, 1397.5681 },
	{ -1108.0033, -323.2995, 1397.6132 },
	{ -1127.2749, -311.3306, 1398.1993 },
	{ -1129.9337, -309.7675, 1398.2343 },
	{ -1116.1293, -330.2281, 1409.6229 },
	{ -1115.0909, -324.5461, 1408.9136 },
	{ -1119.7144, -330.4829, 1409.6995 },
	{ -1120.0090, -324.4146, 1408.8445 },
	{ -1118.1940, -369.5938, 1401.2341 }
} ;

new Float: miner_unload_position [ 3 ] = { -1119.4636, -360.9237, 1401.7491 } ;
new Float: miner_zone_position [ 3 ] = { -1119.4636, -360.9237, 1401.7491 } ;

/*

	factory

*/

#define MAX_GUNWORK_TABLE 9

new table_area [ MAX_GUNWORK_TABLE ] ;
new table_area_toggled [ MAX_GUNWORK_TABLE ] ;

new bool:have_factory_box [ MAX_PLAYERS ] = { false, ... },
    factory_table_id [ MAX_PLAYERS char ] = { 0, ... } ;

new factory_take_area ;

new Float: table_areas_pos [ MAX_GUNWORK_TABLE ] [ 3 ] =
{	
	{ 1706.1085, 304.9668, 1401.0000 },
	{ 1708.2327, 318.5704, 1401.0000 },
	{ 1713.7305, 300.5636, 1401.0000 },
	{ 1701.9356, 296.3287, 1401.0000 },
	{ 1691.9495, 293.8544, 1401.0000 },
	{ 1700.1573, 300.9678, 1401.0000 },
	{ 1695.1503, 314.3629, 1401.0000 },
	{ 1709.5289, 296.3645, 1401.0000 },
	{ 1691.9822, 297.2607, 1401.0000 }
} ;

new Float: factory_box_unload [ 3 ] = { 1701.4378, 334.5983, 1401.0000 } ;
new Float: factory_box_position [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;
new Float: factory_take_position [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;
new Float: factory_pickup_boxes [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;
new Float: factory_zone_position [ 3 ] = { 1685.8614, 306.8830, 1401.0000 } ;

/*

	sawmil

*/

new Float:tree_positions [ 17 ] [ 6 ] = // 618
{
	{ 1494.9351, 2823.2109, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1501.2811, 2808.0549, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1496.6313, 2796.1801, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1496.6522, 2778.8647, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1510.9093, 2772.8237, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1521.7133, 2782.7351, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1525.3884, 2797.5122, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1530.9440, 2813.4729, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1543.1014, 2822.5270, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1560.4030, 2822.6047, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1557.1866, 2811.5534, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1547.8372, 2795.0976, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1544.7932, 2780.7106, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1542.0635, 2766.5407, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1558.9392, 2764.9785, 11.6899,   0.00000, 0.00000, 0.00000 },
	{ 1567.5589, 2778.3808, 11.6875,   0.00000, 0.00000, 0.00000 },
	{ 1569.9671, 2791.2573, 11.6875,   0.00000, 0.00000, 0.00000 }
} ;

new Float: tree_unload_position [ 3 ] = { 1499.9731, 2868.1442, 11.8671 } ;

/*

	Bank Robbery

*/

new Float: bank_robbery_pick [ MAX_BANKS ] [ 3 ] =
{
    { 980.6726, -476.5360, 1008.9092 },
	{ 979.1316, -475.2167, 1008.9092 },
	{ 979.3150, -471.8606, 1008.9092 },
	
	{ 979.3150, -471.8606, 1008.9092 }
} ;

new bank_names [ MAX_BANKS ] [ 16 ] =
{
	"Т-Банк Арзамас",
	"Тинькофф",
	"Т-Банк Южный",
	
	"Сбер Island"
} ;

new Float: bank_progress_checkpoint [ MAX_BANKS ] [ 3 ] =
{
	{ 1907.7779, -2239.8271, 11.0595 },
	{ 1903.0008, 1722.3802, 15.9925 },
	{ 1903.0008, 1722.3802, 15.9925 },
	
	{ 1903.0008, 1722.3802, 15.9925 }
} ;

new Float: bank_vehicle_pos [ MAX_BANK_GZ ] [ 4 ] =
{
   	{ -2599.1132, 2802.5219, 37.8291, 358.4070 },
	{ -1494.7735, 1544.1082, 36.4899, 270.4045 },
	{ 2485.2744, -201.6959, 2.5809, 168.7185 },
	{ 535.2778, -1229.6591, 40.7058, 161.9521 },
	{ 2315.5058, -2327.3596, 21.9660, 180.4908 },
	{ 153.9726, 1710.2375, 12.1298, 168.7470 }
} ;

new Float: robbery_doors [ MAX_BANKS ] [ 6 ] =
{
    { 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 },
	{ 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 },
	{ 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 },
	
	{ 993.1038, -460.2257, 1015.4014, 0.0000, 0.0000, -90.0000 }
} ;

/*

	Откат ограбления

*/

#define MAX_ROBBERY_POSITION 2
new Float: robbery_position [ MAX_ROBBERY_POSITION ] [ 3 ] =
{
	{ -1106.7509, 2202.9082, 37.9341 },
	{ -1051.6173, 2203.7514, 38.1177 }
} ;

/*

	Family Quest

*/

new Float: fam_con_buritto [ 4 ] = { 1869.3351, 1900.7021, 13.2229, 275.1915 } ;

new fam_con_pickup ;
new Float: fam_con_position [ 3 ] = { -1783.6271, -1105.7000, 49.1617 } ;
new Float: fam_con_gps [ 2 ] [ 3 ] =
{
	{ -1783.6271, -1105.7000, 49.1617 },
	{ 1836.3229, 2160.9033, 15.6397 }
} ;

new ink_quest_pickup [ 3 ] ;
new Float: ink_quest_enter [ 3 ] [ 3 ] =
{
	{ 1831.1251, 2038.3938, 15.8850 },
	{ 421.5002, 619.5287, 12.0000 },
	{ 2376.5864, -2129.4839, 22.1167 }
} ;

new Float: ink_car_position [ 3 ] [ 4 ] =
{
	{ 1818.4205, 2039.4039, 16.0819, 270.1484 },
	{ 428.0262, 614.2616, 12.0748, 130.3902  },
	{ 2388.4038, -2124.3062, 21.9676, 91.0207 }
} ;

new Float: ink_quest_position [ 3 ] [ 3 ] =
{
	{ 2388.4038, -2124.3062, 21.9676 },
 	{ 1818.4205, 2039.4039, 16.0819 },
	{ 421.5002, 619.5287, 12.0000 }
} ;

/*

	Boxing Spawn

*/

new Float:boxing_spawn [ 3 ] [ 4 ] =
{
	{ 1997.9544, 2010.8920, 1499.3984, 311.9240 },
	{ 2002.1077, 2015.5246, 1499.3984, 110.9596 },
	{ 1994.9169, 2018.1477, 1498.7265, 186.5323 }
} ;

/*

	Cellar

*/

#define cellar_interior 6
new Float: cellar_table_pos [ 3 ] = { 1497.8924, 2499.3320, 1601.0000 } ;
new Float: cellar_text_pos [ 3 ] = { 1500.0668, 2496.2875, 1601.0000 } ;
new Float: cellar_enter_pos [ 4 ] = { 1498.4794, 2503.9855, 1601.0000, 146.0584 } ;
new Float: cellar_player_spawn [ 4 ] = { 1502.6672, 2503.0375, 1601.0000, 129.7407 } ;
new Float: cellar_veh_garage [ 4 ] = { 1499.9361, 2499.7351, 1600.8255, 180.8342 } ;

/*

	Hotel

*/

// чтоб всё было окей у отелей, они должны находиться друг от друга, минимум, в 10и идах (бизнес)

#define MAX_ROOMS   12
new Float:rooms_position [ MAX_ROOMS ] [ 4 ] =
{
	{ -1889.0400, 1983.4067, 1165.4636, 267.3506 },
	{ -1889.0317, 1980.8937, 1165.4636, 266.7804 },
	{ -1889.0377, 1978.3229, 1165.4636, 269.3013 },
	{ -1889.0334, 1975.7653, 1165.4636, 269.3289 },
	{ -1889.0405, 1973.1080, 1165.4636, 268.3386 },
	{ -1889.0308, 1970.5614, 1165.4636, 269.2615 },
	{ -1884.7073, 1970.5327, 1165.4636, 89.7877 },
	{ -1884.7056, 1973.1754, 1165.4636, 90.1290 },
	{ -1884.7108, 1975.7376, 1165.4636, 88.7815 },
	{ -1884.7032, 1978.3273, 1165.4636, 91.2003 },
	{ -1884.7116, 1980.8820, 1165.4636, 89.8233 },
	{ -1884.7021, 1983.4189, 1165.4636, 87.7758 }
} ;

new Float: hotel_exit_pickup [ 4 ] = { -2030.6610, 1973.7435, 1164.0964, 0.8170 } ;
new Float: position_spawn_hotel [ 4 ] = { -2031.3840, 1980.7836, 1164.0964, 168.0294 } ;

/*
	
	Parking
	
*/

#define parking_interior 21
new Float: position_player_parking [ 4 ] = { 941.9621, -29.0439, 787.7415, 278.7233 } ;
new Float: position_text_parking [ 3 ] = { 957.3778, -30.7134, 787.1038 } ;
new Float: position_vehicle_parking [ 4 ] = { 973.6870, -16.0773, 786.6587, 270.6184 } ;

/*

	House

*/

#define HINTS_COUNT 7

//#define pickupPropertyFree 1273
//#define pickupPropertyUse 1272
//#define pickupPropertyGarage 1239

#define pickupPropertyFree 1273
#define pickupPropertyUse 1272
#define pickupPropertyGarage 19131

enum _house_int
{
	hint_class,
	Float:hint_position [ 4 ],
	Float:hspawn_position [ 4 ],
	hint_int,
	hint_description [ 54 ]
} ;

new bool: create_pick_house_exit [ HINTS_COUNT ] = { false, ... } ;
new pick_house_exit [ HINTS_COUNT ] ;
new house_int [ HINTS_COUNT ] [ _house_int ] =
{
	{ 3, { 2415.5083, 286.3436, 1401.0000, 355.5837 }, { 2394.2592, 289.1534, 1401.0000, 311.6602 }, 9, "Квартира (Москоу сити)"},
	{ 1, { 1397.7495, 290.2237, 1401.0000, 353.6212 }, { 1391.3106, 298.3734, 1401.0000, 265.4133 }, 8, "2ух этажная квартира"},
	{ 2, { 1397.7495, 290.2237, 1401.0000, 353.6212 }, { 1391.3106, 298.3734, 1401.0000, 265.4133 }, 8, "2ух этажный дом"},
	{ 3, { 2415.5083, 286.3436, 1401.0000, 355.5837 }, { 2394.2592, 289.1534, 1401.0000, 311.6602 }, 9, "Пентхаус, люкс интерьер"},
	{ 1, { 1097.9675, 293.9834, 1401.0000, 354.2443 }, { 1102.1008, 306.5283, 1401.0000, 177.4632 }, 7, "3ёх комнатный дом"},
	{ 0, { 1097.9675, 293.9834, 1401.0000, 354.2443 }, { 1102.1008, 306.5283, 1401.0000, 177.4632 }, 7, "Старая квартира"},
	{ 1, { 1097.9675, 293.9834, 1401.0000, 354.2443 }, { 1102.1008, 306.5283, 1401.0000, 177.4632 }, 7, "Маленькая квартира с ремонтом"}
} ;

new Float:house_safe_pos [ HINTS_COUNT ] [ 6 ] =
{
	{ 2399.1176, 292.6497, 1401.0000, 0.0000, 0.0000, 90.0 },
	{ 1398.4273, 291.8314, 1401.0000, 0.0000, 0.0000, 180.0 },
	{ 1398.4273, 291.8314, 1401.0000, 0.0000, 0.0000, 0.0 },
	{ 2399.1176, 292.6497, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1101.4908, 306.4855, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1101.4908, 306.4855, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1101.4908, 306.4855, 1401.0000, 0.0000, 0.0000, -90.0 }
} ;

new Float:house_freeze_pos [ HINTS_COUNT ] [ 6 ] =
{
	{ 2403.1240, 307.4076, 1401.0000, 0.0000, 0.0000, 90.0 },
	{ 1399.8908, 309.5599, 1401.0000, 0.0000, 0.0000, 180.0 },
	{ 1399.8908, 309.5599, 1401.0000, 0.0000, 0.0000, 0.0 },
	{ 2403.1240, 307.4076, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1096.5185, 300.0601, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1096.5185, 300.0601, 1401.0000, 0.0000, 0.0000, -90.0 },
	{ 1096.5185, 300.0601, 1401.0000, 0.0000, 0.0000, -90.0 }
} ;

new Float:house_veh_garage [ max_class ] [ 4 ] =
{
	{ 1499.9361, 2499.7351, 1600.8255, 180.8342 },
	{ 1499.9361, 2499.7351, 1600.8255, 180.8342 },
	{ 499.1057, 1991.3969, 1547.9420, 295.9618 },
	{ 499.1057, 1991.3969, 1547.9420, 295.9618 }
} ;

new house_garage_interior [ max_class ] = { 6, 6, 1, 1 } ;
new Float:house_garage_position [ max_class ] [ 4 ] =
{
	{ 1498.4794, 2503.9855, 1601.0000, 146.0584 },
	{ 1498.4794, 2503.9855, 1601.0000, 146.0584 },
	{ 496.4140, 2014.7678, 1547.8515, 177.8924 },
	{ 496.4140, 2014.7678, 1547.8515, 177.8924 }
} ;

new Float:house_garage_text [ max_class ] [ 4 ] =
{
	{ 1500.0668, 2496.2875, 1601.0000, 175.6883 },
	{ 1500.0668, 2496.2875, 1601.0000, 175.6883 },
	{ 493.0792, 1989.0706, 1547.6866, 97.9286 },
	{ 493.0792, 1989.0706, 1547.6866, 97.9286 }
} ;

new Float: house_cellar_position [ 4 ] = { 499.6892, 2496.1872, 1503.7264, 92.6199 } ;
new Float: house_cellar_text [ 3 ] = { 498.1103, 2502.9570, 1500.9956 } ;
#define house_cellar_int 1

#define yacht_interior 11
new Float: yacht_freeze [ 3 ] = { 295.6707, 1002.4004, 999.5312 } ;
new Float: yacht_clothes [ 3 ] = { 300.3798, 994.7538, 999.5312 } ;
new Float: yacht_spawn [ 4 ] = { 301.2443, 997.4320, 999.5312, 72.6010 } ;
new Float: yacht_enter [ 4 ] = { 299.5769, 1005.6893, 999.5386, 176.3741 } ;

/*

	duels
	
*/

new Float: duels_pos [ 6 ] [ 4 ] =
{
	{ 201.8062, 89.8162, 42.9854, 271.7700 },
	{ 85.4893, 91.5027, 42.9854, 90.5370 },
	
	{ 1717.5389, -2557.5913, 11.2748, 2.0126 },
	{ 1711.8566, -2451.0737, 9.5063, 226.0120 },
	
	{ -2414.9753, 1678.7813, 53.0214, 121.9914 },
	{ -2504.8813, 1560.1192, 53.0214, 29.6862 }
} ;

new duels_interior [ 3 ] = { 0, 0, 0 } ;

/*

	Gym

*/

#define gym_interior 5

#define max_gym_bike 5
new Float: gym_bike_position [ max_gym_bike ] [ 4 ] =
{
	{ 1992.4897, 2010.7996, 1498.7265, 79.2709 },
	{ 1992.4122, 2012.2374, 1498.7265, 86.2848 },
	{ 1992.4166, 2013.7410, 1498.7265, 62.3246 },
	{ 2007.8300, 2001.5379, 1498.7265, 242.6216 },
	{ 2007.6741, 2002.9858, 1498.7265, 251.2684 }
} ;
//new area_gym_bike [ max_gym_bike ] ;

#define max_gym_thread 8
new Float: gym_thread_position [ max_gym_thread ] [ 4 ] =
{
	{ 2006.6093, 2004.8414, 1498.7265, 281.7438 },
	{ 2006.5444, 2007.4865, 1498.7265, 270.1540 },
	{ 2006.8149, 2009.8514, 1498.7265, 265.9346 },
	{ 2006.8647, 2012.5960, 1498.7265, 268.3707 },
	{ 1993.4630, 2008.9815, 1498.7265, 89.5462 },
	{ 1993.6064, 2006.2154, 1498.7265, 92.7958 },
	{ 1993.7169, 2003.9088, 1498.7265, 90.4394 },
	{ 1993.7763, 2001.1262, 1498.7265, 90.2000 }
} ;
//new area_gym_thread [ max_gym_thread ] ;

#define max_gym_bar 3
new Float: gym_bar_position [ max_gym_bar ] [ 4 ] =
{
	{ 2008.1435, 1991.3890, 1498.7265, 183.5687 },
	{ 1997.6160, 2006.6156, 1498.7265, 290.8833 },
	{ 2002.3204, 2006.5960, 1498.7265, 87.4815 }
} ;
//new area_gym_bar [ max_gym_bar ] ;

#define max_gym_dumbbells 2
new Float: gym_dumbbells_position [ max_gym_dumbbells ] [ 4 ] =
{
	{ 1992.7711, 1991.3720, 1498.7812, 275.2420 },
	{ 1992.8363, 1994.3310, 1498.7812, 253.4648 }
} ;
//new area_gym_dumbbells [ max_gym_dumbbells ] ;

#define max_gym_pear 2
new Float: gym_pear_position [ max_gym_pear ] [ 3 ] =
{
	{ 2007.6162, 1999.5728, 1498.7265 },
	{ 2007.2841, 1996.5406, 1498.7265 }
} ;

new bool:SimulatorUse [ MAX_BUSINESS ] [ max_gym_bike + max_gym_thread + max_gym_bar + max_gym_dumbbells + max_gym_pear ] ;

/*

	Vehicles

*/

/*new vehicle_name [ 212 ] [ 32 ] =
{
	"BMW X5 E53","Alfa Romeo 33","Tesla Model S","DAF XF","Lamborghini LM002","Audi Rs7","BelAZ","Firetruck","Nissan 240SX","Toyota Land Cruiser 200","LADA Priora",
	"Ford Mustang Boss 200", "Dodge Coronet 1967","BMW 535I E34","Gazel","Audi R8","Mercedes-Benz Sprinter Hospital","Leviathan","Volga","Lada Vesta","Vaz 2114","Mercedes-Benz S600","Molniya Maqueen","BMW 750IL E38",
	"Zaporozech","Hunter","Vaz 2107","Chevrolet Camaro ZL1","Chevrolet Camaro ZR1","Mercedes-Benz C63s W205 Coupe","Predator","Bus MAZ","Rhino","KamAZ","Porsche Panamera Turbo S","Article Trailer","Ford Sierra R5","Dodge Challenger SRT","Kia Rio",
	"Volvo 244","Pegout 406","RC Bandit","Vaz 2101","Packer","Renault Megane","Kia Stinger","Squalo","Seasparrow","Pizzaboy","Trailer","Article Trailler 2","Dodge SRT Demon","Speeder",
	"Reefer","Tropic","UAZ Hunter","Vaz 2110","Volkswagen Golf II GTI","Cadilac Escalade","Volkswagen Polo","Skimmer","Freeway DPS","Faggio","Bike Skeletone","RC Baron","RC Raider",
	"BMW M5 F90","Skoda Ocvatia","Sanchez","Sparrow","Lada Niva Urban","Quad","Coastguard","Dinghy","Moskvich","Lamborghini Urus","Rustler","Lamborghini Countach","GAZ Tigr","Toyota Camry XV70",
	"Bentley Continental","BMX","GMC Vandura","AZLK 2141","Marquise","Mercedes-Benz 200 W240","Dozer","Maverick","Maverick San-News","Renault Logan","Mercedes-Benz G63","Aston Martin","Nissan Skyline",
	"Jetmax","Buggati Chiron","Mercedes-Benz 6x6","Honda Civic","Maverick Police","Lexus LS 500","Jeep Grand Cherokee SRT8","Daewoo Lanos","RC Goblin","Nissan GTR R35","BMW I8",
	"Mercedes-Benz GT 63 S","Mercedes-Benz ","Porsche 911SS","BMW 50D E39","Mercedes-Benz CLS63","Bike","Mountain Bike","Beagle","Cropduster","Stuntplane","Tanker","KamAZ MAZ",
	"Audi 100 c4","Mercedes-Benz C63 AMG","Toyota Mark 2","Shamal","Ducati 848","FCR-900","NGR-500","HPV100","Cement Truck","Towtruck","BMW M2","Lada 2119","ZIL Police",
	"Honda Accord","Forklift","Tractor","Combine Harvester","Subaru Impreza STI","BMW M3","Slamvan","Ford Mustang GT","None","None","Vortex","Kia Ceed","Acura NSX","Tesla Cyber Truck",
	"Toyota Supra","Firetruck LA","Audi RS6","Intruder","Primo","Cargobob","Ferrari La-Ferarri","Sunrise","Mercedes-Benz Maybach S650","Utility Van","Nevada","Yosemite","Windsor","Monster A",
	"Monster B","1111 OKA","Jester","Subaru BRZ","Stratum","Nissan Silvia","Raindance","RC Tiger","Jaguar F-Type","Jeep GrandCherokee V8","Audi Q7","Bandito","None","None",
	"Kart","Mower","Dune","Sweeper","McLaren P1","Mitsubishi Evolution","AT-400","DFT-30","Lexus LX570","Rolls-Royce Wraith","BF-400","Fiat Tinkoff","Tug","Petlor Trailer","Emperor",
	"Wayfarer","Mercedes-Benz CLS63 AMG","Mercedes-Benz GTRK Ritm","Volkswagen Golf STI","None","Article Trailer 3","Andromada","Dodo","RC Cam","Launch","Lada Priora DPS","Police Car(SFPD)",
	"Police Car(LVPD)","UAZ Hunter","Picador","S.W.A.T","Lamborghini Huracan","BMW M8","Glendale Shit","L Trailer","L Trailer A","Baggage Trailer B",
	"Tug Stailers Trailer","Boxville","Farm Trailer","U Trailer"
} ;*/

stock max_veh_speed ( model )
{
	new _v_speed ;
	switch ( model )
	{
		case 400: _v_speed = 250 ;
		case 401: _v_speed = 186 ;
		case 402: _v_speed = 350 ;
		case 403: _v_speed = 85 ;
		case 404: _v_speed = 201 ;
		case 405: _v_speed = 250 ;
		case 406: _v_speed = 110 ;
		case 407: _v_speed = 113 ;
		case 408: _v_speed = 240 ;
		case 409: _v_speed = 195 ;
		case 410: _v_speed = 195 ;
		case 411: _v_speed = 190 ;
		case 412: _v_speed = 210 ;
		case 413: _v_speed = 232 ;
		case 414: _v_speed = 100 ;
		case 415: _v_speed = 340 ;
		case 416: _v_speed = 170 ;
		case 417: _v_speed = 200 ;
		case 418: _v_speed = 175 ;
		case 419: _v_speed = 193 ;
		case 420: _v_speed = 165 ;
		case 421: _v_speed = 250 ;
		case 422: _v_speed = 440 ;
		case 423: _v_speed = 250 ;
		case 424: _v_speed = 118 ;
		case 425: _v_speed = 170 ;
		case 426: _v_speed = 155 ;
		case 427: _v_speed = 310 ;
		case 428: _v_speed = 315 ;
		case 429: _v_speed = 290 ;
		case 430: _v_speed = 114 ;
		case 431: _v_speed = 106 ;
		case 432: _v_speed = 87 ;
		case 433: _v_speed = 163 ;
		case 434: _v_speed = 315 ;
		case 435: _v_speed = 197 ;
		case 436: _v_speed = 152 ;
		case 437: _v_speed = 270 ;
		case 438: _v_speed = 183 ;
		case 439: _v_speed = 165 ;
		case 440: _v_speed = 240 ;
		case 441: _v_speed = 150 ;
		case 442: _v_speed = 140 ;
		case 443: _v_speed = 160 ;
		case 444: _v_speed = 169 ;
		case 445: _v_speed = 270 ;
		case 446: _v_speed = 200 ;
		case 447: _v_speed = 190 ;
		case 448: _v_speed = 150 ;
		case 449: _v_speed = 306 ;
		case 450: _v_speed = 240 ;
		case 451: _v_speed = 270 ;
		case 452: _v_speed = 190 ;
		case 453: _v_speed = 190 ;
		case 454: _v_speed = 160 ;
		case 455: _v_speed = 130 ;
		case 456: _v_speed = 170 ;
		case 457: _v_speed = 208 ;
		case 458: _v_speed = 180 ;
		case 459: _v_speed = 190 ;
		case 460: _v_speed = 160 ;
		case 461: _v_speed = 190 ;
		case 462: _v_speed = 120 ;
		case 463: _v_speed = 280 ;
		case 464: _v_speed = 75 ;
		case 465: _v_speed = 251 ;
		case 466: _v_speed = 305 ;
		case 467: _v_speed = 210 ;
		case 468: _v_speed = 190 ;
		case 469: _v_speed = 185 ;
		case 470: _v_speed = 137 ;
		case 471: _v_speed = 160 ;
		case 472: _v_speed = 190 ;
		case 473: _v_speed = 156 ;
		case 474: _v_speed = 150 ;
		case 475: _v_speed = 305 ;
		case 476: _v_speed = 241 ;
		case 477: _v_speed = 307 ;
		case 478: _v_speed = 170 ;
		case 479: _v_speed = 220 ;
		case 480: _v_speed = 335 ;
		case 481: _v_speed = 120 ;
		case 482: _v_speed = 150 ;
		case 483: _v_speed = 170 ;
		case 484: _v_speed = 301 ;
		case 485: _v_speed = 209 ;
		case 486: _v_speed = 200 ;
		case 487: _v_speed = 200 ;
		case 488: _v_speed = 166 ;
		case 489: _v_speed = 172 ;
		case 490: _v_speed = 220 ;
		case 491: _v_speed = 295 ;
		case 492: _v_speed = 315 ;
		case 493: _v_speed = 235 ;
		case 494: _v_speed = 420 ;
		case 495: _v_speed = 260 ;
		case 496: _v_speed = 270 ;
		case 497: _v_speed = 250 ;
		case 498: _v_speed = 250 ;
		case 499: _v_speed = 257 ;
		case 500: _v_speed = 172 ;
		case 501: _v_speed = 177 ;
		case 502: _v_speed = 315 ;
		case 503: _v_speed = 307 ;
		case 504: _v_speed = 315 ;
		case 505: _v_speed = 170 ;
		case 506: _v_speed = 320 ;
		case 507: _v_speed = 206 ;
		case 508: _v_speed = 250 ;
		case 509: _v_speed = 140 ;
		case 510: _v_speed = 200 ;
		case 511: _v_speed = 200 ;
		case 512: _v_speed = 87 ;
		case 513: _v_speed = 120 ;
		case 514: _v_speed = 251 ;
		case 515: _v_speed = 163 ;
		case 516: _v_speed = 210 ;
		case 517: _v_speed = 250 ;
		case 518: _v_speed = 280 ;
		case 519: _v_speed = 330 ;
		case 520: _v_speed = 217 ;
		case 521: _v_speed = 200 ;
		case 522: _v_speed = 160 ;
		case 523: _v_speed = 160 ;
		case 524: _v_speed = 160 ;
		case 525: _v_speed = 213 ;
		case 526: _v_speed = 250 ;
		case 527: _v_speed = 190 ;
		case 528: _v_speed = 85 ;
		case 529: _v_speed = 207 ;
		case 530: _v_speed = 160 ;
		case 531: _v_speed = 160 ;
		case 532: _v_speed = 251 ;
		case 533: _v_speed = 255 ;
		case 534: _v_speed = 237 ;
		case 535: _v_speed = 160 ;
		case 536: _v_speed = 372 ;
		case 537: _v_speed = 110 ;
		case 538: _v_speed = 110 ;
		case 539: _v_speed = 251 ;
		case 540: _v_speed = 183 ;
		case 541: _v_speed = 306 ;
		case 542: _v_speed = 170 ;
		case 543: _v_speed = 265 ;
		case 544: _v_speed = 122 ;
		case 545: _v_speed = 265 ;
		case 546: _v_speed = 285 ;
		case 547: _v_speed = 160 ;
		case 548: _v_speed = 197 ;
		case 549: _v_speed = 340 ;
		case 550: _v_speed = 305 ;
		case 551: _v_speed = 260 ;
		
		case 552: _v_speed = 160 ;
		case 553: _v_speed = 200 ;
		case 554: _v_speed = 275 ;
		case 555: _v_speed = 110 ;
		case 556: _v_speed = 170 ;
		case 557: _v_speed = 251 ;
		case 558: _v_speed = 130 ;
		case 559: _v_speed = 210 ;
		case 560: _v_speed = 226 ;
		case 561: _v_speed = 197 ;
		case 562: _v_speed = 210 ;
		case 563: _v_speed = 200 ;
		case 564: _v_speed = 237 ;
		case 565: _v_speed = 321 ;
		case 566: _v_speed = 267 ;
		case 567: _v_speed = 225 ;
		case 568: _v_speed = 170 ;
		case 569: _v_speed = 110 ;
		case 570: _v_speed = 110 ;
		case 571: _v_speed = 90 ;
		case 572: _v_speed = 60 ;
		case 573: _v_speed = 110 ;
		case 574: _v_speed = 184 ;
		case 575: _v_speed = 357 ;
		case 576: _v_speed = 253 ;
		case 577: _v_speed = 200 ;
		case 578: _v_speed = 305 ;
		case 579: _v_speed = 250 ;
		case 580: _v_speed = 290 ;
		case 581: _v_speed = 158 ;
		case 582: _v_speed = 160 ;
		case 583: _v_speed = 170 ;
		case 584: _v_speed = 240 ;
		case 585: _v_speed = 165 ;
		case 586: _v_speed = 296 ;
		case 587: _v_speed = 329 ;
		case 588: _v_speed = 190 ;
		case 589: _v_speed = 265 ;
		case 590: _v_speed = 110 ;
		case 591: _v_speed = 120 ;
		case 592: _v_speed = 200 ;
		case 593: _v_speed = 200 ;
		case 594: _v_speed = 60 ;
		case 595: _v_speed = 190 ;
		case 596: _v_speed = 166 ;
		case 597: _v_speed = 201 ;
		case 598: _v_speed = 251 ;
		case 599: _v_speed = 130 ;
		case 600: _v_speed = 178 ;
		case 601: _v_speed = 110 ;
		case 602: _v_speed = 320 ;
		case 603: _v_speed = 305 ;
		case 604: _v_speed = 231 ;
		case 605: _v_speed = 165 ;
		case 606: _v_speed = 160 ;
		case 607: _v_speed = 160 ;
		case 608: _v_speed = 160 ;
		case 609: _v_speed = 140 ;
		case 610: _v_speed = 160 ;
		case 611: _v_speed = 160 ;
		
		default: _v_speed = 200 ;
	}
	return _v_speed ;
}

/*

	Training

*/

const interior_training = 30 ;
new Float: training_pickup_exit [ max_maps ] [ 4 ] =
{
	{ 60.3501, 615.0355, 1011.0000, 294.3141 },
	{ 337.4527, 752.7503, 1011.0000, 93.7341 }
} ;

/*

	Mafia Factory

*/

new Float:InFactorySF [ ] [ 3 ] =
{
	{ -2157.1682, -248.9834, 36.5156 },
	{ -2157.1736, -247.0755, 36.5156 },
	{ -2160.8301, -247.0759, 36.5156 },
	{ -2160.7249, -248.9828, 36.5156 },
	{ -2164.0405, -248.9827, 36.5156 },
	{ -2164.2017, -247.0761, 36.5156 },
	{ -2167.7698, -247.0759, 36.5156 },
	{ -2167.7573, -248.9828, 36.5156 },
	{ -2171.2109, -248.9825, 36.5156 },
	{ -2171.2607, -247.0756, 36.5156 },
	{ -2174.9988, -247.0750, 36.5156 },
	{ -2174.6753, -248.9835, 36.5156 }
};

new Float:rent_position [ 5 ] [ 3 ] =
{
    { -2155.5325, -264.1970, 36.5156 },
	{ -2158.9153, -264.2672, 36.5156 },
	{ -2162.3665, -264.2671, 36.5156 },
	{ -2165.8293, -264.2680, 36.5156 },
	{ -2169.3394, -264.2683, 36.5156 }
} ;

/*

	Jail

*/

const jail_interior = 1 ;

#define MAX_JAIL_SPAWN 10
new Float:jail_spawn [ MAX_JAIL_SPAWN ] [ 4 ] =
{
	{ 913.7928, 4.3062, 1399.9978, 86.6297 },
	{ 913.9542, 1.4708, 1399.9978, 87.7527 },
	{ 914.3837, -1.3761, 1399.9978, 77.9264 },
	{ 913.8224, -4.5742, 1399.9978, 81.1549 },
	{ 913.9264, -7.4955, 1399.9978, 74.9176 },
	{ 907.7309, -7.2247, 1399.9978, 275.7327 },
	{ 907.6371, -4.6182, 1400.0052, 279.8035 },
	{ 907.5487, -1.5340, 1400.0052, 269.9773 },
	{ 907.2159, 1.1629, 1399.9978, 277.6978 },
	{ 908.0001, 4.3279, 1399.9978, 273.9077 }
} ;

#define MAX_AREA_JAIL 1
new Float:jail_arrest [ MAX_AREA_JAIL ] [ 4 ] =
{
	{ 910.7253, -0.7746, 1400.0052 }
} ;

new Float:exit_jail_player [ 4 ] = { 910.7464, -7.9931, 1400.0052, 1.4404 } ;

/*

	Buy Cars

*/

new Float: t_shop_pos [ 9 ] [ 7 ] =
{
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 }, // low
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 }, // medium
	{ 2.6313, 804.3572, 501.2592, 127.7170, 0.7734, 799.3925, 503.0000 }, // high
	{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // donate
	{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // truck
	{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // boat
	{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 }, // fly
	{ -2773.308, -25.440, 1142.495, 284.965, -2775.288, -20.955, 1143.724 }, // moto
	{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 } // other
} ;

new Float: player_exit_salon [ 9 ] [ 4 ] =
{
	{ -7.4777, 808.1842, 501.0000, 222.5906 }, // low
	{ -7.4777, 808.1842, 501.0000, 222.5906 }, // medium
	{ -7.4777, 808.1842, 501.0000, 222.5906 }, // high
	{ 0.0, 0.0, 0.0, 0.0 }, // donate
	{ 0.0, 0.0, 0.0, 0.0 }, // truck
	{ 0.0, 0.0, 0.0, 0.0 }, // boat
	{ 0.0, 0.0, 0.0, 0.0 }, // fly
	{ -2775.288, -20.955, 1142.724, 206.164 }, // moto
	{ 0.0, 0.0, 0.0, 0.0 } // other
} ;

new Float: t_shop_respawn [ 9 ] [ 5 ] [ 4 ] =
{
	{
		// low
		{ 2516.7261,-741.3741,12.1817,180.0778 },
		{ 2510.2258,-741.6595,12.1786,179.1435 },
		{ 2503.3591,-741.2247,12.1818,180.6669 },
		{ 2496.5435,-741.8356,12.1810,180.2539 },
		{ 2489.6494,-741.6521,12.1811,180.2325 }
	},
	{
		// medium
		{ 418.1292,400.9328,12.1128,162.1140 },
		{ 423.8583,399.0459,12.1129,162.9944 },
		{ 429.6279,397.1036,12.1127,161.6112 },
		{ 435.5108,395.1590,12.1130,162.2532 },
		{ 441.2678,393.4161,12.1127,162.9778 }
	},
	{
		// high
		{ 1828.045, 218.733, 8.089, 140.275 },
		{ 1833.677, 213.963, 8.087, 139.053 },
		{ 1839.312, 209.193, 8.086, 141.790 },
		{ 1861.058, 191.130, 8.089, 139.522 },
		{ 1867.064, 186.386, 8.089, 139.556 }
	},
	{
		// donate
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	},
	{
		// truck
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	},
	{
		// boat
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	},
	{
		// fly
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	},
	{
		// moto
		{ -2099.593, -336.671, 26.150, 79.520 },
		{ -2100.774, -342.544, 26.147, 73.502 },
		{ -2101.839, -348.211, 26.136, 78.889 },
		{ -2102.909, -354.386, 26.144, 77.614 },
		{ -2104.227, -360.275, 26.147, 75.194 }
	},
	{
		// other
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 },
		{ 0.0, 0.0, 0.0, 0.0 }
	}
} ;

new Float: car_shop_player_position [ 9 ] [ 3 ] = 
{ 
	{ 0.7734, 799.3925, 501.0000 }, // low
	{ 0.7734, 799.3925, 501.0000 }, // medium
	{ 0.7734, 799.3925, 501.0000 }, // high
	{ 0.0, 0.0, 0.0 }, // donate
	{ 0.0, 0.0, 0.0 }, // truck
	{ 0.0, 0.0, 0.0 }, // boat
	{ 0.0, 0.0, 0.0 }, // fly
	{ -2775.288, -20.955, 1142.724 }, // moto
	{ 0.0, 0.0, 0.0 } // other
} ;

new model_business [ 3 ] [ 15 ] =
{
	{ 401, 405, 408, 410, 413, 423, 438, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 582, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 403, 514, 515, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
} ;

new model_change [ 11 ] [ 15 ] =
{
	{ 461, 528, 596, 599, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 409, 461, 517, 528, 596, 599, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 409, 517, 579, 487, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 416, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 405, 408, 413, 423, 482, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 405, 408, 413, 423, 482, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },

	{ 548, 433, 478, 487, 431, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 548, 433, 478, 487, 431, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 588, 487, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	{ 409, 517, 579, 487, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
	
	{ 3328, 3329, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 } // fsin
} ;

/*

	Hospital
			
*/

new player_death_id [ MAX_PLAYERS ] ;

new Float:hospital_spawn [ 4 ] [ 4 ] =
{
	{ -737.035, -505.051, 953.016, 268.477 },
	{ -717.124, -494.313, 953.016, 172.770 },
	{ -739.835, -464.736, 948.992, 175.749 },
	{ -749.861, -465.542, 948.992, 168.907 }
} ;

#define H_BED_AMOUNT 16
new player_use_bed_world [ MAX_PLAYERS char ] ;
new player_use_bed [ MAX_PLAYERS char ] ;
new hospital_area [ H_BED_AMOUNT ] ;
new bool: h_bed_toggled [ H_BED_AMOUNT ] [ 3 ] ;
new Float:h_bed_position [ H_BED_AMOUNT ] [ 4 ] =
{
	{ -752.539, -464.043, 949.680, 358.832 },
	{ -752.673, -467.121, 949.680, 177.614 },
	{ -746.784, -464.058, 949.680, 359.518 },
	{ -746.969, -467.081, 949.680, 176.706 },
	{ -746.834, -470.581, 949.680, 178.328 },
	{ -742.223, -464.060, 949.680, 355.578 },
	{ -742.556, -467.080, 949.680, 184.118 },
	{ -742.458, -470.585, 949.680, 178.742 },
	{ -736.882, -466.945, 949.680, 180.953 },
	{ -736.606, -470.672, 949.680, 185.822 },
	{ -713.445, -497.216, 953.703, 180.239 },
	{ -733.269, -507.744, 953.703, 85.119 },
	{ -736.793, -507.645, 953.703, 90.986 },
	{ -736.777, -501.929, 953.703, 88.234 },
	{ -733.754, -501.901, 953.703, 270.255 },
	{ -730.262, -502.036, 953.703, 269.621 }
} ;

/*

	army hospital

*/

#define army_interior	18
new Float:army_hospital_spawn [ 4 ] = { -1413.0517, 304.2385, 1401.0000, 262.0823 } ;

/*

	Exam

*/

#define vehicle_exam_drive	426
#define vehicle_exam_boat 	473
#define vehicle_exam_fly	487

#define int_exam_drive		1
#define virt_exam_drive		1

#define int_exam_boat		1
#define virt_exam_boat		1

#define int_exam_fly		1
#define virt_exam_fly		1

new exam_cp_number [ MAX_PLAYERS char ] ;
new bool: exam_start [ MAX_PLAYERS ] ;
new exam_vehicle [ MAX_PLAYERS ] ;
new Float:ds_checkpoints [ 33 ] [ 3 ] =
{
	{ 1897.6697, 2246.5720, 15.4017 },
	{ 1882.1855, 2229.3115, 15.5082 },
	{ 1768.4443, 2215.5408, 15.5126 },
	{ 1782.8396, 2052.4355, 15.5422 },
	{ 1962.0815, 2012.6504, 15.5236 },
	{ 1977.7338, 1901.6615, 15.1380 },
	{ 2216.2185, 1903.1713, 15.5180 },
	{ 2363.6375, 1928.9557, 15.5321 },
	{ 2346.9924, 2128.3076, 11.8548 },
	{ 2346.6262, 2323.9797, 11.8548 },
	{ 2283.0674, 2346.7456, 11.8548 },
	{ 2164.5208, 2355.4858, 11.8629 },
	{ 2088.5000, 2469.9783, 13.3981 },
	{ 2067.6267, 2569.9678, 13.3447 },
	{ 2075.9045, 2567.6853, 13.3448 },
	{ 2028.9202, 2532.0583, 13.3448 },
	{ 1970.7991, 2588.4111, 13.9803 },
	{ 1922.3638, 2674.1267, 14.8242 },
	{ 2033.6453, 2832.6362, 13.8207 },
	{ 2075.0571, 2944.1682, 11.5131 },
	{ 2056.2258, 2967.7917, 11.9647 },
	{ 1797.8000, 2967.6516, 11.6145 },
	{ 1782.2489, 2937.6563, 11.7077 },
	{ 1775.9072, 2842.2075, 11.7167 },
	{ 1599.5195, 2842.1682, 11.7157 },
	{ 1778.9358, 2837.3215, 11.6993 },
	{ 1800.8418, 2952.6277, 11.6145 },
	{ 2069.3164, 2942.8291, 11.4694 },
	{ 1873.0796, 2629.9368, 14.8229 },
	{ 1831.7207, 2389.1204, 15.5571 },
	{ 1887.2543, 2284.8723, 15.5676 },
	{ 1903.5026, 2246.5564, 15.3292 },
	{ 1932.4703, 2249.0227, 15.3255 }
} ;

new Float:bs_checkpoints [ 17 ] [ 3 ] =
{
	{ 2852.3945, -2546.0815, -0.0830 },
	{ 2876.6980, -2569.6550, -0.4391 },
	{ 2903.7793, -2653.2397, -0.7401 },
	{ 2866.3704, -2766.0601, 0.4409 },
	{ 2725.4351, -2817.4866, 0.3810 },
	{ 2557.2686, -2820.2878, -0.3937 },
	{ 2402.3982, -2827.2542, -0.4509 },
	{ 2265.1157, -2831.6165, -0.6667 },
	{ 2153.9175, -2826.9246, -0.7116 },
	{ 2058.6406, -2857.1353, -0.3866 },
	{ 2153.5061, -2905.1411, 0.2480 },
	{ 2303.5552, -2900.6953, -0.2531 },
	{ 2416.8809, -2904.4617, 0.1782 },
	{ 2507.0242, -2913.5713, 0.4829 },
	{ 2636.3132, -2912.9216, 0.4158 },
	{ 2815.9246, -2875.0569, -0.8249 },
	{ 2845.3953, -2549.0569, -0.1445 }
} ;

new Float:ps_checkpoints [ 15 ] [ 3 ] =
{
	{ 1858.5020, 212.0582, 115.3868 },
	{ 1805.7715, 429.1734, 126.5238 },
	{ 1757.0668, 688.3719, 123.5294 },
	{ 1751.1394, 1181.7412, 106.1125 },
	{ 1484.4012, 1407.5286, 105.5369 },
	{ 1146.9193, 1199.1251, 105.0154 },
	{ 980.7827, 956.0674, 110.4021 },
	{ 808.2227, 741.7266, 106.3817 },
	{ 893.6891, 503.0087, 113.0904 },
	{ 1168.2244, 407.9733, 124.8170 },
	{ 1401.4301, 301.8726, 145.4609 },
	{ 1618.2480, 140.1903, 140.6468 },
	{ 1752.1870, 99.6070, 122.8391 },
	{ 1844.9404, 137.8696, 79.8629 },
	{ 1876.2151, 148.1551, 14.0823 }
} ;

new Float: exam_start_pos [ 3 ] [ 4 ] =
{
	{ 0.0, 0.0, 0.0, 0.0 },
	{ 2836.4966, -2546.8652, -0.1317, 273.3148 },
	{ 1847.3391, 129.9388, 8.3330, 319.9091 }
} ;
new Float: autoschool_exam_pos [ 3 ] = { 5.0771, 11.7030, 1731.1362 } ;
new Float: autoschool_parking_pos [ 3 ] = { 1919.6520, 2228.3386, 15.7109 } ;

new Float: exam_player_pos [ 4 ] = { -31.8521, -0.3679, 1730.9799, 349.3462 } ;

/*

	Кости

*/

#define MAX_BONE 2
new Float: dice_positions [ MAX_BONE ] [ 3 ] =
{
	{ 2330.822, 99.271, 801.992 },
	{ 2330.994, 95.121, 801.992 }
} ;

#define MAX_CASINO_CAR 10
new casino_car [ MAX_CASINO_CAR ] = { 405, 495, 415, 426, 466, 458, 451, 500, 551, 3252 } ;

/*

	ворота/шлагбаумы

*/

enum _barrier_pos
{
	Float: close_bar [ 6 ],
	Float: open_bar [ 6 ],
	fraction_bar [ 4 ],
	double_bar_id,
	object_bar,
	Float: speed_bar,
	type_bar,
	Float: place_bar [ 6 ], // стойка для шлагбаумов
	bool: label_brs,
	Float: label_bar [ 3 ],
	name_bar [ 24 ]
} ;

#define MAX_BARRIERS 4
new bool: barrier_status [ MAX_BARRIERS ] ;
new barrier_area [ MAX_BARRIERS ] ;
new barrier_object [ MAX_BARRIERS ] ;
new barrier_pos [ MAX_BARRIERS ] [ _barrier_pos ] =
{
	{
		{ 507.4989, 300.1560, 12.1949, 0.0000, -90.0000, 0.0000 }, 
		{ 507.4989, 300.1560, 12.1939, 0.0000, 0.0000, 0.0000 },
		{ 7, -1, -1, -1 },
		-1,
		13045,
		0.07,
		1,
		{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 },
		true, 
		{ 507.4989, 300.1560, 12.1949 },
		"Парковка ФСБ"
	},
	{
		{ 2579.8222, -2438.8681, 21.5995, 0.0000, -90.0000, -90.0000 }, 
		{ 2579.8222, -2438.8681, 21.5975, 0.0000, 0.0000, -90.0000 },
		{ 4, 5, -1, -1 },
		-1,
		13045,
		0.07,
		1,
		{ 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 },
		true, 
		{ 2579.8222, -2438.8681, 21.5995 },
		"Парковка ПЮ"
	},
	{
		{ 656.0350, 1115.5427, 14.4599, 0.0000, -90.0000, -24.0000 }, 
		{ 656.0350, 1115.5427, 14.4499, 0.0000, 0.0000, -24.0000 },
		{ 4, 5, -1, -1 },
		-1,
		13045,
		0.07,
		2,
		{ 655.8497, 1115.6204, 13.7500, 0.0000, 0.0000, -25.0000 },
		true, 
		{ 656.0350, 1115.5427, 14.4599 },
		"Парковка ПА"
	},
	{
		{ 1892.4931, 1725.6662, 15.6674, 0.0000, -90.0000, 88.0000 }, 
		{ 1892.4931, 1725.6662, 15.6674, 0.0000, 0.0000, 88.0000 },
		{ 8, -1, -1, -1 },
		-1,
		13045,
		0.07,
		2,
		{ 1892.4907, 1725.6682, 14.9188, 0.0000, 0.0000, 88.0000 },
		true, 
		{ 1893.2868, 1722.1815, 15.9648 },
		"Воинская часть"
	}
} ;

enum _door_pos
{
	Float: close_doors [ 6 ],
	Float: open_doors [ 6 ],
	fraction_doors [ 4 ],
	double_doors_id,
	object_doors,
	int_doors,
	vw_doors,
	Float: speed_doors,
	bool: label_drs,
	Float: label_doors [ 3 ],
	name_doors [ 24 ]
} ;

#define MAX_DOORS 14
new bool: door_status [ MAX_DOORS ] ;
new door_area [ MAX_DOORS ] ;
new door_object [ MAX_DOORS ] ;
new door_pos [ MAX_DOORS ] [ _door_pos ] =
{
	{ // army
		{ 1893.2718, 1716.5159, 16.3259, 0.0000, 0.0000, 0.0000 },
		{ 1893.2718, 1716.5159, 10.3259, 0.0000, 0.0000, 0.0000 },
		{ 8, -1, -1, -1 },
		-1, 
		9046,
		0, 0,
		0.5,
		true,
		{ 1893.2718, 1716.5159, 16.3259 },
		"КПП"
	},
	{ // arz pd
		{ 532.1426, 326.7189, 1201.8593, 0.0000, 0.0000, 0.0000 },
		{ 532.1426, 326.7189, 1201.8593, 0.0000, 0.0000, 90.0000 },
		{ 4, 5, -1, -1 },
		-1,
		9048,
		1, 1,
		0.02,
		true,
		{ 532.1426, 326.7189, 1201.8593 },
		"Блок изоляции"
	},
	{ // arz pd
		{ 541.7069, 337.8638, 1201.8643, 0.0000, 0.0000, -92.0000 },
		{ 541.7069, 337.8638, 1190.8643, 0.0000, 0.0000, -92.0000 },
		{ 4, 5, -1, -1 },
		-1,
		9046,
		1, 1,
		0.5,
		true,
		{ 541.7069, 337.8638, 1201.8643 },
		"Оружейная"
	},
	{ // yuzh pd
		{ 532.1426, 326.7189, 1201.8593, 0.0000, 0.0000, 0.0000 },
		{ 532.1426, 326.7189, 1201.8593, 0.0000, 0.0000, 90.0000 },
		{ 4, 5, -1, -1 },
		-1,
		9048,
		1, 2,
		0.02,
		true,
		{ 532.1426, 326.7189, 1201.8593 },
		"Блок изоляции"
	},
	{ // yuzh pd
		{ 541.7069, 337.8638, 1201.8643, 0.0000, 0.0000, -92.0000 },
		{ 541.7069, 337.8638, 1190.8643, 0.0000, 0.0000, -92.0000 },
		{ 4, 5, -1, -1 },
		-1,
		9046,
		1, 2,
		0.5,
		true,
		{ 541.7069, 337.8638, 1201.8643 },
		"Оружейная"
	},
	{ // ammo fbi
		{ 1285.1370, -210.7672, 1202.1921, 0.0000, 0.0000, -90.0000 },
		{ 1285.1370, -210.7672, 1190.1921, 0.0000, 0.0000, -90.0000 },
		{ 7, -1, -1, -1 },
		6,
		9046,
		1, 300,
		0.5,
		true,
		{ 1283.9072, -210.1168, 1201.9819 },
		"Оружейная"
	},
	{ // ammo fbi
		{ 1282.8487, -210.7412, 1202.1921, 0.0000, 0.0000, 90.0000 },
		{ 1282.8487, -210.7412, 1190.1921, 0.0000, 0.0000, 90.0000 },
		{ 7, -1, -1, -1 },
		5,
		9046,
		1, 300,
		0.5,
		false,
		{ 1283.9072, -210.1168, 1201.9819 },
		"Оружейная"
	},
	{ // enter fbi
		{ 1278.2886, -209.5916, 1202.3522, 0.0000, 0.0000, 0.0000 },
		{ 1278.2886, -209.5916, 1202.3522, 0.0000, 0.0000, 90.0000 },
		{ 7, -1, -1, -1 },
		8,
		9048,
		1, 300,
		0.02,
		true,
		{ 1277.9508, -208.3998, 1201.9819 },
		"Офис"
	},
	{ // enter fbi
		{ 1278.2182, -206.9083, 1202.3522, 0.0000, 0.0000, 180.0000 },
		{ 1278.2182, -206.9083, 1202.3522, 0.0000, 0.0000, 90.0000 },
		{ 7, -1, -1, -1 },
		7,
		9048,
		1, 300,
		0.02,
		false,
		{ 1277.9508, -208.3998, 1201.9819 },
		"Офис"
	},
	{ // enter 2 fbi
		{ 1292.3558, -209.5916, 1202.3522, 0.0000, 0.0000, 0.0000 },
		{ 1292.3558, -209.5916, 1202.3522, 0.0000, 0.0000, 90.0000 },
		{ 7, -1, -1, -1 },
		10,
		9048,
		1, 300,
		0.02,
		true,
		{ 1291.9406, -208.1953, 1201.9819 },
		"Кабинеты"
	},
	{ // enter 2 fbi
		{ 1292.3558, -206.9083, 1202.3522, 0.0000, 0.0000, 180.0000 },
		{ 1292.3558, -206.9083, 1202.3522, 0.0000, 0.0000, 90.0000 },
		{ 7, -1, -1, -1 },
		9,
		9048,
		1, 300,
		0.02,
		false,
		{ 1291.9406, -208.1953, 1201.9819 },
		"Кабинеты"
	},
	{ // mayor ammo
		{ 674.0266, -12.7351, 1206.4233, 0.0000, 0.0000, 90.0000 },
		{ 674.0266, -12.7351, 1196.4233, 0.0000, 0.0000, 90.0000 },
		{ 1, -1, -1, -1 },
		-1,
		9046,
		10, 10,
		0.5,
		true,
		{ 674.0266, -12.7351, 1206.4233 },
		"Оружейная"
	},
	{ // mayor camera man
		{ 677.5206, -16.5725, 1202.0782, 0.0000, 0.0000, 0.0000 },
		{ 677.5206, -16.5725, 1202.0782, 0.0000, 0.0000, 90.0000 },
		{ 1, -1, -1, -1 },
		-1,
		9048,
		1, 300,
		0.02,
		true,
		{ 677.5206, -16.5725, 1202.0782 },
		"Комната охраны"
	},
	{ // mayor spawn
		{ 670.6000, -12.7424, 1206.4014, 0.0000, 0.0000, 90.0000 },
		{ 670.6000, -12.7424, 1206.4014, 0.0000, 0.0000, 0.0000 },
		{ 1, -1, -1, -1 },
		-1,
		9048,
		1, 300,
		0.02,
		true,
		{ 670.6000, -12.7424, 1206.4014 },
		"Раздевалка"
	}
} ;

/* 

	anti DM zones 
	
*/

#define MAX_DM_ZONE	35
new Float:anti_dm_pos [ MAX_DM_ZONE ] [ 5 ] =
{
	{ -590.4393, 835.7374, -392.5235, 986.0483 }, // Спавн Арзамас
	{ 2619.140625, -2542.96875, 2859.375, -2337.890625 }, // Спавн Южный
	{ 1625.3769, 2325.6125, 2025.3769, 2725.6125 }, // Спавн Батырево
	{ -2613.28125, 2777.34375, -2396.484375, 2906.25 }, // Спавн Эдово
	{ -967.3302, 1138.9241, -827.2811, 1199.2756 }, // Авторынок Арзамас
	//{ 2257.0434, 1977.6138, 2391.3063, 2144.8906 }, // Завод экстерьер
    //{ -1404.1159, 2487.5583, -1382.5051, 2721.8244 }, // Шахта экстерьер
    //{ -1149.6396, -2557.0886, -965.8488, -2408.6982 }, // Лесопилка экстерьер
    { -632.0730, -1925.7319, -232.0730, -1525.7319 }, // Контейнеры экстерьер
	{ -2902.5537, -1251.6031, -2502.5537, -851.6031 }, // Контейнеры экстерьер
    { 1930.2950, -2556.6826, 2087.7817, -2673.4519 }, // TowCar экстерьер
    { -240.7030, 1161.3299, 159.2969, 1561.3299 }, // TowCar 2 экстерьер
    { 358.4842, 2073.2622, 578.6975, 2338.3811 }, // Автосалон экстерьер
    { 314.0030, 1124.8214, 512.2774, 1286.0318 }, // Автосалон экстерьер
    { -635.6882, -56.3636, -391.8175, 151.1965 }, // Автошкола экстерьер
    { 376.0902, 740.8290, 401.7876, 825.2216 }, // Автосервис экстерьер
    { 2036.5374, 1848.9660, 2079.5156, 1906.4348 }, // Автосервис экстерьер
    { 1719.8878, 2239.3576, 1803.6607, 2316.3623 }, // Perfomance экстерьер
    { 489.129028, -219.868103, 889.129028, 180.131896 }, // Мэрия интерьер
    { 341.492187, 126.651397, 741.492187, 526.651367 }, // ФСБ Экстерьер
    { -1161.952026, -172.769104, -761.952026, 227.230895 }, // Полиция 2 этаж интерьер LS
    { -1161.952026, -172.769104, -761.952026, 227.230895 }, // Полиция 2 этаж интерьер SF
    { -1257.3323, -1650.6502, -857.3323, -1250.6502 }, // Больница интерьер
	{ -2855.1093, -2021.1542, -2455.1093, -1621.1542 }, // Радиоцентр интерьер
    { -411.1932, -199.4269, -11.1932, 200.5730 }, // Автосалон средний интерьер
	{ -215.7364, 145.1031, 184.2635, 545.1031 }, // Автосалон премиум интерьер
	{ -1090.5965, 1794.9842, -690.5965, 2194.9843 }, // Perfomance экстерьер
	{ 932.6988, 2454.0334, 1332.6988, 2854.0334 }, // Аммунация Лион
	{ 452.5021, 916.7006, 852.5021, 1316.7006 }, // Полиция Арзамаса Экстерьер
	{ 432.6923, 1555.9334, 832.6923, 1955.9334 }, // Больница экстерьер
	{ 1099.9482, -407.2881, 1499.9482, -7.2881 }, // ФСБ интерьер
	{ 588.2896, -1047.2934, 988.2896, -647.2935 }, // Тюрьма интерьер
	{ -153.9472, 748.1160, -20.3255, 1023.7902 }, // Мэрия экстерьер
	{ -652.3120, 650.2329, -363.7535, 824.0664 }, // Центральный рынок экстерьер
	{ -366.3169, 741.4293, -210.0801, 848.2103, }, // Риелторка Арзамас экстерьер
	{ -975.1032, -1182.5628, -802.6290, -966.1182 }, // Stone Island экстерьер
	{ 174.5592, 737.4492, 12.0749, 103.6843 }, // sim card exterior
	{ 1015.4652, 1502.6326, 2005.8909, 1865.9083 } // army exterior
} ;

new anti_dm_data [ MAX_DM_ZONE ] [ 2 ] =
{
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	//{ 0, 0 },
	//{ 0, 0 },
	//{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 10, -1 },
	{ 0, 0 },
	{ 1, 1 },
	{ 1, 2 },
	{ 2, -1 },
	{ 2, 2 },
	{ 1, 1 },
	{ 1, 2 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 300, 1 },
	{ 1, 20 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 },
	{ 0, 0 }
} ;

new anti_dm_area [ MAX_DM_ZONE ] ;

new anti_dm_warning [ MAX_PLAYERS char ] ;
new anti_db_warning [ MAX_PLAYERS char ] ;

new is_player_in_dmzone [ MAX_PLAYERS char ] ;

/* nonparking zones */
#define MAX_NONPARKING_ZONES 20
new non_parking_area [ MAX_NONPARKING_ZONES ] ;
new Float:non_parking_pos [ MAX_NONPARKING_ZONES ] [ 4 ] =
{
	{ -590.4393, 835.7374, -392.5235, 986.0483 }, // Спавн Арзамас
	{ 2451.2473, -1817.3842, 2851.2473, -1417.3842 }, // Спавн Южный
	{ 1896.5842, 1653.6564, 2296.5842, 2053.6564 }, // Спавн Батырево
	{ 245.8847, 1473.5052, 645.8847, 1873.5052 }, // Спавн Эдово
	{ -967.3302, 1138.9241, -827.2811, 1199.2756 }, // Авторынок Арзамас
	//{ 2257.0434, 1977.6138, 2391.3063, 2144.8906 }, // Завод экстерьер
    //{ -1404.1159, 2487.5583, -1382.5051, 2721.8244 }, // Шахта экстерьер
    //{ -1149.6396, -2557.0886, -965.8488, -2408.6982 }, // Лесопилка экстерьер
    { -637.7767, -1935.9996, -237.7767, -1535.9996 }, // Контейнеры экстерьер
	{ -2896.9956, -1248.6145, -2496.9956, -848.6145 }, // Контейнеры экстерьер
    { 1930.2950, -2673.4519, 2087.7817, -2556.6826 }, // TowCar экстерьер
    { -240.7030, 1161.3299, 159.2969, 1561.3299 }, // TowCar 2 экстерьер
    { 237.5264, 189.7162, 637.5264, 589.7163 }, // Автосалон экстерьер
    { 2275.9914, -919.6683, 2675.9914, -519.6683 }, // Автосалон экстерьер
    { 1723.0256, 2035.3686, 2123.0256, 2435.3686 }, // Автошкола экстерьер
    { 376.0902, 740.8290, 401.7876, 825.2216 }, // Автосервис экстерьер
    { 2036.5374, 1848.9660, 2079.5156, 1906.4348 }, // Автосервис экстерьер
    { 1719.8878, 2239.3576, 1803.6607, 2316.3623 }, // Perfomance экстерьер
	{ 2151.6784, -1787.7387, 18.9632, 148.8024 }, // Рынок
	{ 9.4723, 1175.2156, 409.4723, 1575.2156 }, // Полиция Арзамас экстерьер
	{ 1603.7050, 1542.2421, 2003.7050, 1942.2421 }, // Сухопутные войска экстерьер
    { 2215.5676, -2019.8002, 2615.5676, -1619.8002 }, // ФСБ Экстерьер
	{ -517.9415, 617.1256, -117.9415, 1017.1256 } // Риелторка Арзамас экстерьер
} ;

new is_player_nonpark_zone [ MAX_PLAYERS char ] ;

/* 

	Штрафстоянка 
	
*/

new Float:fine_pos [ 2 ] [ 4 ] [ 4 ] =
{
	{
		{ 2009.3795, -2581.7380, 11.2227, 180.0523 },
		{ 2002.6379, -2581.6877, 11.2135, 180.3594 },
		{ 1995.8305, -2581.6765, 11.2226, 180.4615 },
		{ 1988.9157, -2581.9365, 11.2142, 179.5117 }
	},
	{
		{ -38.2886, 1400.4451, 13.7379, 248.8697 },
		{ -40.1023, 1393.3902, 13.3078, 246.2878 },
		{ -41.4072, 1386.4732, 13.0283, 245.4378 },
		{ -43.2682, 1379.2653, 12.7138, 239.1890 }
	}
} ;

/*

	Аксесуары + скины

*/

#define MAX_SKIN_IN_SHOP 72

new shop_skins [ 2 ] [ MAX_SKIN_IN_SHOP ] =
{
    {
		1, 2, 4, 6, 7, 17, 18, 19, 21, 22, 23, 24, 26, 27, 28, 29, 30, 33, 34, 35, 36, 37, 42, 43, 44, 45, 47, 48, 49, 50, 51, 52, 57, 58,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
	},
    {
		9, 11, 12, 13, 40, 41, 53, 63, 75, 76, 85, 87, 88, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
	}
} ;

new shop_skins_price [ 2 ] [ MAX_SKIN_IN_SHOP ] =
{
    { 7000, 11000, 15000, 5000, 5000, 7500, 20000, 9000, 9000, 6000, 10000, 15000, 9000, 11000, 2000, 9000, 7000, 11000, 30000, 15000, 16000,
    9000, 60000, 13000, 24000, 7000, 13000, 3000, 3000, 20000, 8000, 7000, 6000, 13000, 13000, 14000, 2000, 4000, 3000, 3000, 7000, 8000, 3000, 
    7000, 7000, 8000, 9000, 11000, 7000, 13000, 8000, 50000, 1_000_000, 1_000_000, 1_000_000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 
    { 3000, 5000, 10000, 30000, 4000, 6000, 8000, 7000, 9000, 7000, 11000, 7000, 9000, 5000, 13000, 13000, 11000, 30000, 3000, 3000, 4000, 9000,
    9000, 8000, 5000, 8000, 9000, 15000, 20000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
} ;

new Float: position_skin_shop [ 4 ] = { 2698.7070, 303.2422, 1401.0000, 224.5035 } ;
new Float: camera_position_skin_shop [ 6 ] = { 2701.6162, 301.5572, 1403.0000, 2698.7070, 303.2422, 1401.0000 } ;

new Float: position_acs_shop [ 4 ] = { 2701.976, 303.112, 1401.000, 123.401 } ;
new Float: camera_position_acs_shop [ 6 ] = { 2698.865, 299.383, 1401.000, 2696.863, 298.412, 1401.961 } ;
new Float: acs_shop_position [ 3 ] = { 2696.863, 298.412, 1401.961 } ;
new acs_pickup [ MAX_PLAYERS ] ;
new Float: accessories_camera_positions [ 3 ] [ 6 ] =
{
	{ 2701.6162, 301.5572, 1403.0000, 2698.7070, 303.2422, 1401.0000 }, // наушники
	{ 2696.2141, 305.1310, 1403.0000, 2698.7070, 303.2422, 1401.0000 }, //часы
	{ 2695.9780, 302.0278, 1403.0000, 2698.7070, 303.2422, 1401.0000 } // портфели
} ;

/*new Float: position_skin_shop [ 4 ] = { -50.4988, 956.1966, 1597.9787, 141.4894 } ;
new Float: camera_position_skin_shop [ 6 ] = { -52.5169, 951.5756, 1600.0740, -50.4988, 956.1966, 1597.9787 } ;

new Float: accessories_camera_positions [ 3 ] [ 6 ] =
{
	{ -51.4315, 954.4996, 1599.2109, -50.4988, 956.1966, 1597.9787 }, // наушники
	{ -52.2926, 955.6592, 1598.7863, -50.4988, 956.1966, 1597.9787 }, //часы
	{ -49.4342, 957.7579, 1598.7863, -50.4988, 956.1966, 1597.9787 } // портфели
} ;

[14:30:36] [SAVED] { -1466.6072, -1289.8629, 1387.7010, 4.2101 } (clothes)
[14:30:53] [SAVED] { -1466.3430, -1271.0021, 1387.7010, 346.4686 } (pick)
[14:31:10] [SAVED] { -1452.6391, -1266.4696, 1387.7010, 114.4080 } (player)
[14:31:25] [SAVED] { -1455.3717, -1268.3111, 1387.7010, 314.5522 } (cam)
[14:31:32] [SAVED] { -1452.7761, -1268.9368, 1387.7010, 354.3699 } (cam1)
[14:31:38] [SAVED] { -1450.1066, -1264.9243, 1387.7010, 108.8377 } (cam1)*/

/*

	paintball

*/

#define paint_interior 0

new SkinPaint [ 2 ] [ 2 ] =
{
	{ 47, 48 },
	{ 55, 56 }
} ;

new Float:SpawnBlueTeam [ 2 ] [ 2 ] [ 4 ] =
{
	{
		{ 1738.8603, -2426.5380, 10.9703, 185.0785 },
		{ 1701.9056, -2427.4252, 11.0005, 184.0965 }
	},
	{
	    { -132.7875, 420.8446, 13.0228, 74.2197 },
		{ -130.1514, 436.9424, 13.0554, 344.1335 }
	}
} ;

new Float:SpawnRedTeam [ 2 ] [ 2 ] [ 4 ] =
{
	{
		{ 1702.5109, -2554.2480, 11.0819, 347.9646 },
		{ 1777.2631, -2551.4079, 11.0005, 35.5587 }
	},
	{
		{ -222.2040, 489.1200, 12.8196, 268.8248 },
		{ -202.7733, 517.9824, 12.8830, 204.6310 }
	}
} ;

/*

	map icon

*/

enum _pause_icon_array
{
	icon_title [ 32 ],
	icon_id,
	icon_gta_id,
	bool: icon_visible
} ;

enum
{
    radar_centre = 2,
    radar_arrow = 3,
    radar_north = 4,
    radar_airYard = 5,
    radar_ammugun = 6,
    radar_barbers = 7,
    radar_BIGSMOKE = 8,
    radar_boatyard = 9,
    radar_burgerShot = 10,
    radar_bulldozer = 11,
    radar_CATALINAPINK = 12,
    radar_CESARVIAPANDO = 13,
    radar_chicken = 14,
    radar_CJ = 15,
    radar_CRASH1 = 16,
    radar_diner = 17,
    radar_emmetGun = 18,
    radar_enemyAttack = 19,
    radar_fire = 20,
    radar_girlfriend = 21,
    radar_hostpitaL = 22,
    radar_LocoSyndicate = 23,
    radar_MADDOG = 24,
    radar_mafiaCasino = 25,
    radar_MCSTRAP = 26,
    radar_modGarage = 27,
    radar_OGLOC = 28,
    radar_pizza = 29,
    radar_police = 30,
    radar_propertyG = 31,
    radar_propertyR = 32,
    radar_race = 33,
    radar_RYDER = 34,
    radar_saveGame = 35,
    radar_school = 36,
    radar_qmark = 37,
    radar_SWEET = 38,
    radar_tattoo = 39,
    radar_THETRUTH = 40,
    radar_waypoint = 41,
    radar_TorenoRanch = 42,
    radar_triads = 43,
    radar_triadsCasino = 44,
    radar_tshirt = 45,
    radar_WOOZIE = 46,
    radar_ZERO = 47,
    radar_dateDisco = 48,
    radar_dateDrink = 49,
    radar_dateFood = 50,
    radar_truck = 51,
    radar_cash = 52,
    radar_flag = 53,
    radar_gym = 54,
    radar_impound = 55,
    radar_ligh = 56,
    radar_runway = 57,
    radar_gangB = 58,
   	radar_gangP = 59,
    radar_gangY = 60,
    radar_gangN = 61,
    radar_gangG = 62,
    radar_spray = 63
} ;

new pause_icon_array [ ] [ _pause_icon_array ] =
{
	{ "Кафе", 0, radar_pizza, true }, // map_icon_pizza
	{ "Магазин 24/7", 1, radar_diner, true }, // map_icon_product_shop
	{ "Правительство", 2, radar_enemyAttack, false }, // map_icon_government
	{ "Банк", 3, radar_cash, true }, // map_icon_bank
	{ "Полиция", 4, radar_police, false }, // map_icon_mvd
	{ "Бар / клуб", 5, radar_BIGSMOKE, true }, // map_icon_beer_fabric
	{ "Лесопилка", 6, radar_bulldozer, false }, // map_icon_sawmill
	{ "хз", 7, radar_MADDOG, false }, // map_icon_construction
	{ "СМИ", 8, radar_race, false }, // map_icon_mass_media
	{ "Казино", 9, radar_triads, true }, // map_icon_casino
	{ "Тир", 10, radar_flag, false }, // map_icon_shooting_gallery
	{ "Спортивный зал", 11, radar_gym, true }, // map_icon_gym
	{ "Магазин одежды", 12, radar_tshirt, true }, // map_icon_clothing_shop (53)
	{ "Магазин аксессуаров", 13, radar_tattoo, false }, // map_icon_accessory_shop
	{ "Автошкола", 14, radar_school, false }, // map_icon_driving_school
	{ "Автосалон", 15, radar_impound, true }, // map_icon_car_shop
	{ "Занятая недвижимость", 16, radar_propertyR, true }, // map_icon_sold_house
	{ "Свободная недвижимость", 17, radar_propertyG, true }, // map_icon_vaccant_house
	{ "Вход", 18, radar_THETRUTH, false }, // map_icon_entrance
	{ "Магазин оружия", 19, radar_emmetGun, true }, // map_icon_ammunition
	{ "Колесо", 20, radar_spray, false }, // map_icon_tire_shop 
	{ "Тюнинг-центр", 21, radar_modGarage, false }, // map_icon_tunning // >>> НЕТ В ДЖАВЕ <<<<
	{ "Армия", 22, radar_CJ, false }, // map_icon_army
	{ "Больница", 23, radar_hostpitaL, false }, // map_icon_hospital
	{ "Такси", 24, radar_runway, false }, // map_icon_taxi
	{ "АЗС", 25, radar_ZERO, true }, // map_icon_fuel_station
	{ "Аренда транспорта", 26, radar_truck, false }, // map_icon_scooter_rental // >>> НЕТ В ДЖАВЕ <<<<
	{ "radar_gangN", 27, radar_gangN, false }, // >>> НЕТ В ДЖАВЕ <<<<
	{ "radar_gangP", 28, radar_gangP, false }, // >>> НЕТ В ДЖАВЕ <<<<
	{ "radar_gangY", 29, radar_gangY, false }, // >>> НЕТ В ДЖАВЕ <<<<
	{ "radar_TorenoRanch", 30, radar_TorenoRanch, false }, // >>> НЕТ В ДЖАВЕ <<<<
	{ "radar_waypoint", 31, radar_waypoint, false }, // >>> НЕТ В ДЖАВЕ <<<<
	{ "radar_airYard", 32, radar_airYard, false },
	{ "radar_ammugun", 33, radar_ammugun, false },
	{ "radar_barbers", 34, radar_barbers, false },
	{ "radar_boatyard", 35, radar_boatyard, false },
	{ "radar_burgerShot", 36, radar_burgerShot, false },
	{ "radar_CATALINAPINK", 37, radar_CATALINAPINK, false },
	{ "radar_centre", 38, radar_centre, false },
	{ "radar_CESARVIAPANDO", 39, radar_CESARVIAPANDO, false },
	{ "radar_chicken", 40, radar_chicken, false },
	{ "radar_CRASH1", 41, radar_CRASH1, false },
	{ "radar_dateDisco", 42, radar_dateDisco, false },
	{ "radar_dateDrink", 43, radar_dateDrink, false },
	{ "radar_dateFood", 44, radar_dateFood, false },
	{ "radar_fire", 45, radar_fire, false },
	{ "radar_gangB", 46, radar_gangB, false },
	{ "radar_gangG", 47, radar_gangG, false },
	{ "radar_girlfriend", 48, radar_girlfriend, false },
	{ "radar_ligh", 49, radar_ligh, false },
	{ "radar_LocoSyndicate", 50, radar_LocoSyndicate, false },
	{ "radar_mafiaCasino", 51, radar_mafiaCasino, false },
	{ "radar_MCSTRAP", 52, radar_MCSTRAP, false },
	{ "radar_OGLOC", 53, radar_OGLOC, false },
	{ "radar_qmark", 54, radar_qmark, false },
	{ "radar_RYDER", 55, radar_RYDER, false },
	{ "radar_SWEET", 56, radar_SWEET, false },
	{ "radar_WOOZIE", 58, radar_WOOZIE, false },
	{ "radar_triadsCasino", 59, radar_triadsCasino, false },
	{ "radar_saveGame", 60, radar_saveGame, false }
} ;

/*

	Businesses

*/

enum _busines_int
{
	i_interior,
	Float: i_position [ 4 ],
	i_map_icon
} ;

#define max_interior            29
new bool: create_pick_bizz_exit [ max_interior ] = { false, ... } ;
new pickup_bizz_exit [ max_interior ] ;
new b_interior [ max_interior ] [ _busines_int ] =
{
	{ 3, { 2098.9743, -4.3693, 1398.8626, 8.7793 }, radar_diner }, // 24/7
	{ 5, { 17.5948, -1114.4359, 1029.7817, 335.5659 }, radar_emmetGun }, // ammo
	{ 21, { -14.6586, 790.8205, 501.0000, 267.5117 }, radar_impound }, // car shop
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, radar_pizza }, // Cluckin Bell
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, radar_pizza }, // Pizza
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, radar_pizza }, // Burger Shot
	{ 15, { 2698.2543, 295.6882, 1401.0000, 5.4650 }, radar_tshirt }, // clothes shop
	{ 36, { 1428.8320, 987.1152, 1509.3293, 29.4457 }, radar_pizza }, // cafe.int
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, radar_BIGSMOKE }, // Alhambra
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, radar_BIGSMOKE }, // BAR
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, radar_BIGSMOKE }, // strip
	{ 8, { 797.2066, -789.1630, 1798.0234, 167.7832 }, radar_BIGSMOKE }, // Джиззи
	{ 3, { 2098.9743, -4.3693, 1398.8626, 8.7793 }, radar_hostpitaL }, // аптека
	{ 22, { 2343.989, 83.855, 802.047, 21.895 }, radar_triads }, // Casino
	{ 5, { 1987.7821, 1995.9537, 1498.7265, 193.8429 }, radar_gym }, // Спортивный зал
	{ 25, { -110.4756, 252.6027, 1201.0783, 278.9470 }, 34 }, // Риэлторское агенство
	{ 3, { -2721.6037, -1761.1633, 2.3055, 86.5605 }, 35 }, // Отель
	{ 1, { 624.4999,-28.2754,3002.8833,357.1800 }, radar_truck }, // Аренда транспорта
	{ 24, { -0.153, 233.996, 951.000, 169.943 }, radar_modGarage }, // Автомастерские
	{ 25, { -110.4756, 252.6027, 1201.0783, 278.9470 }, 37 }, // SIM-карты
	{ 1, { 0.0, 0.0, 0.0, 0.0 }, radar_truck }, // TowCar
	{ 11, { 972.3325, -468.4626, 1015.4014, 306.2096 }, radar_cash }, // Банк
	{ 3, { 2098.9743, -4.3693, 1398.8626, 8.7793 }, 9 }, // Охота и рыбалка
	{ 0, { 0.0, 0.0, 0.0, 0.0 }, radar_pizza }, // Ларёк с едой
	{ 21, { -14.6586, 790.8205, 501.0000, 267.5117 }, radar_impound }, // Автосалон
	{ 1, { -2780.875, -10.046, 1142.724, 187.599 }, radar_impound }, // Мотосалон
	{ 0, { 0.0, 0.0, 0.0, 0.0 }, radar_impound }, // Аэросалон
	{ 0, { 0.0, 0.0, 0.0, 0.0 }, radar_impound }, // Боатсалон
	{ 11, { -2129.13,-188.362,35.3203,83.879 }, 23 } // Оружейный завод
} ;

new Float: strip_actor_position [ 5 ] [ 4 ] =
{
	{ 807.0740, -798.4188, 1798.9687, 113.9852 },
	{ 806.9464, -792.0521, 1798.9687, 96.7424 },
	{ 804.5762, -795.5242, 1798.0234, 101.2054 }, // охранник
	{ 808.5623, -803.5466, 1798.0234, 62.2185 },
	{ 796.1598, -801.8287, 1798.0234, 327.1965 } // охранник
} ;

/*

	Delivery Load

*/

new Float: delivery_loaded [ 3 ] = { 1780.6839, 2713.9484, 13.8925 } ;

new Float: spawn_trailer_delivery [ 4 ] = { 1758.9499, 2649.5366, 15.0926, 42.7152 } ;
new Float: fuel_delivery_loaded [ 3 ] = { 1751.2965, 2681.8454, 13.8925 } ;

/*

	Авторынок

*/

#define CAR_MARKET_SLOTS 	22
new carmarket_integr_id [ 3 ] ;
new car_market_area [ CAR_MARKET_SLOTS ] ;
new bool: car_market_slotes_toggled [ CAR_MARKET_SLOTS ] ;
new Float:car_market_pos [ CAR_MARKET_SLOTS ] [ 4 ] =
{
	{ 674.6074, 1059.4849, 11.9732, 249.6945 },
	{ 672.1573, 1053.1856, 11.9716, 248.6549 },
	{ 669.7837, 1046.5745, 11.9728, 249.5404 },
	{ 667.3760, 1040.1425, 11.9731, 250.3180 },
	{ 665.0457, 1033.7239, 11.9732, 251.0140 },
	{ 662.8092, 1027.2850, 11.9716, 249.4372 },
	{ 660.3543, 1020.8878, 11.9700, 249.9458 },
	{ 684.1784, 1027.5866, 11.9723, 0.4874 },
	{ 690.9632, 1027.4886, 11.9716, 0.2617 },
	{ 697.8453, 1027.5017, 11.9733, 359.5798 },
	{ 704.6920, 1027.5673, 11.9736, 0.0000 },
	{ 711.7147, 1027.4467, 11.9725, 0.2755 },
	{ 718.4163, 1027.4620, 11.9717, 0.5818 },
	{ 725.1896, 1027.5107, 11.9730, 0.2967 },
	{ 623.6701, 1004.3137, 11.9723, 0.0560 },
	{ 630.5718, 1004.3322, 11.9723, 359.4285 },
	{ 637.3651, 1004.3913, 11.9733, 0.0000 },
	{ 644.2913, 1004.4550, 11.9730, 0.4710 },
	{ 651.0368, 1004.3116, 11.9732, 359.9476 },
	{ 658.0458, 1004.3336, 11.9716, 0.0685 },
	{ 0.0, 0.0, 0.0, 0.0 },
	{ 0.0, 0.0, 0.0, 0.0 }
} ;

/*

	Аксессуары

*/

new accessories_items [ ] [ ] =
{
	{ 19421,19422,19423,19424,1}, // наушники
	{ 19069,19068,19067,19554,18953,18954,1}, // шапки
	{ 18968,18967,18969,1}, // панамы
	{ 18955,18956,18957,18959,18926,18927,18928,18929,18930,18931,18932,18933,1,1,1,1,1}, // кепки
	{ 19104,19105,19106,19107,19108,19109,1}, // каски
	{ 18925,18922,18923,18924,18921,1}, // береты
	{ 19519,19274,1}, // парики
	{ 19011,19012,19013,19014,19015,19016,19017,19018,19019,19024,19027,19028,19029,19022,19035,19031,19032,19033,1}, // очки
	{ 18911,18912,18913,18914,18915,18916,18917,18918,18919,18920,1 }, // повязки
	{ 18947,18948,18949,18950,18951,1 }, // шляпы
	{ 19042,19041,19040,19039,19043,19044,19045,19046,19048,19049,19050,19051,19053,1 }, // часы
	{ 3026,371,19559,1,1,1,1,1,1,1 }, // портфели
	{ 18910,18909,18908,18907,18906,1 }, // банданы
	{ 19624,11745,1 } // сумки
} ;

new accessories_items_price [ 14 ] [ ] =
{
	{ 5000,5000,5000,5000,1},
	{ 4500,4500,5000,7000,4000,5000,1},
	{ 3000,3000,3000,1},
	{ 2500,2500,2500,3500,3500,2500,6000,6000,4000,3500,3500,5000,/*дальше кастом*/10000,10000,10000,10000,1},
	{ 3500,3500,3500,3500,3500,3500,1},
	{ 3000,3200,3200,3500,4000,1},
	{ 4000,4000,1},
	{ 1500,3000,1500,1700,2200,2800,3800,3800,3800,4000,4000,4000,4000,4000,3000,3100,3100,5000,1},
	{ 3000,2000,2000,2700,2700,2700,2300,2000,2000,2700,1 },
	{ 3100,3100,3100,3100,3100,1 },
	{ 40000,30000,45000,50000,60000,6000,6000,6000,6000,6500,6000,6200,6400,1 },
	{ 2500,1800,2200,/*дальше кастом*/10000,10000,10000,10000,10000,10000,1 },
	{ 3000,3000,3000,3000,3000,1 },
	{ 5500,7500,1 }
} ;

/*

	Donate

*/

new donate_cars [ 12 ] [ 2 ] =
{
	{ 402, 1000 },
	{ 411, 500 },
	{ 412, 500 },
	{ 415, 1000 },
	{ 437, 300 },
	{ 451, 300 },
	{ 466, 1500 },
	{ 480, 2000 },
	{ 490, 2000 },
	{ 503, 1500 },
	{ 542, 1000 },
	{ 603, 1800 }
} ;

new donate_cars_2 [ 6 ] [ 2 ] =
{
	{ 475, 3000 },
	{ 477, 3000 },
	{ 494, 3000 },
	{ 495, 3000 },
	{ 463, 3000 },
	{ 444, 5000 }
} ;
 
new donate_acessories [ 10 ] [ 2 ] =
{
	{ 12635, 500 },
	{ 12636, 750 },
	{ 12637, 500 },
	{ 12638, 750 },
	{ 12640, 1000 },
	{ 12650, 1000 },
	{ 12659, 1500 },
	{ 12660, 1500 },
	{ 12662, 2500 },
	{ 12664, 2500 }
} ;

new donate_skin [ 39 ] [ 3 ] =
{
	{ 84, 250, 0 },
	{ 105, 250, 0 },
	{ 106, 250, 0 },
	{ 109, 250, 0 },
	{ 110, 250, 0 },
	{ 64, 400, 1 },
	{ 33, 400, 0 },
	{ 45, 400, 0 },
	{ 47, 400, 0 },
	{ 77, 400, 0 },
	{ 178, 400, 0 },
	{ 180, 400, 0 },
	{ 180, 400, 0 },
	{ 300, 600, 0 },
	{ 303, 600, 0 },
	{ 310, 600, 0 },
	{ 311, 250, 0 },
	{ 10, 400, 0 },
	{ 130, 400, 0 },
	{ 139, 400, 0 },
	{ 145, 400, 0 },
	{ 313, 750, 0 },
	{ 314, 750, 0 },
	{ 318, 400, 0 },
	{ 4507, 400, 0 },
	
	{ 4508, 750, 0 },
	{ 4509, 2000, 0 },
	{ 4516, 2000, 0 },
	
	{ 4521, 1500, 0 },
	{ 4522, 300, 0 },
	{ 4523, 300, 0 },
	{ 4524, 1500, 0 },
	{ 4529, 2000, 0 },
	{ 4530, 2500, 0 },
	{ 4531, 500, 0 },
	{ 4532, 1000, 0 },
	{ 4533, 500, 0 },
	{ 4534, 2500, 0 },
	{ 4530, 2500, 0 }
} ;

/*

	Admin Zone

*/

#define admin_interior	21
new Float: spawn_admin_zone [ 4 ] = { -14.6586, 790.8205, 501.0000, 267.5117 } ;

/*
	
	roulette
	
*/

new dr_skin [ 12 ] = { 83, 86, 107, 164, 294, 68, 104, 32, 35, 43, 302, 304 } ;
new dr_accesories [ 8 ] = { 19319, 19318, 19317, 19472, 19142, 1276, 19079, 19137 } ;
new dr_veh_models [ 8 ] [ 6 ] =
{
	{ 462, 471, 426, 404, 436, 462 },
	{ 401, 410, 436, 505, 439, 458 },
	{ 405, 426, 550, 566, 579, 461 },
	{ 462, 471, 502, 404, 436, 462 },
	{ 401, 410, 436, 505, 439, 458 },
	{ 405, 426, 550, 566, 579, 461 },
	{ 560, 562, 480, 559, 421, 550 },
	{ 547, 451, 567, 604, 506, 522 }
} ;