-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Май 03 2025 г., 18:35
-- Версия сервера: 10.3.31-MariaDB-0+deb10u1
-- Версия PHP: 7.3.31-1~deb10u7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gs292974`
--

-- --------------------------------------------------------

--
-- Структура таблицы `family`
--

CREATE TABLE `family` (
  `id` int(11) NOT NULL,
  `name` varchar(32) NOT NULL,
  `color` int(11) NOT NULL DEFAULT 0,
  `reputation` int(11) NOT NULL DEFAULT 0,
  `owner` int(11) NOT NULL DEFAULT -1,
  `slot_veh` int(11) NOT NULL DEFAULT 5,
  `money` int(11) NOT NULL DEFAULT 0,
  `armour` int(11) NOT NULL DEFAULT 0,
  `material` int(11) NOT NULL DEFAULT 0,
  `heath_kit` int(11) NOT NULL DEFAULT 0,
  `patron` int(11) NOT NULL DEFAULT 0,
  `level_storage` int(11) NOT NULL DEFAULT 1,
  `level_weapon` int(11) NOT NULL DEFAULT 1,
  `level_compound` int(11) NOT NULL DEFAULT 1,
  `rang_1` varchar(38) NOT NULL DEFAULT '1 Ранг,1,0,0,0,1',
  `rang_2` varchar(38) NOT NULL DEFAULT '2 Ранг,1,0,0,0,1',
  `rang_3` varchar(38) NOT NULL DEFAULT '3 Ранг,1,0,0,0,1',
  `rang_4` varchar(38) NOT NULL DEFAULT '4 Ранг,1,0,0,0,1',
  `rang_5` varchar(38) NOT NULL DEFAULT '5 Ранг,1,1,1,1,1',
  `house` int(11) NOT NULL DEFAULT -1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Очистить таблицу перед добавлением данных `family`
--

TRUNCATE TABLE `family`;
--
-- Дамп данных таблицы `family`
--

INSERT INTO `family` (`id`, `name`, `color`, `reputation`, `owner`, `slot_veh`, `money`, `armour`, `material`, `heath_kit`, `patron`, `level_storage`, `level_weapon`, `level_compound`, `rang_1`, `rang_2`, `rang_3`, `rang_4`, `rang_5`, `house`) VALUES
(23, 'БОЛЬШИЕ ЯЙЦА', 0, 0, 5, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(24, 'EEEEEEEEEПТА', 3, 0, 6, 5, 0, 0, 0, 0, 0, 3, 1, 1, '0eshka,1,0,0,0,1', '0001,1,0,0,0,1', 'sigmi,1,0,0,0,1', 'strni chel,1,0,0,0,1', 'king,1,1,1,1,1', -1),
(25, 'БОЛЬШИЕ ЯЙЦА 12', 0, 0, 7, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(27, '{FDDDDD} етпа', 0, 0, 21, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(28, 'ADMINS TEAM', 0, 0, 22, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(29, 'welsiimba', 0, 0, 24, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(33, 'Abaudna Team', 0, 0, 32, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(34, 'Zalupa ', 0, 0, 34, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(35, 'picunF\Z', 0, 0, 35, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(36, 'Vpotoke', 0, 941, 36, 52, 5000, 0, 0, 0, 0, 2, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(37, 'dkdkdoeoe', 0, 0, 24, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(39, 'ням ням ', 0, 0, 38, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(40, 'ням ням ', 0, 0, 39, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(44, 'jopajopa', 0, 0, 42, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(46, 'Wetdrug Vpotoke', 0, 0, 41, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(47, 'SAMURAI ', 0, 312, 28, 10, 5000, 0, 0, 0, 0, 2, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(49, '{FF00FF}DROCHAMBUS DYNASTY', 5, 0, 26, 21, 0, 0, 0, 0, 0, 1, 1, 1, 'малой,1,0,0,0,1', 'салага,1,0,0,0,1', 'дрочамба,1,0,0,0,1', 'з.г.д,1,0,0,0,1', 'г.дрочамба,1,1,1,1,1', 72),
(51, '{000000}Porn{FF4500}Hub', 0, 55, 27, 5, 0, 0, 0, 0, 0, 7, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(52, 'PISKI SQUAD', 0, 0, 29, 5, 0, 0, 0, 0, 0, 1, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,1,0,0,0,1', '5 Ранг,1,1,1,1,1', -1),
(54, '{ff0000}FAMILY', 9, 0, 4, 5, 500000, 0, 0, 0, 4975, 2, 1, 1, '1 Ранг,1,0,0,0,1', '2 Ранг,1,0,0,0,1', '3 Ранг,1,0,0,0,1', '4 Ранг,0,0,0,0,1', 'БОСС,1,1,1,1,1', -1);

-- --------------------------------------------------------

--
-- Структура таблицы `family_ad`
--

CREATE TABLE `family_ad` (
  `id` int(11) NOT NULL,
  `family` int(11) NOT NULL,
  `ad_text` varchar(62) NOT NULL,
  `create_id` int(11) NOT NULL,
  `create_name` varchar(24) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Очистить таблицу перед добавлением данных `family_ad`
--

TRUNCATE TABLE `family_ad`;
--
-- Дамп данных таблицы `family_ad`
--

INSERT INTO `family_ad` (`id`, `family`, `ad_text`, `create_id`, `create_name`, `time`) VALUES
(1, 16, 'Ку епта', 4, 'Welsi_Dev', 1743209572),
(2, 16, 'привет я вас люблю блять', 4, 'Welsi_Dev', 1743211139),
(3, 16, 'ВЕЛСИ ЭМПАИР ', 4, 'Welsi_Dev', 1743223172),
(4, 18, 'Семья для конченных', 4, 'Welsi_Dev', 1743224003),
(5, 18, 'корабли ловилловари бля дальше не помню', 4, 'Welsi_Dev', 1743224027),
(6, 20, 'jdjdj', 4, 'Welsi_Dev', 1743227237),
(7, 22, 'прив', 4, 'Welsi_Dev', 1743962006),
(8, 22, 'всем привет, аптечки по 4000р за 10 штук', 4, 'Welsi_Dev', 1744738244),
(10, 29, 'rrrr', 24, 'Dev_Russia', 1746046383),
(12, 28, 'Ваша семья заняла второе место в прошлом сезоне', -1, 'Система', 1746133207),
(15, 43, 'Ваша семья заняла второе место в прошлом сезоне', -1, 'Система', 1746136807),
(16, 36, 'Ваша семья заняла третье место в прошлом сезоне', -1, 'Система', 1746136807),
(18, 23, 'Ваша семья заняла второе место в прошлом сезоне', -1, 'Система', 1746140456),
(19, 44, 'Ваша семья заняла третье место в прошлом сезоне', -1, 'Система', 1746140456),
(21, 36, 'Ваша семья заняла второе место в прошлом сезоне', -1, 'Система', 1746144025),
(22, 23, 'Ваша семья заняла третье место в прошлом сезоне', -1, 'Система', 1746144025),
(23, 47, 'Фама\Zа адам тартамыз', 28, 'Eroma_Qazaq', 1746173107);

-- --------------------------------------------------------

--
-- Структура таблицы `family_cars`
--

CREATE TABLE `family_cars` (
  `id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `color_1` int(11) NOT NULL,
  `color_2` int(11) NOT NULL,
  `number` varchar(7) NOT NULL DEFAULT '------',
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `angle` float NOT NULL,
  `rang` int(11) NOT NULL DEFAULT 1,
  `family_owner` int(11) NOT NULL DEFAULT -1,
  `create_time` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Очистить таблицу перед добавлением данных `family_cars`
--

TRUNCATE TABLE `family_cars`;
--
-- Дамп данных таблицы `family_cars`
--

INSERT INTO `family_cars` (`id`, `model_id`, `color_1`, `color_2`, `number`, `pos_x`, `pos_y`, `pos_z`, `angle`, `rang`, `family_owner`, `create_time`) VALUES
(28, 415, 0, 0, '------', 13.036, 2549.34, 10.876, 358.786, 5, 36, 1746094698),
(32, 444, 1, 1, '------', 1334.57, 2366.59, 17.672, 356.799, 1, 47, 1746162702),
(33, 490, 1, 1, '------', 21.443, 2636.45, 10.872, 171.188, 1, 47, 1746162763),
(34, 579, 1, 1, '------', 4.687, 2635.89, 10.872, 178.197, 1, 47, 1746162769),
(35, 466, 1, 1, '------', 25.336, 2549.8, 10.876, 0.382, 1, 47, 1746162775),
(36, 405, 1, 1, '------', 4.525, 2666.29, 10.046, 183.965, 1, 47, 1746162916),
(37, 415, 0, 0, '------', 13.036, 2549.34, 10.876, 358.786, 1, 36, 1746183759),
(43, 505, 0, 0, '------', 1935.87, 1823.32, 15.363, 269.06, 1, 49, 1746212042),
(44, 505, 0, 0, '------', 1935.83, 1826.64, 15.399, 262.829, 1, 49, 1746212127),
(45, 546, 1, 1, '------', 1795.56, 2522.33, 14.499, 356.799, 2, 51, 1746216867),
(47, 494, 1, 1, '------', 13.036, 2549.34, 10.876, 358.786, 5, 54, 1746227443);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `family_ad`
--
ALTER TABLE `family_ad`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `family_cars`
--
ALTER TABLE `family_cars`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `family`
--
ALTER TABLE `family`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- AUTO_INCREMENT для таблицы `family_ad`
--
ALTER TABLE `family_ad`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `family_cars`
--
ALTER TABLE `family_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
