-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Апр 13 2023 г., 22:38
-- Версия сервера: 10.3.34-MariaDB-0+deb10u1
-- Версия PHP: 7.3.31-1~deb10u1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gs201511`
--

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

CREATE TABLE `accounts` (
  `id` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `password` varchar(65) NOT NULL,
  `salt` varchar(10) CHARACTER SET cp1251 NOT NULL,
  `email` varchar(61) NOT NULL DEFAULT 'None',
  `confirm_email` int(11) NOT NULL,
  `level` int(11) NOT NULL DEFAULT 1,
  `exp` int(11) NOT NULL,
  `refer` int(11) NOT NULL,
  `sex` int(11) NOT NULL,
  `skin` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `bank` int(11) NOT NULL,
  `admin` int(11) NOT NULL,
  `a_secret` int(11) NOT NULL,
  `prefix` varchar(15) CHARACTER SET cp1251 NOT NULL DEFAULT '[A]',
  `a_3d_prefix` int(11) NOT NULL,
  `admin_warn` int(11) NOT NULL,
  `AdminPass` int(11) NOT NULL,
  `driving_lic` int(11) NOT NULL,
  `weapon_lic` int(11) NOT NULL,
  `suspect` int(11) NOT NULL,
  `phone` int(11) NOT NULL,
  `phone_balance` int(11) NOT NULL,
  `phone_color` int(11) NOT NULL DEFAULT 9,
  `law_abiding` int(11) NOT NULL,
  `improvements` int(11) NOT NULL,
  `power` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `metall` int(11) NOT NULL,
  `wife` int(11) NOT NULL,
  `team` int(11) NOT NULL,
  `subdivison` int(11) NOT NULL,
  `wage` int(11) NOT NULL,
  `job` int(11) NOT NULL,
  `house_type` int(11) NOT NULL DEFAULT -1,
  `house_room` int(11) NOT NULL DEFAULT -1,
  `house` int(11) NOT NULL DEFAULT -1,
  `business` int(11) NOT NULL DEFAULT -1,
  `fuel_st` int(11) NOT NULL DEFAULT -1,
  `reg_time` int(11) NOT NULL,
  `reg_ip` varchar(16) NOT NULL,
  `last_ip` varchar(16) NOT NULL,
  `last_login` int(11) NOT NULL,
  `game_for_hour` int(11) NOT NULL,
  `game_for_day` int(11) NOT NULL,
  `game_for_day_prev` int(11) NOT NULL,
  `setting_phone` varchar(13) NOT NULL DEFAULT 'None',
  `setting_pin_code` varchar(5) NOT NULL DEFAULT 'None',
  `request_phone` int(11) NOT NULL,
  `request_pin` int(11) NOT NULL,
  `setting1` int(11) NOT NULL DEFAULT 2,
  `setting2` int(11) NOT NULL DEFAULT 1,
  `setting4` int(11) NOT NULL DEFAULT 1,
  `setting5` int(11) NOT NULL DEFAULT 0,
  `setting6` int(11) NOT NULL DEFAULT 1,
  `warn` int(11) NOT NULL,
  `warn_time` int(11) NOT NULL,
  `mute` int(11) NOT NULL,
  `skill_colt` int(11) NOT NULL,
  `skill_sdpistol` int(11) NOT NULL,
  `skill_deagle` int(11) NOT NULL,
  `skill_shotgun` int(11) NOT NULL,
  `skill_mp5` int(11) NOT NULL,
  `skill_ak47` int(11) NOT NULL,
  `skill_m4` int(11) NOT NULL,
  `skill_sniper_rifle` int(11) NOT NULL,
  `skill_sawnoff` int(11) NOT NULL,
  `skill_combat_sg` int(11) NOT NULL,
  `skill_micro_uzi` int(11) NOT NULL,
  `donate_current` int(11) NOT NULL,
  `donate_total` int(11) NOT NULL,
  `org_skin` int(11) NOT NULL,
  `setting_spawn` int(11) NOT NULL,
  `hospital` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT 100,
  `car_slots` int(11) NOT NULL DEFAULT 1,
  `jail` int(11) NOT NULL,
  `premium` int(11) NOT NULL,
  `premium_date` int(11) NOT NULL,
  `rub` int(11) NOT NULL,
  `player` int(11) NOT NULL,
  `gifts` int(11) NOT NULL,
  `cmdaccess` varchar(32) NOT NULL DEFAULT '000000000000000',
  `family` int(11) NOT NULL,
  `family_rank` int(11) NOT NULL,
  `test` int(11) NOT NULL,
  `quest_1` int(11) NOT NULL,
  `quest_2` int(11) NOT NULL,
  `quest_3` int(11) NOT NULL,
  `quest_4` int(11) NOT NULL,
  `quest_5` int(11) NOT NULL,
  `quest_6` int(11) NOT NULL,
  `quest_7` int(11) NOT NULL,
  `quest_8` int(11) NOT NULL,
  `quest_exp_1` int(11) NOT NULL,
  `quest_exp_2` int(11) NOT NULL,
  `quest_exp_3` int(11) NOT NULL,
  `quest_exp_4` int(11) NOT NULL,
  `quest_exp_5` int(11) NOT NULL,
  `quest_exp_6` int(11) NOT NULL,
  `quest_exp_7` int(11) NOT NULL,
  `quest_exp_8` int(11) NOT NULL,
  `youtube` int(11) NOT NULL,
  `AntiBh` int(11) NOT NULL,
  `get_adm_status` int(11) NOT NULL DEFAULT 0,
  `get_adm_hour` int(11) NOT NULL DEFAULT 0,
  `online` int(11) NOT NULL DEFAULT 0,
  `totalhour` int(11) DEFAULT NULL,
  `quest231` int(11) NOT NULL DEFAULT 0,
  `quest232` int(11) NOT NULL DEFAULT 0,
  `quest233` int(11) NOT NULL,
  `postcard` int(11) NOT NULL,
  `repcarid` int(11) NOT NULL,
  `helper` int(11) NOT NULL,
  `healme` int(11) NOT NULL,
  `QuestBox1` int(11) NOT NULL,
  `QuestBox2` int(11) NOT NULL,
  `QuestBox3` int(11) NOT NULL,
  `QuestBox4` int(11) NOT NULL,
  `QuestBox5` int(11) NOT NULL,
  `QuestBox6` int(11) NOT NULL,
  `repair` int(11) NOT NULL,
  `fmute` int(11) NOT NULL,
  `fwarn` int(11) NOT NULL,
  `owarn` int(11) NOT NULL,
  `dmz_kills` int(11) NOT NULL,
  `Progress1` int(11) NOT NULL,
  `Progress2` int(11) NOT NULL,
  `Progress3` int(11) NOT NULL,
  `Progress4` int(11) NOT NULL,
  `Progress5` int(11) NOT NULL,
  `Progress6` int(11) NOT NULL,
  `ProgressExp1` int(11) NOT NULL,
  `ProgressExp2` int(11) NOT NULL,
  `ProgressExp3` int(11) NOT NULL,
  `ProgressExp4` int(11) NOT NULL,
  `ProgressExp5` int(11) NOT NULL,
  `ProgressExp6` int(11) NOT NULL,
  `capt_kills` int(11) NOT NULL,
  `coins` int(11) NOT NULL,
  `ytpromo_activate` int(11) NOT NULL,
  `3d_prefix` int(11) NOT NULL,
  `loader_skill` int(11) NOT NULL,
  `premium_time` int(11) NOT NULL,
  `antisliv` int(11) NOT NULL,
  `QuestBox` int(11) NOT NULL,
  `flower1` int(11) NOT NULL,
  `flower2` int(11) NOT NULL,
  `flower3` int(11) NOT NULL,
  `TakeFlower` int(11) NOT NULL,
  `CongratulateWomen` int(11) NOT NULL,
  `BuyPerfume` int(11) NOT NULL,
  `GivePerfume` int(11) NOT NULL,
  `BuyCake` int(11) NOT NULL,
  `BuyProducts` int(11) NOT NULL,
  `BuyCandle` int(11) NOT NULL,
  `EndQuest8marta` int(11) NOT NULL,
  `voenny_bilet` int(11) NOT NULL,
  `medcard` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `aclogs`
--

CREATE TABLE `aclogs` (
  `id` int(11) NOT NULL,
  `type` varchar(16) NOT NULL,
  `date` varchar(24) NOT NULL,
  `name` varchar(24) NOT NULL,
  `reason` varchar(32) NOT NULL,
  `data` varchar(128) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 ROW_FORMAT=COMPRESSED;

--
-- Дамп данных таблицы `aclogs`
--

INSERT INTO `aclogs` (`id`, `type`, `date`, `name`, `reason`, `data`) VALUES
(1, 'panellog', '10-7-2022', 'Alexey_Vernetto', '[kick] speed diff #2', '19:25:15 | 85.140.92.95 | 2 | 87 | 0.0'),
(2, 'panellog', '10-7-2022', 'Alexey_Vernetto', '[kick] over speed', '19:25:15 | 85.140.92.95 | 2 | 87 | 0.0'),
(3, 'panellog', '9-4-2023', 'Dany_Good', '[kick] speed diff #2', '16:41:51 | 46.180.166.86 | 2 | 119 | 0.024'),
(4, 'panellog', '9-4-2023', 'Difsan_Shedrin', '[kick] speed diff #2', '18:26:23 | 176.222.167.27 | 2 | 325 | 4.663'),
(5, 'panellog', '9-4-2023', 'Nikita_Stegiv', '[remove] crash pass #1', '19:21:5 | 95.31.181.2 | 2 | 74 | 11.037'),
(6, 'panellog', '9-4-2023', 'Difsan_Shedrin', '[remove] carhack #1', '19:39:57 | 176.222.167.27 | 1 | 112 | 1.79'),
(7, 'panellog', '9-4-2023', 'Difsan_Shedrin', '[remove] carhack #1', '19:41:45 | 176.222.167.27 | 1 | 129 | 1.714'),
(8, 'panellog', '9-4-2023', 'Difsan_Shedrin', '[remove] crash pass #1', '19:56:13 | 176.222.167.27 | 2 | 274 | 2.285'),
(9, 'panellog', '9-4-2023', 'Dany_Good', '[remove] carhack #1', '19:56:58 | 46.180.166.86 | 2 | 136 | 0.0'),
(10, 'panellog', '10-4-2023', 'Nikita_Stegiv', '[remove] carhack #1', '8:58:14 | 83.220.237.195 | 2 | 100 | 0.0'),
(11, 'panellog', '10-4-2023', 'Difsan_Shedrin', '[remove] crash pass #1', '10:1:25 | 2.75.27.113 | 2 | 227 | 0.003');

-- --------------------------------------------------------

--
-- Структура таблицы `action_log`
--

CREATE TABLE `action_log` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `type` int(11) NOT NULL,
  `description` varchar(128) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `action_log`
--

INSERT INTO `action_log` (`id`, `acc_id`, `uip`, `type`, `description`, `time`) VALUES
(1, 1, '85.140.92.95', 3, 'Инициировал PayDay', 1657465189),
(2, 1, '85.140.92.95', 1, 'sa', 1657465427),
(3, 1, '85.140.92.95', 1, 'ds', 1657465435),
(4, 1, '85.140.92.95', 1, 'ГЫГ', 1657465550),
(5, 1, '85.140.92.95', 1, 'sd', 1657497819),
(6, 1, '85.140.92.95', 10, 'Смотрит информацию об аккаунте Alexey_Vernetto[acc:1]', 1657497829),
(7, 1, '85.140.92.95', 10, 'Смотрит информацию об аккаунте Alexey_Vernetto[acc:1]', 1657498056),
(8, 1, '85.140.92.95', 10, 'Смотрит информацию об аккаунте Alexey_Vernetto[acc:1]', 1657498155),
(9, 1, '85.140.92.95', 3, 'Использует меню телепортов', 1657532213),
(10, 1, '85.140.92.95', 3, 'Создал транспорт (466, 1, 1)', 1657532228),
(11, 1, '85.140.92.95', 3, 'Использует меню телепортов', 1657532315),
(12, 1, '85.140.92.95', 3, 'Использует меню телепортов', 1657532331),
(13, 1, '85.140.92.95', 3, 'Использует меню телепортов', 1657532339),
(14, 1, '85.140.92.95', 3, 'Использует меню телепортов', 1657532348),
(15, 1, '85.140.92.95', 5, 'Назначил Alexey_Vernetto[acc:1] лидером ФСБ[7]', 1657532459),
(16, 1, '85.140.92.95', 3, 'Смотрит статистику Alexey_Vernetto[acc:1]', 1657532502),
(17, 1, '85.140.92.95', 3, 'Смотрит статистику Alexey_Vernetto[acc:1]', 1657532878),
(18, 1, '85.140.92.95', 3, 'Смотрит статистику Alexey_Vernetto[acc:1]', 1657532914),
(19, 1, '85.140.92.95', 3, 'Смотрит статистику Alexey_Vernetto[acc:1]', 1657532947),
(20, 1, '85.140.92.95', 3, 'Смотрит статистику Alexey_Vernetto[acc:1]', 1657533139),
(21, 1, '85.140.92.95', 3, 'Смотрит статистику Alexey_Vernetto[acc:1]', 1657533402),
(22, 1, '85.140.92.95', 3, 'Инициировал PayDay', 1657533675),
(23, 1, '85.140.92.95', 3, 'Инициировал PayDay', 1657533679),
(24, 1, '85.140.92.95', 3, 'Создал транспорт (494, 1, 1)', 1657533702),
(25, 1, '37.212.39.105', 3, 'Администратор очистил чат', 1680633558),
(26, 1, '37.212.39.105', 3, 'Установил Sander_Kligan[acc:1] скин 120', 1680634757),
(27, 1, '37.212.39.105', 3, 'Администратор очистил чат', 1680634762),
(28, 1, '37.212.39.105', 3, 'Установил время 12:00 на сервере', 1680634780),
(29, 1, '37.212.39.105', 3, 'Создал транспорт (411, 1, 1)', 1680634787),
(30, 1, '37.212.39.105', 3, 'Администратор очистил чат', 1680634821),
(31, 1, '37.212.39.105', 3, 'Создал транспорт (429, 1, 1)', 1680639848),
(32, 1, '37.212.39.105', 3, 'Зареспавнил весь незанятый транспорт', 1680639887),
(33, 1, '37.212.39.105', 3, 'Создал транспорт (411, 1, 1)', 1680671906),
(34, 1, '37.212.39.105', 3, 'Зареспавнил весь незанятый транспорт', 1680672085),
(35, 1, '37.212.39.105', 3, 'Администратор очистил чат', 1680672198),
(36, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 10 руб', 1680672226),
(37, 1, '37.212.39.105', 3, 'Установил время 12:00 на сервере', 1680717864),
(38, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 10000000 руб', 1680725277),
(39, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 25000000 руб', 1680725287),
(40, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 25000000 руб', 1680725293),
(41, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 25000000 руб', 1680725295),
(42, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 25000000 руб', 1680725296),
(43, 1, '37.212.39.105', 10, 'Выдал Sander_Kligan[acc:1] 25000000 руб', 1680725298),
(44, 2, '188.163.34.236', 3, 'Создал транспорт (411, 1, 1)', 1680760585),
(45, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 1000 руб доната', 1680760662),
(46, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 1000 руб доната', 1680760665),
(47, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 1000 руб доната', 1680760666),
(48, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 1000 руб доната', 1680760667),
(49, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760690),
(50, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760691),
(51, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760692),
(52, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760693),
(53, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760695),
(54, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760696),
(55, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760697),
(56, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760698),
(57, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760700),
(58, 2, '188.163.34.236', 10, 'Выдал Kizary_Cappone[acc:2] 25000000 руб', 1680760701),
(59, 2, '188.163.34.236', 3, 'Администратор очистил чат', 1680760704),
(60, 2, '188.163.34.236', 3, 'Подбросил Kizary_Cappone[acc:2]', 1680760745),
(61, 2, '188.163.34.236', 5, 'Взял временное лидерство Правительство области[1]', 1680761058),
(62, 2, '188.163.34.236', 3, 'Создал транспорт (541, 1, 1)', 1680761144),
(63, 2, '188.163.34.236', 5, 'Взял временное лидерство Воинская часть[2]', 1680761390),
(64, 2, '188.163.34.236', 3, 'Зареспавнил весь незанятый транспорт', 1680761417),
(65, 2, '188.163.34.236', 3, 'Создал транспорт (604, 1, 1)', 1680761607),
(66, 2, '188.163.34.236', 3, 'Зареспавнил весь незанятый транспорт', 1680761634),
(67, 2, '188.163.34.236', 3, 'Создал транспорт (444, 1, 1)', 1680761644),
(68, 2, '188.163.34.236', 3, 'Создал транспорт (603, 1, 1)', 1680761712),
(69, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1680762128),
(70, 2, '188.163.34.236', 10, 'Смотрит информацию об аккаунте Sander_Kligan[acc:1]', 1680762323),
(71, 2, '188.163.34.236', 3, 'Создал транспорт (539, 1, 1)', 1680762454),
(72, 2, '95.47.150.30', 3, 'Смотрит список администрации', 1680780370),
(73, 2, '95.47.150.30', 3, 'Создал транспорт (411, 1, 1)', 1680780477),
(74, 2, '95.47.150.30', 3, 'Создал транспорт (530, 1, 1)', 1680780504),
(75, 2, '95.47.150.30', 3, 'Создал транспорт (572, 1, 1)', 1680780563),
(76, 1, '37.212.39.201', 3, 'Установил время 01:00 на сервере', 1680879522),
(77, 1, '37.212.39.201', 3, 'Установил время 01:00 на сервере', 1680879545),
(78, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680879555),
(79, 1, '37.212.39.201', 3, 'Создал транспорт (411, 1, 1)', 1680879572),
(80, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1680879681),
(81, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680879870),
(82, 1, '37.212.39.201', 3, 'Установил время 01:00 на сервере', 1680879875),
(83, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680879957),
(84, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680880017),
(85, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680880052),
(86, 2, '188.163.34.236', 1, 'q', 1680898276),
(87, 2, '188.163.34.236', 1, 'та сука теМА', 1680898281),
(88, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1680933025),
(89, 1, '37.212.39.201', 5, 'Взял временное лидерство Правительство области[1]', 1680965770),
(90, 2, '188.163.34.236', 1, 'бля бра ', 1680966571),
(91, 1, '37.212.39.201', 5, 'Взял временное лидерство Правительство области[1]', 1680966860),
(92, 1, '37.212.39.201', 5, 'Взял временное лидерство Правительство области[1]', 1680967953),
(93, 1, '37.212.39.201', 3, 'Создал транспорт (600, 1, 1)', 1680984275),
(94, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680984286),
(95, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1680984302),
(96, 1, '37.212.39.201', 3, 'Следит за Difsan_Shedrin[acc:4]', 1681050303),
(97, 1, '37.212.39.201', 3, 'Следит за Dany_Good[acc:5]', 1681050309),
(98, 1, '37.212.39.201', 3, 'Использует меню телепортов', 1681050315),
(99, 1, '37.212.39.201', 3, 'Телепортировался к Dany_Good[acc:5]', 1681050327),
(100, 1, '37.212.39.201', 3, 'Следит за Dany_Good[acc:5]', 1681050332),
(101, 1, '37.212.39.201', 3, 'Следит за Dany_Good[acc:5]', 1681050337),
(102, 1, '37.212.39.201', 3, 'Следит за Sander_Kligan[acc:1]', 1681050339),
(103, 1, '37.212.39.201', 3, 'Установил Dany_Good[acc:5] скин 100', 1681050362),
(104, 1, '37.212.39.201', 3, 'Установил Dany_Good[acc:5] скин 125', 1681050366),
(105, 1, '37.212.39.201', 4, 'Установил Dany_Good[acc:5] уровень администратора 3', 1681050389),
(106, 1, '37.212.39.201', 4, 'Установил Difsan_Shedrin[acc:4] уровень администратора 3', 1681050400),
(107, 4, '176.222.167.27', 3, 'Следит за Dany_Good[acc:5]', 1681050423),
(108, 4, '176.222.167.27', 3, 'Следит за Dany_Good[acc:5]', 1681050430),
(109, 1, '37.212.39.201', 3, 'Следит за Difsan_Shedrin[acc:4]', 1681050435),
(110, 1, '37.212.39.201', 3, 'Следит за Dany_Good[acc:5]', 1681050437),
(111, 5, '46.180.166.86', 3, 'Следит за Difsan_Shedrin[acc:4]', 1681050443),
(112, 5, '46.180.166.86', 3, 'Следит за Sander_Kligan[acc:1]', 1681050448),
(113, 4, '176.222.167.27', 1, 'как лвл выдать себе', 1681050450),
(114, 1, '37.212.39.201', 1, 'как у вас с пикапами?', 1681050452),
(115, 5, '46.180.166.86', 1, 'норм', 1681050457),
(116, 1, '37.212.39.201', 1, 'не флудит?', 1681050459),
(117, 5, '46.180.166.86', 1, 'не могу следить', 1681050462),
(118, 5, '46.180.166.86', 3, 'Следит за Difsan_Shedrin[acc:4]', 1681050466),
(119, 4, '176.222.167.27', 1, 'тож не могв', 1681050469),
(120, 5, '46.180.166.86', 3, 'Следит за Dany_Good[acc:5]', 1681050471),
(121, 5, '46.180.166.86', 3, 'Следит за Dany_Good[acc:5]', 1681050473),
(122, 5, '46.180.166.86', 3, 'Следит за Dany_Good[acc:5]', 1681050474),
(123, 5, '46.180.166.86', 3, 'Следит за Dany_Good[acc:5]', 1681050475),
(124, 5, '46.180.166.86', 1, 'визуал', 1681050478),
(125, 4, '176.222.167.27', 1, 'вы где', 1681050482),
(126, 1, '37.212.39.201', 3, 'Создал транспорт (411, 1, 1)', 1681050487),
(127, 4, '176.222.167.27', 3, 'Использует меню телепортов', 1681050488),
(128, 5, '46.180.166.86', 1, 'моя 24/7', 1681050490),
(129, 4, '176.222.167.27', 3, 'Телепортировался к Dany_Good[acc:5]', 1681050497),
(130, 4, '176.222.167.27', 3, 'Создал транспорт (468, 3, 3)', 1681050527),
(131, 1, '37.212.39.201', 1, 'ид 411', 1681050535),
(132, 4, '176.222.167.27', 3, 'Создал транспорт (411, 1, 1)', 1681050541),
(133, 4, '176.222.167.27', 3, 'Создал транспорт (411, 1, 1)', 1681050599),
(134, 4, '176.222.167.27', 3, 'Создал транспорт (476, 3, 3)', 1681050612),
(135, 1, '37.212.39.201', 3, 'Администратор очистил чат', 1681050632),
(136, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681050689),
(137, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681050738),
(138, 4, '176.222.167.27', 1, 'ко мне го', 1681050840),
(139, 1, '37.212.39.201', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681050861),
(140, 1, '37.212.39.201', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681050863),
(141, 1, '37.212.39.201', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681050878),
(142, 1, '37.212.39.201', 3, 'Следит за Difsan_Shedrin[acc:4]', 1681050885),
(143, 1, '37.212.39.201', 3, 'Следит за Difsan_Shedrin[acc:4]', 1681050889),
(144, 1, '37.212.39.201', 3, 'Телепортировал к себе Difsan_Shedrin[acc:4]', 1681050897),
(145, 4, '176.222.167.27', 1, 'принимай', 1681050987),
(146, 4, '176.222.167.27', 1, 'я в магазе', 1681050995),
(147, 4, '176.222.167.27', 3, 'Создал транспорт (466, 4, 4)', 1681051056),
(148, 1, '37.212.39.201', 3, 'Выдал Sander_Kligan[acc:1] Парашют[1 патр]', 1681051061),
(149, 4, '176.222.167.27', 3, 'Создал транспорт (443, 5, 5)', 1681051068),
(150, 1, '37.212.39.201', 1, 'ид паршута 46', 1681051071),
(151, 4, '176.222.167.27', 1, 'как лвл выдать?', 1681051083),
(152, 1, '37.212.39.201', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681051090),
(153, 4, '176.222.167.27', 1, 'где команды алм посмотреть', 1681051101),
(154, 4, '176.222.167.27', 3, 'Создал транспорт (465, 3, 3)', 1681051108),
(155, 4, '176.222.167.27', 1, 'оф', 1681051122),
(156, 1, '37.212.39.201', 3, 'Выдал Sander_Kligan[acc:1] Парашют[1 патр]', 1681051122),
(157, 4, '176.222.167.27', 1, 'ой', 1681051127),
(158, 1, '37.212.39.201', 3, 'Создал транспорт (465, 1, 1)', 1681051131),
(159, 4, '176.222.167.27', 1, 'я скажу когда тп', 1681051147),
(160, 1, '37.212.39.201', 1, 'я создал верт', 1681051158),
(161, 4, '176.222.167.27', 1, 'двухместнвй?', 1681051170),
(162, 1, '37.212.39.201', 1, 'не а надо?', 1681051182),
(163, 4, '176.222.167.27', 1, 'го', 1681051188),
(164, 4, '176.222.167.27', 1, 'я ацди не помню', 1681051192),
(165, 4, '176.222.167.27', 3, 'Создал транспорт (467, 5, 5)', 1681051242),
(166, 4, '176.222.167.27', 3, 'Создал транспорт (477, 5, 5)', 1681051266),
(167, 1, '37.212.39.201', 3, 'Создал транспорт (417, 1, 1)', 1681051276),
(168, 4, '176.222.167.27', 3, 'Создал транспорт (458, 5, 5)', 1681051287),
(169, 1, '37.212.39.201', 1, 'тп ко мне', 1681051299),
(170, 4, '176.222.167.27', 3, 'Создал транспорт (476, 5, 5)', 1681051302),
(171, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681051308),
(172, 1, '37.212.39.201', 3, 'Выдал Sander_Kligan[acc:1] Парашют[1 патр]', 1681051332),
(173, 4, '176.222.167.27', 1, 'я просто сдох', 1681051433),
(174, 1, '37.212.39.201', 1, '*', 1681051438),
(175, 4, '176.222.167.27', 1, 'хахахахаха', 1681051442),
(176, 4, '176.222.167.27', 1, 'ядумал щас эпик будет', 1681051451),
(177, 1, '37.212.39.201', 1, 'лад , дз делатт', 1681051456),
(178, 4, '176.222.167.27', 3, 'Создал транспорт (456, 5, 5)', 1681051462),
(179, 1, '37.212.39.201', 3, 'Установил Difsan_Shedrin[acc:4] скин 1', 1681051467),
(180, 1, '37.212.39.201', 1, 'ой', 1681051471),
(181, 5, '46.180.166.86', 3, 'Создал транспорт (406, 2, 2)', 1681051474),
(182, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681051475),
(183, 1, '37.212.39.201', 3, 'Установил Sander_Kligan[acc:1] скин 1', 1681051487),
(184, 5, '46.180.166.86', 1, 'диф тп ко мне', 1681051490),
(185, 5, '46.180.166.86', 1, 'диф де ты', 1681051495),
(186, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681051512),
(187, 5, '46.180.166.86', 3, 'Создал транспорт (406, 2, 2)', 1681051519),
(188, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681051545),
(189, 5, '46.180.166.86', 3, 'Использует меню телепортов', 1681052100),
(190, 5, '46.180.166.86', 3, 'Использует меню телепортов', 1681052111),
(191, 4, '176.222.167.27', 3, 'Создал транспорт (476, 5, 5)', 1681052338),
(192, 4, '176.222.167.27', 3, 'Следит за Ilya_Vysotsky[acc:6]', 1681052431),
(193, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681052437),
(194, 4, '176.222.167.27', 3, 'Телепортировался к Ilya_Vysotsky[acc:6]', 1681052442),
(195, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681052460),
(196, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681052478),
(197, 4, '176.222.167.27', 3, 'Телепортировался к Ilya_Vysotsky[acc:6]', 1681052505),
(198, 5, '46.180.166.86', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681052569),
(199, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052572),
(200, 4, '176.222.167.27', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681052578),
(201, 4, '176.222.167.27', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681052602),
(202, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052608),
(203, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052613),
(204, 5, '46.180.166.86', 3, 'Использует меню телепортов', 1681052625),
(205, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052636),
(206, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052641),
(207, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052641),
(208, 5, '46.180.166.86', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052642),
(209, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052642),
(210, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052643),
(211, 5, '46.180.166.86', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052645),
(212, 5, '46.180.166.86', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052646),
(213, 5, '46.180.166.86', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681052647),
(214, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052671),
(215, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052846),
(216, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052867),
(217, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052903),
(218, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052921),
(219, 5, '46.180.166.86', 3, 'Телепортировался к Dany_Good[acc:5]', 1681052925),
(220, 5, '46.180.166.86', 3, 'Телепортировался к Ilya_Vysotsky[acc:6]', 1681052928),
(221, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681052937),
(222, 5, '46.180.166.86', 3, 'Использует меню телепортов', 1681052960),
(223, 5, '46.180.166.86', 3, 'Смотрит статистику Difsan_Shedrin[acc:4]', 1681052998),
(224, 4, '176.222.167.27', 3, 'Установил Difsan_Shedrin[acc:4] уровень здоровья на 100', 1681053018),
(225, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053057),
(226, 4, '176.222.167.27', 3, 'Установил Difsan_Shedrin[acc:4] уровень здоровья на 0', 1681053085),
(227, 4, '176.222.167.27', 3, 'Установил Difsan_Shedrin[acc:4] уровень здоровья на 1', 1681053091),
(228, 4, '176.222.167.27', 3, 'Следит за Nikita_Stegiv[acc:7]', 1681053178),
(229, 5, '46.180.166.86', 3, 'Следит за Nikita_Stegiv[acc:7]', 1681053184),
(230, 5, '46.180.166.86', 1, 'псж', 1681053187),
(231, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681053196),
(232, 5, '46.180.166.86', 1, 'я думал тут крис', 1681053203),
(233, 5, '46.180.166.86', 1, 'я наверно пойду с тестеров', 1681053213),
(234, 4, '176.222.167.27', 5, 'Взял временное лидерство Правительство области[1]', 1681053262),
(235, 4, '176.222.167.27', 5, 'Взял временное лидерство Воинская часть[2]', 1681053269),
(236, 5, '46.180.166.86', 5, 'Взял временное лидерство Лыткаринская ОПГ[10]', 1681053273),
(237, 5, '46.180.166.86', 5, 'Взял временное лидерство Батыревская ОПГ[9]', 1681053277),
(238, 5, '46.180.166.86', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681053282),
(239, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681053325),
(240, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053328),
(241, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053336),
(242, 4, '176.222.167.27', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681053380),
(243, 4, '176.222.167.27', 9, 'Принял Ilya_Vysotsky[acc:6] в организацию Воинская часть', 1681053390),
(244, 5, '46.180.166.86', 3, 'Телепортировал к себе Difsan_Shedrin[acc:4]', 1681053395),
(245, 4, '176.222.167.27', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681053414),
(246, 5, '46.180.166.86', 5, 'Взял временное лидерство Правительство области[1]', 1681053440),
(247, 5, '46.180.166.86', 5, 'Взял временное лидерство Воинская часть[2]', 1681053442),
(248, 4, '176.222.167.27', 9, 'Повысил Ilya_Vysotsky[acc:0] до 2 (Ефрейтор)', 1681053491),
(249, 4, '176.222.167.27', 9, 'Повысил Ilya_Vysotsky[acc:0] до 3 (Сержант)', 1681053493),
(250, 4, '176.222.167.27', 9, 'Повысил Ilya_Vysotsky[acc:0] до 4 (Старшина)', 1681053495),
(251, 5, '46.180.166.86', 3, 'Посадил в тюрьму Ilya_Vysotsky[acc:6] на 60 мин. Причина: DM', 1681053495),
(252, 5, '46.180.166.86', 3, 'Телепортировался к Ilya_Vysotsky[acc:6]', 1681053500),
(253, 4, '176.222.167.27', 3, 'Выпустил из тюрьмы Ilya_Vysotsky[acc:6]', 1681053503),
(254, 4, '176.222.167.27', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681053508),
(255, 4, '176.222.167.27', 1, 'даня ьлять', 1681053514),
(256, 5, '46.180.166.86', 3, 'Заспавнил Ilya_Vysotsky[acc:6]', 1681053517),
(257, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053521),
(258, 5, '46.180.166.86', 1, 'чо', 1681053524),
(259, 4, '176.222.167.27', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681053528),
(260, 4, '176.222.167.27', 1, 'не твори хуйню', 1681053534),
(261, 5, '46.180.166.86', 1, 'нафек иди', 1681053543),
(262, 4, '176.222.167.27', 1, 'заблудились блият', 1681053569),
(263, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681053614),
(264, 4, '176.222.167.27', 9, 'Принял Sander_Kligan[acc:1] в организацию Воинская часть', 1681053624),
(265, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 2 (Ефрейтор)', 1681053632),
(266, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 3 (Сержант)', 1681053635),
(267, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 4 (Старшина)', 1681053638),
(268, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 5 (Прапорщик)', 1681053642),
(269, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 6 (Лейтенант)', 1681053645),
(270, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 7 (Капитан)', 1681053647),
(271, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 8 (Майор)', 1681053649),
(272, 4, '176.222.167.27', 9, 'Повысил Sander_Kligan[acc:4] до 9 (Подполковник)', 1681053652),
(273, 5, '46.180.166.86', 1, 'хыхыэы', 1681053695),
(274, 5, '46.180.166.86', 1, 'хыхыэы', 1681053702),
(275, 1, '37.212.39.201', 3, 'Телепортировал к себе Ilya_Vysotsky[acc:6]', 1681053704),
(276, 1, '37.212.39.201', 3, 'Телепортировал к себе Difsan_Shedrin[acc:4]', 1681053706),
(277, 1, '37.212.39.201', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681053708),
(278, 1, '37.212.39.201', 3, 'Телепортировал к себе Dany_Good[acc:5]', 1681053709),
(279, 1, '37.212.39.201', 3, 'Телепортировал к себе Sander_Kligan[acc:1]', 1681053712),
(280, 1, '37.212.39.201', 3, 'Телепортировал к себе Alex_Fentazi[acc:3]', 1681053714),
(281, 5, '46.180.166.86', 9, 'Принял Alex_Fentazi[acc:3] в организацию Воинская часть', 1681053747),
(282, 4, '176.222.167.27', 3, 'Создал транспорт (476, 5, 5)', 1681053754),
(283, 5, '46.180.166.86', 9, 'Принял Nikita_Stegiv[acc:7] в организацию Воинская часть', 1681053760),
(284, 4, '176.222.167.27', 3, 'Создал транспорт (476, 5, 5)', 1681053760),
(285, 1, '37.212.39.201', 4, 'Установил Alex_Fentazi[acc:3] уровень администратора 3', 1681053786),
(286, 1, '37.212.39.201', 4, 'Установил Nikita_Stegiv[acc:7] уровень администратора 3', 1681053790),
(287, 1, '37.212.39.201', 4, 'Установил Ilya_Vysotsky[acc:6] уровень администратора 3', 1681053795),
(288, 3, '95.153.161.153', 5, 'Взял временное лидерство Воинская часть[2]', 1681053806),
(289, 1, '37.212.39.201', 1, 'айпи не показываетсч', 1681053810),
(290, 7, '95.31.181.2', 5, 'Взял временное лидерство Городская больница[3]', 1681053812),
(291, 3, '95.153.161.153', 1, 'всм?', 1681053815),
(292, 3, '95.153.161.153', 3, 'Смотрит список администрации', 1681053820),
(293, 1, '37.212.39.201', 1, 'если будет то только потом и лично игроку', 1681053823),
(294, 3, '95.153.161.153', 1, 'я если что рук проекта)', 1681053835),
(295, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053838),
(296, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053842),
(297, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053843),
(298, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053844),
(299, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053844),
(300, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053845),
(301, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053847),
(302, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053848),
(303, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053849),
(304, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053850),
(305, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053851),
(306, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053852),
(307, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053852),
(308, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053855),
(309, 7, '95.31.181.2', 3, 'Заспавнил Nikita_Stegiv[acc:7]', 1681053856),
(310, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053856),
(311, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053857),
(312, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053858),
(313, 1, '37.212.39.201', 9, 'Покинул организацию Воинская часть по собственному желанию', 1681053860),
(314, 4, '176.222.167.27', 1, 'как лвл выдать', 1681053870),
(315, 1, '37.212.39.201', 1, 'бд', 1681053877),
(316, 5, '46.180.166.86', 1, 'нельзя ', 1681053880),
(317, 5, '46.180.166.86', 1, '/setstats', 1681053885),
(318, 1, '37.212.39.201', 1, 'кст армию оставляем так и переносим пикапы', 1681053891),
(319, 3, '95.153.161.153', 1, 'всм?', 1681053897),
(320, 1, '37.212.39.201', 1, 'но вот куда пикапы перенести?', 1681053900),
(321, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053904),
(322, 4, '176.222.167.27', 1, 'здание слишком большое', 1681053904),
(323, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053908),
(324, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681053909),
(325, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053914),
(326, 5, '46.180.166.86', 1, 'посмотри вход', 1681053918),
(327, 1, '37.212.39.201', 3, 'Создал транспорт (411, 1, 1)', 1681053921),
(328, 5, '46.180.166.86', 1, 'в военку', 1681053923),
(329, 6, '195.211.216.154', 3, 'Создал транспорт (474, 1, 1)', 1681053934),
(330, 5, '46.180.166.86', 1, 'пизда топ', 1681053934),
(331, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053934),
(332, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053937),
(333, 4, '176.222.167.27', 1, 'выход из военки забаган пон', 1681053938),
(334, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053939),
(335, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053942),
(336, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053951),
(337, 1, '37.212.39.201', 1, 'тп все ко мне сделаем скрин', 1681053958),
(338, 4, '176.222.167.27', 3, 'Создал транспорт (444, 5, 5)', 1681053960),
(339, 5, '46.180.166.86', 3, 'Создал транспорт (406, 2, 2)', 1681053968),
(340, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681053972),
(341, 1, '37.212.39.201', 1, 'тп все ко мне сделаем скрин', 1681053976),
(342, 1, '37.212.39.201', 1, 'тп все ко мне сделаем скрин', 1681053983),
(343, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053988),
(344, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681053996),
(345, 1, '37.212.39.201', 1, 'тп все ко мне сделаем скрин', 1681053996),
(346, 1, '37.212.39.201', 1, 'тп все ко мне сделаем скрин', 1681054003),
(347, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681054013),
(348, 3, '95.153.161.153', 5, 'Взял временное лидерство Воинская часть[2]', 1681054036),
(349, 7, '95.31.181.2', 5, 'Взял временное лидерство Отдел полиции №1 (ГИБДД)[5]', 1681054047),
(350, 1, '37.212.39.201', 3, 'Администратор очистил чат', 1681054049),
(351, 4, '176.222.167.27', 3, 'Выдал Difsan_Shedrin[acc:4] скин 234', 1681054054),
(352, 4, '176.222.167.27', 3, 'Выдал Difsan_Shedrin[acc:4] скин 233', 1681054059),
(353, 4, '176.222.167.27', 3, 'Выдал Difsan_Shedrin[acc:4] скин 222', 1681054062),
(354, 5, '46.180.166.86', 3, 'Администратор очистил чат', 1681054114),
(355, 3, '95.153.161.153', 3, 'Смотрит список администрации', 1681054123),
(356, 1, '37.212.39.201', 1, 'с ахелп знаю', 1681054148),
(357, 1, '37.212.39.201', 1, 'мой косяк', 1681054157),
(358, 7, '95.31.181.2', 1, 'выдайте лвл', 1681054168),
(359, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681054173),
(360, 7, '95.31.181.2', 3, 'Создал транспорт (456, 1, 1)', 1681054175),
(361, 5, '46.180.166.86', 3, 'Создал транспорт (406, 2, 2)', 1681054184),
(362, 6, '195.211.216.154', 3, 'Создал транспорт (473, 1, 1)', 1681054187),
(363, 3, '95.153.161.153', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681054187),
(364, 6, '195.211.216.154', 3, 'Создал транспорт (427, 1, 1)', 1681054220),
(365, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681054222),
(366, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681054230),
(367, 6, '195.211.216.154', 3, 'Создал транспорт (474, 1, 1)', 1681054303),
(368, 7, '95.31.181.2', 3, 'Создал транспорт (456, 1, 1)', 1681054310),
(369, 6, '195.211.216.154', 3, 'Создал транспорт (572, 1, 1)', 1681054333),
(370, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1681054374),
(371, 7, '95.31.181.2', 5, 'Взял временное лидерство ФСБ[7]', 1681054389),
(372, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681054429),
(373, 7, '95.31.181.2', 5, 'Взял временное лидерство Воинская часть[2]', 1681054672),
(374, 7, '95.31.181.2', 5, 'Взял временное лидерство ФСБ[7]', 1681054721),
(375, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681054933),
(376, 7, '95.31.181.2', 3, 'Создал транспорт (456, 6, 16)', 1681055024),
(377, 7, '95.31.181.2', 3, 'Администратор очистил чат', 1681055141),
(378, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681055334),
(379, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681055340),
(380, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681055383),
(381, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681055392),
(382, 7, '95.31.181.2', 3, 'Следит за Kizary_Cappone[acc:2]', 1681055667),
(383, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681055672),
(384, 7, '95.31.181.2', 3, 'Создал транспорт (414, 6, 6)', 1681055767),
(385, 7, '95.31.181.2', 3, 'Использует меню телепортов', 1681055813),
(386, 7, '95.31.181.2', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 100', 1681055851),
(387, 7, '95.31.181.2', 5, 'Взял временное лидерство Правительство области[1]', 1681055942),
(388, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681056120),
(389, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681056161),
(390, 7, '95.31.181.2', 5, 'Взял временное лидерство ФСБ[7]', 1681056480),
(391, 7, '95.31.181.2', 3, 'Администратор очистил чат', 1681056539),
(392, 7, '95.31.181.2', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 100', 1681056607),
(393, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681056704),
(394, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681056714),
(395, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681056719),
(396, 1, '37.212.39.201', 3, 'Следит за Nikita_Stegiv[acc:7]', 1681056719),
(397, 1, '37.212.39.201', 3, 'Создал транспорт (411, 1, 1)', 1681056825),
(398, 1, '37.212.39.201', 10, 'Выдал Nikita_Stegiv[acc:7] 1000000 руб', 1681056862),
(399, 1, '37.212.39.201', 5, 'Взял временное лидерство Городская больница[3]', 1681056903),
(400, 1, '37.212.39.201', 5, 'Взял временное лидерство Воинская часть[2]', 1681056905),
(401, 7, '95.31.181.2', 1, 'вот', 1681056996),
(402, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681056999),
(403, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681057141),
(404, 7, '95.31.181.2', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057209),
(405, 4, '176.222.167.27', 3, 'Создал транспорт (475, 5, 5)', 1681057223),
(406, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681057253),
(407, 7, '95.31.181.2', 3, 'Создал транспорт (416, 6, 6)', 1681057265),
(408, 4, '176.222.167.27', 3, 'Создал транспорт (444, 5, 5)', 1681057283),
(409, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №39', 1681057308),
(410, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №41', 1681057313),
(411, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №42', 1681057316),
(412, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №42', 1681057321),
(413, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №42', 1681057327),
(414, 4, '176.222.167.27', 3, 'Создал транспорт (465, 5, 5)', 1681057397),
(415, 7, '95.31.181.2', 3, 'Создал транспорт (465, 1, 1)', 1681057424),
(416, 4, '176.222.167.27', 3, 'Создал транспорт (479, 5, 5)', 1681057473),
(417, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057540),
(418, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057572),
(419, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057573),
(420, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057575),
(421, 7, '95.31.181.2', 3, 'Телепортировал к себе Difsan_Shedrin[acc:4]', 1681057579),
(422, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057579),
(423, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057579),
(424, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057581),
(425, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057581),
(426, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057582),
(427, 4, '176.222.167.27', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057583),
(428, 7, '95.31.181.2', 3, 'Телепортировал к себе Difsan_Shedrin[acc:4]', 1681057583),
(429, 4, '176.222.167.27', 3, 'Создал транспорт (485, 5, 5)', 1681057615),
(430, 4, '176.222.167.27', 3, 'Создал транспорт (411, 5, 5)', 1681057650),
(431, 7, '95.31.181.2', 1, 'аххахаа', 1681057671),
(432, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №42', 1681057675),
(433, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №43', 1681057689),
(434, 4, '176.222.167.27', 3, 'Создал транспорт (411, 5, 5)', 1681057691),
(435, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №43', 1681057726),
(436, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057728),
(437, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057731),
(438, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057732),
(439, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057733),
(440, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057734),
(441, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057735),
(442, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057736),
(443, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681057740),
(444, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057742),
(445, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681057744),
(446, 7, '95.31.181.2', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681057752),
(447, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681057780),
(448, 4, '176.222.167.27', 3, 'Создал транспорт (414, 5, 5)', 1681057799),
(449, 7, '95.31.181.2', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057802),
(450, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681057809),
(451, 4, '176.222.167.27', 3, 'Зареспавнил авто №1', 1681057814),
(452, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №34', 1681057817),
(453, 4, '176.222.167.27', 3, 'Зареспавнил авто №2', 1681057819),
(454, 4, '176.222.167.27', 3, 'Зареспавнил авто №3', 1681057821),
(455, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №30', 1681057837),
(456, 5, '46.180.166.86', 3, 'Подбросил Dany_Good[acc:5]', 1681057859),
(457, 4, '176.222.167.27', 3, 'Создал транспорт (432, 5, 5)', 1681057865),
(458, 4, '176.222.167.27', 1, 'ой', 1681057907),
(459, 7, '95.31.181.2', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681057942),
(460, 7, '95.31.181.2', 3, 'Подбросил Difsan_Shedrin[acc:4]', 1681057948),
(461, 4, '176.222.167.27', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681057959),
(462, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681057971),
(463, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №38', 1681057982),
(464, 7, '95.31.181.2', 3, 'Создал транспорт (414, 6, 6)', 1681057984),
(465, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №39', 1681057986),
(466, 7, '95.31.181.2', 1, 'хаха', 1681057996),
(467, 5, '46.180.166.86', 3, 'Администратор очистил чат', 1681058007),
(468, 5, '46.180.166.86', 1, 'дифсан гей', 1681058019),
(469, 5, '46.180.166.86', 3, 'Администратор очистил чат', 1681058026),
(470, 4, '176.222.167.27', 3, 'Создал транспорт (473, 5, 5)', 1681058027),
(471, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №40', 1681058038),
(472, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №39', 1681058043),
(473, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №41', 1681058048),
(474, 7, '95.31.181.2', 1, 'СУКА', 1681058053),
(475, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №41', 1681058058),
(476, 4, '176.222.167.27', 1, 'НЕТЕЛЕПОРТИРУЫТЕ БЛЯТЬ', 1681058064),
(477, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681058064),
(478, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №1', 1681058073),
(479, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №2', 1681058074),
(480, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №3', 1681058076),
(481, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №4', 1681058077),
(482, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №5', 1681058079),
(483, 7, '95.31.181.2', 1, '+', 1681058081),
(484, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №6', 1681058087),
(485, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №7', 1681058089),
(486, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №8', 1681058091),
(487, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №9', 1681058093),
(488, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №10', 1681058096),
(489, 5, '46.180.166.86', 1, 'тп', 1681058103),
(490, 4, '176.222.167.27', 3, 'Создал транспорт (474, 5, 5)', 1681058110),
(491, 5, '46.180.166.86', 3, 'Телепортировал к себе Difsan_Shedrin[acc:4]', 1681058126),
(492, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №11', 1681058143),
(493, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №12', 1681058145),
(494, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №13', 1681058146),
(495, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №14', 1681058148),
(496, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №15', 1681058149),
(497, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №16', 1681058151),
(498, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №17', 1681058155),
(499, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №18', 1681058157),
(500, 7, '95.31.181.2', 1, 'Харе бред творить', 1681058159),
(501, 5, '46.180.166.86', 1, 'та лан', 1681058165),
(502, 4, '176.222.167.27', 1, '+', 1681058165),
(503, 5, '46.180.166.86', 1, 'я шучу так', 1681058170),
(504, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №19', 1681058178),
(505, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №20', 1681058183),
(506, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №21', 1681058187),
(507, 7, '95.31.181.2', 1, 'ты в заявке скок ставил адекватность?', 1681058189),
(508, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №22', 1681058189),
(509, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №23', 1681058191),
(510, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №24', 1681058192),
(511, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №25', 1681058195),
(512, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №26', 1681058198),
(513, 7, '95.31.181.2', 3, 'Заспавнил Dany_Good[acc:5]', 1681058202),
(514, 4, '176.222.167.27', 3, 'Кикнул Dany_Good[acc:5]', 1681058202),
(515, 7, '95.31.181.2', 1, 'хахаха', 1681058210),
(516, 7, '95.31.181.2', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681058216),
(517, 5, '46.180.166.86', 1, 'анти слив работает!', 1681058249),
(518, 5, '46.180.166.86', 1, 'я проверил!', 1681058254),
(519, 7, '95.31.181.2', 1, 'это хорошо', 1681058258),
(520, 5, '46.180.166.86', 1, ':D', 1681058261),
(521, 7, '95.31.181.2', 1, 'ток тебя кикнул админ', 1681058271),
(522, 5, '46.180.166.86', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681058276),
(523, 5, '46.180.166.86', 1, 'диф кикнул?', 1681058291),
(524, 4, '176.222.167.27', 3, 'Создал транспорт (488, 5, 5)', 1681058397),
(525, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681058425),
(526, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058430),
(527, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681058459),
(528, 5, '46.180.166.86', 1, 'че за хует', 1681058484),
(529, 5, '46.180.166.86', 1, 'че за хуета', 1681058485),
(530, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681058491),
(531, 5, '46.180.166.86', 1, 'что за пиздец', 1681058504),
(532, 4, '176.222.167.27', 3, 'Создал транспорт (482, 5, 5)', 1681058504),
(533, 4, '176.222.167.27', 3, 'Создал транспорт (411, 5, 5)', 1681058521),
(534, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058575),
(535, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058583),
(536, 7, '95.31.181.2', 3, 'Следит за Dany_Good[acc:5]', 1681058615),
(537, 5, '46.180.166.86', 3, 'Создал транспорт (401, 1, 1)', 1681058665),
(538, 4, '176.222.167.27', 3, 'Кикнул Dany_Good[acc:5]', 1681058676),
(539, 7, '95.31.181.2', 1, 'М....', 1681058686),
(540, 4, '176.222.167.27', 1, 'НАХУЯ БЛЯТЬ', 1681058691),
(541, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058718),
(542, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058723),
(543, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058726),
(544, 1, '37.212.39.201', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 100', 1681058734),
(545, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681058867),
(546, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058872),
(547, 5, '46.180.166.86', 3, 'Телепортировался к Dany_Good[acc:5]', 1681058890),
(548, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681058896),
(549, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058898),
(550, 7, '95.31.181.2', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681058910),
(551, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681058913),
(552, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058916),
(553, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681058922),
(554, 1, '37.212.39.201', 1, 'думайте куда будем переносить пикапы на вч', 1681058926),
(555, 1, '37.212.39.201', 3, 'Создал транспорт (417, 1, 1)', 1681058973),
(556, 5, '46.180.166.86', 5, 'Взял временное лидерство Воинская часть[2]', 1681058977),
(557, 1, '37.212.39.201', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 100', 1681058999),
(558, 4, '176.222.167.27', 3, 'Создал транспорт (411, 1, 2)', 1681058999),
(559, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681059020),
(560, 1, '37.212.39.201', 3, 'Создал транспорт (425, 1, 1)', 1681059025),
(561, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681059040),
(562, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681059051),
(563, 7, '95.31.181.2', 3, 'Создал транспорт (467, 1, 1)', 1681059057),
(564, 5, '46.180.166.86', 3, 'Создал транспорт (511, 1, 1)', 1681059057),
(565, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681059067),
(566, 1, '37.212.39.201', 3, 'Создал транспорт (437, 1, 1)', 1681059097),
(567, 7, '95.31.181.2', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681059194),
(568, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059199),
(569, 7, '95.31.181.2', 3, 'Создал транспорт (414, 6, 6)', 1681059209),
(570, 5, '46.180.166.86', 3, 'Создал транспорт (512, 2, 2)', 1681059222),
(571, 5, '46.180.166.86', 3, 'Создал транспорт (513, 3, 3)', 1681059241),
(572, 4, '176.222.167.27', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681059261),
(573, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059267),
(574, 5, '46.180.166.86', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681059286),
(575, 5, '46.180.166.86', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681059293),
(576, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059299),
(577, 1, '37.212.39.201', 3, 'Создал транспорт (577, 1, 1)', 1681059300),
(578, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681059311),
(579, 1, '37.212.39.201', 1, 'кто хочет со мной жду', 1681059314),
(580, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059323),
(581, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059349),
(582, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059350),
(583, 7, '95.31.181.2', 1, 'скажи ид', 1681059352),
(584, 5, '46.180.166.86', 3, 'Создал транспорт (516, 2, 2)', 1681059353),
(585, 7, '95.31.181.2', 1, 'скажи ид', 1681059358),
(586, 5, '46.180.166.86', 3, 'Создал транспорт (515, 2, 2)', 1681059359),
(587, 5, '46.180.166.86', 3, 'Создал транспорт (514, 2, 2)', 1681059365),
(588, 4, '176.222.167.27', 3, 'Создал транспорт (611, 5, 5)', 1681059373),
(589, 5, '46.180.166.86', 3, 'Создал транспорт (412, 2, 2)', 1681059375),
(590, 7, '95.31.181.2', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681059382),
(591, 5, '46.180.166.86', 3, 'Создал транспорт (412, 2, 2)', 1681059384),
(592, 1, '37.212.39.201', 3, 'Создал транспорт (577, 1, 1)', 1681059385),
(593, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681059385),
(594, 4, '176.222.167.27', 3, 'Создал транспорт (610, 5, 5)', 1681059388),
(595, 7, '95.31.181.2', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681059390),
(596, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059392),
(597, 5, '46.180.166.86', 3, 'Создал транспорт (516, 2, 2)', 1681059396),
(598, 4, '176.222.167.27', 3, 'Создал транспорт (600, 5, 5)', 1681059400),
(599, 5, '46.180.166.86', 3, 'Создал транспорт (512, 2, 2)', 1681059403),
(600, 4, '176.222.167.27', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059408),
(601, 5, '46.180.166.86', 3, 'Создал транспорт (514, 2, 2)', 1681059415),
(602, 5, '46.180.166.86', 3, 'Создал транспорт (510, 1, 1)', 1681059426),
(603, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059428),
(604, 4, '176.222.167.27', 3, 'Создал транспорт (488, 5, 5)', 1681059432),
(605, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059445),
(606, 5, '46.180.166.86', 3, 'Создал транспорт (510, 2, 2)', 1681059548),
(607, 5, '46.180.166.86', 3, 'Создал транспорт (511, 2, 2)', 1681059555),
(608, 5, '46.180.166.86', 3, 'Создал транспорт (512, 2, 2)', 1681059562),
(609, 5, '46.180.166.86', 3, 'Создал транспорт (506, 2, 2)', 1681059583),
(610, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №40', 1681059603),
(611, 5, '46.180.166.86', 1, '/spcars pls', 1681059612),
(612, 5, '46.180.166.86', 1, '/spcars pls', 1681059629),
(613, 5, '46.180.166.86', 1, '/spcars pls', 1681059631),
(614, 5, '46.180.166.86', 1, '/spcars pls', 1681059643),
(615, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681059657),
(616, 5, '46.180.166.86', 3, 'Создал транспорт (512, 1, 1)', 1681059721),
(617, 1, '37.212.39.201', 3, 'Создал транспорт (448, 1, 1)', 1681059789),
(618, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681059807),
(619, 7, '95.31.181.2', 3, 'Выдал Nikita_Stegiv[acc:7] скин 122', 1681059815),
(620, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681059835),
(621, 1, '37.212.39.201', 3, 'Заспавнил Dany_Good[acc:5]', 1681059887),
(622, 1, '37.212.39.201', 3, 'Заспавнил Sander_Kligan[acc:1]', 1681059889),
(623, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №39', 1681059901),
(624, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681059913),
(625, 7, '95.31.181.2', 3, 'Телепортировался к себе авто №39', 1681059919),
(626, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №40', 1681059927),
(627, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №40', 1681059935),
(628, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №40', 1681059938),
(629, 5, '46.180.166.86', 3, 'Телепортировался к себе авто №39', 1681060063),
(630, 5, '46.180.166.86', 3, 'Смотрит статистику Nikita_Stegiv[acc:7]', 1681060174),
(631, 7, '95.31.181.2', 1, 'ой', 1681060229),
(632, 7, '95.31.181.2', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681060233),
(633, 5, '46.180.166.86', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681060271),
(634, 1, '37.212.39.201', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681060361),
(635, 5, '46.180.166.86', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681060419),
(636, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681060540),
(637, 5, '46.180.166.86', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681060543),
(638, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681060546),
(639, 5, '46.180.166.86', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681060556),
(640, 5, '46.180.166.86', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681060562),
(641, 7, '95.31.181.2', 1, 'd', 1681060865),
(642, 7, '95.31.181.2', 3, 'Использует меню телепортов', 1681060885),
(643, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681060939),
(644, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681060944),
(645, 1, '37.212.39.201', 3, 'Зареспавнил весь незанятый транспорт', 1681060962),
(646, 7, '95.31.181.2', 1, 'хаха', 1681061068),
(647, 1, '37.212.39.201', 3, 'Следит за Kizary_Cappone[acc:2]', 1681061085),
(648, 1, '37.212.39.201', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681061090),
(649, 1, '37.212.39.201', 4, 'Установил Kizary_Cappone[acc:2] уровень администратора 3', 1681061112),
(650, 2, '188.163.34.236', 1, 'q all', 1681061138),
(651, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1681061141),
(652, 7, '95.31.181.2', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 100', 1681061149),
(653, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681061221),
(654, 7, '95.31.181.2', 1, 'поч пишет аренда скутера 50 руб а списывает 800', 1681061255),
(655, 2, '188.163.34.236', 1, 'хз', 1681061292),
(656, 7, '95.31.181.2', 1, 'я себе казик купил', 1681061315),
(657, 2, '188.163.34.236', 1, 'молодец!', 1681061334),
(658, 7, '95.31.181.2', 1, 'спс', 1681061352),
(659, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 6)', 1681061378),
(660, 7, '95.31.181.2', 1, 'цены на дома очень маленькие ', 1681061436),
(661, 7, '95.31.181.2', 3, 'Телепортировался к Dany_Good[acc:5]', 1681061498),
(662, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681061501),
(663, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1681061532),
(664, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1681061595),
(665, 7, '95.31.181.2', 1, 'работа автобусников не работает', 1681061625),
(666, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681061674),
(667, 2, '188.163.34.236', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681061781),
(668, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1681061813),
(669, 7, '95.31.181.2', 1, 'такси тоже не работает', 1681061844);
INSERT INTO `action_log` (`id`, `acc_id`, `uip`, `type`, `description`, `time`) VALUES
(670, 1, '37.212.39.201', 1, 'в тг я забуду', 1681061867),
(671, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1681061881),
(672, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1681062011),
(673, 2, '188.163.34.236', 1, 'я тут ', 1681062183),
(674, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1681062195),
(675, 2, '188.163.34.236', 3, 'Создал транспорт (411, 1, 1)', 1681062201),
(676, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681062224),
(677, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681062238),
(678, 2, '188.163.34.236', 1, 'артем я отойду на минут 10,окей ?', 1681062426),
(679, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1681062460),
(680, 7, '95.31.181.2', 3, 'Использует меню телепортов', 1681062622),
(681, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681062629),
(682, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681062710),
(683, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681062875),
(684, 7, '95.31.181.2', 1, 'кста я думаю у инкосации надо поменять цвет авто', 1681063013),
(685, 7, '95.31.181.2', 1, 'выдай пожалуйста 99 доната', 1681063426),
(686, 1, '37.212.39.201', 10, 'Выдал Nikita_Stegiv[acc:7] 100 руб доната', 1681063448),
(687, 1, '37.212.39.201', 10, 'Выдал Sander_Kligan[acc:1] 100 руб доната', 1681063455),
(688, 7, '95.31.181.2', 1, 'я через 10  мин вернусь', 1681063499),
(689, 1, '37.212.39.201', 1, 'сто', 1681063506),
(690, 1, '37.212.39.201', 1, 'стой', 1681063515),
(691, 1, '37.212.39.201', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681063524),
(692, 1, '37.212.39.201', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681063530),
(693, 1, '37.212.39.201', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681063536),
(694, 1, '37.212.39.201', 5, 'Взял временное лидерство Воинская часть[2]', 1681063585),
(695, 1, '37.212.39.201', 9, 'Принял Nikita_Stegiv[acc:7] в организацию Воинская часть', 1681063594),
(696, 7, '95.31.181.2', 9, 'Покинул организацию Воинская часть по собственному желанию', 1681063617),
(697, 1, '37.212.39.201', 3, 'Подбросил Sander_Kligan[acc:1]', 1681063711),
(698, 7, '95.31.181.2', 3, 'Выдал Nikita_Stegiv[acc:7] скин 1', 1681065125),
(699, 7, '95.31.181.2', 3, 'Выдал Nikita_Stegiv[acc:7] скин 228', 1681065142),
(700, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1681065193),
(701, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065201),
(702, 2, '188.163.34.236', 3, 'Смотрит список администрации', 1681065224),
(703, 7, '95.31.181.2', 3, 'Смотрит статистику Kizary_Cappone[acc:2]', 1681065229),
(704, 2, '188.163.34.236', 5, 'Взял временное лидерство Правительство области[1]', 1681065254),
(705, 2, '188.163.34.236', 3, 'Создал транспорт (510, 1, 1)', 1681065261),
(706, 2, '188.163.34.236', 3, 'Включил прослушку SMS', 1681065287),
(707, 7, '95.31.181.2', 5, 'Взял временное лидерство Городская больница[3]', 1681065294),
(708, 7, '95.31.181.2', 5, 'Взял временное лидерство Правительство области[1]', 1681065296),
(709, 2, '188.163.34.236', 3, 'Включил Fly-режим', 1681065303),
(710, 7, '95.31.181.2', 3, 'Включил Fly-режим', 1681065309),
(711, 2, '188.163.34.236', 3, 'Выключил Fly-режим', 1681065313),
(712, 7, '95.31.181.2', 3, 'Выключил Fly-режим', 1681065315),
(713, 7, '95.31.181.2', 3, 'Включил Fly-режим', 1681065321),
(714, 7, '95.31.181.2', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681065335),
(715, 7, '95.31.181.2', 3, 'Выключил Fly-режим', 1681065344),
(716, 2, '188.163.34.236', 1, 'шо  ты много багов нашел?', 1681065348),
(717, 7, '95.31.181.2', 1, 'ага', 1681065355),
(718, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065362),
(719, 2, '188.163.34.236', 1, 'покажи все я артему передам', 1681065364),
(720, 2, '188.163.34.236', 3, 'Телепортировал к себе Nikita_Stegiv[acc:7]', 1681065374),
(721, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065374),
(722, 7, '95.31.181.2', 9, 'Покинул организацию Правительство области по собственному желанию', 1681065388),
(723, 2, '188.163.34.236', 1, '?', 1681065396),
(724, 7, '95.31.181.2', 1, 'прими на лицензира', 1681065440),
(725, 7, '95.31.181.2', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681065443),
(726, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065447),
(727, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065463),
(728, 7, '95.31.181.2', 1, 'прими на лицензира', 1681065468),
(729, 2, '188.163.34.236', 1, 'артем я баг нашел', 1681065483),
(730, 7, '95.31.181.2', 1, 'ага', 1681065488),
(731, 2, '188.163.34.236', 5, 'Взял временное лидерство Правительство области[1]', 1681065493),
(732, 1, '176.60.184.57', 1, '?', 1681065494),
(733, 2, '188.163.34.236', 9, 'Принял Nikita_Stegiv[acc:7] в организацию Правительство области', 1681065498),
(734, 2, '188.163.34.236', 1, 'тп покажу', 1681065499),
(735, 1, '176.60.184.57', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065515),
(736, 2, '188.163.34.236', 9, 'Повысил Nikita_Stegiv[acc:0] до 2 (Охранник)', 1681065518),
(737, 2, '188.163.34.236', 9, 'Повысил Nikita_Stegiv[acc:0] до 3 (Начальник Охраны)', 1681065519),
(738, 2, '188.163.34.236', 9, 'Повысил Nikita_Stegiv[acc:0] до 4 (Секретарь)', 1681065520),
(739, 2, '188.163.34.236', 9, 'Повысил Nikita_Stegiv[acc:0] до 5 (Советник)', 1681065520),
(740, 2, '188.163.34.236', 9, 'Повысил Nikita_Stegiv[acc:0] до 6 (Лицензер)', 1681065523),
(741, 7, '95.31.181.2', 1, 'это анти-епп, хахаха', 1681065575),
(742, 7, '95.31.181.2', 1, 'ты не понимаешь', 1681065588),
(743, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065593),
(744, 2, '188.163.34.236', 1, '?', 1681065593),
(745, 7, '95.31.181.2', 1, 'это анти-епп, хахаха', 1681065600),
(746, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681065656),
(747, 7, '95.31.181.2', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681065677),
(748, 7, '95.31.181.2', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681065696),
(749, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681065698),
(750, 7, '95.31.181.2', 3, 'Телепортировался к Sander_Kligan[acc:1]', 1681065701),
(751, 7, '95.31.181.2', 1, 'помоги', 1681065730),
(752, 2, '188.163.34.236', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681065735),
(753, 7, '95.31.181.2', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681065754),
(754, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681065780),
(755, 7, '95.31.181.2', 9, 'Покинул организацию Правительство области по собственному желанию', 1681065998),
(756, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681066016),
(757, 7, '95.31.181.2', 3, 'Смотрит список администрации', 1681066082),
(758, 7, '95.31.181.2', 1, 'баг', 1681066217),
(759, 7, '95.31.181.2', 3, 'Телепортировался к Kizary_Cappone[acc:2]', 1681066226),
(760, 7, '95.31.181.2', 5, 'Взял временное лидерство ФСБ[7]', 1681070331),
(761, 7, '95.31.181.2', 3, 'Создал транспорт (416, 6, 1)', 1681070426),
(762, 7, '95.31.181.2', 3, 'Создал транспорт (451, 1, 1)', 1681070448),
(763, 7, '95.31.181.2', 3, 'Создал транспорт (491, 1, 1)', 1681070465),
(764, 7, '95.31.181.2', 1, 'Колонки молчат', 1681070836),
(765, 7, '95.31.181.2', 3, 'Посадил в тюрьму Nikita_Stegiv[acc:7] на 60 мин. Причина: DM', 1681070861),
(766, 7, '95.31.181.2', 3, 'Выпустил из тюрьмы Nikita_Stegiv[acc:7]', 1681070887),
(767, 7, '95.31.181.2', 3, 'Посадил в тюрьму Nikita_Stegiv[acc:7] на 60 мин. Причина: DriveBy', 1681070893),
(768, 7, '95.31.181.2', 3, 'Выпустил из тюрьмы Nikita_Stegiv[acc:7]', 1681071331),
(769, 7, '95.31.181.2', 5, 'Взял временное лидерство Воинская часть[2]', 1681071368),
(770, 7, '95.31.181.2', 3, 'Создал транспорт (420, 6, 6)', 1681100634),
(771, 4, '2.75.27.113', 3, 'Создал транспорт (446, 5, 5)', 1681103743),
(772, 4, '2.75.27.113', 3, 'Зареспавнил авто №1', 1681103823),
(773, 4, '2.75.27.113', 3, 'Зареспавнил авто №2', 1681103828),
(774, 4, '2.75.27.113', 3, 'Зареспавнил авто №3', 1681103833),
(775, 4, '2.75.27.113', 3, 'Зареспавнил авто №4', 1681103836),
(776, 4, '2.75.27.113', 3, 'Зареспавнил авто №5', 1681103839),
(777, 4, '2.75.27.113', 3, 'Зареспавнил авто №6', 1681103844),
(778, 4, '2.75.27.113', 3, 'Зареспавнил авто №7', 1681103847),
(779, 4, '2.75.27.113', 3, 'Зареспавнил авто №8', 1681103852),
(780, 4, '2.75.27.113', 3, 'Зареспавнил авто №9', 1681103854),
(781, 4, '2.75.27.113', 3, 'Зареспавнил авто №10', 1681103860),
(782, 4, '2.75.27.113', 3, 'Зареспавнил авто №11', 1681103867),
(783, 4, '2.75.27.113', 3, 'Зареспавнил авто №12', 1681103877),
(784, 4, '2.75.27.113', 3, 'Зареспавнил авто №13', 1681103880),
(785, 4, '2.75.27.113', 3, 'Зареспавнил авто №14', 1681103883),
(786, 4, '2.75.27.113', 3, 'Зареспавнил авто №15', 1681103886),
(787, 4, '2.75.27.113', 3, 'Зареспавнил авто №16', 1681103887),
(788, 4, '2.75.27.113', 3, 'Зареспавнил авто №17', 1681103890),
(789, 4, '2.75.27.113', 3, 'Зареспавнил авто №18', 1681103894),
(790, 4, '2.75.27.113', 3, 'Зареспавнил авто №19', 1681103901),
(791, 4, '2.75.27.113', 3, 'Зареспавнил авто №20', 1681103904),
(792, 4, '2.75.27.113', 3, 'Зареспавнил авто №21', 1681103905),
(793, 4, '2.75.27.113', 3, 'Зареспавнил авто №22', 1681103908),
(794, 4, '2.75.27.113', 3, 'Зареспавнил авто №23', 1681103909),
(795, 4, '2.75.27.113', 3, 'Зареспавнил авто №24', 1681103912),
(796, 4, '2.75.27.113', 3, 'Зареспавнил авто №25', 1681103914),
(797, 4, '2.75.27.113', 3, 'Зареспавнил авто №26', 1681103917),
(798, 4, '2.75.27.113', 3, 'Зареспавнил авто №27', 1681103919),
(799, 4, '2.75.27.113', 3, 'Зареспавнил авто №28', 1681103923),
(800, 4, '2.75.27.113', 3, 'Зареспавнил авто №29', 1681103925),
(801, 4, '2.75.27.113', 3, 'Зареспавнил авто №30', 1681103929),
(802, 4, '2.75.27.113', 3, 'Зареспавнил авто №31', 1681103933),
(803, 4, '2.75.27.113', 3, 'Зареспавнил авто №32', 1681103936),
(804, 4, '2.75.27.113', 3, 'Зареспавнил авто №33', 1681103938),
(805, 4, '2.75.27.113', 3, 'Зареспавнил авто №34', 1681103940),
(806, 4, '2.75.27.113', 3, 'Зареспавнил авто №35', 1681103943),
(807, 4, '2.75.27.113', 3, 'Зареспавнил авто №36', 1681103946),
(808, 4, '2.75.27.113', 3, 'Зареспавнил авто №37', 1681103951),
(809, 4, '2.75.27.113', 3, 'Зареспавнил авто №38', 1681103953),
(810, 4, '2.75.27.113', 3, 'Зареспавнил авто №39', 1681103956),
(811, 4, '2.75.27.113', 3, 'Создал транспорт (449, 5, 5)', 1681103986),
(812, 4, '2.75.27.113', 3, 'Создал транспорт (476, 5, 5)', 1681105168),
(813, 4, '2.75.27.113', 3, 'Создал транспорт (462, 5, 5)', 1681105292),
(814, 4, '2.75.27.113', 3, 'Создал транспорт (437, 5, 5)', 1681105349),
(815, 4, '2.75.27.113', 3, 'Зареспавнил авто №20', 1681105382),
(816, 4, '2.75.27.113', 3, 'Зареспавнил авто №21', 1681105385),
(817, 4, '2.75.27.113', 3, 'Зареспавнил авто №30', 1681105389),
(818, 4, '2.75.27.113', 3, 'Зареспавнил авто №35', 1681105393),
(819, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681105397),
(820, 4, '2.75.27.113', 3, 'Зареспавнил авто №4', 1681105403),
(821, 4, '2.75.27.113', 3, 'Зареспавнил авто №4', 1681105409),
(822, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681105431),
(823, 4, '2.75.27.113', 3, 'Создал транспорт (426, 5, 5)', 1681105450),
(824, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681105530),
(825, 4, '2.75.27.113', 3, 'Создал транспорт (476, 5, 5)', 1681105556),
(826, 4, '2.75.27.113', 3, 'Создал транспорт (443, 5, 5)', 1681105637),
(827, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681105646),
(828, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681105649),
(829, 4, '2.75.27.113', 3, 'Создал транспорт (579, 5, 5)', 1681105674),
(830, 7, '83.220.237.195', 3, 'Создал транспорт (520, 1, 1)', 1681106273),
(831, 7, '83.220.237.195', 3, 'Создал транспорт (525, 6, 6)', 1681106294),
(832, 7, '83.220.237.195', 3, 'Создал транспорт (525, 6, 6)', 1681106302),
(833, 4, '2.75.27.113', 3, 'Создал транспорт (543, 5, 5)', 1681108371),
(834, 4, '2.75.27.113', 3, 'Создал транспорт (444, 5, 5)', 1681108478),
(835, 4, '2.75.27.113', 3, 'Зареспавнил авто №4', 1681108720),
(836, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681108722),
(837, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681108724),
(838, 4, '2.75.27.113', 3, 'Создал транспорт (411, 5, 5)', 1681108736),
(839, 4, '2.75.27.113', 3, 'Создал транспорт (531, 5, 5)', 1681109130),
(840, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109143),
(841, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681109148),
(842, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109155),
(843, 4, '2.75.27.113', 3, 'Создал транспорт (522, 5, 5)', 1681109158),
(844, 7, '83.220.237.195', 3, 'Создал транспорт (520, 6, 1)', 1681109167),
(845, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109190),
(846, 7, '83.220.237.195', 3, 'Создал транспорт (414, 6, 6)', 1681109211),
(847, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №42', 1681109348),
(848, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №43', 1681109351),
(849, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №43', 1681109353),
(850, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109364),
(851, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №43', 1681109367),
(852, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №43', 1681109372),
(853, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109375),
(854, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109381),
(855, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109385),
(856, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109390),
(857, 7, '83.220.237.195', 3, 'Телепортировался к Difsan_Shedrin[acc:4]', 1681109405),
(858, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №43', 1681109414),
(859, 4, '2.75.27.113', 3, 'Создал транспорт (514, 5, 5)', 1681109493),
(860, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109501),
(861, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681109504),
(862, 4, '2.75.27.113', 3, 'Зареспавнил авто №42', 1681109505),
(863, 7, '83.220.237.195', 5, 'Взял временное лидерство Воинская часть[2]', 1681109508),
(864, 4, '2.75.27.113', 3, 'Зареспавнил авто №43', 1681109509),
(865, 4, '2.75.27.113', 3, 'Зареспавнил авто №44', 1681109513),
(866, 4, '2.75.27.113', 3, 'Создал транспорт (523, 5, 5)', 1681109523),
(867, 4, '2.75.27.113', 3, 'Создал транспорт (532, 5, 5)', 1681109573),
(868, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №41', 1681109587),
(869, 4, '2.75.27.113', 3, 'Создал транспорт (543, 5, 5)', 1681109590),
(870, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №42', 1681109594),
(871, 7, '83.220.237.195', 1, 'стой', 1681109629),
(872, 4, '2.75.27.113', 3, 'Зареспавнил авто №42', 1681109631),
(873, 4, '2.75.27.113', 3, 'Создал транспорт (555, 5, 5)', 1681109649),
(874, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №39', 1681109692),
(875, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №40', 1681109697),
(876, 7, '83.220.237.195', 3, 'Телепортировался к себе авто №42', 1681109700),
(877, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109713),
(878, 7, '83.220.237.195', 3, 'Зареспавнил авто №39', 1681109722),
(879, 7, '83.220.237.195', 3, 'Зареспавнил авто №41', 1681109727),
(880, 7, '83.220.237.195', 3, 'Зареспавнил авто №42', 1681109730),
(881, 7, '83.220.237.195', 3, 'Зареспавнил авто №43', 1681109736),
(882, 4, '2.75.27.113', 3, 'Создал транспорт (563, 5, 5)', 1681109746),
(883, 4, '2.75.27.113', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681109762),
(884, 4, '2.75.27.113', 3, 'Создал транспорт (465, 5, 5)', 1681109768),
(885, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109802),
(886, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681109805),
(887, 4, '2.75.27.113', 3, 'Создал транспорт (564, 5, 5)', 1681109813),
(888, 4, '2.75.27.113', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681109822),
(889, 4, '2.75.27.113', 3, 'Создал транспорт (564, 5, 5)', 1681109835),
(890, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109846),
(891, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681109847),
(892, 4, '2.75.27.113', 3, 'Зареспавнил авто №42', 1681109849),
(893, 4, '2.75.27.113', 3, 'Зареспавнил авто №43', 1681109850),
(894, 4, '2.75.27.113', 3, 'Телепортировался к Nikita_Stegiv[acc:7]', 1681109858),
(895, 4, '2.75.27.113', 3, 'Создал транспорт (564, 5, 5)', 1681109894),
(896, 4, '2.75.27.113', 3, 'Создал транспорт (546, 5, 5)', 1681109960),
(897, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109969),
(898, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681109971),
(899, 4, '2.75.27.113', 3, 'Зареспавнил авто №42', 1681109974),
(900, 4, '2.75.27.113', 3, 'Зареспавнил авто №43', 1681109976),
(901, 4, '2.75.27.113', 3, 'Зареспавнил авто №44', 1681109978),
(902, 4, '2.75.27.113', 3, 'Создал транспорт (473, 5, 5)', 1681109984),
(903, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681109993),
(904, 4, '2.75.27.113', 3, 'Создал транспорт (562, 5, 5)', 1681110001),
(905, 4, '2.75.27.113', 3, 'Создал транспорт (515, 5, 5)', 1681110047),
(906, 4, '2.75.27.113', 3, 'Создал транспорт (543, 5, 5)', 1681110054),
(907, 4, '2.75.27.113', 3, 'Зареспавнил авто №40', 1681110062),
(908, 4, '2.75.27.113', 3, 'Зареспавнил авто №41', 1681110065),
(909, 4, '2.75.27.113', 3, 'Зареспавнил авто №42', 1681110066),
(910, 4, '2.75.27.113', 3, 'Зареспавнил авто №43', 1681110068),
(911, 4, '2.75.27.113', 3, 'Зареспавнил авто №44', 1681110070),
(912, 4, '2.75.27.113', 3, 'Создал транспорт (584, 5, 5)', 1681110085),
(913, 4, '2.75.27.113', 3, 'Создал транспорт (577, 5, 5)', 1681110101),
(914, 7, '95.31.181.2', 5, 'Взял временное лидерство Отдел полиции №2 (УМВД)[6]', 1681125436),
(915, 7, '95.31.181.2', 5, 'Взял временное лидерство ФСБ[7]', 1681125453),
(916, 7, '95.31.181.2', 3, 'Зареспавнил авто №39', 1681125470),
(917, 7, '95.31.181.2', 3, 'Администратор очистил чат', 1681125611),
(918, 7, '95.31.181.2', 3, 'Создал транспорт (526, 1, 1)', 1681125802),
(919, 3, '95.153.161.193', 3, 'Создал транспорт (429, 0, 0)', 1681143896),
(920, 3, '95.153.161.193', 3, 'Подбросил Alex_Fentazi[acc:3]', 1681143999),
(921, 3, '95.153.161.193', 3, 'Включил Fly-режим', 1681144016),
(922, 3, '95.153.161.193', 3, 'Выключил Fly-режим', 1681144025),
(923, 3, '95.153.161.193', 10, 'Смотрит информацию об аккаунте alex_fentazi[acc:3]', 1681144064),
(924, 3, '95.153.161.193', 1, 'q', 1681144114),
(925, 3, '95.153.161.193', 3, 'Смотрит список администрации', 1681144121),
(926, 3, '95.153.161.193', 3, 'Создал транспорт (428, 0, 0)', 1681144138),
(927, 3, '95.153.161.193', 3, 'Создал транспорт (427, 0, 0)', 1681144157),
(928, 3, '95.153.161.193', 3, 'Создал транспорт (426, 0, 0)', 1681144167),
(929, 3, '95.153.161.193', 3, 'Создал транспорт (430, 0, 0)', 1681144179),
(930, 1, '37.212.39.201', 3, 'Установил Sander_Kligan[acc:1] уровень здоровья на 100', 1681147010),
(931, 1, '37.212.39.201', 3, 'Выдал Sander_Kligan[acc:1] скин 122', 1681147732),
(932, 1, '37.212.39.201', 3, 'Выдал Sander_Kligan[acc:1] скин 122', 1681147738),
(933, 1, '37.212.39.201', 3, 'Установил время 12:00 на сервере', 1681152609),
(934, 7, '91.193.176.192', 3, 'Создал транспорт (457, 6, 7)', 1681189031),
(935, 7, '91.193.176.192', 3, 'Телепортировался к себе авто №39', 1681192603),
(936, 7, '91.193.176.192', 3, 'Телепортировался к себе авто №39', 1681192609),
(937, 7, '91.193.176.192', 3, 'Подбросил Nikita_Stegiv[acc:7]', 1681192617),
(938, 7, '91.193.176.192', 3, 'Телепортировался к себе авто №39', 1681192620),
(939, 7, '91.193.176.192', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 100', 1681199565),
(940, 7, '91.193.176.192', 3, 'Создал транспорт (409, 1, 1)', 1681199860),
(941, 7, '91.193.176.192', 3, 'Создал транспорт (451, 1, 1)', 1681203787),
(942, 7, '91.193.176.192', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 50', 1681211063),
(943, 7, '91.193.176.192', 3, 'Установил Nikita_Stegiv[acc:7] уровень здоровья на 50', 1681211066),
(944, 7, '91.193.176.192', 3, 'Создал транспорт (409, 20, 21)', 1681211395),
(945, 7, '91.193.176.192', 5, 'Взял временное лидерство Правительство области[1]', 1681211438),
(946, 1, '37.212.39.201', 3, 'Установил Sander_Kligan[acc:1] уровень здоровья на 100', 1681240189),
(947, 1, '37.212.39.201', 3, 'Установил Sander_Kligan[acc:1] уровень здоровья на 100', 1681240190),
(948, 4, '5.76.95.25', 5, 'Взял временное лидерство ФСБ[7]', 1681303436),
(949, 4, '5.76.95.25', 3, 'Создал транспорт (411, 1, 2)', 1681303458),
(950, 4, '176.222.167.26', 5, 'Взял временное лидерство ФСБ[7]', 1681303780),
(951, 4, '176.222.167.26', 3, 'Администратор очистил чат', 1681304390),
(952, 5, '46.180.166.86', 3, 'Выдал Dany_Good[acc:5] блокировку чата на 1 мин. Причина: 2', 1681308802),
(953, 5, '46.180.166.86', 3, 'Снял блокировку чата у Dany_Good[acc:5]', 1681308816),
(954, 5, '46.180.166.86', 3, 'Смотрит список администрации', 1681308825),
(955, 5, '46.180.166.86', 3, 'Включил Fly-режим', 1681308833),
(956, 5, '46.180.166.86', 3, 'Выключил Fly-режим', 1681308843);

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts`
--

CREATE TABLE `bank_accounts` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `name` varchar(21) NOT NULL DEFAULT 'None',
  `balance` int(11) NOT NULL,
  `pin` varchar(9) NOT NULL DEFAULT '0000',
  `reg_time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `bank_accounts`
--

INSERT INTO `bank_accounts` (`id`, `uid`, `name`, `balance`, `pin`, `reg_time`) VALUES
(1, 1, 'testtop', 0, '0000', 1680755358),
(2, 4, 'понпон', 0, '0000', 1681048622),
(3, 5, 'Diftop', 5500, '0000', 1681048694),
(4, 7, 'NexSisPlay', 1000, '0000', 1681070229);

-- --------------------------------------------------------

--
-- Структура таблицы `bank_accounts_log`
--

CREATE TABLE `bank_accounts_log` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `description` varchar(64) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `bank_accounts_log`
--

INSERT INTO `bank_accounts_log` (`id`, `acc_id`, `uip`, `time`, `description`) VALUES
(1, 3, '46.180.166.86', 1681048711, '+ Пополнение на сумму 500 руб'),
(2, 3, '46.180.166.86', 1681048735, '+ Пополнение на сумму 5000 руб'),
(3, 4, '95.31.181.2', 1681070253, '+ Пополнение на сумму 1000 руб');

-- --------------------------------------------------------

--
-- Структура таблицы `ban_list`
--

CREATE TABLE `ban_list` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `time` int(11) NOT NULL,
  `ban_time` int(11) NOT NULL,
  `ip` varchar(16) NOT NULL,
  `description` varchar(32) NOT NULL,
  `admin` varchar(24) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `business`
--

CREATE TABLE `business` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(24) NOT NULL,
  `improvements` int(11) NOT NULL,
  `products` int(11) NOT NULL,
  `prod_price` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `interior` int(11) NOT NULL,
  `enter_price` int(11) NOT NULL,
  `enter_music` int(11) NOT NULL,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL,
  `eviction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `business`
--

INSERT INTO `business` (`id`, `owner_id`, `name`, `improvements`, `products`, `prod_price`, `balance`, `rent_time`, `price`, `rent_price`, `type`, `interior`, `enter_price`, `enter_music`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `eviction`) VALUES
(1, 0, '', 6, 0, 0, 33402400, 0, 1000000, 10000, 1, 0, 100, 0, 0, 171.947, 738.35, 12.752, 173.823, 737.331, 12.2488, 248.735, 0),
(2, 0, '', 6, 0, 0, 0, 0, 1000000, 10000, 1, 0, 1000, 4, 0, 60.0766, 396.429, 10.0043, 58.504, 397.444, 10.0043, 59.243, 0),
(3, 0, '', 1, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 777, 1, 0, 112.167, 476.68, 11.3836, 110.703, 474.769, 11.3836, 147.446, 0),
(4, 0, '', 6, 0, 0, 36560350, 0, 1000000, 10000, 1, 0, 100, 1, 0, 400.058, 965.637, 12.2467, 398.435, 966.38, 12.0023, 66.9036, 0),
(5, 0, '', 6, 0, 0, 33218900, 0, 1000000, 10000, 1, 0, 5000, 4, 0, -288.961, 955.923, 12.641, -288.66, 958.372, 12.3608, 0.675795, 0),
(6, 0, '', 0, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 222, 0, 0, 1867.87, 1383.13, 9.75565, 1869.58, 1382.87, 9.75565, 271.06, 0),
(7, 0, '', 6, 0, 0, 36610120, 0, 1000000, 10000, 1, 0, 5000, 0, 0, -310.214, 447.576, 13.1093, -313.346, 448.362, 12.764, 83.3864, 0),
(8, 0, '', 6, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 0, 0, 0, 101.818, 812.641, 12.0526, 102.391, 814.185, 12.0294, 336.361, 0),
(9, 0, '', 6, 0, 0, 33429380, 0, 1000000, 10000, 1, 0, 1000, 0, 0, 12.9781, 911.011, 12.1456, 15.0025, 909.071, 12.1446, 223.424, 0),
(10, 0, '', 6, 0, 0, 36276575, 0, 1000000, 10000, 1, 0, 5000, 0, 0, 300.335, 1784.18, 12.2164, 299.938, 1781.41, 12.0283, 175.695, 0),
(11, 0, '', 6, 0, 0, 33558850, 0, 1000000, 10000, 1, 0, 5000, 0, 0, 2260.83, -2106.94, 21.9609, 2258.81, -2106.68, 21.9609, 92.9546, 0),
(12, 0, '', 6, 0, 0, 36348280, 0, 1000000, 10000, 1, 0, 5000, 2, 0, -541.443, 1303.49, 20.8908, -541.018, 1305.45, 20.7349, 340.589, 0),
(13, 0, '', 6, 0, 0, 36632700, 0, 1000000, 10000, 1, 0, 5000, 3, 0, -346.027, 956.11, 12.641, -345.697, 958.087, 12.6123, 0.079129, 0),
(14, 0, '', 6, 0, 0, 33556392, 0, 1000000, 10000, 1, 0, 4999, 2, 0, 302.682, 1664.82, 11.9978, 304.155, 1665.28, 11.9978, 307.751, 0),
(15, 0, '', 0, 0, 0, 33483410, 0, 1000000, 10000, 1, 0, 2000, 0, 0, 2353.48, -749.338, 14.9546, 2351.78, -749.508, 14.5062, 185.481, 0),
(16, 0, '', 0, 0, 0, 1479980, 0, 1000000, 10000, 1, 0, 100, 0, 0, 203.583, 828.749, 13.3807, 202.873, 827.412, 12.9522, 163.695, 0),
(17, 0, '', 6, 0, 0, 51950000, 0, 1000000, 10000, 1, 0, 4999, 1, 0, 2554.66, -2206.4, 22.4537, 2554.58, -2204.34, 22.4537, 351.582, 0),
(18, 0, '', 6, 0, 0, 33578200, 0, 1000000, 10000, 1, 0, 5000, 0, 0, -2232.54, 224.344, 24.5139, -2232.67, 222.646, 24.5161, 173.907, 0),
(19, 0, '', 6, 0, 0, 33387840, 0, 1000000, 10000, 1, 0, 500, 0, 0, -2241.98, 224.805, 24.7783, -2242.55, 222.827, 24.5109, 173.613, 1),
(20, 0, '', 6, 0, 0, 33432658, 0, 1000000, 10000, 1, 0, 777, 0, 0, -359.958, 1025, 13.2453, -362.989, 1024.73, 13.2443, 94.9952, 0),
(21, 0, '', 6, 0, 0, 36594210, 0, 1000000, 10000, 1, 0, 20, 0, 0, 1950.08, 1905.8, 15.4875, 1952.25, 1906.03, 15.518, 269.783, 0),
(22, 0, '', 6, 0, 0, 51950000, 0, 5000000, 50000, 3, 2, 5000, 5, 0, 649.614, 654.42, 12.1855, 648.913, 652.386, 12.1395, 159.377, 0),
(23, 0, '', 6, 0, 0, 51950000, 0, 5000000, 50000, 4, 3, 100, 0, 0, 2450.39, -1903.5, 22.0114, 2453.14, -1903.42, 21.9839, 269.949, 0),
(24, 0, '', 6, 0, 0, 36681400, 0, 5000000, 50000, 5, 4, 0, 0, 0, 145.761, 673.122, 12.763, 144.949, 671.425, 12.7593, 159.2, 0),
(25, 0, '', 6, 0, 0, 644000, 0, 5000000, 50000, 5, 4, 4444, 4, 0, 253.786, 1055.1, 12.1645, 257.209, 1054.67, 12.1697, 262.488, 0),
(26, 0, '', 6, 0, 0, 34438600, 0, 5000000, 50000, 5, 4, 5000, 0, 0, 2260.83, -2099.92, 21.9609, 2258.88, -2099.99, 21.9609, 89.9466, 1),
(56, 0, '', 4, 0, 0, 0, 1683590400, 300000, 0, 1, 0, 1000, 0, 0, 1945.7, 2069.13, 16.1989, 1946.27, 2065.99, 15.7053, 193.853, 0),
(27, 0, '', 6, 0, 0, 33783400, 0, 5000000, 50000, 5, 4, 5000, 0, 0, 131.729, 662.958, 12.7598, 134.643, 661.798, 12.7598, 250.025, 0),
(28, 0, '', 6, 0, 0, 33689000, 0, 5000000, 50000, 5, 4, 5000, 5, 0, -2157.92, 115.127, 26.1419, -2155.03, 116.676, 26.3275, 291.534, 0),
(29, 0, '', 6, 0, 0, 51950000, 0, 5000000, 50000, 5, 4, 100, 0, 0, -2550.97, 2937.42, 38.1288, -2550.85, 2934.69, 37.634, 180.27, 0),
(30, 0, '', 0, 0, 0, 36646400, 0, 5000000, 50000, 5, 4, 100, 0, 0, 384.431, 931.001, 12.2302, 381.981, 931.703, 12.0023, 71.1223, 0),
(31, 0, '', 0, 0, 0, 51950000, 0, 5000000, 50000, 6, 5, 5000, 0, 0, -112.497, 986.783, 12.7591, -112.828, 984.11, 12.7591, 178.972, 0),
(32, 0, '', 0, 0, 0, 51950000, 0, 5000000, 50000, 6, 5, 5000, 0, 0, 2412.4, -1841.73, 22.9498, 2412.38, -1844.08, 21.961, 179.265, 0),
(33, 0, '', 0, 0, 0, 51950000, 0, 5000000, 50000, 6, 5, 0, 0, 0, 177.708, 491.215, 13.1466, 174.941, 493.417, 13.1466, 60.9921, 0),
(34, 0, '', 6, 0, 0, 51950000, 0, 5800000, 58000, 7, 6, 100, 0, 0, -2243.72, 263.255, 24.5391, -2243.12, 264.799, 24.5391, 348.489, 0),
(35, 0, '', 6, 0, 0, 51950000, 0, 10150000, 101500, 7, 6, 5000, 0, 0, 2494.82, -718.345, 12.3706, 2495.4, -721.815, 12.3315, 11.8428, 0),
(36, 0, '', 6, 0, 0, 51950000, 0, 6150000, 61500, 7, 6, 5000, 0, 0, 1410.89, 460.258, 13.163, 1409.58, 458.392, 13.163, 358.806, 0),
(37, 0, '', 6, 0, 0, 51950000, 0, 8200000, 82000, 7, 6, 4444, 4, 0, -20.4165, 2614.89, 11.9766, -17.4168, 2615, 11.9766, 146.915, 0),
(38, 7, '', 6, 411, 30, 491900, 1681603200, 12000000, 120000, 8, 7, 5000, 0, 0, 1333.49, 2372.6, 17.6642, 1333.63, 2368.66, 17.6642, 181.583, 0),
(39, 0, '', 0, 0, 0, 36570000, 0, 4620000, 46200, 9, 8, 5000, 0, 0, 380.035, 918.528, 12.0023, 378.57, 919.394, 12.0023, 65.5253, 0),
(57, 0, '', 0, 0, 0, 35912000, 0, 700000, 0, 5, 0, 4444, 0, 0, 1921.68, 2092.95, 16.1989, 1918.57, 2093.3, 15.7053, 85.5835, 0),
(58, 5, '', 6, 0, 200, 8700, 1683590400, 1000000, 0, 1, 0, 500, 2, 0, 1839.76, 2191.35, 15.5671, 1842.68, 2191.77, 15.6422, 270.86, 0),
(60, 0, '', 6, 0, 0, 15517520, 0, 1000000, 0, 1, 0, 4090, 0, 0, 256.405, 680.098, 12, 255.08, 677.186, 12, 148.226, 0),
(61, 0, '', 0, -25, 0, 250000, 0, 50000000, 0, 10, 9, 0, 0, 0, 1852.64, 2199.57, 15.9025, 1852.79, 2197.02, 15.9068, 172.541, 0),
(62, 0, '', 6, 0, 0, 33415450, 0, 5000000, 0, 1, 0, 5000, 0, 0, -502.044, 1272.12, 20.8908, -499.594, 1271.24, 20.7424, 61.7039, 0),
(63, 0, '', 6, 0, 0, 33546570, 0, 3000000, 0, 1, 0, 3500, 0, 0, -5.06985, 911.411, 12.002, -6.80267, 907.861, 12.002, 325.228, 0),
(65, 0, '', 6, 0, 0, 51950000, 0, 50000000, 0, 10, 0, 0, 0, 0, 367.578, 845.433, 12.1789, 0, 0, 0, 0, 0),
(64, 0, '', 6, 0, 0, 51950000, 0, 500000000, 0, 5, 0, 3000, 0, 0, -510.637, -1628.02, 40.8817, -505.794, -1628.36, 40.9692, 115.701, 0),
(66, 0, '', 0, 0, 0, 51950000, 0, 50000000, 0, 11, 0, 0, 0, 0, 219.359, 416.856, 11.5371, 223.043, 415.368, 11.2402, 67.0849, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `business_gps`
--

CREATE TABLE `business_gps` (
  `id` int(11) NOT NULL,
  `bid` int(11) NOT NULL,
  `pos` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `business_gps`
--

INSERT INTO `business_gps` (`id`, `bid`, `pos`, `time`) VALUES
(87, 43, 0, 1614078832),
(66, 33, 0, 1613794201),
(103, 41, 0, 1681048126),
(104, 38, 0, 1681060429);

-- --------------------------------------------------------

--
-- Структура таблицы `business_profit`
--

CREATE TABLE `business_profit` (
  `id` int(11) NOT NULL,
  `bid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL,
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `business_profit`
--

INSERT INTO `business_profit` (`id`, `bid`, `uid`, `uip`, `time`, `money`, `view`) VALUES
(1, 61, 1, '37.212.39.201', 1680932924, 250000, 0),
(2, 61, 1, '37.212.39.201', 1680932939, 150000, 0),
(3, 61, 1, '37.212.39.201', 1680932942, 100000, 0),
(4, 61, 1, '37.212.39.201', 1680932944, 70000, 0),
(5, 61, 1, '37.212.39.201', 1680932950, 90000, 0),
(6, 61, 1, '37.212.39.201', 1680932952, 100000, 0),
(7, 61, 1, '37.212.39.201', 1680932953, 70000, 0),
(8, 61, 1, '37.212.39.201', 1680932957, 25000, 0),
(9, 61, 1, '37.212.39.201', 1680932959, 70000, 0),
(10, 61, 1, '37.212.39.201', 1680932960, 50000, 0),
(11, 56, 1, '37.212.39.201', 1680967871, 150, 0),
(12, 56, 1, '37.212.39.201', 1680967898, 5000, 0),
(13, 58, 5, '46.180.166.86', 1681047941, 5000, 0),
(14, 58, 5, '46.180.166.86', 1681047958, 450, 0),
(15, 58, 5, '46.180.166.86', 1681047981, 400, 0),
(16, 58, 5, '46.180.166.86', 1681048220, 150, 1),
(17, 58, 5, '46.180.166.86', 1681048229, 2500, 1),
(18, 58, 5, '46.180.166.86', 1681048263, 200, 1),
(19, 58, 5, '46.180.166.86', 1681048296, 450, 1),
(20, 58, 4, '176.222.167.27', 1681048521, 5000, 1),
(21, 58, 5, '46.180.166.86', 1681049259, 400, 1),
(22, 58, 4, '176.222.167.27', 1681049488, 5000, 1),
(23, 58, 4, '176.222.167.27', 1681050948, 800, 1),
(24, 61, 4, '176.222.167.27', 1681052871, 150000, 0),
(25, 61, 4, '176.222.167.27', 1681052873, 100000, 0),
(26, 61, 4, '176.222.167.27', 1681052875, 70000, 0),
(27, 61, 4, '176.222.167.27', 1681052884, 90000, 0),
(28, 61, 4, '176.222.167.27', 1681052886, 100000, 0),
(29, 61, 4, '176.222.167.27', 1681052889, 70000, 0),
(30, 61, 4, '176.222.167.27', 1681052898, 25000, 0),
(31, 61, 4, '176.222.167.27', 1681052900, 70000, 0),
(32, 61, 4, '176.222.167.27', 1681052904, 50000, 0),
(33, 61, 4, '176.222.167.27', 1681052975, 250000, 0),
(34, 58, 7, '95.31.181.2', 1681060110, 200, 1),
(35, 58, 7, '95.31.181.2', 1681060126, 110, 1),
(36, 58, 7, '95.31.181.2', 1681060140, 5000, 1),
(37, 38, 5, '46.180.166.86', 1681060365, 5000, 1),
(38, 38, 5, '46.180.166.86', 1681060408, 150, 1),
(39, 38, 7, '95.31.181.2', 1681060452, 150, 1),
(40, 38, 7, '95.31.181.2', 1681070982, 150, 1),
(41, 38, 7, '95.31.181.2', 1681100829, 150, 1),
(42, 57, 7, '83.220.237.195', 1681102633, 80000, 0),
(43, 2, 7, '91.193.176.192', 1681188991, 150, 0),
(44, 25, 7, '91.193.176.192', 1681199682, 200000, 0),
(45, 38, 7, '91.193.176.192', 1681199877, 150, 1),
(46, 38, 7, '91.193.176.192', 1681211063, 150, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `car_obmen`
--

CREATE TABLE `car_obmen` (
  `car_1` int(11) NOT NULL DEFAULT 5,
  `car_2` int(11) NOT NULL DEFAULT 5,
  `car_3` int(11) NOT NULL DEFAULT 5,
  `car_4` int(11) NOT NULL DEFAULT 5,
  `car_5` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `car_obmen`
--

INSERT INTO `car_obmen` (`car_1`, `car_2`, `car_3`, `car_4`, `car_5`) VALUES
(5, 5, 5, 5, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `change_names`
--

CREATE TABLE `change_names` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(21) NOT NULL,
  `time` int(11) NOT NULL,
  `ip` varchar(16) NOT NULL DEFAULT '255.255.255.255'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `charity`
--

CREATE TABLE `charity` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `charity`
--

INSERT INTO `charity` (`id`, `uid`, `money`, `time`) VALUES
(1, 150, 100000, 1613044031),
(2, 131, 1000000000, 1613045505),
(3, 272, 50, 1613058578),
(4, 339, 100, 1613060795),
(5, 32, 10000000, 1613749239),
(6, 418, 100000, 1613810348),
(7, 23, 1, 1613823985),
(8, 121, 5000000, 1613836371),
(9, 121, 10000000, 1613836417),
(10, 376, 1000000, 1613848338),
(11, 376, 1000000, 1613848393),
(12, 376, 1000000, 1613848407),
(13, 376, 1000000, 1613848416),
(14, 376, 900000000, 1613849366),
(15, 376, 1000000000, 1613849428),
(16, 376, 1000000000, 1613849503),
(17, 376, 1000000000, 1613849540),
(18, 57, 50000000, 1613857659),
(19, 389, 1, 1613908036),
(20, 142, 10000, 1613911244),
(21, 111, 50000000, 1613920977),
(22, 437, 10000000, 1613935503),
(23, 276, 1, 1613938618),
(24, 548, 10000000, 1613948859),
(25, 851, 10000, 1613977620),
(26, 361, 6000, 1613995622),
(27, 749, 10000000, 1613997569),
(28, 682, 100000001, 1614007367),
(29, 75, 1000000000, 1614014839),
(30, 670, 100000000, 1614015711),
(31, 218, 100000, 1614081014),
(32, 1328, 50000000, 1614113112),
(33, 1302, 10000000, 1614146212),
(34, 1471, 100000000, 1614166375),
(35, 1311, 50000, 1614174011),
(36, 1311, 1000000, 1614174035),
(37, 1941, 100000000, 1614181196),
(38, 1950, 1000000, 1614182774),
(39, 1796, 5000, 1614192206),
(40, 2166, 1, 1614197141),
(41, 572, 50000000, 1614197664),
(42, 1303, 1, 1614205627),
(43, 2237, 5000000, 1614208109),
(44, 2237, 100000000, 1614208157),
(45, 2381, 500, 1614246318),
(46, 2381, 1000000, 1614246349),
(47, 2172, 2000000, 1614256689),
(48, 2172, 8, 1614278499),
(49, 2287, 500000, 1614349017),
(50, 2866, 1000000, 1614357795),
(51, 2077, 10, 1614376458),
(52, 2199, 160000000, 1614398261),
(53, 2934, 1, 1614411008),
(54, 2934, 1000000, 1614411028),
(55, 3042, 10000000, 1614417011),
(56, 95, 103, 1614425686),
(57, 2320, 1, 1614460454),
(58, 3124, 1000000, 1614466341),
(59, 363, 100000000, 1614477721),
(60, 58, 1000000, 1614489312),
(61, 58, 1000000, 1614489347),
(62, 58, 10000000, 1614489381),
(63, 58, 100000000, 1614489435),
(64, 1001, 1, 1614505291),
(65, 1001, 100000, 1614505303),
(66, 1001, 10000000, 1614505316),
(67, 1001, 10000000, 1614505331),
(68, 3345, 440000, 1614507955),
(69, 3301, 10000000, 1614508053),
(70, 3403, 1000000, 1614516118),
(71, 1923, 100000, 1614518841);

-- --------------------------------------------------------

--
-- Структура таблицы `debug`
--

CREATE TABLE `debug` (
  `id` int(11) NOT NULL,
  `text` varchar(256) NOT NULL,
  `date` varchar(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `donate_log`
--

CREATE TABLE `donate_log` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) CHARACTER SET utf8 NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `donate` int(11) NOT NULL,
  `description` varchar(64) CHARACTER SET utf8 NOT NULL DEFAULT 'None'
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `donate_log`
--

INSERT INTO `donate_log` (`id`, `uid`, `uip`, `time`, `donate`, `description`) VALUES
(1, 1, '85.140.92.95', 1657465189, 2, 'акция'),
(2, 1, '85.140.92.95', 1657465260, 2, 'акция'),
(3, 1, '85.140.92.95', 1657497660, 2, 'акция'),
(4, 1, '85.140.92.95', 1657533660, 2, 'акция'),
(5, 1, '85.140.92.95', 1657533675, 2, 'акция'),
(6, 1, '85.140.92.95', 1657533679, 2, 'акция'),
(7, 1, '37.212.39.105', 1680634860, 0, 'акция'),
(8, 2, '188.163.34.236', 1680760662, 1000, 'Выдача доната от админа Kizary_Cappone'),
(9, 2, '188.163.34.236', 1680760665, 1000, 'Выдача доната от админа Kizary_Cappone'),
(10, 2, '188.163.34.236', 1680760666, 1000, 'Выдача доната от админа Kizary_Cappone'),
(11, 2, '188.163.34.236', 1680760667, 1000, 'Выдача доната от админа Kizary_Cappone'),
(12, 2, '188.163.34.236', 1680760860, 0, 'акция'),
(13, 2, '188.163.34.236', 1680760873, -100, 'Покупка пакета лицензий'),
(14, 2, '188.163.34.236', 1680761084, -249, 'Смена номера телефона'),
(15, 1, '37.212.39.105', 1680807660, 0, 'акция'),
(16, 1, '37.212.39.201', 1680879660, 0, 'акция'),
(17, 1, '37.212.39.201', 1681038060, 0, 'акция'),
(18, 4, '176.222.167.27', 1681045260, 0, 'акция'),
(19, 5, '46.180.166.86', 1681045260, 0, 'акция'),
(20, 4, '176.222.167.27', 1681048860, 0, 'акция'),
(21, 5, '46.180.166.86', 1681048860, 0, 'акция'),
(22, 1, '37.212.39.201', 1681051502, -100, 'None'),
(23, 6, '195.211.216.154', 1681052460, 0, 'акция'),
(24, 4, '176.222.167.27', 1681052460, 0, 'акция'),
(25, 7, '95.31.181.2', 1681056060, 0, 'акция'),
(26, 5, '46.180.166.86', 1681059660, 0, 'акция'),
(27, 1, '37.212.39.201', 1681059660, 0, 'акция'),
(28, 7, '95.31.181.2', 1681063260, 0, 'акция'),
(29, 1, '37.212.39.201', 1681063260, 0, 'акция'),
(30, 7, '95.31.181.2', 1681063448, 100, 'Выдача доната от админа Sander_Kligan'),
(31, 7, '95.31.181.2', 1681063454, -99, 'Покупка слота для транспорта'),
(32, 1, '37.212.39.201', 1681063455, 100, 'Выдача доната от админа Sander_Kligan'),
(33, 1, '37.212.39.201', 1681063484, -100, 'Покупка пакета лицензий'),
(34, 4, '2.75.27.113', 1681110060, 0, 'акция'),
(35, 7, '91.193.176.192', 1681200060, 0, 'акция');

-- --------------------------------------------------------

--
-- Структура таблицы `donations`
--

CREATE TABLE `donations` (
  `id` int(11) NOT NULL,
  `acc_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `time` varchar(16) NOT NULL,
  `date` varchar(16) NOT NULL,
  `activated` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `entrances`
--

CREATE TABLE `entrances` (
  `id` int(11) NOT NULL,
  `floors` int(11) NOT NULL DEFAULT 2,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `entrances`
--

INSERT INTO `entrances` (`id`, `floors`, `pos_x`, `pos_y`, `pos_z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`) VALUES
(1, 2, -206.366, 1088.86, 12.3796, -208.692, 1088.88, 12.001, 92.0321),
(2, 2, -206.182, 1066.57, 12.3796, -209.008, 1066.7, 12.001, 85.9693),
(3, 2, -233.97, 1088.89, 12.3796, -236.59, 1089, 12.001, 86.0554),
(4, 2, -233.823, 1066.76, 12.3796, -236.6, 1066.77, 12.001, 93.4894),
(5, 2, 208.584, 1543.62, 12.1415, 210.681, 1543.23, 12, 258.441),
(6, 2, 215.227, 1577.16, 12.1359, 217.458, 1576.69, 12, 255.018),
(7, 2, 221.762, 1610.48, 12.1359, 224.114, 1610.06, 12, 260.391),
(8, 2, 276.996, 1544.6, 12.4547, 275.178, 1544.82, 12.3204, 81.5462),
(9, 2, 280.661, 1578.3, 12.4547, 278.794, 1578.4, 12.3204, 82.5096),
(10, 2, 284.298, 1612.4, 12.4547, 282.087, 1612.48, 12.3281, 84.5186),
(11, 2, 116.239, 903.97, 12.1778, 113.973, 904.706, 12, 67.9472),
(12, 2, 121.804, 919.435, 12.1778, 120.094, 920.067, 12, 68.284),
(13, 2, 121.804, 919.435, 12.1778, 120.094, 920.067, 12, 68.284),
(14, 2, 121.804, 919.435, 12.1778, 120.094, 920.067, 12, 68.284),
(15, 2, -293.359, 1029.92, 12.3796, -293.45, 1031.92, 12.1338, 357.257),
(16, 2, -271.129, 1029.77, 12.3796, -271.227, 1031.85, 12.1338, 359.929),
(17, 2, -222.309, 996.306, 12.3796, -222.276, 998.468, 12.001, 1.50558),
(18, 2, -244.601, 996.116, 12.3796, -244.597, 998.263, 12.001, 358.771),
(19, 2, -284.934, 1003.43, 12.3796, -284.936, 1005.8, 12.126, 1.43081),
(20, 2, -307.239, 1003.28, 12.3796, -307.282, 1005.29, 12.1338, 0),
(21, 2, -337.378, 1003.4, 12.1338, -337.347, 1005.21, 12.1338, 3.74481),
(22, 2, -359.588, 1003.29, 12.1338, -359.571, 1005.29, 12.1338, 0.342069),
(23, 2, -440.21, 996.475, 12.3796, -440.148, 998.643, 12.0842, 358.5),
(24, 2, -418.01, 996.221, 12.3796, -417.863, 998.654, 12.1416, 1.36802),
(25, 2, -179.345, 1066.68, 12.3796, -181.462, 1066.48, 12.001, 90.9827),
(26, 2, -179.345, 1088.97, 12.3796, -182.229, 1088.77, 12.001, 92.9487),
(27, 2, -179.344, 1038.63, 12.3796, -182.273, 1038.79, 12.001, 88.7893),
(28, 2, -179.486, 1016.41, 12.3796, -182.188, 1016.33, 12.001, 92.3221),
(29, 2, -183.44, 986.881, 12.3796, -183.168, 989.427, 12.001, 3.96131),
(30, 2, -205.569, 986.92, 12.3796, -205.645, 989.61, 12.001, 0.200768),
(31, 2, -2170.42, 129.625, 29.0623, -2168.4, 130.322, 29.0623, 291.64),
(32, 2, -2163.56, 112.12, 29.0623, -2161.59, 112.932, 29.0623, 292.422),
(33, 2, -2177.26, 147.085, 29.0623, -2175.31, 147.957, 29.0623, 293.52),
(34, 2, -2184.15, 164.668, 29.0623, -2182.24, 165.636, 29.0623, 289.602),
(35, 2, -2191.8, 184.197, 29.0623, -2189.77, 184.853, 29.0623, 292.58),
(36, 2, -2333.51, 275.676, 23.9369, -2330.17, 275.037, 23.9398, 257.665),
(37, 2, -2315.63, 307.423, 24.3226, -2312.13, 306.771, 24.3226, 261.239),
(38, 2, -2333.93, -129.574, 22.3804, -2332.25, -128.008, 22.0837, 319.377),
(39, 2, -2313.29, -147.343, 22.3804, -2311.28, -144.963, 22.2752, 320.134),
(40, 2, -2292.65, -165.115, 23.982, -2290.06, -162.262, 23.6853, 317.791),
(41, 2, -2272, -182.887, 23.982, -2270.19, -180.748, 23.6853, 321.54),
(42, 2, -2251.41, -200.46, 24.8179, -2250.44, -198.278, 24.404, 337.409),
(43, 2, -2226.71, -206.127, 24.982, -2226.3, -204.218, 24.6853, 348.376),
(44, 2, -2200.04, -211.315, 24.982, -2199.61, -209.41, 24.6853, 347.436),
(45, 2, -2173.2, -216.529, 24.982, -2172.79, -214.718, 24.6853, 351.196),
(46, 2, -2153.6, -201.608, 26.1929, -2155.42, -201.164, 25.8884, 82.33);

-- --------------------------------------------------------

--
-- Структура таблицы `family`
--

CREATE TABLE `family` (
  `id` int(11) NOT NULL,
  `name` varchar(64) CHARACTER SET utf8 NOT NULL,
  `u_id` int(11) NOT NULL,
  `time` int(11) NOT NULL,
  `color` int(11) NOT NULL,
  `level` int(11) NOT NULL,
  `exp` int(11) NOT NULL,
  `rank1` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank2` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank3` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank4` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank5` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank6` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank7` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank8` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank9` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `rank10` varchar(32) CHARACTER SET utf8 NOT NULL DEFAULT 'Пусто',
  `money` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `tree` int(11) NOT NULL,
  `metal` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `house_id` int(11) NOT NULL DEFAULT -1,
  `score` int(11) NOT NULL,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `pos_fa` float NOT NULL,
  `inter` float NOT NULL,
  `world` float NOT NULL,
  `r_TakeMoney` int(11) NOT NULL,
  `r_TakeDrugs` int(11) NOT NULL,
  `r_TakeMetall` int(11) NOT NULL,
  `r_TakeAmmo` int(11) NOT NULL,
  `r_Inv` int(11) NOT NULL,
  `r_UnInv` int(11) NOT NULL,
  `r_Mute` int(11) NOT NULL,
  `r_UnMute` int(11) NOT NULL,
  `r_Warn` int(11) NOT NULL,
  `r_UnWarn` int(11) NOT NULL,
  `r_GiveRang` int(11) NOT NULL,
  `family_cars` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Структура таблицы `family_cars`
--

CREATE TABLE `family_cars` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `color_1` int(11) NOT NULL,
  `color_2` int(11) NOT NULL,
  `rang` int(11) NOT NULL,
  `pos_x` int(11) NOT NULL,
  `pos_y` int(11) NOT NULL,
  `pos_z` int(11) NOT NULL,
  `angle` int(11) NOT NULL,
  `fuel` int(11) NOT NULL DEFAULT 50,
  `create_time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `fuel_stations`
--

CREATE TABLE `fuel_stations` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL DEFAULT 'None',
  `improvements` int(11) NOT NULL,
  `fuels` int(11) NOT NULL,
  `fuel_price` int(11) NOT NULL,
  `buy_fuel_price` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `eviction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `fuel_stations`
--

INSERT INTO `fuel_stations` (`id`, `owner_id`, `name`, `improvements`, `fuels`, `fuel_price`, `buy_fuel_price`, `balance`, `rent_time`, `price`, `rent_price`, `lock`, `x`, `y`, `z`, `eviction`) VALUES
(11, 0, 'Заправочная станция', 4, 1000, 3, 10, 10034575, 0, 90000000, 9000, 0, 2877.87, 541.919, 26.3542, 0),
(10, 0, 'Заправочная станция', 0, 1000, 3, 0, 11523225, 0, 90000000, 9000, 0, 2674.46, 2616.66, 16.9724, 0),
(9, 0, 'Заправочная станция', 0, 1000, 3, 0, 28860735, 0, 100000000, 10000, 0, 2245.21, -1784.98, 21.7109, 0),
(8, 0, 'Заправочная станция', 4, 1000, 3, 10, 66322550, 0, 90000000, 9000, 0, 2368.07, -766.732, 14.0431, 0),
(7, 0, 'Заправочная станция', 4, 1000, 3, 0, 9697210, 0, 90000000, 9000, 0, -890.503, 1486.84, 27.4242, 0),
(14, 0, 'None', 4, 1000, 3, 0, 58078200, 0, 1000000, 10000, 0, -537.518, 1315.61, 20.7424, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `fuel_stations_profit`
--

CREATE TABLE `fuel_stations_profit` (
  `id` int(11) NOT NULL,
  `fid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL,
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `view` int(11) NOT NULL DEFAULT 1
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `full_dostup`
--

CREATE TABLE `full_dostup` (
  `id` int(11) NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `gang_repositories`
--

CREATE TABLE `gang_repositories` (
  `id` int(11) NOT NULL,
  `metall` int(11) NOT NULL,
  `ammo` int(11) NOT NULL,
  `drugs` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `lock` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `gang_repositories`
--

INSERT INTO `gang_repositories` (`id`, `metall`, `ammo`, `drugs`, `money`, `lock`) VALUES
(1, 2000, 10000, 500, 20000, 1),
(2, 2000, 10000, 500, 20000, 1),
(3, 2000, 10000, 500, 20000, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `gang_zones`
--

CREATE TABLE `gang_zones` (
  `id` int(11) NOT NULL,
  `min_x` float NOT NULL,
  `min_y` float NOT NULL,
  `max_x` float NOT NULL,
  `max_y` float NOT NULL,
  `fraction` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `gang_zones`
--

INSERT INTO `gang_zones` (`id`, `min_x`, `min_y`, `max_x`, `max_y`, `fraction`) VALUES
(1, -2667, 149, -2567, 249, 3),
(2, -2567, 149, -2467, 249, 3),
(3, -2467, 149, -2367, 249, 3),
(4, -2367, 149, -2267, 249, 3),
(5, -2267, 149, -2167, 249, 3),
(6, -2167, 149, -2067, 249, 3),
(7, -2167, 49, -2067, 149, 3),
(8, -2267, 49, -2167, 149, 3),
(9, -2367, 49, -2267, 149, 3),
(10, -2467, 49, -2367, 149, 3),
(11, -2567, 49, -2467, 149, 3),
(12, -2667, 49, -2567, 149, 3),
(13, -2667, -51, -2567, 49, 3),
(14, -2567, -51, -2467, 49, 3),
(15, -2467, -51, -2367, 49, 3),
(16, -2367, -51, -2267, 49, 3),
(17, -2267, -51, -2167, 49, 3),
(18, -2167, -51, -2067, 49, 3),
(19, -2167, -151, -2067, -51, 3),
(20, -2267, -151, -2167, -51, 3),
(21, -2367, -151, -2267, -51, 3),
(22, -2467, -151, -2367, -51, 3),
(23, -2567, -151, -2467, -51, 3),
(24, -2667, -151, -2567, -51, 3),
(25, -2667, -251, -2567, -151, 3),
(26, -2567, -251, -2467, -151, 3),
(27, -2467, -251, -2367, -151, 3),
(28, -2367, -251, -2267, -151, 3),
(29, -2267, -251, -2167, -151, 3),
(30, -2167, -251, -2067, -151, 1),
(31, 1974, 2007, 2074, 2107, 1),
(32, 1874, 2007, 1974, 2107, 1),
(33, 1774, 2007, 1874, 2107, 1),
(34, 1674, 2007, 1774, 2107, 1),
(35, 1574, 2007, 1674, 2107, 1),
(36, 1574, 2107, 1674, 2207, 2),
(37, 1674, 2107, 1774, 2207, 2),
(38, 1774, 2107, 1874, 2207, 2),
(39, 1874, 2107, 1974, 2207, 1),
(40, 1974, 2107, 2074, 2207, 1),
(41, 1974, 2207, 2074, 2307, 1),
(42, 1874, 2207, 1974, 2307, 1),
(43, 1774, 2207, 1874, 2307, 1),
(44, 1674, 2207, 1774, 2307, 1),
(45, 1574, 2207, 1674, 2307, 1),
(46, 1574, 2307, 1674, 2407, 1),
(47, 1674, 2307, 1774, 2407, 1),
(48, 1774, 2307, 1874, 2407, 1),
(49, 1874, 2307, 1974, 2407, 1),
(50, 1974, 2307, 2074, 2407, 1),
(51, 1974, 2407, 2074, 2507, 1),
(52, 1874, 2407, 1974, 2507, 1),
(53, 1774, 2407, 1874, 2507, 1),
(54, 1674, 2407, 1774, 2507, 1),
(55, 1574, 2407, 1674, 2507, 1),
(56, 1574, 2507, 1674, 2607, 1),
(57, 1674, 2507, 1774, 2607, 1),
(58, 1774, 2507, 1874, 2607, 3),
(59, 1874, 2507, 1974, 2607, 3),
(60, 1974, 2507, 2074, 2607, 2),
(61, 1751, -311, 1851, -211, 2),
(62, 1751, -411, 1851, -311, 3),
(63, 1651, -411, 1751, -311, 3),
(64, 1651, -311, 1751, -211, 1),
(65, 1551, -311, 1651, -211, 2),
(66, 1551, -411, 1651, -311, 2),
(67, 1451, -411, 1551, -311, 2),
(68, 1451, -311, 1551, -211, 3),
(69, 981, -265, 1081, -165, 3),
(70, 981, -365, 1081, -265, 0),
(71, 981, -465, 1081, -365, 3),
(72, 881, -465, 981, -365, 1),
(73, 881, -365, 981, -265, 1),
(74, 881, -265, 981, -165, 1),
(75, 781, -265, 881, -165, 1),
(76, 781, -365, 881, -265, 1),
(77, 781, -465, 881, -365, 0),
(78, 681, -465, 781, -365, 1),
(79, 681, -365, 781, -265, 1),
(80, 681, -265, 781, -165, 0),
(81, 581, -265, 681, -165, 3),
(82, 581, -365, 681, -265, 3),
(83, 581, -465, 681, -365, 3),
(84, 481, -465, 581, -365, 3),
(85, 481, -365, 581, -265, 3),
(86, 481, -265, 581, -165, 0),
(87, 381, -265, 481, -165, 0),
(88, 381, -365, 481, -265, 0),
(89, 381, -465, 481, -365, 3),
(90, 281, -365, 381, -265, 2),
(91, 2401, -330, 2501, -230, 2),
(92, 2501, -330, 2601, -230, 2),
(93, 2501, -230, 2601, -130, 2),
(94, 2501, -130, 2601, -30, 2),
(95, 2401, -230, 2501, -130, 2),
(96, 2401, -130, 2501, -30, 2),
(97, 2301, -230, 2401, -130, 2),
(98, 2601, -330, 2701, -230, 2),
(99, 2601, -230, 2701, -130, 3),
(100, 2201, -230, 2301, -130, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `gift`
--

CREATE TABLE `gift` (
  `id` int(16) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `gift`
--

INSERT INTO `gift` (`id`, `x`, `y`, `z`) VALUES
(7, -2480.86, 2827.01, 37.636),
(8, -2484.53, 2823.11, 37.636),
(9, -2491.47, 2824.58, 37.636),
(10, 2285.66, 2644.08, 20.231),
(11, -794.595, -458.9, 741.103),
(12, 724.995, 1443.39, 12.004),
(13, 1789.07, 2147.58, 16.072),
(14, 1789.55, 2090.84, 15.854),
(15, 615.115, 1723.72, 12.071),
(16, 548.536, 1685.86, 12.285),
(17, 1816.03, 2516.47, 15.664),
(18, 203.522, 1693.14, 12.003),
(19, -116.845, 933.761, 12.002),
(20, -410.271, 929.259, 12.118),
(21, 186.086, 819.896, 12.002),
(22, -899.961, 847.547, 12.671),
(23, 1334.67, 2369.56, 17.664),
(24, 1904.88, 2287.96, 15.711),
(25, 1920.47, 1721.52, 15.993),
(26, 1829.78, 1709.1, 16.253),
(27, 1797.74, 1610.69, 16.104),
(28, 1645.52, 1768.98, 16.01),
(29, 1624.2, 1703.22, 16.217),
(30, 1586.36, 1631.21, 16.003),
(31, 1513.19, 1660.9, 16.078),
(32, 1467.76, 1718.65, 17.253),
(33, 1530.12, 1802.63, 16.26),
(34, 1507.59, -2469.83, 45.975),
(35, 1725.69, -2419.32, 11),
(36, 1897.76, -2352.61, 11.213),
(37, 1911.71, -2239.65, 11.19),
(38, 1881.05, -2205.22, 11.25),
(39, 2512.17, -1926.74, 22.328),
(40, 1695.09, -2331.96, 11.008),
(41, 623.586, -1263.35, 40.734),
(42, -624.236, -1697.69, 39.997),
(43, -560.273, -1634.82, 40.916),
(44, -2177.25, -178.017, 25.891),
(45, -2445.9, 119.47, 18.39),
(46, -2572.52, -131.687, 13.931),
(47, -1810.74, 1539.52, 35.279),
(48, -339.556, 1493.82, 20.747),
(49, -284.951, 1455.17, 20.747),
(50, -245.685, 1392.52, 20.747),
(51, 165.758, 1613.34, 12.003),
(52, 770.015, 775.16, 12.085),
(53, 568.766, 385.019, 12.106),
(54, 691.163, 869.931, 12),
(55, -123.093, 617.269, 12.012),
(56, -180.595, 944.447, 12.002),
(57, 1969.79, 2428.41, 15.974),
(58, 1940.82, 2435.37, 16.619),
(59, 1924.09, 2427.08, 16.022),
(60, 1965.04, 2131.56, 15.943),
(61, 1938.2, 2029.33, 15.871),
(62, 2308.35, 1761.66, 0.895),
(63, -169.861, 847.918, 15.489);

-- --------------------------------------------------------

--
-- Структура таблицы `gift_lose`
--

CREATE TABLE `gift_lose` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `gift_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `gift_lose`
--

INSERT INTO `gift_lose` (`id`, `uid`, `gift_id`) VALUES
(25, 3, 1),
(26, 410, 1),
(27, 5, 1),
(28, 291, 1),
(29, 291, 2),
(30, 291, 3),
(31, 291, 4),
(32, 874, 4),
(33, 1068, 4),
(34, 680, 4),
(35, 291, 5),
(36, 1048, 4),
(37, 796, 4),
(38, 980, 4),
(39, 1048, 5),
(40, 1013, 4),
(41, 1071, 6),
(42, 291, 6),
(43, 670, 4),
(44, 1042, 4),
(45, 1065, 4),
(46, 275, 4),
(47, 1064, 6),
(48, 1055, 4),
(49, 291, 7),
(50, 291, 8),
(51, 291, 9),
(52, 589, 4),
(53, 874, 6),
(54, 291, 10),
(55, 291, 11),
(56, 781, 11),
(57, 342, 11),
(58, 28, 2),
(59, 704, 4),
(60, 1064, 4),
(61, 758, 4),
(62, 275, 6),
(63, 530, 4),
(64, 1048, 6),
(65, 874, 3),
(66, 589, 5),
(67, 874, 2),
(68, 28, 6),
(69, 218, 4),
(70, 636, 4),
(71, 275, 5),
(72, 57, 7),
(73, 636, 5),
(74, 1048, 2),
(75, 57, 4),
(76, 57, 5),
(77, 1071, 7),
(78, 291, 12),
(79, 589, 12),
(80, 530, 5),
(81, 1068, 6),
(82, 1065, 10),
(83, 1062, 4),
(84, 111, 4),
(85, 530, 7),
(86, 1071, 8),
(87, 636, 10),
(88, 530, 8),
(89, 874, 12),
(90, 530, 9),
(91, 704, 6),
(92, 874, 7),
(93, 670, 5),
(94, 796, 5),
(95, 291, 13),
(96, 186, 2),
(97, 57, 8),
(98, 28, 13),
(99, 874, 8),
(100, 670, 7),
(101, 796, 7),
(102, 1048, 13),
(103, 291, 14),
(104, 363, 10),
(105, 291, 15),
(106, 1062, 10),
(107, 670, 10),
(108, 796, 10),
(109, 1062, 8),
(110, 291, 16),
(111, 874, 9),
(112, 1062, 9),
(113, 874, 11),
(114, 291, 17),
(115, 636, 8),
(116, 275, 8),
(117, 291, 18),
(118, 1071, 13),
(119, 291, 19),
(120, 636, 9),
(121, 291, 20),
(122, 704, 8),
(123, 291, 21),
(124, 111, 10),
(125, 291, 23),
(126, 111, 8),
(127, 874, 10),
(128, 28, 14),
(129, 291, 24),
(130, 342, 4),
(131, 111, 9),
(132, 186, 5),
(133, 704, 5),
(134, 670, 9),
(135, 796, 9),
(136, 363, 9),
(137, 186, 4),
(138, 342, 5),
(139, 342, 10),
(140, 528, 6),
(141, 528, 13),
(142, 291, 25),
(143, 291, 26),
(144, 874, 20),
(145, 528, 2),
(146, 1048, 8),
(147, 874, 21),
(148, 437, 4),
(149, 1048, 9),
(150, 291, 27),
(151, 670, 8),
(152, 291, 28),
(153, 589, 28),
(154, 874, 17),
(155, 28, 15),
(156, 874, 22),
(157, 28, 16),
(158, 680, 28),
(159, 28, 19),
(160, 874, 15),
(161, 111, 7),
(162, 28, 20),
(163, 536, 10),
(164, 796, 8),
(165, 363, 8),
(166, 874, 16),
(167, 291, 29),
(168, 28, 21),
(169, 111, 5),
(170, 291, 30),
(171, 680, 26),
(172, 874, 19),
(173, 275, 7),
(174, 795, 2),
(175, 536, 4),
(176, 874, 18),
(177, 291, 31),
(178, 795, 13),
(179, 291, 33),
(180, 291, 34),
(181, 874, 14),
(182, 1048, 10),
(183, 363, 12),
(184, 28, 17),
(185, 796, 12),
(186, 46, 8),
(187, 680, 14),
(188, 795, 6),
(189, 680, 15),
(190, 28, 22),
(191, 46, 10),
(192, 680, 19),
(193, 536, 5),
(194, 796, 13),
(195, 363, 13),
(196, 680, 18),
(197, 275, 10),
(198, 1072, 6),
(199, 46, 9),
(200, 275, 13),
(201, 1048, 41),
(202, 363, 2),
(203, 680, 17),
(204, 670, 2),
(205, 796, 2),
(206, 28, 18),
(207, 680, 21),
(208, 275, 2),
(209, 46, 4),
(210, 363, 6),
(211, 796, 6),
(212, 275, 12),
(213, 363, 5),
(214, 291, 44),
(215, 186, 44),
(216, 1049, 44),
(217, 363, 4),
(218, 874, 40),
(219, 291, 45),
(220, 249, 8),
(221, 76, 44),
(222, 275, 15),
(223, 275, 18),
(224, 275, 19),
(225, 340, 44),
(226, 275, 16),
(227, 1055, 5),
(228, 275, 17),
(229, 340, 10),
(230, 76, 8),
(231, 186, 10),
(232, 275, 22),
(233, 46, 5),
(234, 76, 45),
(235, 340, 4),
(236, 76, 9),
(237, 465, 14),
(238, 275, 14),
(239, 69, 9),
(240, 589, 8),
(241, 69, 8),
(242, 874, 44),
(243, 111, 44),
(244, 69, 45),
(245, 69, 10),
(246, 69, 44),
(247, 896, 42),
(248, 670, 41),
(249, 796, 41),
(250, 680, 40),
(251, 680, 7),
(252, 363, 7),
(253, 437, 8),
(254, 680, 12),
(255, 186, 7),
(256, 186, 40),
(257, 111, 40),
(258, 437, 7),
(259, 680, 6),
(260, 69, 7),
(261, 69, 40),
(262, 680, 13),
(263, 186, 11),
(264, 28, 1),
(265, 111, 45),
(266, 680, 3),
(267, 1055, 9),
(268, 680, 2),
(269, 437, 6),
(270, 437, 13),
(271, 437, 2),
(272, 465, 45),
(273, 680, 10),
(274, 465, 8),
(275, 340, 9),
(276, 680, 8),
(277, 680, 45),
(278, 465, 39),
(279, 680, 9),
(280, 28, 10),
(281, 437, 10),
(282, 28, 44),
(283, 363, 42),
(284, 437, 45),
(285, 186, 45),
(286, 896, 11),
(287, 69, 6),
(288, 69, 13),
(289, 186, 37),
(290, 437, 37),
(291, 186, 38),
(292, 437, 38),
(293, 69, 2),
(294, 186, 39),
(295, 437, 39),
(296, 1065, 14),
(297, 69, 14),
(298, 69, 15),
(299, 1065, 15),
(300, 69, 17),
(301, 1065, 16),
(302, 69, 18),
(303, 1065, 17),
(304, 69, 19),
(305, 1065, 18),
(306, 69, 16),
(307, 437, 33),
(308, 186, 33),
(309, 1065, 6),
(310, 1065, 13),
(311, 69, 28),
(312, 1065, 2),
(313, 437, 44),
(314, 1065, 5),
(315, 874, 30),
(316, 874, 32),
(317, 531, 42),
(318, 874, 31),
(319, 1065, 8),
(320, 69, 26),
(321, 1065, 45),
(322, 1064, 10),
(323, 874, 33),
(324, 1064, 44),
(325, 874, 34),
(326, 28, 12),
(327, 531, 45),
(328, 531, 8),
(329, 1074, 8),
(330, 531, 10),
(331, 531, 13),
(332, 531, 6),
(333, 531, 3),
(334, 69, 5),
(335, 69, 4),
(336, 531, 5),
(337, 874, 45),
(338, 531, 4),
(339, 1076, 6),
(340, 1079, 6),
(341, 531, 39),
(342, 531, 37),
(343, 1077, 6),
(344, 531, 38),
(345, 1077, 4),
(346, 363, 38),
(347, 363, 39),
(348, 363, 44),
(349, 1075, 11),
(350, 1065, 12),
(351, 396, 7),
(352, 396, 4),
(353, 1080, 6),
(354, 1075, 38),
(355, 396, 10),
(356, 396, 8),
(357, 396, 45),
(358, 396, 9),
(359, 1080, 14),
(360, 1080, 15),
(361, 1080, 9),
(362, 1080, 44),
(363, 443, 11),
(364, 443, 9),
(365, 443, 8),
(366, 443, 45),
(367, 531, 9),
(368, 443, 10),
(369, 396, 39),
(370, 531, 43),
(371, 443, 5),
(372, 443, 4),
(373, 383, 27),
(374, 443, 44),
(375, 443, 1),
(376, 396, 11),
(377, 363, 41),
(378, 363, 16),
(379, 443, 39),
(380, 363, 15),
(381, 363, 19),
(382, 363, 18),
(383, 363, 21),
(384, 363, 17),
(385, 1083, 6),
(386, 363, 14),
(387, 1074, 12),
(388, 383, 6),
(389, 383, 14),
(390, 383, 15),
(391, 383, 17),
(392, 383, 18),
(393, 383, 21),
(394, 383, 20),
(395, 383, 22),
(396, 383, 10),
(397, 925, 8),
(398, 925, 45),
(399, 283, 10),
(400, 925, 14),
(401, 925, 15),
(402, 340, 15),
(403, 340, 14),
(404, 925, 16),
(405, 925, 19),
(406, 340, 18),
(407, 925, 18),
(408, 246, 8),
(409, 340, 20),
(410, 925, 20),
(411, 340, 19),
(412, 340, 16),
(413, 340, 17),
(414, 925, 10),
(415, 363, 26),
(416, 363, 27),
(417, 246, 45),
(418, 246, 10),
(419, 1085, 6),
(420, 1031, 4),
(421, 443, 20),
(422, 1085, 4),
(423, 443, 21),
(424, 340, 26),
(425, 246, 6),
(426, 1031, 5),
(427, 443, 18),
(428, 443, 17),
(429, 363, 33),
(430, 246, 5),
(431, 246, 4),
(432, 443, 15),
(433, 443, 16),
(434, 443, 14),
(435, 8, 4),
(436, 1031, 44),
(437, 1031, 8),
(438, 1031, 10),
(439, 1031, 6),
(440, 1031, 7),
(441, 1031, 40),
(442, 1031, 11),
(443, 925, 6),
(444, 1031, 13),
(445, 925, 12),
(446, 1031, 45),
(447, 925, 4),
(448, 340, 6),
(449, 743, 6),
(450, 743, 7),
(451, 743, 40),
(452, 576, 44),
(453, 743, 8),
(454, 743, 45),
(455, 743, 10),
(456, 119, 7),
(457, 576, 6),
(458, 199, 45),
(459, 199, 8),
(460, 119, 5),
(461, 743, 44),
(462, 1086, 6),
(463, 8, 8),
(464, 199, 4),
(465, 8, 10),
(466, 1014, 6),
(467, 363, 1),
(468, 410, 2),
(469, 410, 3),
(470, 410, 4),
(471, 410, 7),
(472, 329, 3),
(473, 329, 2),
(474, 329, 1),
(475, 972, 2),
(476, 972, 1),
(477, 972, 3),
(478, 833, 6),
(479, 261, 4),
(480, 261, 5),
(481, 833, 1),
(482, 833, 2),
(483, 833, 3),
(484, 32, 5),
(485, 1129, 6),
(486, 550, 5),
(487, 1140, 6),
(488, 1155, 7),
(489, 5, 2),
(490, 5, 3),
(491, 1021, 4),
(492, 75, 3),
(493, 75, 2),
(494, 75, 1),
(495, 75, 5),
(496, 75, 4),
(497, 75, 7),
(498, 1260, 4),
(499, 1187, 3),
(500, 1187, 2),
(501, 1187, 1),
(502, 516, 4),
(503, 1197, 4),
(504, 970, 6);

-- --------------------------------------------------------

--
-- Структура таблицы `hotels`
--

CREATE TABLE `hotels` (
  `id` int(11) NOT NULL,
  `hotel_id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `hotels`
--

INSERT INTO `hotels` (`id`, `hotel_id`, `owner_id`, `rent_time`, `status`) VALUES
(1, 0, 0, 0, 0),
(2, 0, 0, 0, 1),
(3, 0, 0, 0, 1),
(4, 0, 0, 0, 1),
(5, 0, 0, 0, 1),
(6, 0, 0, 0, 1),
(7, 0, 0, 0, 1),
(8, 0, 0, 0, 0),
(9, 0, 0, 0, 0),
(10, 0, 0, 0, 0),
(11, 0, 0, 0, 0),
(12, 0, 0, 0, 0),
(13, 0, 0, 0, 0),
(14, 0, 0, 0, 0),
(15, 0, 0, 0, 0),
(16, 0, 0, 0, 0),
(17, 0, 0, 0, 0),
(18, 0, 0, 0, 0),
(19, 0, 0, 0, 0),
(20, 0, 0, 0, 0),
(21, 0, 0, 0, 0),
(22, 0, 0, 0, 0),
(23, 0, 0, 0, 0),
(24, 0, 0, 0, 0),
(25, 0, 0, 0, 0),
(26, 0, 0, 0, 0),
(27, 0, 0, 0, 0),
(28, 0, 0, 0, 0),
(29, 0, 0, 0, 0),
(30, 0, 0, 0, 0),
(31, 0, 0, 0, 0),
(32, 0, 0, 0, 0),
(33, 0, 0, 0, 0),
(34, 0, 0, 0, 0),
(35, 0, 0, 0, 0),
(36, 0, 0, 0, 0),
(37, 0, 0, 0, 0),
(38, 0, 0, 0, 0),
(39, 0, 0, 0, 0),
(40, 0, 0, 0, 0),
(41, 0, 0, 0, 0),
(42, 0, 0, 0, 0),
(43, 0, 0, 0, 0),
(44, 0, 0, 0, 0),
(45, 0, 0, 0, 0),
(46, 0, 0, 0, 0),
(47, 0, 0, 0, 0),
(48, 0, 0, 0, 0),
(49, 0, 0, 0, 0),
(50, 0, 0, 0, 0),
(51, 0, 0, 0, 0),
(52, 0, 0, 0, 0),
(53, 0, 0, 0, 0),
(54, 0, 0, 0, 0),
(55, 0, 0, 0, 0),
(56, 0, 0, 0, 0),
(57, 0, 0, 0, 0),
(58, 0, 0, 0, 0),
(59, 0, 0, 0, 0),
(60, 0, 0, 0, 0),
(61, 0, 0, 0, 0),
(62, 0, 0, 0, 0),
(63, 0, 0, 0, 0),
(64, 0, 0, 0, 0),
(65, 0, 0, 0, 0),
(66, 0, 0, 0, 0),
(67, 0, 0, 0, 0),
(68, 0, 0, 0, 0),
(69, 0, 0, 0, 0),
(70, 0, 0, 0, 0),
(71, 0, 0, 0, 0),
(72, 0, 0, 0, 0),
(73, 0, 0, 0, 0),
(74, 0, 0, 0, 0),
(75, 0, 0, 0, 0),
(76, 0, 0, 0, 0),
(77, 0, 0, 0, 0),
(78, 0, 0, 0, 0),
(79, 0, 0, 0, 0),
(80, 0, 0, 0, 0),
(81, 0, 0, 0, 0),
(82, 0, 0, 0, 0),
(83, 0, 0, 0, 0),
(84, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `houses`
--

CREATE TABLE `houses` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `improvements` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `rent_price` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `entrance` int(11) NOT NULL DEFAULT -1,
  `lock` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `z` float NOT NULL,
  `exit_x` float NOT NULL,
  `exit_y` float NOT NULL,
  `exit_z` float NOT NULL,
  `exit_angle` float NOT NULL,
  `car_x` float NOT NULL,
  `car_y` float NOT NULL,
  `car_z` float NOT NULL,
  `car_angle` float NOT NULL,
  `store_x` float NOT NULL,
  `store_y` float NOT NULL,
  `store_z` float NOT NULL,
  `eviction` int(11) NOT NULL,
  `store_metall` int(11) NOT NULL,
  `store_drugs` int(11) NOT NULL,
  `store_weapon` int(11) NOT NULL,
  `store_ammo` int(11) NOT NULL,
  `store_skin` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `houses`
--

INSERT INTO `houses` (`id`, `owner_id`, `name`, `improvements`, `rent_time`, `price`, `rent_price`, `type`, `entrance`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `car_x`, `car_y`, `car_z`, `car_angle`, `store_x`, `store_y`, `store_z`, `eviction`, `store_metall`, `store_drugs`, `store_weapon`, `store_ammo`, `store_skin`) VALUES
(1, 0, '', 5, 0, 30000000, 7000, 6, -1, 0, -681.871, 909.614, 13.0814, -681.696, 906.357, 12.5611, 179.864, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(2, 0, '', 5, 0, 300000, 7000, 6, -1, 0, -722.573, 910.056, 13.1247, -722.972, 904.671, 12.5611, 174.177, -998.152, 746.812, 12.1348, 71.7873, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(3, 0, '', 0, 0, 5000000, 7000, 0, -1, 0, 1838.18, 1338.24, 9.75565, -744.82, 718.793, 11.8373, 357.014, 1833.38, 1326.51, 9.8282, 93.9606, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(4, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 1813.15, 1333.2, 9.75565, 1812.91, 1330.75, 9.75565, 177.179, 1815.05, 1325.43, 9.91828, 91.4933, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(5, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 1800.64, 1337.81, 9.75565, 1801.27, 1335.48, 9.75565, 177.657, 1794.94, 1326.15, 9.85514, 89.8407, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(6, 0, '', 5, 0, 1000000, 7000, 0, -1, 0, 1784.26, 1338.18, 9.75565, 1784.04, 1336.19, 9.75565, 183.924, 1788.21, 1338.37, 9.75565, 179.98, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(7, 0, '', 0, 0, 3000000, 7000, 0, -1, 0, 1764.04, 1334.3, 9.75565, 1766.16, 1334.11, 9.75565, 273.538, 1766.49, 1327.62, 9.75565, 92.4101, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(8, 0, '', 5, 0, 7000000, 7000, 0, -1, 0, 1865.3, 1358.19, 9.75565, 1865.51, 1360.67, 9.75565, 0.457568, 1870.99, 1366.57, 9.78858, 179.831, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(9, 0, '', 5, 0, 3000000, 7000, 0, -1, 0, 1865.87, 1337.14, 9.75565, 1865.92, 1339.07, 9.75565, 0.052339, 1872.02, 1341.17, 9.84551, 178.492, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(10, 0, '', 5, 0, 3000000, 7000, 0, -1, 0, 1859.47, 1404.84, 9.75565, 1859.56, 1402.23, 9.75565, 180, 1872.23, 1401.38, 9.85196, 187.806, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(11, 0, '', 0, 0, 3000000, 7000, 0, -1, 0, 1865.04, 1419.27, 10.2281, 1865.63, 1421.57, 9.75565, 354.897, 1871.51, 1426.82, 9.81496, 184.006, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(12, 0, '', 0, 0, 3000000, 7000, 0, -1, 0, 1866.21, 1439.86, 9.75565, 1866.24, 1441.66, 9.75565, 357.529, 1870.95, 1444, 9.78611, 186.615, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(13, 0, '', 0, 0, 5000000, 7000, 0, -1, 0, 2038.9, 1339.88, 26.1435, -998.152, 746.812, 12.1348, 71.7873, -998.152, 746.812, 12.1348, 71.7873, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(14, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2060.48, 1339.87, 26.1435, 2060.04, 1338.31, 26.1431, 181.308, 2060.11, 1326.08, 26.2445, 91.3083, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(15, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2204.58, -231.381, 2.06699, 2206.82, -228.955, 2.25525, 277.201, 2211.3, -234.127, 1.87778, 5.1858, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(16, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2240.53, -197.184, 2.38868, 2242.59, -197.361, 2.29445, 271.396, 2238.01, -206.463, 2.1434, 176.373, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(17, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2261.31, -230.6, 2.07146, 2261.11, -228.177, 2.1372, 1.26067, 2255.77, -231.819, 2.05207, 3.01565, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(18, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2329.97, -205.21, 2.4335, 2316.32, -207.188, 2.16208, 182.683, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(19, 0, '', 0, 0, 5000000, 7000, 0, -1, 0, 2381.84, -202.405, 2.7631, 2381.45, -204.764, 2.13854, 180.509, 2377.47, -204.53, 2.13854, 180.423, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(20, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2422.07, -206.157, 2.35224, 2424.88, -207.299, 2.13854, 176.225, 2423.47, -212.532, 2.14481, 83.7904, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(21, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2414.87, -230.591, 2.06488, 2414.84, -228.595, 2.0888, 358.774, 2410.25, -231.852, 2.05712, 1.34348, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(22, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2466.45, -201.208, 2.14461, 2465.12, -202.897, 2.14461, 92.2998, 2460.18, -200.027, 2.14461, 182.3, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(23, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2487.49, -252.622, 1.84195, 2489.96, -252.104, 1.87508, 357.379, 2485.33, -244.838, 2.34694, 14.6319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(24, 0, '', 5, 0, 5000000, 7000, 0, -1, 0, 2513.72, -230.512, 2.56648, 2513.41, -228.206, 2.56648, 88.8398, 2507.64, -232.153, 2.45217, 1.48161, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(25, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -785.534, 915.499, 13.0786, -785.899, 913.447, 13.0786, 180.362, -780.734, 902.264, 12.5538, 178.732, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(26, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -829.38, 909.598, 13.0814, -829.351, 907.061, 12.5611, 181.278, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(27, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -870.147, 910.056, 13.1247, -869.911, 907.648, 13.131, 182.031, -861.567, 905.655, 12.5611, 179.966, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(28, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -933.41, 915.487, 13.0786, -933.384, 913.293, 13.0786, 177.809, -926.255, 901.563, 12.5538, 184.076, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(29, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -975.353, 909.615, 13.0814, -975.096, 907.13, 12.5611, 180.731, -963.752, 902.586, 12.5538, 179.792, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(30, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -968.533, 851.711, 13.0786, -971.872, 851.895, 12.5538, 88.2741, -983.279, 844.578, 12.5538, 91.1568, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(31, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -973.983, 790.814, 13.1247, -977.415, 790.899, 12.6794, 87.2088, -976.715, 781.68, 12.5611, 88.7756, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(32, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -974.458, 753.127, 13.0814, -976.956, 753.312, 12.5611, 90.4049, -982.507, 741.463, 12.5538, 88.7128, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(33, 0, '', 6, 0, 50000000, 7000, 6, -1, 0, -848.743, 753.141, 13.0814, -851.451, 752.94, 12.5611, 89.9034, -856.244, 741.16, 12.5611, 89.2141, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(34, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -848.094, 790.744, 13.1247, -850.43, 790.775, 13.131, 89.4218, -852.261, 782.263, 12.5611, 88.0629, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(35, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -842.646, 851.644, 13.0786, -844.634, 851.778, 13.0786, 90.5893, -856.238, 844.828, 12.5538, 92.5517, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(36, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -791.782, 841.27, 13.0814, -789.443, 841.379, 12.5611, 261.73, -785.377, 853.62, 12.5538, 264.425, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(37, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -792.192, 803.566, 13.1247, -789.327, 803.486, 12.9825, 271.275, -787.451, 811.279, 12.5611, 271.922, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(38, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -797.588, 742.829, 13.0786, -794.696, 742.695, 12.7114, 271.189, -784.155, 749.379, 12.5538, 271.46, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(39, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -730.554, 753.198, 13.0814, -733.028, 753.165, 12.5611, 81.7463, -739.391, 741.919, 12.5538, 93.4848, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(40, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -730.225, 790.771, 13.131, -732.538, 790.786, 13.131, 90.0579, -733.258, 782.347, 12.5611, 92.5216, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(41, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -724.671, 851.594, 13.0786, -726.863, 851.53, 13.0786, 89.2828, -738.767, 843.65, 12.5538, 94.9425, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(42, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -674.694, 841.237, 13.0814, -672.484, 841.119, 12.5611, 266.73, -666.594, 852.935, 12.5538, 272.432, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(43, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -675.142, 803.555, 13.1247, -672.578, 803.435, 12.9825, 270.823, -672.304, 811.617, 12.5611, 270.905, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(44, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -680.573, 742.795, 13.0786, -677.603, 743.082, 12.7114, 90.7994, -666.647, 749.483, 12.5538, 269.628, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(45, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 2685.6, -231.553, 3.97524, 2685.56, -229.216, 3.97524, 2.22396, 2698.83, -233.507, 3.97524, 7.15497, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(46, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2627.62, -232.8, 3.97524, 2627.53, -230.269, 3.97524, 3.87646, 2641.5, -233.218, 3.97524, 2.83082, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(47, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2608.46, -200.931, 6.83413, 2606.42, -200.792, 6.41226, 93.7575, 2605.57, -190.668, 6.91647, 176.749, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(48, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 2590.71, -230.937, 4.03638, 2590.52, -228.926, 4.04053, 357.939, 2595.93, -235.218, 3.97888, 5.41627, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(49, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2524.48, -198.869, 3.72267, 2524.78, -202.072, 3.02409, 180.406, 2531.21, -199.023, 3.1993, 186.861, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(50, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2250.71, 1363.36, 11.3606, 2250.55, 1360.87, 11.3643, 184.523, 2238.22, 1368.55, 11.353, 103.118, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(51, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 2207.51, 1363.42, 11.3606, 2209.74, 1363.74, 11.3601, 273.738, 2219.16, 1354.26, 11.5189, 94.4271, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(52, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 465.347, -1249.77, 41.8968, 466.02, -1247.6, 40.7343, 341.171, 459.281, -1244.9, 40.7343, 340.921, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(53, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 531.188, -1275.49, 40.7343, 532.174, -1273.38, 40.7343, 339.331, 533.845, -1260.7, 40.8498, 272.61, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(54, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 525.155, -1305, 40.7343, 525.849, -1302.69, 40.7343, 351.831, 536.735, -1303.86, 40.7239, 326.88, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(55, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 579.831, -1289.01, 40.7343, 580.6, -1286.9, 40.7343, 340.749, 573.354, -1289.93, 40.6267, 346.346, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(56, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 622.28, -1250.17, 41.8203, 622.017, -1252.59, 40.7343, 164.321, 627.778, -1249.33, 40.7343, 164.07, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(57, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 641.989, -1265.94, 41.8848, 641.107, -1268.57, 40.7343, 162.108, 634.578, -1265.87, 40.7343, 167.345, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(58, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 629.064, -1320.47, 41.5092, 668.287, -1286.27, 40.7343, 157.549, 664.748, -1300.49, 40.4491, 77.7309, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(59, 0, '', 1, 0, 5000000, 7000, 1, -1, 0, 680.528, -1284.15, 41.8848, 680.176, -1285.74, 41.0098, 160.636, 674.81, -1301.27, 40.6322, 161.136, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(60, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 733.133, -1308.76, 40.672, 735.056, -1308.9, 40.6996, 251.629, 730.512, -1321.5, 40.2951, 248.703, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(61, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 720.156, -1351.02, 40.7165, 718.409, -1350.28, 40.7165, 73.2154, 714.882, -1358.07, 40.7165, 247.951, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(62, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 778.244, -1315.23, 40.7165, 776.639, -1314.74, 40.7165, 73.9675, 769.048, -1322.08, 40.7165, 167.236, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(63, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 785.178, -1319.98, 41.8189, 785.503, -1321.91, 41.8189, 140.438, 788.617, -1327.23, 40.6862, 166.319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(64, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 826.264, -1339.17, 40.7165, 827.851, -1340.28, 40.7092, 248.958, 823.398, -1348.97, 40.7165, 77.6057, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(65, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 826.275, -1387.15, 40.7165, 826.497, -1385.44, 40.7165, 343.374, 823.202, -1368.17, 40.7125, 251.985, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(66, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 811.911, -1371.2, 40.7165, 812.487, -1369.22, 40.7092, 344.502, 811.461, -1363.27, 40.6565, 246.972, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(67, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 778.237, -1369.94, 40.7165, 777.011, -1371.9, 40.7165, 161.662, 772.075, -1369.88, 40.7165, 345.798, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(68, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1749.92, 2188.99, 15.9201, 1752.14, 2188.94, 15.8865, 272.566, 1750.8, 2199.84, 15.959, 274.716, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(69, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1745.97, 2115.04, 16.009, 1747.64, 2114.86, 15.9955, 272.628, 1750.15, 2117.98, 16.0251, 264.149, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(70, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1911.98, 2266.08, 15.7223, 1911.9, 2264.66, 15.7723, 180.157, 1901.92, 2270.13, 15.8427, 352.136, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(71, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1945.36, 1845.48, 15.4198, 1947.26, 1845.72, 15.4198, 267.793, 1953.74, 1842.65, 15.525, 190.254, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(72, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1943.5, 1806.87, 15.5073, 1942.92, 1808.72, 15.3979, 3.4856, 1951.94, 1812.3, 15.5252, 183.862, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(73, 0, '', 0, 0, 5000000, 7000, 1, -1, 0, 1989.22, 1793.93, 15.4441, 1986.77, 1794.81, 15.5466, 81.9251, 1982.07, 1800.58, 15.584, 82.4265, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(74, 0, '', 5, 0, 5000000, 7000, 1, -1, 0, 1994.83, 1746.2, 15.6989, 1992.68, 1746.14, 15.6989, 89.6134, 1985.42, 1748.85, 15.6989, 88.027, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(75, 7, '', 0, 1683763200, 5000000, 7000, 1, -1, 0, 1944.01, 1753.15, 15.3423, 1945.73, 1753.2, 15.3423, 271.348, 1952.3, 1748.19, 15.5097, 270.013, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(76, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -425.162, 1440.38, 20.9844, -425.245, 1442.2, 20.7421, 358.008, -433.16, 1444.21, 20.7421, 3.41713, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(77, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -423.341, 1464.19, 21.3906, -423.552, 1462.23, 20.8906, 179.972, -430.957, 1465.47, 20.7422, 174.311, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(78, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -410.581, 1441.88, 21.3906, -410.678, 1443.74, 20.8906, 1.32913, -402.344, 1439.35, 20.7421, 5.27737, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(79, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -397.837, 1463.92, 21.197, -397.669, 1462.35, 20.8906, 181.6, -410.036, 1465.79, 20.7421, 184.733, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(80, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -391.905, 1441.38, 21.4921, -391.744, 1443.21, 20.9637, 1.43149, -380.477, 1440.66, 20.7421, 11.6461, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(81, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -376.115, 1464.68, 21.4921, -376.222, 1462.77, 20.9119, 178.968, -387.457, 1467.4, 20.7421, 177.193, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(82, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -364.914, 1465.68, 20.9844, -364.743, 1463.99, 20.7421, 180.996, -356.19, 1462.59, 20.7421, 178.321, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(83, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -351.675, 1441.13, 21.3906, -350.313, 1440.92, 20.8906, 269.522, -355.819, 1431.47, 20.7421, 277.543, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(84, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -329.338, 1427.34, 21.4921, -330.969, 1427.13, 21.0743, 88.0374, -336.504, 1428.61, 20.7469, 183.437, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(85, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -328.339, 1415.81, 20.9844, -329.72, 1415.85, 20.7421, 89.8548, -332.36, 1407.15, 20.7421, 90.3132, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(86, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -351.864, 1421.12, 21.1973, -350.137, 1420.74, 20.8906, 270.815, -352.585, 1409.75, 20.7422, 269.354, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(87, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -292.945, 1442.34, 21.3905, -293.042, 1443.58, 20.8905, 0.081564, -283.14, 1438.66, 20.7421, 359.06, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(88, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -289.77, 1465.66, 20.9844, -289.806, 1463.78, 20.7421, 179.123, -281.466, 1461.95, 20.7421, 181.273, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(89, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -300.876, 1463.93, 21.1971, -300.663, 1462.32, 20.8906, 179.914, -312.018, 1464.46, 20.7421, 173.604, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(90, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -260.416, 1464.19, 21.3905, -260.552, 1460.96, 20.8905, 176.757, -268.297, 1466.1, 20.7421, 183.862, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(91, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -272.757, 1441.4, 21.4921, -272.746, 1443.19, 20.973, 355.735, -261.755, 1440.76, 20.7421, 3.94447, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(92, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -232.337, 1419.83, 21.4921, -234.24, 1419.95, 20.9158, 89.8381, -231.23, 1430.15, 20.7421, 91.2167, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(93, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -254.872, 1413.5, 21.1977, -253.382, 1413.52, 20.8906, 273.304, -257.392, 1402.29, 20.7422, 273.994, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(94, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -260.536, 1374.17, 21.3905, -260.649, 1372.92, 21.1303, 181.81, -268.603, 1376.34, 20.7421, 179.805, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(95, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -289.84, 1375.68, 20.9844, -289.628, 1373.97, 20.7421, 179.867, -281.549, 1372.2, 20.7421, 184.775, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(96, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -272.877, 1351.38, 21.4921, -272.686, 1353.12, 21.0118, 358.697, -261.12, 1348.57, 20.7421, 359.429, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(97, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -231.349, 1386.35, 20.9844, -233.167, 1386.34, 20.7421, 91.0055, -235.643, 1378, 20.7421, 94.3466, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(98, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -232.859, 1401.01, 21.3905, -234.66, 1401.04, 20.8905, 88.037, -231.906, 1409.12, 20.7421, 93.301, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(99, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -293.169, 1352.34, 21.3905, -292.939, 1354.14, 20.8905, 1.51659, -284.363, 1349.55, 20.7421, 3.02077, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(100, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -353.632, 1302.69, 20.9844, -351.91, 1302.39, 20.7421, 268.057, -350.644, 1310.77, 20.7421, 273.591, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(101, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -329.851, 1300.97, 21.3905, -331.736, 1300.95, 20.8905, 89.2045, -328.737, 1309.13, 20.7421, 91.3978, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(102, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -351.674, 1289.53, 21.3906, -350.469, 1289.65, 20.8906, 270.603, -354.3, 1280, 20.7421, 271.856, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(103, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -328.337, 1286.25, 20.9844, -330.026, 1286.26, 20.7421, 91.0612, -331.45, 1277.86, 20.7421, 89.2009, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(104, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -373.511, 1250.88, 21.3906, -373.686, 1251.99, 21.2286, 358.752, -365.589, 1249.28, 20.7421, 3.76572, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(105, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -388.083, 1249.4, 20.9844, -387.946, 1251.19, 20.7421, 359.63, -396.471, 1252.99, 20.7421, 5.10154, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(106, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -417.614, 1250.88, 21.3906, -417.256, 1252.44, 20.8906, 356.246, -409.16, 1250.21, 20.7421, 2.01091, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(107, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -404.945, 1272.93, 21.1974, -405.101, 1271.27, 20.8906, 177.746, -417.189, 1274.28, 20.7421, 184.577, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(108, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -383.128, 1273.64, 21.4921, -383.083, 1271.45, 20.8906, 178.145, -394.387, 1277.65, 20.7421, 176.559, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(109, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -451.967, 1274.53, 20.9844, -451.817, 1272.96, 20.7421, 179.587, -443.666, 1271.15, 20.7421, 177.1, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(110, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -441.686, 1309.5, 21.3906, -439.884, 1309.79, 20.8906, 270.784, -444.347, 1300.32, 20.7421, 273.478, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(111, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -419.83, 1298.92, 21.3906, -421.736, 1299.25, 20.8906, 86.3147, -418.823, 1307.11, 20.7421, 93.4982, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(112, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -444.682, 1282.47, 20.9921, -443.003, 1282.5, 20.9921, 268.379, -436.343, 1286.04, 20.8908, 287.387, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(113, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -410.085, 1352.13, 21.1971, -410.226, 1354.1, 20.8905, 0.476833, -398.711, 1351.54, 20.7421, 6.36763, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(114, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -419.428, 1374.19, 21.3905, -419.504, 1371.49, 20.8905, 178.053, -426.771, 1375.6, 20.7421, 185.635, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(115, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -394.199, 1374.67, 21.4921, -394.07, 1373.18, 21.1525, 178.531, -405.406, 1377.29, 20.7421, 175.19, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(116, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -233.292, 1483.73, 21.3905, -234.865, 1483.67, 20.8905, 90.2325, -232.209, 1493.42, 20.7421, 93.4912, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(117, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -260.507, 1526.68, 21.3905, -260.298, 1525.2, 20.8905, 178.593, -268.581, 1527.66, 20.7421, 184.359, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(118, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -272.927, 1503.9, 21.4921, -272.649, 1505.63, 21.0078, 359.2, -261.504, 1503.63, 20.7421, 356.858, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(119, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -278.894, 1526.39, 21.1972, -278.698, 1524.92, 20.8905, 179.071, -290.41, 1527.95, 20.7421, 187.218, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(120, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -301.195, 1527.18, 21.4921, -300.878, 1526.02, 21.3519, 181.578, -312.304, 1528.67, 20.7421, 105.678, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(121, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -306.239, 1502.89, 20.9844, -306.121, 1504.68, 20.7421, 0.242283, -314.521, 1507.17, 20.7421, 4.67194, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(122, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -293, 1505.09, 21.3905, -293.041, 1506.39, 20.8905, 2.31029, -283.651, 1502.21, 20.7421, 185.569, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(123, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -355.886, 1526.23, 21.3906, -355.953, 1524.32, 20.8906, 180.285, -365.738, 1526.56, 20.7421, 2.0399, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(124, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -369.969, 1504.65, 21.1976, -370.045, 1505.77, 21.0421, 357.696, -358.428, 1502.85, 20.7421, 182.146, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(125, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -376.125, 1527.18, 21.4921, -375.969, 1525.32, 20.9426, 180.285, -387.038, 1527.95, 20.7421, 5.73736, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(126, 0, '', 1, 0, 50000000, 7000, 6, -1, 0, -388.513, 1504.38, 21.3905, -388.467, 1506.02, 20.8905, 357.822, -380.621, 1503.68, 20.7421, 184.629, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(127, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -408.831, 1528.18, 20.9844, -408.844, 1526.33, 20.7421, 180.575, -400.602, 1525.8, 20.7421, 185.421, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(128, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -411.941, 1504.84, 21.3905, -411.768, 1506.4, 20.8905, 359.98, -403.175, 1504.11, 20.7421, 187.927, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(129, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -419.916, 1526.43, 21.1973, -419.796, 1525.31, 21.0474, 179.487, -431.212, 1526.06, 20.7422, 2.18167, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(130, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -435.795, 1503.89, 21.4921, -436.178, 1506.25, 20.8905, 359.98, -424.871, 1504.76, 20.7421, 194.319, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(131, 0, '', 2, 0, 50000000, 7000, 6, -1, 0, -460.632, 1490.12, 20.9844, -459.277, 1490.1, 20.7421, 271.232, -457.879, 1498.07, 20.7421, 270.961, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(132, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -458.685, 1476.96, 21.3906, -457.392, 1477.03, 20.8906, 269.477, -460.585, 1467.69, 20.7422, 280.131, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(133, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -458.885, 1437.56, 21.1975, -457.283, 1437.45, 20.8906, 271.294, -459.233, 1425.94, 20.7421, 274.365, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(134, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -459.635, 1415.45, 21.4921, -458.077, 1415.3, 21.1172, 275.055, -459.328, 1403.95, 20.7421, 87.4091, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(135, 0, '', 5, 0, 50000000, 7000, 6, -1, 0, -437.298, 1401.41, 21.3906, -438.562, 1401.45, 20.8906, 89.5202, -437.341, 1410.79, 20.7421, 268.392, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(136, 0, '', 0, 0, 50000000, 7000, 6, -1, 0, -460.636, 1378.19, 20.9844, -458.981, 1378.29, 20.7421, 268.412, -458.245, 1386.65, 20.7421, 276.641, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(137, 0, '', 5, 0, 5000000, 7000, 3, -1, 0, 394.404, 701.187, 12.802, 395.196, 702.649, 12.4392, 335.191, 399.485, 698.061, 12.117, 341.5, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(138, 0, '', 5, 0, 5000000, 7000, 3, -1, 0, 473.25, 673.052, 12.1515, 471.56, 673.618, 12.126, 68.5648, 469.493, 677.414, 12.1315, 342.816, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(139, 0, '', 0, 0, 5000000, 7000, 3, -1, 0, 485.676, 672.548, 12.1311, 485.903, 674.764, 12.135, 340.204, 491.847, 678.574, 12.149, 251.635, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(140, 0, '', 0, 0, 5000000, 7000, 3, -1, 0, 504.005, 662.206, 12.4645, 502.455, 662.698, 12.1381, 66.4736, 515.125, 661.209, 12.1102, 335.21, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(141, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(142, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(143, 0, '', 5, 0, 450000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(144, 0, '', 0, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(145, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(146, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(147, 0, '', 5, 0, 500000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(148, 0, '', 5, 0, 450000, 500, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(149, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(150, 0, '', 5, 0, 450000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(151, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(152, 0, '', 5, 0, 450000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(153, 0, '', 0, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(154, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(155, 0, '', 5, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(156, 0, '', 0, 0, 500000, 500, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(157, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(158, 0, '', 0, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(159, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(160, 0, '', 5, 0, 500000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(161, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(162, 0, '', 5, 0, 500000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(163, 0, '', 5, 0, 450000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(164, 0, '', 5, 0, 500000, 500, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(165, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(166, 0, '', 5, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(167, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(168, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(169, 0, '', 0, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(170, 0, '', 5, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(171, 0, '', 5, 0, 500000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(172, 0, '', 5, 0, 450000, 500, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(173, 0, '', 0, 0, 450000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(174, 0, '', 5, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(175, 0, '', 6, 1683590400, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2899.31, 1505.9, 2001, 0, 0, 0, 0, 0, 0),
(176, 0, '', 0, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(177, 0, '', 0, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(178, 0, '', 0, 0, 450000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(179, 0, '', 5, 0, 450000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(180, 0, '', 0, 0, 500000, 500, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(181, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(182, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(183, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(184, 0, '', 5, 0, 450000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(185, 0, '', 0, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(186, 0, '', 5, 0, 450000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(187, 0, '', 5, 0, 500000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(188, 0, '', 0, 0, 450000, 500, 1, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(189, 0, '', 5, 0, 450000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(190, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(191, 0, '', 0, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(192, 0, '', 0, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(193, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(194, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(195, 0, '', 5, 0, 500000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(196, 0, '', 0, 0, 450000, 500, 1, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(197, 0, '', 5, 0, 450000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(198, 0, '', 0, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(199, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(200, 0, '', 0, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(201, 0, '', 0, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(202, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(203, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(204, 0, '', 5, 0, 500000, 500, 1, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(205, 0, '', 5, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(206, 0, '', 5, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(207, 0, '', 0, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(208, 0, '', 5, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(209, 0, '', 0, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(210, 0, '', 5, 0, 500000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(211, 0, '', 5, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(212, 0, '', 5, 0, 450000, 500, 1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(213, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(214, 0, '', 0, 0, 450000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(215, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(216, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(217, 0, '', 5, 0, 450000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(218, 0, '', 0, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(219, 0, '', 5, 0, 500000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(220, 0, '', 5, 0, 450000, 500, 1, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(221, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(222, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(223, 0, '', 4, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(224, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(225, 0, '', 5, 0, 450000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(226, 0, '', 5, 0, 450000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(227, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(228, 0, '', 5, 0, 500000, 500, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(229, 0, '', 0, 0, 500000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(230, 0, '', 5, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(231, 0, '', 5, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(232, 0, '', 0, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(233, 0, '', 1, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(234, 0, '', 5, 0, 500000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(235, 0, '', 5, 0, 450000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(236, 0, '', 5, 0, 500000, 500, 1, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(237, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(238, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(239, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(240, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(241, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(242, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(243, 0, '', 0, 0, 500000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(244, 0, '', 0, 0, 450000, 500, 1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(245, 0, '', 5, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(246, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(247, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(248, 0, '', 0, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(249, 0, '', 0, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(250, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(251, 0, '', 0, 0, 450000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(252, 0, '', 0, 0, 500000, 500, 1, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(253, 0, '', 5, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(254, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(255, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(256, 0, '', 5, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(257, 0, '', 0, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(258, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(259, 0, '', 5, 0, 500000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(260, 0, '', 5, 0, 450000, 500, 1, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(261, 0, '', 5, 0, 450000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(262, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(263, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(264, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(265, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(266, 0, '', 5, 0, 500000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(267, 0, '', 0, 0, 450000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(268, 0, '', 5, 0, 450000, 500, 1, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(269, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(270, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(271, 0, '', 5, 0, 450000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(272, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(273, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(274, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(275, 0, '', 5, 0, 500000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(276, 0, '', 5, 0, 450000, 500, 1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(277, 0, '', 0, 0, 450000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(278, 0, '', 0, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(279, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(280, 0, '', 0, 0, 450000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(281, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(282, 0, '', 5, 0, 450000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(283, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(284, 0, '', 5, 0, 500000, 500, 1, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(285, 0, '', 5, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(286, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(287, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(288, 0, '', 0, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(289, 0, '', 5, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(290, 0, '', 5, 0, 500000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(291, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(292, 0, '', 5, 0, 450000, 500, 1, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(293, 0, '', 5, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(294, 0, '', 5, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(295, 0, '', 0, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(296, 0, '', 5, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(297, 0, '', 0, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(298, 0, '', 5, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(299, 0, '', 5, 0, 450000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(300, 0, '', 0, 0, 500000, 500, 1, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(301, 0, '', 5, 0, 450000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(302, 0, '', 5, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(303, 0, '', 0, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(304, 0, '', 5, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(305, 0, '', 0, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(306, 0, '', 5, 0, 500000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(307, 0, '', 5, 0, 450000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(308, 0, '', 5, 0, 450000, 500, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(309, 0, '', 5, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(310, 0, '', 0, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(311, 0, '', 5, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(312, 0, '', 5, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(313, 0, '', 0, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(314, 0, '', 5, 0, 500000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(315, 0, '', 0, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(316, 0, '', 0, 0, 450000, 500, 1, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(317, 0, '', 0, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(318, 0, '', 5, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(319, 0, '', 5, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(320, 0, '', 0, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(321, 0, '', 5, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(322, 0, '', 5, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(323, 0, '', 5, 0, 500000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(324, 0, '', 5, 0, 450000, 500, 1, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(325, 0, '', 5, 0, 450000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(326, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(327, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(328, 0, '', 5, 0, 450000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(329, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(330, 0, '', 5, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(331, 0, '', 0, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(332, 0, '', 0, 0, 500000, 500, 1, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(333, 0, '', 0, 0, 500000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(334, 0, '', 0, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(335, 0, '', 5, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(336, 0, '', 5, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(337, 0, '', 5, 0, 500000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(338, 0, '', 5, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(339, 0, '', 5, 0, 500000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(340, 0, '', 0, 0, 450000, 500, 1, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(341, 0, '', 0, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(342, 0, '', 0, 0, 450000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(343, 0, '', 5, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(344, 0, '', 0, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(345, 0, '', 5, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(346, 0, '', 0, 0, 450000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(347, 0, '', 0, 0, 450000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(348, 0, '', 5, 0, 500000, 500, 1, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(349, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(350, 0, '', 0, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(351, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(352, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(353, 0, '', 5, 0, 450000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(354, 0, '', 0, 0, 450000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(355, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(356, 0, '', 5, 0, 500000, 500, 1, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(357, 0, '', 0, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(358, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(359, 0, '', 0, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(360, 0, '', 5, 0, 450000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(361, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(362, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(363, 0, '', 5, 0, 500000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(364, 0, '', 5, 0, 450000, 500, 1, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(365, 0, '', 5, 0, 450000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(366, 0, '', 0, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(367, 0, '', 5, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(368, 0, '', 5, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(369, 0, '', 5, 0, 450000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(370, 0, '', 0, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(371, 0, '', 5, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(372, 0, '', 2, 0, 500000, 500, 1, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(373, 0, '', 5, 0, 450000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(374, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(375, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(376, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(377, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(378, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(379, 0, '', 0, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(380, 0, '', 5, 0, 500000, 500, 1, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(381, 0, '', 4, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(382, 0, '', 5, 0, 450000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(383, 0, '', 0, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(384, 0, '', 0, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(385, 0, '', 5, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(386, 0, '', 3, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(387, 0, '', 5, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(388, 0, '', 5, 0, 500000, 500, 1, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(389, 0, '', 5, 0, 450000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(390, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(391, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(392, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(393, 0, '', 0, 0, 450000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(394, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(395, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(396, 0, '', 5, 0, 500000, 500, 1, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
INSERT INTO `houses` (`id`, `owner_id`, `name`, `improvements`, `rent_time`, `price`, `rent_price`, `type`, `entrance`, `lock`, `x`, `y`, `z`, `exit_x`, `exit_y`, `exit_z`, `exit_angle`, `car_x`, `car_y`, `car_z`, `car_angle`, `store_x`, `store_y`, `store_z`, `eviction`, `store_metall`, `store_drugs`, `store_weapon`, `store_ammo`, `store_skin`) VALUES
(397, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(398, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(399, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(400, 0, '', 5, 0, 500000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(401, 0, '', 0, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(402, 0, '', 5, 0, 500000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(403, 0, '', 5, 0, 450000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(404, 0, '', 0, 0, 500000, 500, 1, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(405, 0, '', 5, 0, 450000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(406, 0, '', 5, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(407, 0, '', 0, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(408, 0, '', 0, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(409, 0, '', 5, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(410, 0, '', 0, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(411, 0, '', 5, 0, 500000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(412, 0, '', 5, 0, 450000, 500, 1, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(413, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(414, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(415, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(416, 0, '', 0, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(417, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(418, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(419, 0, '', 5, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(420, 0, '', 0, 0, 500000, 500, 1, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(421, 0, '', 5, 0, 450000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(422, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(423, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(424, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(425, 0, '', 5, 0, 450000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(426, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(427, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(428, 0, '', 5, 0, 500000, 500, 1, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(429, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(430, 0, '', 5, 0, 450000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(431, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(432, 0, '', 5, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(433, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(434, 0, '', 5, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(435, 0, '', 5, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(436, 0, '', 0, 0, 500000, 500, 1, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(437, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(438, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(439, 0, '', 5, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(440, 0, '', 5, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(441, 0, '', 5, 0, 450000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(442, 0, '', 5, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(443, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(444, 0, '', 0, 0, 500000, 500, 1, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(445, 0, '', 5, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(446, 0, '', 5, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(447, 0, '', 5, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(448, 0, '', 0, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(449, 0, '', 5, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(450, 0, '', 5, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(451, 0, '', 0, 0, 450000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(452, 0, '', 0, 0, 500000, 500, 1, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(453, 0, '', 0, 0, 450000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(454, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(455, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(456, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(457, 0, '', 5, 0, 450000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(458, 0, '', 0, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(459, 0, '', 0, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(460, 0, '', 5, 0, 500000, 500, 1, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(461, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(462, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(463, 0, '', 0, 0, 450000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(464, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(465, 0, '', 5, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(466, 0, '', 0, 0, 500000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(467, 0, '', 5, 0, 450000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(468, 0, '', 0, 0, 450000, 500, 1, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(469, 0, '', 5, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(470, 0, '', 5, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(471, 0, '', 0, 0, 450000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(472, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(473, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(474, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(475, 0, '', 0, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(476, 0, '', 5, 0, 500000, 500, 1, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(477, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(478, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(479, 0, '', 5, 0, 450000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(480, 0, '', 5, 0, 450000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(481, 0, '', 0, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(482, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(483, 0, '', 0, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(484, 0, '', 5, 0, 500000, 500, 1, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(485, 0, '', 1, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(486, 0, '', 0, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(487, 0, '', 5, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(488, 0, '', 5, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(489, 0, '', 5, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(490, 0, '', 0, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(491, 0, '', 0, 0, 500000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(492, 0, '', 5, 0, 450000, 500, 1, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(493, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(494, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(495, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(496, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(497, 0, '', 5, 0, 450000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(498, 0, '', 5, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(499, 0, '', 0, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(500, 0, '', 3, 0, 500000, 500, 1, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(501, 0, '', 5, 0, 450000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(502, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(503, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(504, 0, '', 0, 0, 450000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(505, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(506, 0, '', 5, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(507, 0, '', 0, 0, 500000, 500, 1, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(508, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -915.642, 742.634, 13.0786, -911.77, 742.832, 12.5538, 266.362, -901.488, 753.024, 12.5845, 3.25374, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(509, 0, '', 5, 0, 100000, 7000, 6, -1, 0, -2.83529, 595.115, 13.0936, -2.72501, 597.511, 12.7131, 315.935, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(510, 0, '', 5, 0, 100000, 7000, 6, -1, 0, 8.77968, 594.24, 13.0997, 9.80212, 597.247, 12.1772, 345.124, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(511, 0, '', 0, 0, 50000000, 0, 6, -1, 0, -910.2, 803.403, 13.1247, -905.621, 803.598, 12.5611, 268.369, -907.983, 809.465, 12.5886, 270.603, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(512, 0, '', 5, 0, 50000000, 0, 6, -1, 0, -909.759, 841.158, 13.0814, -906.767, 841.352, 12.5611, 271.502, -901.315, 850.322, 12.6162, 270.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(530, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 836.383, -1332.92, 40.7165, 833.409, -1333.68, 40.7165, 96.9411, 832.977, -1333.57, 40.7165, 74.0158, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(522, 0, '', 0, 0, 10000000, 0, 5, -1, 0, -286.996, 1249.53, 20.9844, -287.945, 1254.64, 20.8743, 224.162, -295.549, 1254.49, 20.7421, 181.861, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(523, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -316.422, 1251.69, 21.3906, -316.76, 1255.08, 20.8823, 1.0893, -317.552, 1257.26, 20.7414, 3.98212, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(513, 0, '', 0, 0, 50, 0, 6, -1, 0, -306.522, 488.966, 13.223, -309.333, 489.443, 12.8737, 256.344, -321.401, 490.382, 12.8096, 82.1275, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(514, 0, '', 5, 0, 100000000, 0, 0, -1, 0, 2290.85, -191.04, 2.14294, 2289.33, -193.151, 2.14294, 135.187, 2295.71, -210.163, 2.18921, 203.911, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(515, 0, '', 5, 0, 100000000, 0, 2, -1, 0, 2355.03, -261.294, 2.79638, 2356.2, -265.236, 2.79638, 33.9029, 2342.25, -263.525, 1.48889, 87.161, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(516, 0, '', 0, 0, 100000000, 0, 0, -1, 0, 2625.76, -180.869, 7.20756, 2628.45, -184.284, 7.22695, 254.059, 2629.4, -186.107, 7.15312, 267.869, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(517, 0, '', 0, 0, 50, 0, 6, -1, 0, -303.15, 516.448, 13.2285, -307.02, 517.289, 12.8656, 251.935, -317.54, 517.546, 12.6296, 98.692, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(518, 0, '', 5, 0, 10000000, 0, 6, -1, 0, -232.118, 1335, 20.9844, -237.101, 1334.89, 20.8898, 97.8873, -234.816, 1326.01, 20.7421, 75.4721, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(519, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -232.829, 1305.51, 21.3906, -237.241, 1305.4, 20.8823, 98.0557, -240.117, 1301.87, 20.7414, 352.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(520, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -232.333, 1290.93, 20.9844, -236.257, 1290.66, 20.8573, 86.2938, -240.482, 1286.15, 20.7414, 344.773, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(521, 0, '', 5, 0, 10000000, 0, 5, -1, 0, -272.323, 1250.88, 21.3906, -272.709, 1256.92, 20.8898, 2.80142, -277.096, 1258.74, 20.7414, 264.582, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(560, 0, '', 5, 0, 50000000, 0, 2, -1, 0, 669.086, -1283.81, 41.8848, 668.113, -1285.04, 41.0098, 198.469, 662.598, -1301.22, 40.4405, 132.458, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(524, 0, '', 5, 0, 10000000, 0, 5, -1, 0, 1787.55, 2409.34, 15.3082, 1784.32, 2407.95, 15.2733, 285.625, 1787.28, 2402.74, 15.2737, 217.318, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(554, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2210.36, -95.159, 26.125, -2210.6, -95.429, 26.125, 101.839, -2213.64, -95.9077, 26.125, 100.191, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(563, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1911.18, 1086.44, 28.769, 1912.15, 1086.56, 28.769, 272.656, 1913.01, 1090.29, 28.769, 279.567, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(531, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 772.416, -1273.58, 40.7107, 769.649, -1274.68, 40.7165, 108.351, 766.488, -1274.32, 40.7165, 80.3046, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(561, 0, '', 0, 0, 5000000, 0, 2, -1, 0, -2812.33, -670.784, 8.62537, -2811.96, -671.979, 8.56018, 181.892, -2805.69, -671.704, 8.33861, 182.271, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(552, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2201.14, -107.546, 26.125, -2199.73, -107.922, 26.125, 275.373, -2199.46, -110.804, 26.125, 236.851, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(525, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 668.764, -1363.1, 40.7343, 671.394, -1364.64, 40.7343, 70.4924, 673.607, -1363.34, 40.7343, 300.653, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(526, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 734.808, -1392.2, 40.7134, 730.713, -1390.25, 40.7114, 249.873, 730.575, -1390.55, 40.7115, 118.385, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(527, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 760.23, -1402.05, 40.7168, 0, 0, 0, 0, 765.159, -1403.86, 40.7166, 252.769, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(528, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 791.408, -1407.55, 40.7165, 0, 0, 0, 0, 790.245, -1401.16, 40.7165, 9.00012, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(529, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 829.752, -1413.33, 40.7092, 825.182, -1412.94, 40.7165, 82.5647, 824.649, -1412.82, 40.7165, 78.5232, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(532, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 729.248, -1254.39, 40.9853, 730.12, -1257.73, 40.8622, 196.773, 730.107, -1260.27, 40.824, 177.245, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(533, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 700.42, -1250.33, 40.838, 699.54, -1252.91, 40.7343, 159.758, 696.08, -1257.62, 40.7343, 147.893, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(559, 0, '', 5, 0, 200000, 0, 0, -1, 0, -1543.25, 1584.09, 36.7768, -1544.43, 1583.68, 36.7768, 113.52, -1545.02, 1578.13, 36.7768, 194.254, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(534, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 656.188, -1232.2, 40.7344, 656.802, -1235.06, 40.7344, 186.86, 659.74, -1237.82, 40.7344, 226.003, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(535, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 644.801, -1244.29, 40.7343, 644.469, -1240.46, 40.7343, 30.3543, 644.469, -1240.46, 40.7343, 30.3543, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(536, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 570.416, -1316.85, 40.7343, 570.307, -1314.74, 40.7343, 352.398, 568.051, -1309.97, 40.7343, 34.6926, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(537, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 548.99, -1312.38, 40.7343, 545.486, -1310.67, 40.7343, 54.9576, 544.006, -1309.85, 40.7343, 59.9365, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(538, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 474.123, -1281.21, 40.7343, 473.429, -1278.54, 40.7343, 352.642, 471.497, -1274.93, 40.7343, 27.3912, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(539, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 468.885, -1254.2, 41.8655, 469.225, -1254.39, 41.8655, 152.511, 468.288, -1261.06, 40.7343, 168.987, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(540, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2223.52, -179.206, 2.46963, 2224.77, -179.031, 2.14385, 249.964, 2230.29, -180.342, 2.1435, 287.416, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(541, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2238.36, -168.02, 2.81221, 2240.67, -168.433, 2.77114, 248.015, 2244.9, -169.235, 2.69577, 261.733, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(542, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2253.29, -167.95, 2.81916, 2253.29, -167.95, 2.81916, 271.618, 2247.52, -169.558, 2.67337, 94.2607, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(543, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2251.19, -200.52, 2.1435, 2250.24, -200.591, 2.1435, 95.9314, 2246.91, -211.047, 2.1435, 216.889, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(544, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2409.29, -260.755, 1.66805, 2406.7, -260.811, 1.75318, 83.2179, 2403.28, -261.662, 1.75457, 105.823, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(545, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2474.37, -264.483, 1.55164, 2466.48, -259.073, 1.81765, 72.504, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(546, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2533.49, -190.739, 3.1993, 2531.81, -190.61, 3.1993, 94.4167, 2527.44, -190.6, 3.04771, 87.2098, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(547, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2609.07, -169.404, 7.32303, 2609.07, -169.404, 7.32303, 8.33922, 2604.16, -175.285, 7.24449, 120.49, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(548, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2205.32, -261.845, 1.61755, 2204.02, -266.187, 1.63748, 79.3288, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(549, 0, '', 0, 0, 20000000, 0, 0, -1, 0, 2602.49, -243.833, 3.97888, 2602.49, -243.833, 3.97888, 293.651, 2596.2, -249.211, 3.97888, 143.347, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(550, 0, '', 5, 0, 20000000, 0, 0, -1, 0, 2684, -260.958, 3.97524, 2682.17, -261.113, 3.97524, 112.116, 2673.22, -264.327, 4.12566, 108.562, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(551, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2198.26, -97.4927, 26.125, -2196.56, -101.415, 26.125, 119.872, -2196.38, -104.029, 26.125, 180.719, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(553, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2212.51, -107.581, 26.1179, -2212.51, -107.581, 26.1179, 265.764, -2217.92, -106.578, 26.125, 75.1224, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(555, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2195.93, -94.7812, 26.1179, -2195.93, -94.7812, 26.1179, 78.8916, -2188.95, -84.3278, 26.125, 346.332, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(556, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2181.97, -140.857, 26.125, -2181.97, -140.857, 26.125, 161.413, -2181.08, -135.202, 26.125, 344.964, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(557, 0, '', 0, 0, 20000000, 0, 0, -1, 0, -2188.79, -139.533, 26.125, -2188.95, -138.087, 26.125, 349.277, -2188.87, -130.554, 26.125, 357.8, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(558, 0, '', 5, 0, 20000000, 0, 0, -1, 0, -2195.91, -138.144, 26.125, -2196.01, -136.655, 26.125, 323.861, -2198.82, -135.762, 26.125, 7.20593, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(562, 0, '', 5, 0, 5000000, 0, 2, -1, 0, -2790.45, -709.893, 7.26051, -2788.45, -709.265, 6.47324, 314.297, -2783.39, -703.876, 6.36812, 290.893, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(564, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1894.06, 1086.17, 28.769, 1895.35, 1086.3, 28.769, 254.574, 1895.99, 1091.29, 28.769, 9.25485, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(565, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1909.75, 1066.22, 28.8205, 1911.4, 1065.94, 28.7805, 270.055, 1911.22, 1069.18, 28.785, 8.56015, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(566, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 1894.91, 1186.52, 30.3278, 1894.77, 1187.59, 30.3224, 355.42, 1899.78, 1188.68, 30.0135, 9.52159, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(567, 0, '', 0, 0, 5000000, 0, 2, -1, 0, 1633.86, 1294.77, 12.2211, 1634.63, 1295.76, 12.2077, 310.05, 1644.82, 1296.42, 12.0926, 283.956, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(568, 0, '', 4, 0, 5000000, 0, 2, -1, 0, 838.705, -1323.03, 40.7096, 837.788, -1322.35, 40.7107, 94.0755, 837.176, -1324.48, 40.7112, 81.0172, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(569, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 834.799, -1391.52, 41.7043, 835.544, -1389.81, 41.3085, 350.786, 842.848, -1392.13, 40.7071, 352.234, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(570, 0, '', 5, 0, 5000000, 0, 2, -1, 0, 623.878, -1243.93, 40.7343, 623.207, -1245.25, 40.7343, 199.795, 630.627, -1242.6, 40.7343, 149.315, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(571, 0, '', 0, 0, 1, 0, 0, -1, 0, 2196.63, -172.736, 2.45325, 2194.6, -169.466, 2.67972, 213.806, 2194.6, -169.466, 2.67972, 213.806, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `houses_renters`
--

CREATE TABLE `houses_renters` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `house_id` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `rent_time` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `houses_renters`
--

INSERT INTO `houses_renters` (`id`, `owner_id`, `house_id`, `room_id`, `rent_time`, `time`) VALUES
(203, 2791, 565, 0, 0, 1614442958),
(132, 2397, 465, 0, 0, 1614270837),
(8, 404, 2, 1, 0, 1613828849),
(7, 460, 2, 0, 0, 1613817720),
(15, 595, 124, 0, 0, 1613892336),
(10, 437, 2, 2, 0, 1613837961),
(11, 514, 2, 3, 0, 1613837964),
(96, 2099, 129, 0, 0, 1614194529),
(20, 647, 92, 0, 0, 1613914055),
(26, 422, 116, 0, 0, 1613927540),
(204, 244, 253, 1, 0, 1614445758),
(23, 755, 222, 0, 0, 1613916256),
(79, 1420, 124, 1, 0, 1614154383),
(38, 650, 21, 0, 0, 1613988755),
(127, 2551, 92, 1, 0, 1614267680),
(88, 95, 124, 2, 0, 1614181372),
(87, 1205, 235, 0, 0, 1614180222),
(35, 951, 236, 0, 0, 1613985719),
(75, 965, 101, 0, 0, 1614147655),
(131, 1303, 2, 4, 0, 1614270505),
(44, 1036, 65, 0, 0, 1614016209),
(94, 2023, 536, 0, 0, 1614191174),
(46, 1038, 86, 1, 0, 1614017612),
(116, 2384, 191, 0, 0, 1614242972),
(74, 851, 86, 0, 0, 1614146917),
(50, 554, 130, 0, 0, 1614028245),
(170, 2911, 118, 2, 0, 1614359217),
(53, 1098, 86, 2, 0, 1614066288),
(144, 2553, 191, 1, 0, 1614318959),
(200, 3185, 106, 0, 0, 1614436725),
(65, 1282, 524, 0, 0, 1614105917),
(67, 1008, 52, 0, 0, 1614112204),
(84, 329, 510, 0, 0, 1614170641),
(138, 2663, 304, 1, 0, 1614276786),
(70, 186, 52, 1, 0, 1614114628),
(167, 1709, 76, 0, 0, 1614357082),
(227, 2054, 6, 0, 0, 1614518307),
(104, 1899, 124, 3, 0, 1614202426),
(105, 2263, 510, 1, 0, 1614215039),
(165, 2904, 101, 1, 0, 1614356506),
(164, 2892, 307, 1, 0, 1614355875),
(110, 1497, 26, 0, 0, 1614228048),
(129, 2037, 118, 0, 0, 1614269715),
(114, 1507, 58, 0, 0, 1614235953),
(115, 2127, 183, 0, 0, 1614236267),
(161, 2588, 29, 0, 0, 1614352980),
(118, 2394, 166, 0, 0, 1614245892),
(162, 1577, 41, 0, 0, 1614353299),
(140, 2612, 464, 0, 0, 1614280271),
(143, 2746, 286, 0, 0, 1614317257),
(133, 2372, 493, 0, 0, 1614271893),
(123, 2381, 160, 0, 0, 1614257581),
(142, 2737, 195, 0, 0, 1614314542),
(177, 2944, 47, 1, 0, 1614362079),
(168, 2883, 309, 0, 0, 1614358204),
(135, 2461, 183, 1, 0, 1614273854),
(137, 2155, 480, 1, 0, 1614276572),
(145, 1127, 118, 1, 0, 1614323204),
(212, 2251, 37, 3, 0, 1614464810),
(147, 2298, 510, 3, 0, 1614323860),
(148, 2762, 392, 0, 0, 1614324073),
(188, 1056, 41, 1, 0, 1614414246),
(152, 2793, 187, 0, 0, 1614336041),
(199, 28, 37, 2, 0, 1614435575),
(193, 559, 455, 0, 0, 1614419454),
(192, 3121, 67, 0, 0, 1614416690),
(163, 1135, 37, 0, 0, 1614353744),
(159, 2812, 477, 0, 0, 1614348905),
(160, 2860, 47, 0, 0, 1614350239),
(171, 2172, 129, 1, 0, 1614359295),
(196, 356, 253, 0, 0, 1614430219),
(189, 1070, 446, 0, 0, 1614414551),
(211, 2407, 307, 0, 0, 1614463331),
(175, 2934, 211, 0, 0, 1614360661),
(198, 2597, 327, 0, 0, 1614435275),
(178, 2961, 46, 1, 0, 1614362524),
(184, 853, 37, 1, 0, 1614374838),
(181, 2593, 354, 0, 0, 1614365562),
(182, 2928, 304, 0, 0, 1614368413),
(201, 2662, 493, 1, 0, 1614438864),
(202, 2876, 229, 0, 0, 1614439767),
(226, 2399, 283, 0, 0, 1614516631),
(209, 1939, 51, 0, 0, 1614457480),
(207, 2068, 228, 0, 0, 1614446611),
(208, 3102, 92, 2, 0, 1614448086),
(213, 3297, 37, 4, 0, 1614467435),
(215, 3331, 33, 0, 0, 1614496396),
(216, 3345, 53, 0, 0, 1614496678),
(219, 3294, 112, 1, 0, 1614498053),
(218, 3179, 112, 0, 0, 1614497704),
(220, 3250, 33, 1, 0, 1614502229),
(221, 2196, 182, 0, 0, 1614504085),
(222, 3395, 44, 0, 0, 1614510090),
(223, 3364, 33, 2, 0, 1614511716),
(224, 255, 33, 3, 0, 1614511883),
(225, 3403, 33, 4, 0, 1614512042),
(228, 3465, 101, 2, 0, 1614518509);

-- --------------------------------------------------------

--
-- Структура таблицы `leaders`
--

CREATE TABLE `leaders` (
  `id` int(11) NOT NULL,
  `accout_id` int(11) NOT NULL DEFAULT 0,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `frac_id` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `money_log`
--

CREATE TABLE `money_log` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `uip` varchar(16) NOT NULL DEFAULT '255.255.255.255',
  `time` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `description` varchar(64) NOT NULL DEFAULT 'None'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `money_log`
--

INSERT INTO `money_log` (`id`, `uid`, `uip`, `time`, `money`, `description`) VALUES
(1, 1, '85.140.92.95', 1657470301, -300, 'Аренда велика'),
(2, 1, '85.140.92.95', 1657496594, -300, 'Аренда велика'),
(3, 1, '85.140.92.95', 1657498180, 64000, 'Конвертация доната 16 в игровую валюту'),
(4, 1, '85.140.92.95', 1657531940, -300, 'Аренда велика'),
(5, 1, '85.140.92.95', 1657532307, 800, 'Зарплата на работе шахтера'),
(6, 1, '37.212.39.105', 1680672226, 10, 'Выдача денег от админа Sander_Kligan'),
(7, 2, '188.163.34.236', 1680723359, -100, 'Аренда велика'),
(8, 1, '37.212.39.105', 1680725277, 10000000, 'Выдача денег от админа Sander_Kligan'),
(9, 1, '37.212.39.105', 1680725287, 25000000, 'Выдача денег от админа Sander_Kligan'),
(10, 1, '37.212.39.105', 1680725293, 25000000, 'Выдача денег от админа Sander_Kligan'),
(11, 1, '37.212.39.105', 1680725295, 25000000, 'Выдача денег от админа Sander_Kligan'),
(12, 1, '37.212.39.105', 1680725296, 25000000, 'Выдача денег от админа Sander_Kligan'),
(13, 1, '37.212.39.105', 1680725298, 25000000, 'Выдача денег от админа Sander_Kligan'),
(14, 1, '37.212.39.105', 1680725300, -50000000, 'Покупка дома'),
(15, 1, '37.212.39.105', 1680725324, -8000, 'Покупка улучшений для дома'),
(16, 1, '37.212.39.105', 1680725327, -14500, 'Покупка улучшений для дома'),
(17, 1, '37.212.39.105', 1680725330, -20000, 'Покупка улучшений для дома'),
(18, 1, '37.212.39.105', 1680725332, -55000, 'Покупка улучшений для дома'),
(19, 1, '37.212.39.105', 1680725334, -60000, 'Покупка улучшений для дома'),
(20, 1, '37.212.39.105', 1680725336, -160000, 'Покупка улучшений для дома'),
(21, 2, '188.163.34.236', 1680760690, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(22, 2, '188.163.34.236', 1680760691, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(23, 2, '188.163.34.236', 1680760692, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(24, 2, '188.163.34.236', 1680760693, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(25, 2, '188.163.34.236', 1680760695, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(26, 2, '188.163.34.236', 1680760696, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(27, 2, '188.163.34.236', 1680760697, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(28, 2, '188.163.34.236', 1680760698, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(29, 2, '188.163.34.236', 1680760700, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(30, 2, '188.163.34.236', 1680760701, 25000000, 'Выдача денег от админа Kizary_Cappone'),
(31, 2, '188.163.34.236', 1680760826, -850000, 'Покупка ТС в автосалоне'),
(32, 2, '188.163.34.236', 1680760826, 10000000, 'Выполнение квеста'),
(33, 2, '188.163.34.236', 1680761100, -50000, 'Покупка улучшения аккаунта'),
(34, 2, '188.163.34.236', 1680761117, -75000, 'Покупка улучшения аккаунта'),
(35, 2, '188.163.34.236', 1680761123, -100000, 'Покупка улучшения аккаунта'),
(36, 2, '188.163.34.236', 1680761128, -125000, 'Покупка улучшения аккаунта'),
(37, 2, '188.163.34.236', 1680761134, -150000, 'Покупка улучшения аккаунта'),
(38, 2, '188.163.34.236', 1680898310, 680000, '[BANK] Продажа личного транспорта'),
(39, 1, '37.212.39.201', 1680932821, -3800000, 'Покупка ТС в автосалоне'),
(40, 1, '37.212.39.201', 1680932821, 10000000, 'Выполнение квеста'),
(41, 1, '37.212.39.201', 1680932924, -250000, 'Покрасил авто'),
(42, 1, '37.212.39.201', 1680932939, -150000, 'Performance Tuning'),
(43, 1, '37.212.39.201', 1680932942, -100000, 'Performance Tuning'),
(44, 1, '37.212.39.201', 1680932944, -70000, 'Performance Tuning'),
(45, 1, '37.212.39.201', 1680932950, -90000, 'Performance Tuning'),
(46, 1, '37.212.39.201', 1680932952, -100000, 'Performance Tuning'),
(47, 1, '37.212.39.201', 1680932953, -70000, 'Performance Tuning'),
(48, 1, '37.212.39.201', 1680932957, -25000, 'Performance Tuning'),
(49, 1, '37.212.39.201', 1680932959, -70000, 'Performance Tuning'),
(50, 1, '37.212.39.201', 1680932960, -50000, 'Performance Tuning'),
(51, 1, '37.212.39.201', 1680932967, -25000, 'Починка транспорта'),
(52, 1, '37.212.39.201', 1680967871, -150, 'Использование аптечки в бизнесе'),
(53, 1, '37.212.39.201', 1680967898, -5000, 'Покупка телефона'),
(54, 1, '37.212.39.201', 1680967898, 5000000, 'Выполнение квеста'),
(55, 4, '5.76.95.25', 1681043350, -100, 'Аренда велика'),
(56, 4, '2.76.202.34', 1681043741, -100, 'Аренда велика'),
(57, 4, '176.222.167.27', 1681044035, -100, 'Аренда велика'),
(58, 5, '46.180.166.86', 1681044241, -100, 'Аренда велика'),
(59, 5, '46.180.166.86', 1681045143, -100, 'Аренда велика'),
(60, 5, '46.180.166.86', 1681045598, -100, 'Аренда велика'),
(61, 5, '46.180.166.86', 1681046105, 6720, 'Зарплата на работе шахтера'),
(62, 4, '176.222.167.27', 1681046203, 5440, 'Зарплата на работе шахтера'),
(63, 5, '46.180.166.86', 1681046452, -100, 'Аренда велика'),
(64, 4, '176.222.167.27', 1681046703, -100, 'Аренда велика'),
(65, 5, '46.180.166.86', 1681046833, -100, 'Аренда велика'),
(66, 5, '46.180.166.86', 1681046945, -100, 'Аренда велика'),
(67, 5, '46.180.166.86', 1681047314, 160, 'Зарплата на работе лесоруба'),
(68, 5, '46.180.166.86', 1681047321, -100, 'Аренда велика'),
(69, 4, '176.222.167.27', 1681047783, 800, 'Зарплата на работе лесоруба'),
(70, 4, '176.222.167.27', 1681047817, -100, 'Аренда велика'),
(71, 5, '46.180.166.86', 1681047894, -100, 'Аренда велика'),
(72, 5, '46.180.166.86', 1681047941, -5000, 'Покупка телефона'),
(73, 5, '46.180.166.86', 1681047941, 5000000, 'Выполнение квеста'),
(74, 5, '46.180.166.86', 1681047958, -450, 'Смена номера телефона[1]'),
(75, 5, '46.180.166.86', 1681047981, -400, 'Покупка лотерейного билета'),
(76, 5, '46.180.166.86', 1681048026, -1000000, 'Покупка бизнеса'),
(77, 5, '46.180.166.86', 1681048109, -15000, 'Покупка улучшений для Бизнеса'),
(78, 5, '46.180.166.86', 1681048114, -30000, 'Покупка улучшений для Бизнеса'),
(79, 5, '46.180.166.86', 1681048118, -80000, 'Покупка улучшений для Бизнеса'),
(80, 5, '46.180.166.86', 1681048120, -150000, 'Покупка улучшений для Бизнеса'),
(81, 5, '46.180.166.86', 1681048123, -300000, 'Покупка улучшений для Бизнеса'),
(82, 5, '46.180.166.86', 1681048126, -450000, 'Покупка улучшений для Бизнеса'),
(83, 5, '46.180.166.86', 1681048220, -150, 'Использование аптечки в бизнесе'),
(84, 5, '46.180.166.86', 1681048229, -2500, 'Покупка наушников в 24/7'),
(85, 5, '46.180.166.86', 1681048263, -200, 'Смена цвета телефона'),
(86, 5, '46.180.166.86', 1681048296, -450, 'Смена номера телефона[1]'),
(87, 4, '176.222.167.27', 1681048382, -100, 'Аренда велика'),
(88, 4, '176.222.167.27', 1681048521, -5000, 'Оплата за вход в бизнес'),
(89, 5, '46.180.166.86', 1681048711, -500, 'Пополнение банк. счета (банк)'),
(90, 5, '46.180.166.86', 1681048735, -5000, 'Пополнение банк. счета (банк)'),
(91, 4, '176.222.167.27', 1681048828, -100, 'Аренда велика'),
(92, 4, '176.222.167.27', 1681048860, 0, '[BANK] Зарплата'),
(93, 5, '46.180.166.86', 1681048860, 0, '[BANK] Зарплата'),
(94, 5, '46.180.166.86', 1681049259, -400, 'Покупка лотерейного билета'),
(95, 3, '95.153.161.156', 1681049287, -100, 'Аренда велика'),
(96, 4, '176.222.167.27', 1681049385, 8800, 'Зарплата на работе шахтера'),
(97, 4, '176.222.167.27', 1681049434, -100, 'Аренда велика'),
(98, 4, '176.222.167.27', 1681049488, -5000, 'Покупка телефона'),
(99, 4, '176.222.167.27', 1681049488, 5000000, 'Выполнение квеста'),
(100, 4, '176.222.167.27', 1681049743, -100, 'Аренда велика'),
(101, 5, '46.180.166.86', 1681050022, -100, 'Аренда велика'),
(102, 4, '176.222.167.27', 1681050242, 50000, 'Выполнение квеста'),
(103, 4, '176.222.167.27', 1681050251, 1600, 'Зарплата на работе грузчика'),
(104, 4, '176.222.167.27', 1681050323, -100, 'Аренда велика'),
(105, 4, '176.222.167.27', 1681050948, -800, 'Покупка парашюта'),
(106, 4, '176.222.167.27', 1681052460, 0, '[BANK] Зарплата'),
(107, 4, '176.222.167.27', 1681052719, -80000, 'Покупка ТС в автосалоне'),
(108, 4, '176.222.167.27', 1681052719, 10000000, 'Выполнение квеста'),
(109, 6, '195.211.216.154', 1681052822, -100, 'Аренда велика'),
(110, 4, '176.222.167.27', 1681052850, -25000, 'Починка транспорта'),
(111, 4, '176.222.167.27', 1681052871, -150000, 'Performance Tuning'),
(112, 4, '176.222.167.27', 1681052873, -100000, 'Performance Tuning'),
(113, 4, '176.222.167.27', 1681052875, -70000, 'Performance Tuning'),
(114, 4, '176.222.167.27', 1681052884, -90000, 'Performance Tuning'),
(115, 4, '176.222.167.27', 1681052886, -100000, 'Performance Tuning'),
(116, 4, '176.222.167.27', 1681052889, -70000, 'Performance Tuning'),
(117, 4, '176.222.167.27', 1681052898, -25000, 'Performance Tuning'),
(118, 4, '176.222.167.27', 1681052900, -70000, 'Performance Tuning'),
(119, 4, '176.222.167.27', 1681052904, -50000, 'Performance Tuning'),
(120, 4, '176.222.167.27', 1681052975, -250000, 'Покрасил авто'),
(121, 4, '176.222.167.27', 1681053000, -300, 'Метка ТС на GPS'),
(122, 7, '95.31.181.2', 1681053121, -100, 'Аренда велика'),
(123, 6, '195.211.216.154', 1681053390, 10000000, 'Выполнение квеста'),
(124, 1, '37.212.39.201', 1681053624, 10000000, 'Выполнение квеста'),
(125, 3, '95.153.161.153', 1681053747, 10000000, 'Выполнение квеста'),
(126, 7, '95.31.181.2', 1681053760, 10000000, 'Выполнение квеста'),
(127, 1, '37.212.39.201', 1681053847, -50000, 'Покупка улучшения аккаунта'),
(128, 1, '37.212.39.201', 1681053851, -75000, 'Покупка улучшения аккаунта'),
(129, 7, '95.31.181.2', 1681055093, 160, 'Зарплата на работе грузчика'),
(130, 7, '95.31.181.2', 1681055744, -300000, 'Покупка бизнеса'),
(131, 7, '95.31.181.2', 1681056060, 5500, '[BANK] Зарплата'),
(132, 7, '95.31.181.2', 1681056231, -100, 'Аренда велика'),
(133, 7, '95.31.181.2', 1681056862, 1000000, 'Выдача денег от админа Sander_Kligan'),
(134, 7, '95.31.181.2', 1681058507, -100, 'Аренда велика'),
(135, 7, '95.31.181.2', 1681058540, -15000, 'Покупка улучшений для Бизнеса'),
(136, 7, '95.31.181.2', 1681058543, -30000, 'Покупка улучшений для Бизнеса'),
(137, 7, '95.31.181.2', 1681058548, -80000, 'Покупка улучшений для Бизнеса'),
(138, 7, '95.31.181.2', 1681058550, -150000, 'Покупка улучшений для Бизнеса'),
(139, 7, '95.31.181.2', 1681058849, 375000, '[BANK] Продажа бизнеса'),
(140, 7, '95.31.181.2', 1681058849, 0, 'Продажа бизнеса государству'),
(141, 5, '46.180.166.86', 1681059660, 0, '[BANK] Зарплата'),
(142, 5, '46.180.166.86', 1681059697, -100, 'Аренда велика'),
(143, 1, '37.212.39.201', 1681059758, -3000, 'Аренда велика'),
(144, 7, '95.31.181.2', 1681059818, -100, 'Аренда велика'),
(145, 1, '37.212.39.201', 1681059894, -3000, 'Аренда велика'),
(146, 7, '95.31.181.2', 1681060110, -200, 'Покупка фотоаппарата'),
(147, 7, '95.31.181.2', 1681060126, -110, 'Покупка маски'),
(148, 7, '95.31.181.2', 1681060140, -5000, 'Покупка телефона'),
(149, 7, '95.31.181.2', 1681060140, 5000000, 'Выполнение квеста'),
(150, 7, '95.31.181.2', 1681060159, -25000, 'Пополнение счета телефона'),
(151, 7, '95.31.181.2', 1681060246, -12000000, 'Покупка бизнеса'),
(152, 5, '46.180.166.86', 1681060365, -5000, 'Оплата за вход в бизнес'),
(153, 5, '46.180.166.86', 1681060408, -150, 'Использование аптечки в бизнесе'),
(154, 7, '95.31.181.2', 1681060415, -15000, 'Покупка улучшений для Бизнеса'),
(155, 7, '95.31.181.2', 1681060419, -30000, 'Покупка улучшений для Бизнеса'),
(156, 7, '95.31.181.2', 1681060421, -80000, 'Покупка улучшений для Бизнеса'),
(157, 7, '95.31.181.2', 1681060424, -150000, 'Покупка улучшений для Бизнеса'),
(158, 7, '95.31.181.2', 1681060426, -300000, 'Покупка улучшений для Бизнеса'),
(159, 7, '95.31.181.2', 1681060429, -450000, 'Покупка улучшений для Бизнеса'),
(160, 7, '95.31.181.2', 1681060452, -150, 'Использование аптечки в бизнесе'),
(161, 1, '37.212.39.201', 1681060901, -1500, 'Аренда велика'),
(162, 5, '46.180.166.86', 1681060902, -800, 'Аренда велика'),
(163, 1, '37.212.39.201', 1681060947, -1500, 'Аренда велика'),
(164, 1, '37.212.39.201', 1681060966, -1500, 'Аренда велика'),
(165, 2, '188.163.34.236', 1681061051, 4000, 'Конвертация доната 1 в игровую валюту'),
(166, 7, '95.31.181.2', 1681061160, 70000, '{00ff08}>> {FFFFFF}Вы успешно завершили заказ'),
(167, 7, '95.31.181.2', 1681061230, -800, 'Аренда велика'),
(168, 7, '95.31.181.2', 1681061964, -800, 'Аренда велика'),
(169, 7, '95.31.181.2', 1681062514, -800, 'Аренда велика'),
(170, 7, '95.31.181.2', 1681062566, -500000, 'Покупка дома'),
(171, 7, '95.31.181.2', 1681062575, -8000, 'Покупка улучшений для дома'),
(172, 7, '95.31.181.2', 1681062577, -14500, 'Покупка улучшений для дома'),
(173, 7, '95.31.181.2', 1681062578, -20000, 'Покупка улучшений для дома'),
(174, 7, '95.31.181.2', 1681062580, -55000, 'Покупка улучшений для дома'),
(175, 7, '95.31.181.2', 1681062582, -60000, 'Покупка улучшений для дома'),
(176, 7, '95.31.181.2', 1681062584, -160000, 'Покупка улучшений для дома'),
(177, 7, '95.31.181.2', 1681062828, -50, 'Аренда велика'),
(178, 1, '37.212.39.201', 1681062858, -50, 'Аренда велика'),
(179, 1, '37.212.39.201', 1681062907, 160, 'Зарплата на работе грузчика'),
(180, 7, '95.31.181.2', 1681062909, 160, 'Зарплата на работе грузчика'),
(181, 1, '37.212.39.201', 1681063217, 160, 'Зарплата на работе грузчика'),
(182, 1, '37.212.39.201', 1681063225, 3040000, '[BANK] Продажа личного транспорта'),
(183, 7, '95.31.181.2', 1681063260, 0, '[BANK] Зарплата'),
(184, 1, '37.212.39.201', 1681063260, 0, '[BANK] Зарплата'),
(185, 7, '95.31.181.2', 1681063315, -780000, 'Покупка ТС в автосалоне'),
(186, 7, '95.31.181.2', 1681063315, 10000000, 'Выполнение квеста'),
(187, 7, '95.31.181.2', 1681063362, 70000, '{00ff08}>> {FFFFFF}Вы успешно завершили заказ'),
(188, 1, '37.212.39.201', 1681063414, 160, 'Зарплата на работе грузчика'),
(189, 7, '95.31.181.2', 1681063610, -50000, 'Покупка улучшения аккаунта'),
(190, 7, '95.31.181.2', 1681063614, -75000, 'Покупка улучшения аккаунта'),
(191, 7, '95.31.181.2', 1681065243, -50, 'Аренда велика'),
(192, 7, '95.31.181.2', 1681065544, -50, 'Аренда велика'),
(193, 7, '95.31.181.2', 1681070253, -1000, 'Пополнение банк. счета (банк)'),
(194, 7, '95.31.181.2', 1681070498, 540500, '[BANK] Продажа дома'),
(195, 7, '95.31.181.2', 1681070498, 0, 'Продажа дома государству'),
(196, 7, '95.31.181.2', 1681070500, -5000000, 'Покупка дома'),
(197, 7, '95.31.181.2', 1681070556, -8000, 'Покупка улучшений для дома'),
(198, 7, '95.31.181.2', 1681070558, -14500, 'Покупка улучшений для дома'),
(199, 7, '95.31.181.2', 1681070560, -20000, 'Покупка улучшений для дома'),
(200, 7, '95.31.181.2', 1681070562, -55000, 'Покупка улучшений для дома'),
(201, 7, '95.31.181.2', 1681070563, -60000, 'Покупка улучшений для дома'),
(202, 7, '95.31.181.2', 1681070566, -160000, 'Покупка улучшений для дома'),
(203, 7, '95.31.181.2', 1681070604, -550, 'Доставка ТС к дому (/home)'),
(204, 7, '95.31.181.2', 1681070982, -150, 'Использование аптечки в бизнесе'),
(205, 7, '95.31.181.2', 1681071346, -50, 'Аренда велика'),
(206, 7, '95.31.181.2', 1681100829, -150, 'Использование аптечки в бизнесе'),
(207, 7, '95.31.181.2', 1681100927, -1900000, 'Покупка ТС в автосалоне'),
(208, 7, '83.220.237.195', 1681102633, -80000, 'Покупка скина (магазин одежды)'),
(209, 7, '83.220.237.195', 1681102633, 5000000, 'Выполнение квеста'),
(210, 7, '83.220.237.195', 1681102715, -50, 'Аренда велика'),
(211, 4, '2.75.27.113', 1681107983, -300, 'Метка ТС на GPS'),
(212, 4, '2.75.27.113', 1681108052, 64000, '[BANK] Продажа личного транспорта'),
(213, 4, '2.75.27.113', 1681108087, -50000, 'Покупка улучшения аккаунта'),
(214, 4, '2.75.27.113', 1681108323, -2800000, 'Покупка ТС в автосалоне'),
(215, 7, '83.220.237.195', 1681109261, 3690500, '[BANK] Продажа дома'),
(216, 7, '83.220.237.195', 1681109261, 0, 'Продажа дома государству'),
(217, 7, '83.220.237.195', 1681109272, 1520000, '[BANK] Продажа личного транспорта'),
(218, 7, '83.220.237.195', 1681109309, -2200000, 'Покупка ТС в автосалоне'),
(219, 7, '83.220.237.195', 1681109789, -50, 'Аренда велика'),
(220, 4, '2.75.27.113', 1681110060, 0, '[BANK] Зарплата'),
(221, 7, '95.31.181.2', 1681125363, -50, 'Аренда велика'),
(222, 1, '37.212.39.201', 1681146969, 320, 'Зарплата на работе грузчика'),
(223, 7, '91.193.176.192', 1681188889, -50, 'Аренда велика'),
(224, 7, '91.193.176.192', 1681188991, -150, 'Использование аптечки в бизнесе'),
(225, 7, '91.193.176.192', 1681189203, -5000000, 'Покупка дома'),
(226, 7, '91.193.176.192', 1681192524, -50, 'Аренда велика'),
(227, 7, '91.193.176.192', 1681199443, -50, 'Аренда велика'),
(228, 7, '91.193.176.192', 1681199627, -50, 'Аренда велика'),
(229, 7, '91.193.176.192', 1681199682, -200000, 'Покупка скина (магазин одежды)'),
(230, 7, '91.193.176.192', 1681199806, -500000, 'Пополнение счета Бизнеса'),
(231, 7, '91.193.176.192', 1681199877, -150, 'Использование аптечки в бизнесе'),
(232, 7, '91.193.176.192', 1681203695, -50, 'Аренда велика'),
(233, 7, '91.193.176.192', 1681210887, -50, 'Аренда велика'),
(234, 7, '91.193.176.192', 1681211063, -150, 'Использование аптечки в бизнесе'),
(235, 7, '91.193.176.192', 1681211272, -50, 'Аренда велика'),
(236, 1, '37.212.39.201', 1681239369, -50, 'Аренда велика'),
(237, 1, '37.212.39.201', 1681240269, -50, 'Аренда велика'),
(238, 1, '37.212.39.201', 1681240629, 160, 'Зарплата на работе грузчика'),
(239, 1, '37.212.19.157', 1681320548, 160, 'Зарплата на работе грузчика');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `company` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `type`, `company`, `amount`, `price`, `time`) VALUES
(4, 1, 3, 8000, 10, 1613060914),
(5, 2, 36, 400, 25, 1613740339),
(15, 2, 10, 10, 200, 1613772592),
(8, 2, 12, 1000, 200, 1613741852),
(9, 2, 35, 1000, 200, 1613742230),
(13, 2, 11, 62, 100, 1613751765);

-- --------------------------------------------------------

--
-- Структура таблицы `ownable_cars`
--

CREATE TABLE `ownable_cars` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `model_id` int(11) NOT NULL,
  `color_1` int(11) NOT NULL DEFAULT -1,
  `color_2` int(11) NOT NULL DEFAULT -1,
  `pos_x` float NOT NULL,
  `pos_y` float NOT NULL,
  `pos_z` float NOT NULL,
  `angle` float NOT NULL,
  `number` varchar(7) NOT NULL DEFAULT '------',
  `status` int(11) NOT NULL,
  `alarm` int(11) NOT NULL,
  `key_in` int(11) NOT NULL,
  `mileage` float NOT NULL,
  `create_time` int(11) NOT NULL,
  `health` float NOT NULL DEFAULT 1000,
  `vinilcar` int(11) NOT NULL,
  `pt_engine` int(11) NOT NULL,
  `pt_brake` int(11) NOT NULL,
  `pt_stability` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `payments`
--

CREATE TABLE `payments` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `sum` int(11) NOT NULL,
  `status` int(11) NOT NULL,
  `name` varchar(24) COLLATE utf8mb4_unicode_ci NOT NULL,
  `billID` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `data_create` datetime NOT NULL,
  `data_accept` datetime NOT NULL DEFAULT current_timestamp(),
  `server_id` int(11) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `payments`
--

INSERT INTO `payments` (`id`, `user_id`, `sum`, `status`, `name`, `billID`, `data_create`, `data_accept`, `server_id`) VALUES
(1, 1515, 20, 0, 'Gena_Lazurkin', 'a714ea56-956b-4a82-9de0-aa54640f59e1', '2021-02-25 13:36:54', '2021-02-25 16:36:54', 1),
(2, 65, 25, 2, 'Tiago_King', 'e3f4902d-3742-4eb7-a858-d241f955e494', '2021-02-25 14:02:35', '2021-02-25 14:06:22', 1),
(3, 2232, 200000000, 0, 'Robert_Versachi', 'f9df68e8-e13c-4b63-a9d7-a61f9f8731a6', '2021-02-25 14:03:38', '2021-02-25 17:03:38', 1),
(4, 65, 10, 2, 'Tiago_King', 'f303d6fc-0212-46cf-aee7-6093cac0ea69', '2021-02-25 14:08:11', '2021-02-25 14:10:33', 1),
(5, 2450, 499, 0, 'Demyan_Medrodore', '6b59e4d7-17c8-4b77-9818-fca65e6e4e5d', '2021-02-25 14:16:57', '2021-02-25 17:16:57', 1),
(6, 425, 25, 0, 'Maxim_Kaipan', 'd626b83d-332d-4631-93d0-cf1acd1a54c1', '2021-02-25 14:17:22', '2021-02-25 17:17:22', 1),
(7, 425, 40, 0, 'Maxim_Kaipan', '89b4068e-f499-41bb-9362-efb5fc79cf0e', '2021-02-25 14:17:58', '2021-02-25 17:17:58', 1),
(8, 2450, 490, 2, 'Demyan_Medrodore', 'd7c7d500-01bc-4c2f-b67f-d18b407baf0c', '2021-02-25 14:29:39', '2021-02-25 14:40:38', 1),
(9, 1952, 50, 0, 'Richard_Squezze', '17e04970-ef38-4e10-be53-1de59cdae20f', '2021-02-25 14:38:22', '2021-02-25 17:38:22', 1),
(10, 1577, 100, 2, 'Ivan_Traiple', 'a2e7ab09-ad6e-4ed9-8618-ea7222e95dc4', '2021-02-25 15:50:15', '2021-02-25 15:52:58', 1),
(11, 1577, 50, 2, 'Ivan_Traiple', 'feba1b5f-45a0-4667-a106-0c8d5a2e9070', '2021-02-25 16:52:49', '2021-02-25 16:54:58', 1),
(12, 1782, 300, 2, 'Tomas_Shelby', '70c8b164-18fd-447d-b411-c255d7f7a2bb', '2021-02-25 20:02:19', '2021-02-25 20:04:31', 1),
(13, 2336, 30, 0, 'Stefan_Perederii', '28ec20b4-4ba1-4760-92e9-1d49af998071', '2021-02-25 20:03:20', '2021-02-25 23:03:20', 1),
(14, 2336, 30, 0, 'Stefan_Perederii', '97803b04-632a-47b6-893e-aeb96c5205c1', '2021-02-25 20:03:36', '2021-02-25 23:03:36', 1),
(15, 2336, 30, 0, 'Stefan_Perederii', '7910eb07-271d-4d23-9854-8c4ba637d4db', '2021-02-25 20:08:31', '2021-02-25 23:08:31', 1),
(16, 2336, 30, 2, 'Stefan_Perederii', 'e696a0af-2858-4549-98c9-c4464590eab1', '2021-02-25 20:13:10', '2021-02-25 20:22:09', 1),
(17, 2705, 300, 0, 'Zahar_Supreme', '8cd91a19-ccbc-42c3-903d-c4a236740fe7', '2021-02-25 20:13:58', '2021-02-25 23:13:58', 1),
(18, 2705, 300, 0, 'Zahar_Supreme', '9ab5f3f7-ff2a-4ae1-8f9f-8199f4c62820', '2021-02-25 20:14:18', '2021-02-25 23:14:18', 1),
(19, 2672, 1000, 0, 'Maksim_Sizov', '389b243b-7e48-4f7b-9064-43bdc2c49d28', '2021-02-25 20:28:41', '2021-02-25 23:28:41', 1),
(20, 2705, 250, 0, 'Zahar_Supreme', '9cee5647-350e-4d6f-8ac0-0ebd98bd420f', '2021-02-25 20:42:53', '2021-02-25 23:42:53', 1),
(21, 2705, 250, 0, 'Zahar_Supreme', 'cf87236f-ce3d-4339-a9b0-112964bfe0e7', '2021-02-25 20:49:48', '2021-02-25 23:49:48', 1),
(22, 2705, 250, 2, 'Zahar_Supreme', 'a304ce10-c7e9-41da-9aa3-f102c7e67ad9', '2021-02-25 21:02:41', '2021-02-25 21:05:27', 1),
(23, 2265, 100, 0, 'Nazar_Tsilinskyi', '06bfb450-903e-4476-b933-2e56580d02b9', '2021-02-25 23:54:35', '2021-02-26 02:54:35', 1),
(24, 2614, 10, 0, 'Under_Graund', '9e8f937c-f896-4155-8298-b6fc2ac61154', '2021-02-26 05:24:00', '2021-02-26 08:24:00', 1),
(25, 2614, 100, 0, 'Under_Graund', '9f30b046-af85-4bb3-8929-eda04c8acd46', '2021-02-26 05:27:33', '2021-02-26 08:27:33', 1),
(26, 1056, 50, 0, 'Ray_Versetty', 'f558b7b9-6598-49aa-9420-5c3af1634d4a', '2021-02-26 07:23:05', '2021-02-26 10:23:05', 1),
(27, 536, 100, 0, 'Alexey_Filatov', '51a62836-8173-4b7f-998f-9827f5f55154', '2021-02-26 08:19:55', '2021-02-26 11:19:55', 1),
(28, 536, 99, 2, 'Alexey_Filatov', 'd1183cbd-f6eb-4ae3-bc81-488ae87fb97b', '2021-02-26 08:24:35', '2021-02-26 08:26:05', 1),
(29, 1056, 48, 2, 'Ray_Versetty', '92f3445f-097f-4f83-a9b1-7b73da9258b9', '2021-02-26 12:00:56', '2021-02-26 12:18:13', 1),
(30, 118, 67, 2, 'Sergey_Emerald', '22058d58-46f3-4d66-93e6-f9e3f69726b9', '2021-02-26 13:51:44', '2021-02-26 13:54:07', 1),
(31, 2830, 50, 0, 'Diaz_Rosenberg', 'abb85466-8189-441a-b014-e60a69312465', '2021-02-26 14:12:44', '2021-02-26 17:12:44', 1),
(32, 2705, 400, 0, 'Zahar_Supreme', '799206f9-b385-47a3-abdf-74db6cc8a45c', '2021-02-26 14:13:38', '2021-02-26 17:13:38', 1),
(33, 2705, 400, 0, 'Zahar_Supreme', '387a8ad8-037e-42d0-866d-d2c47b8780df', '2021-02-26 14:14:28', '2021-02-26 17:14:28', 1),
(34, 2830, 50, 2, 'Diaz_Rosenberg', '1a3c85ad-5d96-4da5-9ba7-3e56e4af07e1', '2021-02-26 14:17:04', '2021-02-26 14:19:22', 1),
(35, 2830, 17, 0, 'Diaz_Rosenberg', '9ec6dc3d-c684-481b-a0b3-b0b173c32482', '2021-02-26 14:23:20', '2021-02-26 17:23:20', 1),
(36, 2898, 100, 0, 'Denis_Sanda', '33f0102c-9ee2-482c-bd8a-ad3be5df4fa8', '2021-02-26 16:37:16', '2021-02-26 19:37:16', 1),
(37, 2898, 100, 0, 'Denis_Sanda', '97fc0e96-1998-4ca5-a96a-21b527e09c93', '2021-02-26 16:38:23', '2021-02-26 19:38:23', 1),
(38, 2495, 100, 0, 'Misha_Shkvarok', 'e51d9ce6-37dd-4e49-87e5-29bdc5155c06', '2021-02-26 18:39:40', '2021-02-26 21:39:40', 1),
(39, 118, 10, 2, 'Sergey_Emerald', '03384209-1415-4cbd-bf33-85d5f34c2b21', '2021-02-26 19:00:16', '2021-02-26 19:03:09', 1),
(40, 3022, 150, 2, 'Vlad_Bichevich', 'b63a34e7-cc35-4e20-afb6-83517c8e63d9', '2021-02-26 22:46:12', '2021-02-26 22:51:32', 1),
(41, 340, 100, 0, 'Timofey_Shavkun', 'f6f6cc53-4ce7-4d81-808c-16e244ee2cd6', '2021-02-26 22:49:25', '2021-02-27 01:49:25', 1),
(42, 2265, 1449, 0, 'Nazar_Tsilinskyi', 'e56e6f90-b850-4e0a-8cf9-896e6336a07c', '2021-02-27 00:26:09', '2021-02-27 03:26:09', 1),
(43, 2265, 100, 0, 'Nazar_Tsilinskyi', 'a7798ec0-01cc-41d3-bc33-e17f45484248', '2021-02-27 00:38:33', '2021-02-27 03:38:33', 1),
(44, 2265, 100, 0, 'Nazar_Tsilinskyi', '4f69ef38-4f5c-4a73-a49f-65887504b4d6', '2021-02-27 00:38:46', '2021-02-27 03:38:46', 1),
(45, 2265, 900, 0, 'Nazar_Tsilinskyi', '6000b122-4fe9-4a2b-8df5-ef1e5a64e8d9', '2021-02-27 00:43:11', '2021-02-27 03:43:11', 1),
(46, 2265, 900, 0, 'Nazar_Tsilinskyi', '5275c8fa-e6f6-4d8f-8f62-3d972178e743', '2021-02-27 00:59:54', '2021-02-27 03:59:54', 1),
(47, 2265, 100, 0, 'Nazar_Tsilinskyi', 'af4f4ff9-f76f-49a5-aaa5-ae482d1208ac', '2021-02-27 01:01:55', '2021-02-27 04:01:55', 1),
(48, 1708, 15, 2, 'Semen_Orlov', '32d3f568-b9f5-4b8e-bdde-6b46b85b7b6b', '2021-02-27 08:54:34', '2021-02-27 08:56:41', 1),
(49, 1708, 10, 2, 'Semen_Orlov', '7b044f21-2bfd-495a-b529-e886e907459f', '2021-02-27 08:58:20', '2021-02-27 09:00:39', 1),
(50, 536, 130, 0, 'Alexey_Filatov', '19e07893-e4c9-46e3-a9f2-b33c27c4159f', '2021-02-27 09:19:28', '2021-02-27 12:19:28', 1),
(51, 536, 129, 2, 'Alexey_Filatov', 'ab4c0ece-47ac-4aa2-ad8d-c971d0405899', '2021-02-27 09:19:59', '2021-02-27 09:20:45', 1),
(52, 536, 16, 2, 'Alexey_Filatov', '9c9e86a1-864b-41fc-b6c3-58d713189f37', '2021-02-27 09:28:30', '2021-02-27 09:29:21', 1),
(53, 1056, 15, 2, 'Ray_Versetty', '5a0b8c58-a652-45f8-85a4-a6593a59400a', '2021-02-27 10:32:59', '2021-02-27 10:46:03', 1),
(54, 1056, 300, 0, 'Ray_Versetty', 'aeb72db3-6232-45fb-bb5b-ce8c7b3ffa02', '2021-02-27 12:01:28', '2021-02-27 15:01:28', 1),
(55, 3102, 100, 0, 'Ramazan_Versace', 'febeb1b7-821d-4bea-aa86-768c484edc96', '2021-02-27 12:24:22', '2021-02-27 15:24:22', 1),
(56, 3102, 500, 2, 'Ramazan_Versace', 'b308cc7a-cb66-48cd-8539-ad4cdb397671', '2021-02-27 12:40:09', '2021-02-27 12:46:57', 1),
(57, 1952, 25, 0, 'Richard_Squezze', '7ff1923b-9e38-43e2-b902-7aad85a10b3e', '2021-02-27 15:43:01', '2021-02-27 18:43:01', 1),
(58, 118, 500, 0, 'Sergey_Emerald', 'dddafd59-fc66-4626-99f9-3da3722817c0', '2021-02-27 16:05:00', '2021-02-27 19:05:00', 1),
(59, 118, 500, 2, 'Sergey_Emerald', 'a96586f3-fdda-4339-9566-2c819ae023f6', '2021-02-27 16:09:48', '2021-02-27 16:13:35', 1),
(60, 590, 50, 0, 'Nikita_Molodd', '3548787d-490e-45f8-ab8f-23bfc3c2d818', '2021-02-28 03:48:07', '2021-02-28 06:48:07', 1),
(61, 590, 50, 0, 'Nikita_Molodd', '8697e75d-b13f-42f4-b9e5-3c129d5592d5', '2021-02-28 03:49:33', '2021-02-28 06:49:33', 1),
(62, 590, 50, 0, 'Nikita_Molodd', '9c5635d3-dcb4-45b1-af70-4ef7b517bff2', '2021-02-28 03:51:34', '2021-02-28 06:51:34', 1),
(63, 590, 50, 0, 'Nikita_Molodd', '5cb44618-6a74-47bf-928f-bdff6908de7c', '2021-02-28 03:53:36', '2021-02-28 06:53:36', 1),
(64, 590, 50, 0, 'Nikita_Molodd', 'f1aeea25-1168-4b9f-98db-aa2a7def42c0', '2021-02-28 03:54:22', '2021-02-28 06:54:22', 1),
(65, 590, 55, 0, 'Nikita_Molodd', '8ec9f986-fa66-4716-951f-2bcb1ca6b5e9', '2021-02-28 05:55:05', '2021-02-28 08:55:05', 1),
(66, 590, 55, 0, 'Nikita_Molodd', 'bd7389a0-c95b-48c4-9102-633463b87a19', '2021-02-28 05:55:47', '2021-02-28 08:55:47', 1),
(67, 590, 100, 0, 'Nikita_Molodd', 'a1225fcd-ead8-4295-a489-ea63525b45dd', '2021-02-28 05:56:23', '2021-02-28 08:56:23', 1),
(68, 590, 50, 0, 'Nikita_Molodd', '54ae838c-4b77-4b48-86f9-c8418de3c71b', '2021-02-28 05:56:37', '2021-02-28 08:56:37', 1),
(69, 590, 50, 0, 'Nikita_Molodd', 'be081ab4-b488-49dd-8c52-ccb69961382d', '2021-02-28 05:56:57', '2021-02-28 08:56:57', 1),
(70, 590, 50, 0, 'Nikita_Molodd', 'd79b89b4-23d1-4c91-82bb-32d69668e331', '2021-02-28 06:05:26', '2021-02-28 09:05:26', 1),
(71, 2791, 400, 0, 'Erzhan_Tenisov', 'c7818f8b-25fe-47fb-a9d8-5cc1ea240e2a', '2021-02-28 06:22:38', '2021-02-28 09:22:38', 1),
(72, 2791, 400, 0, 'Erzhan_Tenisov', 'd0fd7839-54be-47df-bca9-20ffeaf8664f', '2021-02-28 06:44:18', '2021-02-28 09:44:18', 1),
(73, 2791, 395, 0, 'Erzhan_Tenisov', '06efae75-040b-4cb5-bb55-1a751e2e77a6', '2021-02-28 06:45:12', '2021-02-28 09:45:12', 1),
(74, 2791, 393, 0, 'Erzhan_Tenisov', '5dfb2762-0764-4815-b680-be409ed7416a', '2021-02-28 06:45:31', '2021-02-28 09:45:31', 1),
(75, 2791, 390, 0, 'Erzhan_Tenisov', 'c1cbaaaf-7b4b-47aa-ae38-bf38e3f9836b', '2021-02-28 06:47:11', '2021-02-28 09:47:11', 1),
(76, 2791, 398, 0, 'Erzhan_Tenisov', '54153fa8-d04c-47b3-b6fe-5c17f64c1072', '2021-02-28 06:50:28', '2021-02-28 09:50:28', 1),
(77, 2791, 400, 0, 'Erzhan_Tenisov', '0229b32d-7bbb-4686-8974-ec38f3497803', '2021-02-28 06:52:18', '2021-02-28 09:52:18', 1),
(78, 2791, 400, 0, 'Erzhan_Tenisov', '21586e9a-95cd-4d65-93c7-f14574c9bd27', '2021-02-28 06:52:18', '2021-02-28 09:52:18', 1),
(79, 2791, 400, 0, 'Erzhan_Tenisov', '6de7af24-3174-4579-9d02-e725807a2619', '2021-02-28 06:52:30', '2021-02-28 09:52:30', 1),
(80, 261, 100, 0, 'Carlos_Lastro', '5b64d261-7cc5-478e-92c5-3d8d42b05e4b', '2021-02-28 09:20:24', '2021-02-28 12:20:24', 1),
(81, 261, 144, 0, 'Carlos_Lastro', 'd4f86e12-b50c-4284-b549-0c56d526d906', '2021-02-28 09:21:11', '2021-02-28 12:21:11', 1),
(82, 261, 145, 2, 'Carlos_Lastro', '8eaac77d-a7ee-4976-bbc0-15e024e9c0d6', '2021-02-28 09:21:30', '2021-02-28 09:23:18', 1),
(83, 3331, 100, 0, 'Sasha_Nelasov', 'f26b3606-c385-42be-9bb8-94e1b100fc76', '2021-02-28 09:27:17', '2021-02-28 12:27:17', 1),
(84, 1056, 50, 0, 'Ray_Versetty', '2da502af-8301-4d27-9401-30eef514156f', '2021-02-28 10:41:07', '2021-02-28 13:41:07', 1),
(85, 1056, 47, 2, 'Ray_Versetty', 'ad9fa056-bf57-49bb-94dc-262264d10ccd', '2021-02-28 10:41:29', '2021-02-28 11:17:47', 1),
(86, 3331, 180, 0, 'Sasha_Nelasov', '13d87fda-4c74-452d-a529-8b811d8e8a86', '2021-02-28 11:28:13', '2021-02-28 14:28:13', 1),
(87, 3331, 100, 0, 'Sasha_Nelasov', 'c577d819-bf72-4eac-8cbc-f8c6cdeaa009', '2021-02-28 11:30:22', '2021-02-28 14:30:22', 1),
(88, 3331, 150, 2, 'Sasha_Nelasov', '888375cf-4490-45dd-beb9-3b4c03eece45', '2021-02-28 11:30:52', '2021-02-28 11:32:18', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `phone_books`
--

CREATE TABLE `phone_books` (
  `id` int(11) NOT NULL,
  `owner_id` int(11) NOT NULL,
  `name` varchar(21) DEFAULT NULL,
  `number` varchar(9) DEFAULT NULL,
  `time` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `phone_books`
--

INSERT INTO `phone_books` (`id`, `owner_id`, `name`, `number`, `time`) VALUES
(1, 139, 'Almaz_Xan', '2200', 1613049228),
(2, 69, 'Daniil_Dudenkov', '1000548', 1613852350),
(3, 363, 'Ivan_Belozerov', '1000569', 1613892326),
(4, 679, 'Artem_Ford', '100630', 1613917529),
(5, 679, 'Malik_Vakaev', '1000705', 1613925899),
(6, 502, 'Homster', '666', 1613928897),
(7, 502, 'Homster', '6666', 1613928906),
(8, 342, 'Daniil_Dudenkov', '1000548', 1613945999),
(9, 743, 'Ric_Shelby', '1000925', 1613981051),
(10, 363, 'Danya_Golovin', '1000670', 1614033855),
(11, 410, 'Gromik', '232131', 1614062588),
(12, 1194, 'Gena_Genov', '1101179', 1614092178),
(13, 1143, 'Kepis_Fougure', '675432', 1614094898),
(14, 1107, 'Fedot_Pulemet', '1000329', 1614102051),
(15, 340, 'Jesus_Marlboro', '1000874', 1614131253),
(16, 1554, 'Roma_Pavlov', '1000710', 1614173057),
(17, 1554, 'Adam_Morton', '1001500', 1614175852),
(18, 1611, 'Matteo_Fisher', '1001901', 1614179621),
(19, 437, 'Abu_bandit', '44444', 1614205522),
(20, 2039, 'Matteo_Fresh', '1002039', 1614259937),
(21, 2426, 'Diego_Bonsak', '1002397', 1614277547),
(22, 2727, 'Maxim_Horizon', '1000636', 1614306373),
(23, 363, 'Joseph_Eagels', '1002727', 1614306400),
(24, 2560, 'Rodion_Demchenko', '1002511', 1614338341),
(25, 2588, 'Aleksandr_Sufiev', '1000058', 1614349329),
(26, 291, 'Joe_klein', '939383', 1614351174),
(27, 1492, 'Denis_Rockfeller', '1000181', 1614352559),
(28, 2705, 'Conor_McGregor', '1001065', 1614355119),
(29, 1492, 'Maks_Krasnov', '1000465', 1614355588),
(30, 199, 'Oscar', '123', 1614362370),
(31, 199, 'Aby_Bandit', '213', 1614362427),
(32, 1765, 'Zahar_Supreme', '1002705', 1614368006),
(33, 3004, 'Dima_Lipton', '1002319', 1614370216),
(34, 743, 'Karina_Makinova', '1003024', 1614413620),
(35, 3024, 'Stepa_Bandos', '1002906', 1614415470),
(36, 247, 'Alina_Ivanov', '1002746', 1614447990),
(37, 2426, 'Danil_Krytoq', '1003092', 1614448919),
(38, 3092, 'Evgeni_linniks', '1002426', 1614448968),
(39, 3176, 'Lexa_Gardotiv', '1002946', 1614451992),
(40, 2086, 'Maksim_Sizov', '1002672', 1614453058),
(41, 3301, 'Kizaru_Grovis', '1003300', 1614476365),
(43, 3101, 'Vladik_Medrodore', '1002261', 1614489784),
(44, 3301, 'Vladik_Medrodore', '1002261', 1614492334);

-- --------------------------------------------------------

--
-- Структура таблицы `promocode`
--

CREATE TABLE `promocode` (
  `id` int(11) NOT NULL,
  `code` varchar(32) CHARACTER SET utf8 NOT NULL,
  `type` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `usings` int(11) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `promocode_activations`
--

CREATE TABLE `promocode_activations` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `code` varchar(32) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `quick_message`
--

CREATE TABLE `quick_message` (
  `name` varchar(64) COLLATE utf8_bin NOT NULL,
  `text_1` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №1',
  `text_2` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №2',
  `text_3` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №3',
  `text_4` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №4',
  `text_5` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №5',
  `text_6` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №6',
  `text_7` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №7',
  `text_8` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №8',
  `text_9` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №9',
  `text_10` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №10',
  `text_11` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №11',
  `text_12` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №12',
  `text_13` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №13',
  `text_14` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №14',
  `text_15` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №15',
  `text_16` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №16',
  `text_17` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №17',
  `text_18` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №18',
  `text_19` varchar(128) COLLATE utf8_bin NOT NULL DEFAULT 'Введите текст для поля №19',
  `text_20` varchar(128) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `quick_message`
--

INSERT INTO `quick_message` (`name`, `text_1`, `text_2`, `text_3`, `text_4`, `text_5`, `text_6`, `text_7`, `text_8`, `text_9`, `text_10`, `text_11`, `text_12`, `text_13`, `text_14`, `text_15`, `text_16`, `text_17`, `text_18`, `text_19`, `text_20`) VALUES
('oscar_dev', 'Я @name состаю в организации @frac', 'Я смотрю порно', 'Я гей', '/do срет', '/me пахнет', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', ''),
('oscar_dev', 'Введите текст для поля №1', 'Введите текст для поля №2', 'Введите текст для поля №3', 'Введите текст для поля №4', 'Введите текст для поля №5', 'Введите текст для поля №6', 'Введите текст для поля №7', 'Введите текст для поля №8', 'Введите текст для поля №9', 'Введите текст для поля №10', 'Введите текст для поля №11', 'Введите текст для поля №12', 'Введите текст для поля №13', 'Введите текст для поля №14', 'Введите текст для поля №15', 'Введите текст для поля №16', 'Введите текст для поля №17', 'Введите текст для поля №18', 'Введите текст для поля №19', '');

-- --------------------------------------------------------

--
-- Структура таблицы `repositories`
--

CREATE TABLE `repositories` (
  `id` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `action_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `description` varchar(64) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `repositories`
--

INSERT INTO `repositories` (`id`, `type`, `action_id`, `amount`, `description`) VALUES
(1, 0, 0, 40192, 'Шахта, металл'),
(2, 0, 1, 0, 'Шахта, руда'),
(3, 1, 0, 153, 'Завод, металл'),
(4, 1, 1, 8091, 'Завод, топливо'),
(5, 1, 2, 59913, 'Завод, продукты'),
(6, 3, 0, 98393, 'Склад армии, металл'),
(7, 3, 1, 153749, 'Склад армии, патроны'),
(8, 4, 0, 2000, 'Лесопилка, дерево');

-- --------------------------------------------------------

--
-- Структура таблицы `return_money`
--

CREATE TABLE `return_money` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `money` int(11) NOT NULL,
  `description` varchar(64) CHARACTER SET utf8 NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `return_money`
--

INSERT INTO `return_money` (`id`, `uid`, `money`, `description`, `status`) VALUES
(1, 1, 25000000, 'слет дома', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `server_settings`
--

CREATE TABLE `server_settings` (
  `admin_price` int(11) NOT NULL DEFAULT 80,
  `helper_price` int(11) NOT NULL DEFAULT 40,
  `distrub` int(11) NOT NULL DEFAULT 1,
  `donpower` int(11) NOT NULL DEFAULT 1,
  `GiveCoins` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `tickets`
--

CREATE TABLE `tickets` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `description` varchar(64) NOT NULL,
  `issuer` varchar(32) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `trunks`
--

CREATE TABLE `trunks` (
  `id` int(11) NOT NULL,
  `oc_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `value` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `trunks`
--

INSERT INTO `trunks` (`id`, `oc_id`, `item_id`, `amount`, `value`) VALUES
(16, 6425, 5, 600, 0),
(6, 4851, 3, 2, 0),
(7, 4851, 2, 15, 0),
(8, 4851, 2, 15, 0),
(9, 4851, 2, 15, 0),
(10, 4851, 2, 15, 0),
(18, 6774, 1, 1000000, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `unitpay_payments`
--

CREATE TABLE `unitpay_payments` (
  `id` int(10) NOT NULL,
  `unitpayId` varchar(255) NOT NULL,
  `account` varchar(255) NOT NULL,
  `sum` float NOT NULL,
  `itemsCount` int(11) NOT NULL DEFAULT 1,
  `dateCreate` datetime NOT NULL,
  `dateComplete` datetime DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `unitpay_payments`
--

INSERT INTO `unitpay_payments` (`id`, `unitpayId`, `account`, `sum`, `itemsCount`, `dateCreate`, `dateComplete`, `status`) VALUES
(1, '50444', 'test', 10, 10, '2021-02-03 13:51:19', NULL, 0),
(2, '94317', 'test', 10, 10, '2021-02-03 13:52:29', NULL, 0),
(3, '12283', 'test', 10, 10, '2021-02-03 13:52:56', NULL, 0),
(4, '15515', 'test', 10, 10, '2021-02-03 13:53:57', NULL, 0),
(5, '63303', 'test', 10, 10, '2021-02-03 13:54:16', NULL, 0),
(6, '33910', 'test', 10, 10, '2021-02-03 13:54:19', NULL, 0),
(7, '24468', 'test', 10, 10, '2021-02-03 13:54:33', NULL, 0),
(8, '64234', 'test', 10, 10, '2021-02-03 13:55:19', NULL, 0),
(9, '87313', 'test', 10, 10, '2021-02-04 06:37:22', NULL, 0),
(10, '96828', 'test', 10, 10, '2021-02-04 12:50:20', NULL, 0),
(11, '88078', 'test', 10, 10, '2021-02-05 07:18:11', NULL, 0),
(12, '46021', 'test', 10, 10, '2021-02-05 07:21:50', NULL, 0),
(13, '28251', 'test', 10, 10, '2021-02-05 10:55:44', NULL, 0),
(14, '91758', 'test', 10, 10, '2021-02-05 17:03:41', NULL, 0),
(15, '91439', 'test', 10, 10, '2021-02-05 17:24:55', NULL, 0),
(16, '89487', 'test', 10, 10, '2021-02-05 17:31:23', NULL, 0),
(17, '39800', 'test', 10, 10, '2021-02-08 06:53:38', NULL, 0),
(18, '68165', 'test', 10, 10, '2021-02-10 14:37:33', NULL, 0),
(19, '1935288461', 'Alekseevich', 19, 11, '2021-02-10 14:38:19', '2021-02-10 14:38:48', 0),
(20, '99947', 'test', 10, 10, '2021-02-10 14:39:22', NULL, 0),
(21, '21301', 'test', 10, 10, '2021-02-17 07:30:27', NULL, 0),
(22, '53912', 'test', 10, 10, '2021-02-17 07:33:49', NULL, 0),
(23, '10303', 'test', 10, 10, '2021-02-20 11:13:49', NULL, 0),
(24, '1950919373', 'Vicent_Hatake', 160, 160, '2021-02-20 11:26:58', '2021-02-20 11:27:54', 0),
(25, '88706', 'test', 10, 10, '2021-02-20 11:38:22', NULL, 0),
(26, '1950962561', 'Costa_Elite', 50, 50, '2021-02-20 12:09:44', NULL, 0),
(27, '1950972245', 'Maks_Raevskiy ', 40, 40, '2021-02-20 12:18:27', NULL, 0),
(28, '1950974021', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:20:06', NULL, 0),
(29, '1950978287', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:23:50', NULL, 0),
(30, '1950978305', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:23:51', NULL, 0),
(31, '1950978317', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:23:52', NULL, 0),
(32, '1950988469', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:32:50', NULL, 0),
(33, '1950991589', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:35:38', NULL, 0),
(34, '1951000157', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:43:21', NULL, 0),
(35, '1951004633', 'Maks_Raevskiy ', 30, 30, '2021-02-20 12:46:47', NULL, 0),
(36, '1951004765', 'Dima_Boarskih', 100, 100, '2021-02-20 12:46:51', NULL, 0),
(37, '1951006043', 'Maks_Raevskiy ', 25, 25, '2021-02-20 12:47:59', NULL, 0),
(38, '1951009451', 'Maks_Raevskiy ', 40, 40, '2021-02-20 12:50:57', NULL, 0),
(39, '1951034789', 'Dima_Boarskih', 250, 250, '2021-02-20 13:12:41', '2021-02-20 13:13:15', 0),
(40, '1951082741', 'Maks_Raevskiy ', 50, 50, '2021-02-20 13:52:40', NULL, 0),
(41, '1951085963', 'Maks_Raevskiy ', 40, 40, '2021-02-20 13:55:11', NULL, 0),
(42, '1951087163', 'Maks_Raevskiy ', 20, 20, '2021-02-20 13:56:04', '2021-02-20 14:12:14', 0),
(43, '1951091543', 'Maks_Raevskiy ', 30, 30, '2021-02-20 13:59:32', NULL, 0),
(44, '30601', 'test', 10, 10, '2021-02-20 21:18:56', NULL, 0),
(45, '1952212067', 'Costa_Elite', 50, 50, '2021-02-21 11:51:39', '2021-02-21 12:00:28', 0),
(46, '1952485163', 'Sergei_Novik', 100, 100, '2021-02-21 15:33:03', '2021-02-21 15:36:26', 0),
(47, '1952501807', 'Obito_Akatsuki', 150, 150, '2021-02-21 15:45:01', '2021-02-21 15:45:18', 1),
(48, '1953080705', 'Maksim_Rebrov', 500, 500, '2021-02-21 22:46:06', NULL, 0),
(49, '1953081833', 'Maksim_Rebrov', 490, 490, '2021-02-21 22:47:08', NULL, 0),
(50, '1953185693', 'Marcus_Vorov ', 100, 100, '2021-02-22 00:35:02', NULL, 0),
(51, '1953186077', 'Marcus_Vorov ', 100, 100, '2021-02-22 00:35:29', NULL, 0),
(52, '13959', 'test', 10, 10, '2021-02-22 07:32:40', NULL, 0),
(53, '1953512075', 'Dima_Boarskih', 250, 250, '2021-02-22 11:41:30', '2021-02-22 11:42:01', 0),
(54, '1953580973', 'Marcus_Vorov ', 300, 300, '2021-02-22 12:41:29', '2021-02-22 12:41:47', 0),
(55, '1953867251', 'Nastya_Liepa', 40, 40, '2021-02-22 16:13:39', '2021-02-22 16:20:27', 0),
(56, '1953886901', 'Marcus_Vorov ', 100, 100, '2021-02-22 16:27:18', '2021-02-22 16:27:35', 0),
(57, '1954072655', 'Dima_Boarskih', 300, 300, '2021-02-22 18:32:14', '2021-02-22 18:32:43', 0),
(58, '1954316513', 'Kizaru_Angelocheck', 30, 30, '2021-02-22 21:16:02', NULL, 0),
(59, '23897', 'test', 10, 10, '2021-02-22 23:01:00', NULL, 0),
(60, '1954695605', 'Angel_Creyzz ', 10, 10, '2021-02-23 07:43:45', '2021-02-23 07:50:19', 0),
(61, '1954707611', 'Angel_Creyzz ', 30, 30, '2021-02-23 08:10:22', '2021-02-23 08:20:26', 0),
(62, '1954710917', 'Angel_Creyzz ', 10, 10, '2021-02-23 08:16:20', NULL, 0),
(63, '1954825493', 'Angel_Creyzz ', 50, 50, '2021-02-23 10:34:51', '2021-02-23 10:40:19', 0),
(64, '1954841189', 'Vadum_Normov', 400, 400, '2021-02-23 10:48:33', '2021-02-23 10:48:55', 0),
(65, '1954938053', 'Kizaru_Lorenzo', 10, 10, '2021-02-23 12:02:09', '2021-02-23 12:10:32', 1),
(66, '1954964789', 'Angel_Creyzz ', 100, 100, '2021-02-23 12:20:02', NULL, 0),
(67, '1954965965', 'Angel_Creyzz ', 95, 95, '2021-02-23 12:20:56', NULL, 0),
(68, '1954967555', 'Angel_Creyzz ', 90, 90, '2021-02-23 12:22:11', '2021-02-23 12:30:38', 0),
(69, '1955086211', 'Kizaru_Lorenzo', 100, 100, '2021-02-23 13:37:44', NULL, 0),
(70, '1955087387', 'Kizaru_Lorenzo', 250, 250, '2021-02-23 13:38:28', NULL, 0),
(71, '1955093357', 'Kizaru_Lorenzo', 140, 140, '2021-02-23 13:42:16', NULL, 0),
(72, '1955095547', 'Kizaru_Lorenzo', 100, 100, '2021-02-23 13:43:37', NULL, 0),
(73, '1955168909', 'Kizaru_Lorenzo', 250, 250, '2021-02-23 14:28:52', NULL, 0),
(74, '1955170955', 'Kizaru_Lorenzo', 246, 246, '2021-02-23 14:30:07', NULL, 0),
(75, '1955199845', 'Kizaru_Lorenzo', 230, 230, '2021-02-23 14:47:58', NULL, 0),
(76, '1955325641', 'Angel_Creyzz ', 90, 90, '2021-02-23 16:04:58', '2021-02-23 16:10:21', 0),
(77, '1955454749', 'Alex_Root', 80, 80, '2021-02-23 17:22:55', '2021-02-23 17:23:14', 0),
(78, '1955539709', 'Alex_Root', 50, 50, '2021-02-23 18:15:34', '2021-02-23 18:16:01', 0),
(79, '1955554421', 'Alec_Root', 5, 5, '2021-02-23 18:24:34', '2021-02-23 18:24:54', 1),
(80, '1955587469', 'Tima_Forestry', 40, 40, '2021-02-23 18:45:16', '2021-02-23 18:45:31', 0),
(81, '1955593577', 'Tima_Forestry', 40, 40, '2021-02-23 18:49:08', '2021-02-23 18:49:22', 0),
(82, '1955603927', 'Tima_Forestry', 40, 40, '2021-02-23 18:56:00', '2021-02-23 18:56:14', 0),
(83, '1955730077', 'Carter_Winston', 40, 40, '2021-02-23 20:18:43', '2021-02-23 20:31:20', 1),
(84, '1955739863', 'Tima_Forestry', 120, 120, '2021-02-23 20:25:19', NULL, 0),
(85, '1955743667', 'Tima_Forestry', 40, 40, '2021-02-23 20:27:53', NULL, 0),
(86, '31384', 'test', 10, 10, '2021-02-26 05:27:23', NULL, 0),
(87, '1958938757', 'Alex_Root', 100, 100, '2021-02-26 14:46:25', '2021-02-26 14:46:45', 0),
(88, '1959027491', 'Stefan_Perederii', 100, 100, '2021-02-26 15:51:34', NULL, 0),
(89, '1959142553', 'Zahar_Supreme ', 400, 400, '2021-02-26 17:14:51', '2021-02-26 17:20:18', 0),
(90, '12189', 'test', 10, 10, '2021-02-26 18:53:18', NULL, 0),
(91, '1959304847', 'Richard_Squezze', 40, 40, '2021-02-26 19:08:13', NULL, 0),
(92, '1959350615', 'Richard_Squezze', 40, 40, '2021-02-26 19:39:07', '2021-02-26 19:50:58', 1),
(93, '1959405425', 'Stefan_Perederii', 200, 200, '2021-02-26 20:14:53', '2021-02-26 20:15:24', 0),
(94, '1959791339', 'Nazar_Tsilinskyi', 100, 100, '2021-02-27 03:37:44', NULL, 0),
(95, '88241', 'test', 10, 10, '2021-02-27 06:09:07', NULL, 0),
(96, '1959834803', 'Vika_Krylova', 200, 200, '2021-02-27 06:37:44', '2021-02-27 06:38:18', 0),
(97, '1960025159', 'Angel_Creyzz ', 24, 24, '2021-02-27 11:41:19', '2021-02-27 11:50:36', 0),
(98, '1960026359', 'Angel_Creyzz ', 11, 11, '2021-02-27 11:42:31', '2021-02-27 11:50:24', 0),
(99, '1960356185', 'Stas_Pastushenko', 50, 50, '2021-02-27 16:15:38', '2021-02-27 16:15:58', 0),
(100, '1960360883', 'Stas_Pastushenko', 25, 25, '2021-02-27 16:18:59', '2021-02-27 16:19:34', 0),
(101, '1960365149', 'Stas_Pastushenko', 150, 150, '2021-02-27 16:22:29', '2021-02-27 16:22:43', 0),
(102, '1960405757', 'Vovan_Pastushenko', 100, 100, '2021-02-27 16:52:47', '2021-02-27 16:53:05', 0),
(103, '1960818023', 'Vladimir-Boitsov', 100, 100, '2021-02-27 21:59:44', '2021-02-27 22:00:33', 1),
(104, '1961115149', 'Aleksandr_Sufiev', 22, 22, '2021-02-28 07:18:44', NULL, 0),
(105, '1961115731', 'Aleksandr_Sufiev', 20, 20, '2021-02-28 07:20:36', NULL, 0),
(106, '1961116481', 'Aleksandr_Sufiev', 22, 22, '2021-02-28 07:23:09', '2021-02-28 07:23:49', 0),
(107, '1961154461', 'Nikita_Molod ', 50, 50, '2021-02-28 08:57:20', '2021-02-28 08:57:25', 1),
(108, '1961184989', ' Erzhan_Tenisov', 392, 392, '2021-02-28 09:50:09', NULL, 0),
(109, '1961186975', ' Erzhan_Tenisov', 400, 400, '2021-02-28 09:53:06', '2021-02-28 09:53:31', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `whitelist`
--

CREATE TABLE `whitelist` (
  `id` int(11) NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `ytpromocode`
--

CREATE TABLE `ytpromocode` (
  `id` int(11) NOT NULL,
  `code` varchar(32) CHARACTER SET utf8 NOT NULL,
  `type` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `usings` int(11) NOT NULL,
  `paydays` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `accounts`
--
ALTER TABLE `accounts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `name` (`name`),
  ADD KEY `email` (`email`),
  ADD KEY `phone` (`phone`),
  ADD KEY `house` (`house`);

--
-- Индексы таблицы `aclogs`
--
ALTER TABLE `aclogs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `action_log`
--
ALTER TABLE `action_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `bank_accounts_log`
--
ALTER TABLE `bank_accounts_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ban_list`
--
ALTER TABLE `ban_list`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `business`
--
ALTER TABLE `business`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `business_gps`
--
ALTER TABLE `business_gps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `bid` (`bid`);

--
-- Индексы таблицы `business_profit`
--
ALTER TABLE `business_profit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`bid`),
  ADD KEY `view` (`view`);

--
-- Индексы таблицы `car_obmen`
--
ALTER TABLE `car_obmen`
  ADD UNIQUE KEY `car_1` (`car_1`,`car_2`,`car_3`,`car_4`,`car_5`);

--
-- Индексы таблицы `change_names`
--
ALTER TABLE `change_names`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Индексы таблицы `charity`
--
ALTER TABLE `charity`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uid` (`uid`);

--
-- Индексы таблицы `debug`
--
ALTER TABLE `debug`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `donate_log`
--
ALTER TABLE `donate_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `donations`
--
ALTER TABLE `donations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `entrances`
--
ALTER TABLE `entrances`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `family`
--
ALTER TABLE `family`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `family_cars`
--
ALTER TABLE `family_cars`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`owner_id`,`model_id`,`color_1`,`color_2`,`rang`,`pos_x`,`pos_y`,`pos_z`,`angle`,`fuel`);

--
-- Индексы таблицы `fuel_stations`
--
ALTER TABLE `fuel_stations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `fuel_stations_profit`
--
ALTER TABLE `fuel_stations_profit`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`fid`),
  ADD KEY `view` (`view`);

--
-- Индексы таблицы `full_dostup`
--
ALTER TABLE `full_dostup`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gang_repositories`
--
ALTER TABLE `gang_repositories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gang_zones`
--
ALTER TABLE `gang_zones`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gift`
--
ALTER TABLE `gift`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `gift_lose`
--
ALTER TABLE `gift_lose`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `hotels`
--
ALTER TABLE `hotels`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `houses`
--
ALTER TABLE `houses`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `houses_renters`
--
ALTER TABLE `houses_renters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`),
  ADD KEY `house_id` (`house_id`);

--
-- Индексы таблицы `leaders`
--
ALTER TABLE `leaders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `money_log`
--
ALTER TABLE `money_log`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ownable_cars`
--
ALTER TABLE `ownable_cars`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `phone_books`
--
ALTER TABLE `phone_books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `owner_id` (`owner_id`);

--
-- Индексы таблицы `promocode`
--
ALTER TABLE `promocode`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `promocode_activations`
--
ALTER TABLE `promocode_activations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `repositories`
--
ALTER TABLE `repositories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `type` (`type`,`action_id`);

--
-- Индексы таблицы `return_money`
--
ALTER TABLE `return_money`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tickets`
--
ALTER TABLE `tickets`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `trunks`
--
ALTER TABLE `trunks`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `whitelist`
--
ALTER TABLE `whitelist`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `ytpromocode`
--
ALTER TABLE `ytpromocode`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `accounts`
--
ALTER TABLE `accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `aclogs`
--
ALTER TABLE `aclogs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `action_log`
--
ALTER TABLE `action_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=957;

--
-- AUTO_INCREMENT для таблицы `bank_accounts`
--
ALTER TABLE `bank_accounts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `bank_accounts_log`
--
ALTER TABLE `bank_accounts_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `ban_list`
--
ALTER TABLE `ban_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `business`
--
ALTER TABLE `business`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT для таблицы `business_gps`
--
ALTER TABLE `business_gps`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;

--
-- AUTO_INCREMENT для таблицы `business_profit`
--
ALTER TABLE `business_profit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT для таблицы `change_names`
--
ALTER TABLE `change_names`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `charity`
--
ALTER TABLE `charity`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT для таблицы `debug`
--
ALTER TABLE `debug`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `donate_log`
--
ALTER TABLE `donate_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT для таблицы `donations`
--
ALTER TABLE `donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `entrances`
--
ALTER TABLE `entrances`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT для таблицы `family`
--
ALTER TABLE `family`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `family_cars`
--
ALTER TABLE `family_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `fuel_stations`
--
ALTER TABLE `fuel_stations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `fuel_stations_profit`
--
ALTER TABLE `fuel_stations_profit`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `full_dostup`
--
ALTER TABLE `full_dostup`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `gang_repositories`
--
ALTER TABLE `gang_repositories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `gang_zones`
--
ALTER TABLE `gang_zones`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT для таблицы `gift`
--
ALTER TABLE `gift`
  MODIFY `id` int(16) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT для таблицы `gift_lose`
--
ALTER TABLE `gift_lose`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=505;

--
-- AUTO_INCREMENT для таблицы `hotels`
--
ALTER TABLE `hotels`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT для таблицы `houses`
--
ALTER TABLE `houses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=572;

--
-- AUTO_INCREMENT для таблицы `houses_renters`
--
ALTER TABLE `houses_renters`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=229;

--
-- AUTO_INCREMENT для таблицы `leaders`
--
ALTER TABLE `leaders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `money_log`
--
ALTER TABLE `money_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=240;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT для таблицы `ownable_cars`
--
ALTER TABLE `ownable_cars`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT для таблицы `phone_books`
--
ALTER TABLE `phone_books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT для таблицы `promocode`
--
ALTER TABLE `promocode`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `promocode_activations`
--
ALTER TABLE `promocode_activations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `repositories`
--
ALTER TABLE `repositories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `return_money`
--
ALTER TABLE `return_money`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `tickets`
--
ALTER TABLE `tickets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `trunks`
--
ALTER TABLE `trunks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `unitpay_payments`
--
ALTER TABLE `unitpay_payments`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=110;

--
-- AUTO_INCREMENT для таблицы `whitelist`
--
ALTER TABLE `whitelist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `ytpromocode`
--
ALTER TABLE `ytpromocode`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
