enum server_hitman_system
{
	cZakaz,
	cHitman,
};
new ContractInfo[MAX_PLAYERS][server_hitman_system];

stock SetSpawnInfoEx(playerid, skin, Float:x, Float:y, Float:z, Float:angle)
{
	setX[playerid] = x;
	setY[playerid] = y;
	setZ[playerid] = z;
	SetSpawnInfo(playerid, GetPlayerTeam(playerid), skin, x, y, z, angle, -1, -1, -1, -1, -1, -1);
} 

stock SetPlayerPosAC(playerid, Float:x, Float:y, Float:z, worldid = -1, interiorid = -1, setUP = false)
{
    if (playerid == INVALID_PLAYER_ID) return false; 
	if (!setUP)
	{
		if (worldid != -1)
		{
			pTemp[playerid][tVirtualWorld] = worldid;
			SetPlayerVirtualWorld(playerid, worldid);
		}
		if (interiorid != -1)
		{
			pTemp[playerid][tInterior] = interiorid;
			SetPlayerInterior(playerid, interiorid);
			if (!interiorid) SetPlayerTime(playerid, hour, minute);
			else SetPlayerTime(playerid, 11, 00);
		}
	}
	else
	{
		if (worldid != -1) SetPlayerVirtualWorld(playerid, worldid);
		if (interiorid != -1) SetPlayerInterior(playerid, interiorid);
		if (!interiorid) SetPlayerTime(playerid, hour, minute);
		else SetPlayerTime(playerid, 11, 00);
	} 
	SetPlayerPos(playerid, x, y, z);
	SetCameraBehindPlayer(playerid);
	#if defined _ac_ser_inc
		AC_Info[playerid][acSetPos] = GetTickCount() + 3250;
	#endif
	pTemp [ playerid ] [ tIgnorePick ] = 5;

	LoadTextures(playerid);

	return true; 
}

stock ac_Kick(playerid)
{
	//SavePlayerID(playerid);
	SetTimerEx("PlayerKick", 500, false, "d", playerid);
	return 1;
}
publics: PlayerKick(playerid) return Kick(playerid);
#define Kick ac_Kick
stock scmKick(playerid, const reason[], color = COLOR_LIGHTRED) {
	SendClientMessage(playerid, color, reason);
	KickEx(playerid);
	return 1;
}
stock SetPlayerWantedLevelEx(playerid, wantedlevel)
{
    if (pInfo[playerid][pWantedLevel] > 6) pInfo[playerid][pWantedLevel] = 6;
	else pInfo[playerid][pWantedLevel] = wantedlevel;
	
	return SetPlayerWantedLevel(playerid, pInfo[playerid][pWantedLevel]);
} 

enum E_HUNTER_DEER_JOB {
    Float: deerPos[3],
    bool: deerSpawned,
    bool: deerKilled,
	bool: deerUsePlayer,
    deerObject,
    Text3D: deerText,
    deerCoolDown,
};
new  gDeerHunterInfo[][E_HUNTER_DEER_JOB] = {
	{{-497.448089, -2184.120117, 56.615821}, false, false, false, -1, Text3D: -1, 0},
	{{-525.982421, -2182.714111, 55.475837}, false, false, false, -1, Text3D: -1, 0},
	{{-679.097045, -2492.540283, 37.040039}, false, false, false, -1, Text3D: -1, 0},
	{{-769.814636, -2494.437011, 78.879150}, false, false, false, -1, Text3D: -1, 0},
	{{-747.494079, -2482.708251, 73.542350}, false, false, false, -1, Text3D: -1, 0},
	{{-583.563842, -2474.565185, 58.654304}, false, false, false, -1, Text3D: -1, 0},
	{{-573.506591, -2507.612304, 68.424957}, false, false, false, -1, Text3D: -1, 0},
	{{-556.248291, -2504.915283, 73.210540}, false, false, false, -1, Text3D: -1, 0},
	{{-573.338195, -2457.160400, 57.945663}, false, false, false, -1, Text3D: -1, 0},
	{{-697.068969, -2453.698242, 67.455856}, false, false, false, -1, Text3D: -1, 0},
	{{-645.548461, -2272.896484, 26.797964}, false, false, false, -1, Text3D: -1, 0},
	{{-682.580749, -2145.711425, 24.273199}, false, false, false, -1, Text3D: -1, 0},
	{{-733.383300, -2143.369873, 25.547155}, false, false, false, -1, Text3D: -1, 0},
	{{-770.401062, -2158.622314, 25.173139}, false, false, false, -1, Text3D: -1, 0},
	{{-739.397766, -2241.982910, 26.721063}, false, false, false, -1, Text3D: -1, 0},
	{{-599.758361, -2232.163818, 25.545936}, false, false, false, -1, Text3D: -1, 0},
	{{-647.863525, -2144.903564, 24.645931}, false, false, false, -1, Text3D: -1, 0},
	{{-578.571044, -2318.229248, 27.506053}, false, false, false, -1, Text3D: -1, 0},
	{{-590.001464, -2328.718017, 28.326562}, false, false, false, -1, Text3D: -1, 0},
	{{-696.134094, -2343.342285, 36.307662}, false, false, false, -1, Text3D: -1, 0},
	{{-704.494873, -2477.138427, 69.260040}, false, false, false, -1, Text3D: -1, 0},
	{{-642.665649, -2415.849365, 31.011455}, false, false, false, -1, Text3D: -1, 0},
	{{-624.552246, -2417.117919, 28.953720}, false, false, false, -1, Text3D: -1, 0},
	{{-614.694763, -2407.305175, 27.992204}, false, false, false, -1, Text3D: -1, 0},
	{{-734.027526, -2118.675048, 24.822170}, false, false, false, -1, Text3D: -1, 0},
	{{-770.490173, -2304.030029, 37.733295}, false, false, false, -1, Text3D: -1, 0},
	{{-803.823547, -2378.038818, 55.695987}, false, false, false, -1, Text3D: -1, 0},
	{{-710.114868, -2368.512451, 45.210960}, false, false, false, -1, Text3D: -1, 0},
	{{-643.696777, -2314.751708, 34.918426}, false, false, false, -1, Text3D: -1, 0},
	{{-586.649475, -2254.486083, 25.197885}, false, false, false, -1, Text3D: -1, 0},
	{{-531.797973, -2302.297851, 29.777660}, false, false, false, -1, Text3D: -1, 0},
	{{-713.791992, -2151.640380, 23.694490}, false, false, false, -1, Text3D: -1, 0},
	{{-584.114196, -2297.950439, 27.188337}, false, false, false, -1, Text3D: -1, 0},
	{{-514.294982, -2225.773681, 42.092380}, false, false, false, -1, Text3D: -1, 0}
};
new CheckDeerReSpawn = 0;

#define S_DEER_COUNT	sizeof(gDeerHunterInfo)

enum adminzones
{
	Zone_ID,
	Zone_Name[60],
	Zone_Interior,
	Zone_VirtualWorld,
	Float:Zone_posX,
	Float:Zone_posY,
	Float:Zone_posZ
}
new AdminZone[][adminzones] =
{
	{1,"Admin Interior №1", 12, 1, 2324.419921, -1145.568359, 1050.710083},
	{2,"Admin Interior №2", 5, 2, 1282.1960, -800.9465, 1089.9375},
	{3,"Admin Interior №3", 2, 3, 1211.1121, -6.9724, 1000.9219},
	{4,"24/7 1", 17, 4, -25.884498,-185.868988,1003.546875},
	{5,"24/7 2", 10, 5, 6.091179,-29.271898,1003.549438},
	{6,"24/7 3", 18, 6, -30.946699,-89.609596,1003.546875},
	{7,"24/7 4", 16, 7, -25.132598,-139.066986,1003.546875},
	{8,"24/7 5", 4, 8, -27.312299,-29.277599,1003.557250},
	{9,"24/7 6", 6, 9, -26.691598,-55.714897,1003.546875},
	{10,"Airport ticket desk", 14, 10, -1827.147338,7.207417,1061.143554},
	{11,"Airport baggage reclaim", 14, 11, -1861.936889,54.908092,1061.143554},
	{12,"Shamal", 1, 12, 1.808619,32.384357,1199.593750},
	{13,"Andromada", 9, 13, 315.745086,984.969299,1958.919067},
	{14,"Ammunation 1", 1, 14, 286.148986,-40.644397,1001.515625},
	{15,"Ammunation 2", 4, 15, 286.800994,-82.547599,1001.515625},
	{16,"Ammunation 3", 6, 16, 296.919982,-108.071998,1001.515625},
	{17,"Ammunation 4", 7, 17, 314.820983,-141.431991,999.601562},
	{18,"Ammunation 5", 6, 18, 316.524993,-167.706985,999.593750},
	{19,"Ammunation booths", 7, 19, 302.292877,-143.139099,1004.062500},
	{20,"Ammunation range", 7, 20, 298.507934,-141.647048,1004.054748},
	{21,"Blastin fools hallway", 3, 21, 	1038.531372,0.111030,1001.284484},
	{22,"Jefferson motel", 15, 22, 2215.454833,-1147.475585,1025.796875},
	{23,"Off track betting shop", 3, 23, 833.269775,10.588416,1004.179687},
	{24,"Sex shop", 3, 24, -103.559165,-24.225606,1000.718750},
	{25,"Meat factory", 1, 25, 963.418762,2108.292480,1011.030273},
	{26,"Zero's RC shop", 6, 26, -2240.468505,137.060440,1035.414062},
	{27,"Woozie's office", 1, 28,-2159.122802,641.517517,1052.381713},
	{28,"Binco", 15, 29, 207.737991,-109.019996,1005.132812},
	{29,"Didier sachs", 14, 30,204.332992,-166.694992,1000.523437},
	{30,"Prolaps", 3, 31,207.054992,-138.804992,1003.507812},
	{31,"Club", 17, 32,493.390991,-22.722799,1000.679687},
	{32,"Bar", 11, 33,	501.980987,-69.150199,998.757812},
	{33,"Millie room", 6, 34,346.870025,309.259033,999.155700},
	{34,"Planning dept.", 3, 35, 384.808624,173.804992,1008.382812},
	{35,"Area 51", 0, 36, 223.431976,1872.400268,13.734375},
	{36,"LS gym", 5, 37,772.111999,-3.898649,1000.728820},
	{37,"SF gym", 6, 38,774.213989,-48.924297,1000.585937},
	{38,"Pleasure domes", 3, 39, -2640.762939,1406.682006,906.460937},
	{39,"Warehouse 2", 18, 40,1302.519897,-1.787510,1001.028259},
	{40,"RC Battlefield", 10, 41,-975.975708,1060.983032,1345.671875},
	{41,"LV police HQ", 3, 43, 288.745971,169.350997,1007.171875},
	{42,"8-Track", 7, 44, -1398.065307,-217.028900,1051.115844},
	{43,"Bloodbowl", 15, 45,-1398.103515,937.631164,1036.479125},
	{44,"LV Warehouse 1", 0, 46, 1059.895996,2081.685791,10.820312},
	{45,"LS Atruim", 18, 47,1710.433715,-1669.379272,20.225049},
	{46,"Kickstart", 14, 48,-1465.268676,1557.868286,1052.531250}
};

stock kLibGivePlayerEuro(playerid, money) {
	pInfo[playerid][pEuro] += money;
	SavePlayerInteger(playerid, "pEuro", pInfo[playerid][pEuro]);
	return 1;
} 

stock kLibGetPlayerEuro(playerid) return pInfo[playerid][pEuro]; 

stock kLibGivePlayerMoney(playerid, money, const reason[] = ".", targetid = INVALID_PLAYER_ID, bool:save = true) {
	//if (pInfo[playerid][pAdmin] + money < 0) return SendClientMessage(playerid, COLOR_GREY, !"Произошла ошибка ( GivePlayerMoney < 0 )");
	pInfo[playerid][pCash] += money;
	if (pInfo[playerid][pCash] - money > pInfo[playerid][pCash]/* + money*/) {
		LogsUnGiveMoney(playerid, targetid, money, reason, Log_Money);
	} else {
		LogsGiveMoney(playerid, targetid, money, reason, Log_Money);
	} 
	
	ResetPlayerMoney(playerid);
	GivePlayerMoneyEx(playerid);
	if (save) {
		SavePlayerInteger(playerid, "pCash", pInfo[playerid][pCash]);
	}  
	if (targetid == INVALID_PLAYER_ID) {

	}
	//LogTransferAll(playerid, targetid, money, reason, Log_Money);
	//LogMoney(playerid, money, reason); 
	return 1;
} 

stock kLibGetPlayerMoney(playerid) return pInfo[playerid][pCash]; 
stock setFreezePlayerForTime(playerid, time)
{
	TogglePlayerControllable(playerid, 0);
	SetTimerEx("UnFreeze", time * 1000, false, "i", playerid);
}
publics: UnFreeze(playerid) return TogglePlayerControllable(playerid, 1);

stock IsVehicleOccupied(vehicleid)
{

	#if defined FOREACH_I_PlayerInVehicle

	foreach(PlayerInVehicle[vehicleid], i){
		if (IsPlayerInVehicle(i, vehicleid)) return i;
	}

	#else

	foreach(new i: PlayerInLogin) if (IsPlayerInVehicle(i, vehicleid)) return i;

	#endif

	return -1;
}
stock get_passenger_count(playerid)
{
	new passenger_count = 0,
		vehicleid = GetPlayerVehicleID ( playerid ) ; 
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (GetPlayerState(i) == PLAYER_STATE_PASSENGER && GetPlayerVehicleID(i) == vehicleid) passenger_count ++ ;
	}
	return passenger_count ;
}
 
stock CreateDynamicTrigger(Float:x,Float:y,Float:z, worldid = 0, interiorid = 0, t_type = 0)//1 - red //2 - green
{
	new Trigger = CreateDynamicObject(1317,x ,y , z-1.78 ,0.0,0.0,0.0,worldid,interiorid);
	if (t_type == 1) SetDynamicObjectMaterial(Trigger, 0, 18646, "matcolours", "red-3", 0x00000000);
	else if (t_type == 2) SetDynamicObjectMaterial(Trigger, 0, 18646, "matcolours", "green", 0x00000000);
	else if (t_type == 3) SetDynamicObjectMaterial(Trigger, 0, 18646, "matcolours", "samporange", 0x00000000);
	else SetDynamicObjectMaterial(Trigger,0, 18646, "matcolours", "blue", 0xAA80FFDD);
	return Trigger;
} 
enum E_FRACTION_SERVER
{
	fID,
	fName[32],
	fLeader[MAX_PLAYER_NAME],
	fAssistant[MAX_PLAYER_NAME],
	fHelper[7],
	fCost[4],
	fFreeze,
	fAntiTK,
	fMessage[256],
	fWarehouse[20]
};
new fInfo[FRACTION_COUNT + 1][E_FRACTION_SERVER], TOTAL_FRACTION;
new fFractionRank[FRACTION_COUNT + 1][15][25];
new fFractionSalary[FRACTION_COUNT + 1][15];
 
new Iterator: PlayerTeam[FRACTION_COUNT + 1]<MAX_PLAYERS>;

enum Vacancy
{
	VacancyCreator,
	bool: VacancyStatus,
	VacancyText[120],
	VacancyFraction,
	VacancyOwner[MAX_PLAYER_NAME + 1],
};
new VacancyInfo[15][Vacancy], VACANCY_COUNT = 0;
//CreateDynamicMapIcon(Float:x, Float:y, Float:z, type, color, worldid = -1, interiorid = -1, playerid = -1, 
//Float:streamdistance = STREAMER_MAP_ICON_SD, style = MAPICON_LOCAL, STREAMER_TAG_AREA:areaid = STREAMER_TAG_AREA:-1, priority = 0);
enum E_MAP_ICON_SERVER {
	mID,
	Float: mPosition[3],
	mType,
	mColor,
	mWorld,
	mInterior
}
new MapIconInfo[][E_MAP_ICON_SERVER] = {
	{0, {-1880.7670,822.3905,35.1778}, 35, 0, 0, 0},//Семейный центр
	{1, {542.1437,-1272.3624,51.3059}, 55, 0, 0, 0},// AutoSalone LS
	{2, {-1952.2794,297.8026,35.4688}, 55, 0, 0, 0},// AutoSalone SF
	{3, {2200.8857,1394.2892,11.0625}, 55, 0, 0, 0},// AutoSalone LV
	{4, {-1657.7015,1210.2267,7.2500}, 55, 0, 0, 0},// AutoSalone LV
	{5, {1796.7545, -1149.3679, 23.7422}, 28, 0, 0, 0},// Дуэли  
	{6, {2492.3135,-1461.1936,24.0216}, 42, 0, 0, 0},//Работа автоугонщика.
	{7, {-2.9803,-363.4466,5.4297}, 51, 0, 0, 0},// Развозчики 
	{8, {1481.2144,-1756.5200,17.5313}, 56, 0, 0, 0}, // Mayor
	{9, {1552.8314,-1675.9022,16.1953}, 30, 0, 0, 0}, // Police LS
	{10, {-1605.4998,710.2729,13.8672}, 30, 0, 0, 0},// Police SF
	{11, {2340.2075,2459.0200,14.9688}, 30, 0, 0, 0},// Police LV
	{12, {1173.6215,-1323.2500,15.1953}, 22, 0, 0, 0},// Medics LS
	{13, {-2664.6611,637.9663, 14.4531}, 22, 0, 0, 0},// Medics SF
	{14, {1607.1716,1817.0586, 10.8203}, 22, 0, 0, 0},// Medics LV 
	{15, {1414.0972,-1701.0652,13.5395}, 52, 0, 0, 0},// Bank LS
	{16, {-2172.0627,252.1688, 35.3385}, 52, 0, 0, 0},// Bank SF 
	{17, {-2026.9664,-100.3766,35.1641}, 36, 0, 0, 0},// Autoschool
	{18, {2228.5789,-1721.7820,13.5654}, 54, 0, 0, 0},// Спортзал LS 
	{19, {1961.8124,-2189.2671,13.5469}, 53, 0, 0, 0},// Race 
	{20, {212.2816,1812.2374,21.8672}, 56, 0, 0, 0},// Точка наблюдения Зона 51
	{21, {2198.4846,-2264.5479,13.3967}, 11, 0, 0, 0},// Грузчики
	{22, {-284.8494,-2173.5769,28.6741}, 38, 0, 0, 0}, // Работа охотника Сэм
	{23, {1379.9143,-1660.0671,13.5503}, 51, 0, 0, 0},// Стоянка инкосаторов ЛС
	{24, {-2199.7485,300.6416,35.1172}, 51, 0, 0, 0} // Стоянка инкосаторов СФ 
};
#define S_MAPICON_COUNT	sizeof (MapIconInfo)  
//Актеры сервера
enum E_ACTORS_SERVER
{
	aID,
	aSkin,
	aName[128],
	Text3D: aTalk,
	aTalkTime,
	Float: aPos[4],
	Float: aDistance,
	aWorld,
	aInterior,
	aType
}
// 
new ActorsInfo[][E_ACTORS_SERVER] = { 
	{0, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {1152.7504,-1751.4828,13.5811,182.1940}, 7.0, 0, INTERIOR_NONE, 1},// ls avto faggio
	//{1, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {1773.5216,-1904.0164,13.5507,85.5659}, 7.0, 0, INTERIOR_NONE, 1},// ls unity faggio
	{2, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {-2040.4280,-82.9324,35.3203,135.7113}, 10.0, 0, INTERIOR_NONE, 1},// faggio ash
	{3, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {-1982.7079,151.2566,27.6875,127.9296}, 5.0, 0, INTERIOR_NONE, 1},// sf unity faggio
	{4, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {2824.0044,1308.4296,10.7635,239.0337}, 5.0, 0, INTERIOR_NONE, 1}, // lv unity faggio
	{5, 50, "Лип\n{CDCDB4}(( Аренда лодки ))", Text3D:-1, 0, {716.4279,-1692.2598,2.4297,154.2251}, 15.0, 0, INTERIOR_NONE, 2},//LS rent lodka
	{6, 50, "Лип\n{CDCDB4}(( Аренда лодки ))", Text3D:-1, 0, {716.3646,-1638.8864,2.4297,7.5837}, 15.0, 0, INTERIOR_NONE, 2},//LS rent lodka
	{7, 50, "Карл\n{CDCDB4}(( Управляющий штрафстоянки ))", Text3D:-1, 0, {1729.1045,-1063.4531,23.9402,3.0358}, 15.0, 0, INTERIOR_NONE, 3},//Штрафстонка
	{8, 21, "Йен", Text3D:-1, 0, {2493.8167,-1464.6432,24.0252,358.6483}, 5.0, 0, INTERIOR_NONE, 4},//Автоугонщик
	//{9, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {2217.5313,-1149.8391,25.7610,300.2570}, 8.0, 0, INTERIOR_NONE, 1},// ls jefferson faggio
	{10, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {2211.2737,-2263.4329,13.5547,31.4323}, 8.0, 0, INTERIOR_NONE, 1},// ls gruz faggio
	//{11, 72, "Лу\n{CDCDB4}(( Обмен подарков ))", Text3D:-1, 0, {1453.8497,-1749.9009,13.5469,329.7535}, 8.0, 0, INTERIOR_NONE, 5},//Притон
	{12, 27, "Артем\n\n{CDCDB4}(( Работа грузчика ))", Text3D:-1, 0, {2213.9739,-2260.6760,13.5547,48.0474}, 8.0, 0, INTERIOR_NONE, 6},//Прораб грузчика
	{13, 308, "Вероника\n\n{CDCDB4}(( Сотрудница больницы LS ))", Text3D:-1, 0, {833.8718,1346.6162,1071.4790,0.6057}, 5.0, 1, 7, 7},// Больница (регистратура)
	{14, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {-382.6383, -1416.1968,25.7266,280.1925}, 8.0, 0, INTERIOR_NONE, 1},// ferma 0
	{15, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {-106.4155, 6.2204, 3.1172, 68.6142}, 8.0, 0, INTERIOR_NONE, 1},// ferma 1
	{16, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {-1061.3041, -1186.5400, 129.2188, 276.9441}, 8.0, 0, INTERIOR_NONE, 1},// ferma 2
	{17, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {-7.5697, 58.8395, 3.1172, 259.0211}, 8.0, 0, INTERIOR_NONE, 1},// ferma 3
	{18, 50, "Илья\n{CDCDB4}(( Аренда мопедов ))", Text3D:-1, 0, {1900.2354, 176.7068, 37.0829, 344.7560}, 8.0, 0, INTERIOR_NONE, 1}, // ferma 4
	{19, 307, "Джесика\n{CDCDB4}(( Сотрудник LSPD ))", Text3D:-1, 0, {2774.3533, 1392.5522, 1100.8986, 176.2887}, 8.0, 1, 6, 8}, // LSPD
	{20, 32, "Джон\n{CDCDB4}(( Хитман ))", Text3D:-1, 0, {812.0011,-1101.0070,25.7857,270.4923}, 8.0, 0, INTERIOR_NONE, 9}, // Заказные убийства для мафий
	{21, 73, "Пабло\n{CDCDB4}(( Продавец чёрного рынка ))", Text3D:-1, 0, {2123.3384,-1191.5403,24.0045,89.9642}, 9.0, 0, INTERIOR_NONE, 10}, // Заказные убийства для мафий
	{22, 241,"Данте\n{CDCDB4}(( Друг Йена ))", Text3D:-1, 0, {1105.7283,-1311.2351,13.6550,177.6093}, 8.0, 0, INTERIOR_NONE, 11},//Заберет пакет от Йена
	{23, 30, "Александр\n{CDCDB4}(( Организатор Дуэлей ))", Text3D:-1, 0, {2035.1357,-1767.3081,1323.5272,175.4193}, 8.0, 1, DUEL_HOLL_LOBBY, 12},
	{24, 104, "Илья\n{CDCDB4}(( Руководитель ДМ Арены ))", Text3D:-1, 0, {2038.4554,-1767.5093,1323.5272,179.4926}, 8.0, 1, DUEL_HOLL_LOBBY, 13},//ДМ АРена
	{25, 179, "Джонсан\n{CDCDB4}(( Начальник караула ))", Text3D:-1, 0, {2728.4397,-2390.9031,13.6328,275.5981}, 10.0, 0, INTERIOR_NONE, 14},//Начальник караула
	{26, 32, "Дон\n{CDCDB4}(( Продавец Рыбного уголка ))", Text3D:-1, 0, {176.7857,-1905.4867,1.3159,359.5424}, 5.0, 0, INTERIOR_NONE, 15},//Продавец рыбного уголка
	{27, 168, "Флорид\n{CDCDB4}(( Скупщик рыбы ))", Text3D:-1, 0, {219.1092,-1960.6965,1.2960,180.3376}, 8.0, 0, INTERIOR_NONE, 16},
	{28, 209, "Самуро\n{CDCDB4}(( Скупщик рыбы ))", Text3D:-1, 0, {263.3156,-1980.9285,1.2960,90.1203}, 8.0, 0, INTERIOR_NONE, 17},
	{29, 214, "Виктория\n{CDCDB4}(( Сотрудница казино ))", Text3D:-1, 0, {1953.7970, 1017.8046, 992.4688, 270.7951}, 8.0, 1, 10, 18},
	{30, 40, "Лили\n{CDCDB4}(( Сотрудница семейного центра ))", Text3D:-1, 0, {2038.8304,2206.6836,1312.7424,171.9007}, 8.0, 1, FAMILY_CENTER_INT, 19},
	{31, 308, "Екатерина\n{CDCDB4}(( Сотрудница больницы LV ))", Text3D:-1, 0, {1661.9575,1780.7573,1098.1624,89.1066}, 8.0, 1, HOSPITAL_LV_INT, 20},
	{32, 308, "Елизавета\n{CDCDB4}(( Сотрудница больницы SF ))", Text3D:-1, 0, {-2608.2979,602.7126,1338.9753,273.7353}, 8.0, 1, HOSPITAL_SF_INT, 21},
	{33, 70, "Гроулер\n{CDCDB4}(( Оказывет первую помощь ))", Text3D:-1, 0, {138.6817,1649.7491,995.5768,270.9383}, 8.0, 1, HOSPITAL_ARMY_INT, 22},
	{34, 70, "Сергей\n{CDCDB4}(( Оказывет первую помощь ))", Text3D:-1, 0, {138.6817,1649.7491,995.5768,270.9383}, 8.0, 2, HOSPITAL_ARMY_INT, 23},
	{35, 30, "Кофас\n{CDCDB4}(( Огранизатор ограблений ))", Text3D:-1, 0, {2412.3025, -1492.6857, 24.0000,358.5874}, 8.0, 0, INTERIOR_NONE, 24},
	{36, 45, "Мики\n{CDCDB4}(( Скупщик звезд ))", Text3D:-1, 0, {1109.5981,-1414.8774,13.5815,2.2857}, 8.0, 0, INTERIOR_NONE, 25 },
	{37, 27, "Максим\n\n{CDCDB4}(( Работа на заводе ))", Text3D:-1, 0, {2289.0703,-2231.7554,1063.2633,3.3495}, 8.0, 1, FACTORY_INT, 27},
	{38, 150, "Джессика\n\n{CDCDB4}(( Сотрудница банка ))", Text3D:-1, 0, {1464.8815,-1017.3109,1038.1676,350.4089}, 8.0, 1, 22, 28},//Банк ЛС
	{39, 211, "Маша\n\n{CDCDB4}(( Сотрудница банка ))", Text3D:-1, 0, {1461.9607,-1017.3113,1038.1676,356.6757}, 8.0, 1, 22, 28},//Банк ЛС
	{40, 211, "Риана\n\n{CDCDB4}(( Сотрудница банка ))", Text3D:-1, 0, {1458.9801,-1017.3112,1038.1676,353.8558}, 8.0, 1, 22, 28},//Банк ЛС
	{41, 150, "Джессика\n\n{CDCDB4}(( Сотрудница банка ))", Text3D:-1, 0, {1464.8815,-1017.3109,1038.1676,350.4089}, 8.0, 2, 22, 28},//Банк СФ
	{42, 211, "Маша\n\n{CDCDB4}(( Сотрудница банка ))", Text3D:-1, 0, {1461.9607,-1017.3113,1038.1676,356.6757}, 8.0, 2, 22, 28},//Банк СФ
	{43, 211, "Риана\n\n{CDCDB4}(( Сотрудница банка ))", Text3D:-1, 0, {1458.9801,-1017.3112,1038.1676,353.8558}, 8.0, 2, 22, 28},//Банк СФ 
	{44, 141, "Анжелика\n{CDCDB4}(( Создание семей ))", Text3D:-1, 0, {2032.4850,2206.8594,1312.7405,177.5406}, 8.0, 1, FAMILY_CENTER_INT, 29},
	{45, 183, "Семён\n{CDCDB4}(( Работник порта ))", Text3D:-1, 0, {1028.1371,-1946.9478,13.1011,207.4570}, 8.0, 0, 0, 30},
	{46, 161, "Сэм\n\n{CDCDB4}(( Работа охотника ))", Text3D:-1, 0, {-282.4593,-2171.4890,28.6321,117.8158}, 8.0, 0, INTERIOR_NONE, 26},
	{47, 46, "Абрахам\n\n{CDCDB4}(( Торговец ))", Text3D:-1, 0, {1148.6450,-1418.0012,16.0686,217.8556}, 8.0, 0, INTERIOR_NONE, 31},
	{48, 126, "Юрий\n\n{CDCDB4}(( Адвокат ))", Text3D:-1, 0, {26.2202,796.6390,1041.5210,40.5938}, 8.0, 10, MAD_HOUSE_INT, 32}		

};
#define S_ACTOR_COUNT	sizeof (ActorsInfo) 
#define PointToPoint(%0,%1,%2,%3,%4,%5) floatsqroot(floatpower(floatabs(floatsub(%3,%0)),2)+floatpower(floatabs(floatsub(%4,%1)),2)+floatpower(floatabs(floatsub(%5,%2)),2)) 
new ActorsSphere[S_ACTOR_COUNT];

new Float: RENT_FAGGIO_SPAWN[12][4] =
{
	{ 1151.9249,-1743.3195,12.9496,270.4520 }, // ls Авто Вокзал
	{ -2039.7395,-87.3606,34.9161,66.5012 }, // Автошкола аренда
	{ -1984.0571,152.2243,27.2843,93.4445 },// sf Возквал аренда
	{ 2824.7664,1306.9688,10.3632,294.4171 },// lv unity
	{ 2207.4658,-2266.0845,13.1549,350.1379},//LS Gruz 
	{ -382.7336,-1413.7854,25.3262,295.3776 }, // ferma 0
	{ -105.8708,7.5950,2.7129,99.6132 }, // ferma 1 
	{ -1061.1283,-1184.5106,128.8193,297.4590 }, // ferma 2 
	{ -7.5960,57.3798,2.7162,260.4596 }, // ferma 3 
	{ 1903.9521,175.1099,36.7630,349.1272 },// ferma 4  
	{ 720.1100,-1693.0873,-0.3042,178.8085 },//LS rent lodka
	{ 721.1708,-1628.0481,-0.5770,181.3787 }//LS rent lodka
} ;

enum server_bus_stop
{ 
	busType,
	Float: bPos[6],
	busName[32],
	busID
}
new oBusObject[][server_bus_stop] = { /* OLD - Пометка тех. Остановак которые ще не встречались на маршруте */
	{1, {1552.833129, -1742.969116, 13.802822, 0.0, 0.0, -90.599876}, "Мэрия"},//Мэрия
	{1, {1540.36694,-1675.56897,13.83,0.0,0.0,0.0}, "2s"},//OLD
	{1, {1812.57898,-1676.21106,13.826,0.0,0.0,180.0}, "3"}, //OLD
	{1, {2424.25098,-1247.48206,24.116,0.0,0.0,90.0}, "5"}, //OLD
	{1, {1660.34204,-1151.86304,24.165,0.0,0.0,90.0}, "8"},//OLD
	{1, {2249.87695,-1132.40527,26.665,0.0,0.0,73.246}, "9"},//OLD
	{1, {1656.16394,-1169.84497,24.357,0.0,0.0,270.0}, "10"},//OLD
	{1, {2230.70703,-1145.84595,26.076,0.0,0.0,255.0}, "11"},//OLD
	{1, {2398.92603,-1265.60706,24.524,0.0,0.0,270.0}, "12"},//OLD
	{1, {2239.16602,-2193.24707,13.826,0.0,0.0,44.75}, "13"},//OLD
	{1, {1830.48096,-1886.953,13.719,0.0,0.0,0.0}, "14"},//OLD
	{1, {1830.69702,-1661.83997,13.826,0.0,0.0,0.0}, "15"},//OLD
	{1, {1983.849975, -2174.845703, 13.786499, 0.0, 0.0, -90.0}, "Регистрация на гонки"},// Регистрация на гонки рядом с Home SHop
	{1, {2233.77709, -2213.25512, 13.746876, 0.0, 0.0, -135.0}, "Работа Грузчика"},//Грузчики
	{1, {1164.052124, -1755.040283, 13.838446, 0.0, 0.0, -179.899749}, "АвтоВокзал"},//Респа АвтоВокзал
	//{1, {1520.87598,-1659.99023,13.618,0.0,0.0,179.995}, "17LSSTOP"},//OLD
	{2, {-1981.41797,132.862,27.967,0.0,0.0,0.0}, "1SF"},
	{2, {-1707.505,1335.94995,7.455,0.0,0.0,45.0}, "2"},
	{2, {-1635.51465,720.07715,14.896,0.0,0.0,270.0}, "3"},
	{2, {-2604.91211,1342.43799,7.471,0.0,0.0,135.0}, "4"},
	{2, {-2438.32593,717.18402,35.451,0.0,0.0,90.0}, "5"},
	{2, {-2015.76404,470.44199,35.451,0.0,0.0,180.0}, "6"},
	{2, {-1957.57617,1096.70703,55.991,0.0,0.0,0.0}, "7"},
	{2, {-2015.80896,140.91901,27.967,0.0,0.0,179.995}, "8"},
	{2, {-2068.53906,-79.267,35.6,0.0,0.0,270.0}, "9"},
	{2, {-2245.32129,-107.81738,35.592,0.0,0.0,0.0}, "10SFSTOP"},
	{3, {2836.50098,1282.64197,11.215,0.0,0.0,0.0}, "1LV"},
	{3, {2284.76904,2422.271,11.1,0.0,0.0,90.0}, "2LV"},
	{3, {2856.13379,2421.79004,11.348,0.0,0.0,135.0}, "3LV"},
	{3, {2175.66089,964.29199,11.1,0.0,0.0,270.0}, "4LV"},
	{3, {1918.72754,2314.40527,11.1,0.0,0.0,179.995}, "5LV"},
	{3, {1712.2627,1382.5957,10.92,0.0,0.0,198.995}, "6LV"},
	{3, {2033.34277,1039.90039,11.1,0.0,0.0,179.995}, "7LV"},
	{3, {2797.60596,1256.823,11.166,0.0,0.0,270.0}, "8LV"},
	{3, {2499.19824,944.21484,11.1,0.0,0.0,270.0}, "9LV"}
};


enum E_FACTORY_GRUZ_JOB {
	tableToggle,
	Float: tablePos[4],
	Float: tObjectPos[6],
	tableObject,
	tableObjectStatus,
	tableAreaID
};
new  gFactoryInfo[][E_FACTORY_GRUZ_JOB] = {
	{INVALID_PLAYER_ID, {2272.1543, -2231.4492, 1063.2633, 90.0}, {2271.563476, -2231.456542, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2272.1541, -2227.8953, 1063.2633, 90.0}, {2271.533447, -2227.895263, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2277.1541, -2231.4153, 1063.2633, 90.0}, {2276.573974, -2231.532226, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2277.1541, -2227.9065, 1063.2633, 90.0}, {2276.543457, -2227.910400, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2282.1541, -2231.4426, 1063.2633, 90.0}, {2281.542236, -2231.489257, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2282.1541, -2227.9209, 1063.2633, 90.0}, {2281.523437, -2227.913818, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2272.1541, -2214.8760, 1063.2633, 90.0}, {2271.543457, -2214.916015, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2272.1541, -2211.2742, 1063.2633, 90.0}, {2271.473388, -2211.274169, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2277.1541, -2214.9761, 1063.2633, 90.0}, {2276.513427, -2214.906738, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2277.1541, -2211.2976, 1063.2633, 90.0}, {2276.523437, -2211.299560, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2282.1541, -2214.8777, 1063.2633, 90.0}, {2281.533447, -2214.877685, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1},
	{INVALID_PLAYER_ID, {2282.1541, -2211.2676, 1063.2633, 90.0}, {2281.543457, -2211.270507, 1063.313354, 0.000000, 0.000000, 90.0}, -1, -1, -1}
 
};  
#define S_FACTORY_TABLE_COUNT	sizeof(gFactoryInfo)

enum E_FACTORY_GRUZ_SORT {
	sortPlaceToggle,
	Float: sortPos[4],
	Float: sortObject[6],
	Float: sortMoveObject[7],
	sortPlaceObject,
	sortPlaceStatus,
	sortPlaceAreaID,
	sortBoxCount,
	Text3D: sortText
} 
new  gFactorySortInfo[][E_FACTORY_GRUZ_SORT] = {
	{INVALID_PLAYER_ID, {2273.8647, -2222.9580, 1063.2633, 0.0}, 
		{2273.829345, -2222.085937, 1063.213256, 0.000000, 0.000000, -90.0}, 
		{2265.150634, -2222.085937, 1063.213256, 1.0, 0.00000, 0.00000, -90.00000}, 
		-1, -1, -1, 0, Text3D: 0
	},// left 1 level
	{INVALID_PLAYER_ID, {2265.1946, -2222.9583, 1063.2633, 0.0}, 
		{2265.150634, -2222.085937, 1063.213256, 0.000000, 0.000000, -90.0}, 
		{2259.885498, -2222.085937, 1063.213256, 1.0, 0.00000, 0.00000, -90.00000}, 
		-1, -1, -1, 0, Text3D: 0
	},// left 2 level
	{INVALID_PLAYER_ID, {2273.8853, -2219.9224, 1063.2633, 180.0}, 
		{2273.829345, -2220.746093, 1063.213256, 0.000000, 0.000000, -90.0}, 
		{2265.150634, -2220.746093, 1063.213256, 1.0, 0.00000, 0.00000, -90.00000}, 
		-1, -1, -1, 0, Text3D: 0
	},// right 1 level
	{INVALID_PLAYER_ID, {2265.1116, -2219.9224, 1063.2633, 180.0}, 
		{2265.150634, -2220.746093, 1063.213256, 0.000000, 0.000000, -90.0}, 
		{2259.885498, -2220.746093, 1063.213256, 1.0, 0.00000, 0.00000, -90.00000}, 
		-1, -1, -1, 0, Text3D: 0
	}// right 2 level
};

#define S_FACTORY_SORT_COUNT	sizeof(gFactorySortInfo)//-2220.746093

new
	factoryEnter[2];
//CreateDynamicObject(3052, 2271.563476, -2231.456542, 1063.263305, 0.000000, 0.000000, 89.899993, 1, 53, -1, 200.00, 200.00);
enum G_FRACTION_SERVER
{
	fID,
	fReconName[12],
	fTagName[12], 
	fName[24],
	Float: fPos[4], 
	fInt,
	fWorld,
	bool: fFreezeSpawn,
	fColor,
	fRGBColor[8],
	fLimitWareHouse, 
	fLimitPrize,
	fPrizeTime,
	fCoolDown
} 

new gFraction[FRACTION_COUNT + 1][G_FRACTION_SERVER] = {
	{0, "-", "None", "Гражданин", {0.0,0.0,0.0,0.0}, 0,0, false, TEAM_HIT_COLOR, "000000", 0, 0, 0},
	{1, "LSPD", "LSPD", "LSPD", {2757.4709, 1381.2042, 1100.9005, 270.000}, 6, 1, true, 0x110CE7FF, "110CE7", 0, 0, 0},
	{2, "FBI", "FBI", "ФБР", {1371.2074,24.3747,1009.2057,278.9970}, 3, 130, false, 0x313131AA, "313131", 0, 0, 0},
	{3, "ARMY_SF", "ВМС", "Военно-Морские Силы", {-1371.6482,492.1947,11.1953,269.1425}, 0, 0, false, 0xFFE4B5AA, "FFE4B5", 0, 0, 0},//
	{4, "HOSPITAL_SF", "MOH", "Медики СФ", {-2613.0596, 578.4048, 1338.9753, 262.7450}, HOSPITAL_SF_INT, 1, true, 0x954F4FFF, "954F4F", 0, 0, 0},
	{5, "LCN", "None", "La Cosa Nostra", {-922.0643,1027.3247,1281.8180,90.2878}, LCN_INTERIOR, 1, true, 0xDDA701FF, "DDA701", 0, 0, 0},
	{6, "YAKUZA", "None", "Yakuza", {-649.5328,807.0345,1249.7310,183.0352}, YAKUZA_INTERIOR, 1, true, COLOR_REDD, "FF0000", 0, 0, 0},
	{7, "Mayor", "Mayor", "Мэрия", {900.1672, 1533.0800, 1087.7070, 0.000}, 8, 1, true, 0x114D71FF, "114D71", 0, 0, 0},
	{8, "PIRUS", "None", "The Pirus", {2564.6704,-1276.6600,1180.1520,0.8914}, PIRUS_INTERIOR, -1, true, 0x9b2d30FF, "9b2d30", 0, 0, 0}, 
	{9, "SF_NEWS","News SF", "SF News", {1413.1946, -30.6161, 1000.9246, 24.2104}, 45, 1, true, 0x57FF4EFF, "57FF4E", 0, 0, 0},//Камеру повората 
	{10, "SFPD", "SFPD", "SFPD", {225.8292,108.4072,1010.2188, 270.0}, 10, 0, false, 0x110CE7FF, "110CE7", 0, 0, 0},
	{11, "AUTOSCHOOL", "АШ", "Автошкола", {-2012.5765,-107.8019,1000.9500, 180.0}, 64, 1, true, 0x139BECFF, "139BEC", 0, 0, 0},
	{12, "BALLAS", "None", "Ballas Gang", {2649.2698,-2019.4058,13.5515,88.5778}, INTERIOR_NONE, 0, false, 0xB313E7FF, "B313E7", 0, 0, 0},//{12, "BALLAS", "None", "Ballas Gang", {-194.1146,88.6843,973.3170, 51.9658}, 20, 1, false, 0xB313E7FF, "B313E7", 0, 0, 0},
	{13, "VAGOS", "None", "Vagos Gang", {2772.2458,-1626.4633,10.9272,353.8562}, INTERIOR_NONE, 0, false, 0xDBD604AA, "DBD604", 0, 0, 0},//{13, "VAGOS", "None", "Vagos Gang", {2794.1233,-1607.5570,-36.5231, 0.0}, 4, 75, false, 0xDBD604AA, "DBD604", 0, 0, 0},//Камеру поворота
	{14, "RUSSIAN", "None", "Русская Мафия", {1763.7777,2077.3381,1308.8689,268.2158}, RM_INTERIOR, 1, true, COLOR_GRAD1, "B4B5B7", 0, 0, 0},
	{15, "GROVE", "None", "Grove Street", {2497.8291,-1686.9495,13.4824,359.5389}, 0, 0, false, 0x009F00AA, "009F00", 0, 0, 0}, //{15, "GROVE", "None", "Grove Street", {2496.0129,-1708.9232,1014.7421, 0.1916}, 3, 1, false, 0x009F00AA, "009F00", 0, 0, 0}, 
	{16, "LS_NEWS", "News LS", "LS News", {1413.1946, -30.6161, 1000.9246, 24.2104}, 45, 2, true, 0x758C9DFF, "758C9D", 0, 0, 0}, 
	{17, "AZTEC", "None", "Aztecas Gang", {1667.2919,-2108.8508,13.5469,182.1830}, INTERIOR_NONE, 0, false, TEAM_AZTECAS_COLOR, "01FCFF", 0, 0, 0},//{17, "AZTEC", "None", "Aztecas Gang", {-49.7558,1400.3553,1084.4297, 90.4248}, 8, 36, false, TEAM_AZTECAS_COLOR, "01FCFF", 0, 0, 0},
	{18, "RIFA", "None", "Rifa Gang", {2181.3042,-1812.4686,13.5469,358.3756}, INTERIOR_NONE, 0, false, 0x2A9170FF, "2A9170", 0, 0, 0},//{18, "RIFA", "None", "Rifa Gang", {2808.9631,-1169.0806,1025.5703, 0.0}, 8, 63, false, 0x2A9170FF, "2A9170", 0, 0, 0},//Угол башки
	{19, "ARMY_LV", "СВ", "Сухопутные Войска", {2205.2327,1611.4584,999.9753, 0.0}, 0, 0, true, 0xFFE4B5AA, "FFE4B5", 0, 0, 0},//Угол 
	{20, "LV_NEWS", "News LV", "LV News", {1413.1946, -30.6161, 1000.9246, 24.2104}, 45, 3, true, 0xE6284EFF, "E6284E", 0, 0, 0},//Угол 
	{21, "LVPD", "LVPD", "LVPD", {211.3636,184.3113,1003.0313, 174.3579}, 3, 122, false, 0x110CE7FF, "110CE7", 0, 0, 0},
	{22, "HOSPITAL_LS", "MOH", "Медики ЛС", {853.9788,1351.8672,1071.4790,87.4932}, 7, 1, true, 0x954F4FFF, "954F4F", 0, 0, 0},
	{23, "HOSPITAL_LV", "MOH", "Медики ЛВ", {1697.0105, 1765.9357, 1098.1643, 358.8657}, HOSPITAL_LV_INT, 1, true, 0x954F4FFF, "954F4F", 0, 0, 0},
	{24, "MONGOLS_MC", "None", "Mongols MC", {-1000.0667,1942.7020,1077.5378,1.1761}, BIKERS_INT, 1, true, 0x333333FF, "333333", 0, 0, 0},
	{25, "BANDIDOS_MC", "None", "Bandidos MC", {-1000.0667,1942.7020,1077.5378,1.1761}, BIKERS_INT, 2, true, 0xF45000FF, "F45000", 0, 0, 0},
	{26, "OUTLAWS_MC", "None", "Outlaws MC", {-1000.0667,1942.7020,1077.5378,1.1761}, BIKERS_INT, 3, true, 0x868484FF, "868484", 0, 0, 0}
};
new const gFracionCountRank[] = {
	14, 10, 15, 10, 10, 10, 10, 10, 10, 14, 10, 10, 10, 10, 10, 10, 10, 10, 15, 10, 14, 11, 10, 9, 9, 9
};
new FRACTION_MIN_SALARY = 1000, FRACTION_MAX_SALARY = 20000;

new gFractionDefaultSalary[FRACTION_COUNT + 1][2] = {
	{ /*00*/1000, 7000},
	{ /*01*/1000, 7000},
	{ /*02*/1000, 7000},
	{ /*03*/1000, 7000},
	{ /*04*/1000, 7000},
	{ /*05*/1000, 7000},
	{ /*06*/1000, 7000},
	{ /*07*/1000, 7000},
	{ /*08*/1000, 7000},
	{ /*09*/1000, 7000},
	{ /*10*/1000, 7000},
	{ /*11*/1000, 7000},
	{ /*12*/1000, 7000},
	{ /*13*/1000, 7000},
	{ /*14*/1000, 7000},
	{ /*15*/1000, 7000},
	{ /*16*/1000, 7000},
	{ /*17*/1000, 7000},
	{ /*18*/1000, 7000},
	{ /*19*/1000, 7000},
	{ /*20*/1000, 7000},
	{ /*21*/1000, 7000},
	{ /*22*/1000, 7000},
	{ /*23*/1000, 7000},
	{ /*24*/1000, 7000},
	{ /*25*/1000, 7000},
	{ /*26*/1000, 7000}
};
new gFractionRankName[FRACTION_COUNT + 1][15][24] = {
{"","","","","","","","","","","","","","",""},
{"Кадет","Офицер","Мл. Сержант","Сержант","Ст. Сержант","Ст. Прапорщик","Мл. Лейтенант","Лейтенант","Ст. Лейтенант","Капитан","Майор","Подполковник","Полковник","Шериф",""},//1,21
{"Стажёр","Дежурный","Мл.Агент","Агент GNK","Агент CID","Глава GNK","Глава CID","Инспектор FBI","Зам.Директора FBI","Директор FBI","","","","",""},//2
{"Рядовой","Ефрейтор","Мл. Сержант","Сержант","Ст. Сержант","Старшина","Прапорщик","Младший лейтенант","Лейтенант","Старший Лейтенант","Капитан","Майор","Подполковник","Полковник","Генерал"},//3
{"Интерн","Санитар","Мед.Брат","Спасатель","Нарколог","Доктор","Психолог","Хирург","Зам.Глав.Врача","Глав.Врач","","","","",""},//4,22,23
{"Новицио","Ассосиато","Сомбаттенте","Солдато","Боец","Сотто-Капо","Капо","Младший Босс","Консильери","Дон","","","","",""},//5
{"Вакасю","Сятей","Кедай","Фуку-Комбуте","Вагакасира","Со-Хомбуте","Камбу","Cайко-Комон","Оядзи","Кумите","","","","",""},//6
{"Секретарь","Юрист","Охранник","Начальник охраны","Зам. мэра","Мэр","","","","","","","","",""},//7
{"None","None","None","None","None","None","None","None","None","None","","","","",""}, //8
{"Стажер","Звукооператор","Звукорежиссер","Репортер","Ведущий","Редактор","Гл.Редактор","Тех.Директор","Прог.директор","Ген.Директор","","","","",""},//9.16.20
{"Кадет","Офицер","Мл. Сержант","Сержант","Ст. Сержант","Ст. Прапорщик","Мл. Лейтенант","Лейтенант","Ст. Лейтенант","Капитан","Майор","Подполковник","Полковник","Шериф",""},//10
{"Стажёр","Консультант","Экзаменатор","Мл.Инструктор","Инструктор","Координатор","Мл.Менеджер","Ст.Менеджер","Директор","Управляющий","","","","",""},//11
{"Блайд","Младший Нига","Крэкер","Гун брo","Ап Бро","Гангстер","Федерал Блок","Фолкс","Райч Нига","Биг Вилли","","","","",""},//12
{"Новатто","Ординарио","Локал","Верификадо","Бандито","V.E.G.","Ассесино","Лидер V.E.G.","Падрино","Падре","","","","",""},//13
{"Шнырь","Фраер","Бык","Барыга","Блатной","Свояк","Браток","Вор","Вор в законе","Авторитет","","","","",""},//14
{"Плэйя","Хастла","Килла","Юонг","Гангста","О.Г.","Мобста","Де Кинг","Легенд","Мэд Дог","","","","",""},//15
{"Стажер","Звукооператор","Звукорежиссер","Репортер","Ведущий","Редактор","Гл.Редактор","Тех.Директор","Прог.директор","Ген.Директор","","","","",""},//16
{"Перро","Тирадор","Геттор","Лас Геррас","Мирандо","Сабио","Инвасор","Тесосеро","Нестро","Падре","","","","",""},//17
{"Новато","Ладрон","Амиго","Мачo","Джуниор","Эрмано","Бандидо","Ауторидад","Аджунто","Падре","","","","",""},//18
{"Рядовой","Ефрейтор","Мл. Сержант","Сержант","Ст. Сержант","Старшина","Прапорщик","Младший лейтенант","Лейтенант","Старший Лейтенант","Капитан","Майор","Подполковник","Полковник","Генерал"},//19
{"Стажер","Звукооператор","Звукорежиссер","Репортер","Ведущий","Редактор","Гл.Редактор","Тех.Директор","Прог.директор","Ген.Директор","","","","",""},//20
{"Кадет","Офицер","Мл. Сержант","Сержант","Ст. Сержант","Ст. Прапорщик","Мл. Лейтенант","Лейтенант","Ст. Лейтенант","Капитан","Майор","Подполковник","Полковник","Шериф",""},//21
{"Интерн","Санитар","Мед.Брат","Спасатель","Нарколог","Доктор","Психолог","Хирург","Зам.Глав.Врача","Глав.Врач","","","","",""},//22
{"Интерн","Санитар","Мед.Брат","Спасатель","Нарколог","Доктор","Психолог","Хирург","Зам.Глав.Врача","Глав.Врач","","","","",""},//23
{"Support","Hang around","Prospect","Member","Road captain","Sergeant-at-arms","Treasurer","Вице президент","Президент","","","","","",""},
{"Support","Hang around","Prospect","Member","Road captain","Sergeant-at-arms","Treasurer","Вице президент","Президент","","","","","",""},
{"Support","Hang around","Prospect","Member","Road captain","Sergeant-at-arms","Treasurer","Вице президент","Президент","","","","","",""}
};
enum pCrime
{
	pAccusedof[32],
	pVictim[32]
};
new PlayerCrime[MAX_PLAYERS][pCrime];
//59, 163, 164, 165, 186, 228, 240, 290, 216, 219, 141
new gFractionSkin[FRACTION_COUNT][16] = {
	{280, 281, 282, 283, 284, 285, 288, 267, 266, 265, 303, 304, 305, 76, 306, 309}, //LSPD 1  | 8 Скинов (76, 306, 309) Женский
	{286, 163, 164, 165, 166, 303, 304, 305, 285, 141, 0, 0, 0, 0, 0, 0}, // FBI	2   | 6 Скинов (141) Женский
	{287, 179, 61, 253, 255, 191,0,0,0,0,0,0,0,0,0,0}, // Авионосец 3	| 2 Скина (191) Женский
	{70,274,275,276,219,0,0,0,0,0,0,0,0,0,0,0}, // МЧС СФ 4     | 5 Скинов (219) Женский
	{223,124,113,43,214,0,0,0,0,0,0,0,0,0,0,0}, // ЛКН 5         | 4 Скина (214) Женский
	{49, 117, 118, 120, 121, 122, 123, 186, 208, 224, 169, 0, 0, 0, 0, 0}, // Якудза 6      | 4 Скина (169, 224) Женский//120,123,186,169,
	{57, 59, 98, 147, 163, 164, 165, 186, 187, 228, 240, 290, 141, 150, 216, 219}, // Мэрия ЛС 7    | 5 Скинов (141, 150, 216, 219) Женский 
	{18, 19, 22, 180,297,172,0,0,0,0,0,0}, // The Pirus    8        | 6 Скина (172) Женкский
	{250,261,217,211,0,0,0,0,0,0,0,0,0,0,0,0}, //SF News   9   	| 4 Скина (211) Женкский
	{280,281,282,283,284,285,288,267,266,265, 303, 304, 305,76,306,309}, //SFPD 10 | 8 Скинов (76, 306, 309) Женский
	{59,189,240,172,0,0,0,0,0,0,0,0,0,0,0,0}, //Инструкторы 11  | 4 Скина (172) Женский
	{102,103,104,195,0,0,0,0,0,0,0,0,0,0,0,0}, // Баллас  12    | 4 Скина (195) Женский
	{108,109,110,190,0,0,0,0,0,0,0,0,0,0,0,0}, // Вагос 13 		| 4 Скина (190) Женский
	{46, 111, 112, 125, 126, 272, 214,0,0,0,0,0,0,0,0,0},//Русская Маф.14| 5 Скинов (214) Женский//111,112,125,272,214
 	{105,106,107,269,270,271,56,0,0,0,0,0}, // Грув 15 | 7 Скинов (195) Женский
 	{250,261,217,211,0,0,0,0,0,0,0,0,0,0,0,0}, //LS News  16   	| 4 Скина (211) Женкский
	{114,115,116,48,41,0,0,0,0,0,0,0,0,0,0,0}, //Aztec 17       | 4 Скина (193) Женский
	{173,174,175,226,0,0,0,0,0,0,0,0,0,0,0,0}, //Rifa 18        | 4 Скина (226) Женский
	{287, 179, 61, 253, 255, 191,0,0,0,0,0,0,0,0,0,0}, // Зона 51 19	| 2 Скина (191) Женский
	{250,261,217,211,0,0,0,0,0,0,0,0,0,0,0,0}, //LV News   20  	| 4 Скина (211) Женкский
	{280,281,282,283,284,285,288,267,266,265, 303, 304, 305,76,306,309}, //LVPD 21 | 8 Скинов (76, 306, 309) Женский
	{70,274,275,276,219,0,0,0,0,0,0,0,0,0,0,0}, // МЧС ЛС 22    | 5 Скинов (219) Женский
	{70,274,275,276,219,0,0,0,0,0,0,0,0,0,0,0}, // МЧС ЛВ 23    | 5 Скинов (219) Женский
	{100,181,247,248,291,178,201,246,298,0,0,0,0,0,0,0},// Байкеры 24   | 5 Скинов (298,201) Женский
	{100,181,247,248,291,178,201,246,298,0,0,0,0,0,0,0},// Байкеры 24   | 5 Скинов (298,201) Женский
	{100,181,247,248,291,178,201,246,298,0,0,0,0,0,0,0}// Байкеры 24    | 5 Скинов (298,201) Женский
};

new FishNames[][] = {
	{"Амберджек"},
	{"Морской окунь"},
	{"Люциан"},
	{"Форель"},
	{"Голубой Марилин"},
	{"Скумбрия"},
	{"Морской окунь"},
	{"Щука"},
	{"Рыба Парус"},
	{"Тунец"},
	{"Ель"},
	{"Дельфин"},
	{"Акула"},
	{"Черепаха"},
	{"Сом"},
	{"Рыба-Меч"},
	{"Катран"},
	{"Сайда"}
};
// /bizwar 
new ZoneWar;
new ZoneID;
new ZoneTimer;
// /bikerswar
new	
	BikersTimer,
	BikersFamilyHouseID = -1,
	BikersWarGZ = INVALID_GANGZONE_ID,
	BzCheckTimer;
//ZoneN; 
//mafia war
new const Float: MafiaWarZonePos[][4] = {
	{295.00, 843.00, 398.00, 952.00}, // (Карьер)
	{70.00, 2422.00, 377.00, 2562.00}, // (Аэропорт)
	{-436.00, 2166.00, -339.00, 2298.00}, // (Деревня) 
	{2366.10, 1878.19, 2500.10, 1968.19} // (стройка)
	
}; 
new const Float: BikersWarZonePos[][4] = {
	{2252.6276, 1379.6477, 2361.6276, 1526.6477}, // (Стоянка ЛВ)
	{-1467.9403, -1596.3465, -1406.9403, -1442.3465},//-1467.9403, -1590.3465, -1406.9403, -1442.3465}, // (Ферма)
	{-623.9177, -564.0795, -463.9177, -467.0795} // (Развочкика) 
	
};

//А чтобы привычнее вообще было. Нужно 1 - карьер 2 - деревня 3 - аэропорт 4 - стройка эта
new kills_mafia[2],mafia_frac_id[2]/*,kills_need_mafia[2]*/;
new kills_bikers[2], bikers_frac_id[2]/*,kills_need_mafia[2]*/;
new TotalGzR;
new TotalGzA;
new TotalGzB;
new TotalGzG;
new TotalGzV, TotalGzP; 
const max_war_capture = 12;
new 
	capture_timer = 900,
	capture_kills_need[max_war_capture],
	capture_kills[max_war_capture],
	capture_now[max_war_capture],
    capture_start[max_war_capture],
	capture_fix;

new gang_capture;

new bool: g_capture_attack[12] = false;

stock capture_band(id)
{
	switch (id)
	{
	    case FRACTION_BALLAS: return 0;
	    case FRACTION_VAGOS: return 1;
	    case FRACTION_GROVE: return 2;
	    case FRACTION_AZTEC: return 3;
	    case FRACTION_RIFA: return 4;
	    case FRACTION_LCN: return 5;
	    case FRACTION_YAKUZA: return 6;
	    case FRACTION_RUSSIAN: return 7;
		case FRACTION_MONGOLS_MC: return 8;
		case FRACTION_BANDIDOS_MC: return 9;
		case FRACTION_OUTLAWS_MC: return 10;
		case FRACTION_PIRUS: return 11;
	    default: return 0xFFFF;
	}
	return 0xFFFF;
}
stock back_capture_band(id)
{
	switch (id)
	{
	    case 0: return FRACTION_BALLAS;
	    case 1: return FRACTION_VAGOS;
	    case 2: return FRACTION_GROVE;
	    case 3: return FRACTION_AZTEC;
	    case 4: return FRACTION_RIFA;
	    case 5: return FRACTION_LCN;
	    case 6: return FRACTION_YAKUZA;
	    case 7: return FRACTION_RUSSIAN;
		case 8: return FRACTION_MONGOLS_MC;
		case 9: return FRACTION_BANDIDOS_MC;
		case 10: return FRACTION_OUTLAWS_MC;
		case 11: return FRACTION_PIRUS;
	    default: return 0xFFFF;
	}
	return 0xFFFF;
}//Bandidos BANDIDOS
new name_band[max_war_capture][] = {"BALLAS", "VAGOS", "GROVE", "AZTECAS", "RIFA", "LCN", "YAKUZA", "Russian Mafia", "MONGOLS MC", "BANDIDOS MC", "OUTLAWS MC", "The Pirus"};
new crimeDiplomation[max_war_capture][max_war_capture];
 
const max_gz = 131;
enum GzoneInfo
{
	gID,
	gZone,
	Float:gCoords[4],
	gFrakVlad,
	gCaptureTime,
	gCaptureOverTime, 
	gNapad,
	gTimer,
	gTD,
	gCaptureArea
}
new GZInfo[max_gz][GzoneInfo], TOTALGZ;


enum E_GRAFFITI_INFO
{
	tID,
	Float:tPos[3],
	Float:tRPos[3],
	tFraction,
	tSphere,
	Text3D:tText
}
new TagInfo[GRAFFITI_COUNT][E_GRAFFITI_INFO], TOTALGRAFFITI;
new tFractionGraffiti[20];

#include "../source/casino/casino.inc"
#include "../source/casino/poker.inc"
#include "../source/casino/blackjack.inc"
#include "../source/systems/gate_move.pwn"

enum E_BILBOARD_SERVER {
	bID,
    bObjectID,
	bObjectModel,
	Float:bPos[4],
    bPosText[32],
	bText[144],
	bOwner[MAX_PLAYER_NAME],
	bOwned,
	bBackColor,
	bFontFace,
	bAligment,
	bFontSize,
	bDay,
	bMember
};
new BildInfo[BILLBORDS_COUNT][E_BILBOARD_SERVER], TOTALBILBOARD;
new Colors_LOW[][12] = { "000000","FFFFFF","20B2AA","DC143C","6495ED","f0e68c","778899","FF1493","F4A460","EE82EE","FFD720", "8b4513","4949A0","148b8b","14ff7f","556b2f","0FD9FA","10DC29","534081","0495CD","EF6CE8","BD34DA",
"247C1B","0C8E5D","635B03","CB7ED3","65ADEB","5C1ACC","F2F853","11F891","7B39AA","53EB10","54137D", "275222","F09F5B","3D0A4F","22F767","D63034","9A6980","DFB935","3793FA","90239D","E9AB2F","AF2FF3",
"057F94","B98519","388EEA","028151","A55043","0DE018","93AB1C","95BAF0","369976","18F71F","4B8987", "491B9E","829DC7","BCE635","CEA6DF","20D4AD","2D74FD","3C1C0D","12D6D4","48C000","2A51E2","E3AC12",
"FC42A8","2FC827","1A30BF","B740C2","42ACF5","2FD9DE","FAFB71","05D1CD","C471BD","94436E","C1F7EC", "CE79EE","BD1EF2","93B7E4","3214AA","184D3B","AE4B99","7E49D7","4C436E","FA24CC","CE76BE","A04E0A",
"9F945C","DCDE3D","10C9C5","70524D","0BE472","8A2CD7","6152C2","CF72A9","E59338","EEDC2D","D8C762","3FE65C" };

new Colors_BIG[100] = { 0x000000,0xFFFFFF,0x20B2AA,0xDC143C,0x6495ED,0xf0e68c,0x778899,0xFF1493,0xF4A460,0xEE82EE,0xFFD720, 0x8b4513,0x4949A0,0x148b8b,0x14ff7f,0x556b2f,0x0FD9FA,0x10DC29,0x534081,0x0495CD,0xEF6CE8,0xBD34DA,
0x247C1B,0x0C8E5D,0x635B03,0xCB7ED3,0x65ADEB,0x5C1ACC,0xF2F853,0x11F891,0x7B39AA,0x53EB10,0x54137D, 0x275222,0xF09F5B,0x3D0A4F,0x22F767,0xD63034,0x9A6980,0xDFB935,0x3793FA,0x90239D,0xE9AB2F,0xAF2FF3,
0x057F94,0xB98519,0x388EEA,0x028151,0xA55043,0x0DE018,0x93AB1C,0x95BAF0,0x369976,0x18F71F,0x4B8987, 0x491B9E,0x829DC7,0xBCE635,0xCEA6DF,0x20D4AD,0x2D74FD,0x3C1C0D,0x12D6D4,0x48C000,0x2A51E2,0xE3AC12,
0xFC42A8,0x2FC827,0x1A30BF,0xB740C2,0x42ACF5,0x2FD9DE,0xFAFB71,0x05D1CD,0xC471BD,0x94436E,0xC1F7EC, 0xCE79EE,0xBD1EF2,0x93B7E4,0x3214AA,0x184D3B,0xAE4B99,0x7E49D7,0x4C436E,0xFA24CC,0xCE76BE,0xA04E0A,
0x9F945C,0xDCDE3D,0x10C9C5,0x70524D,0x0BE472,0x8A2CD7,0x6152C2,0xCF72A9,0xE59338,0xEEDC2D,0xD8C762, 0x3FE65C };

#define PlayerToPoint%0(%1,%2,%3,%4,%5)	IsPlayerInRangeOfPoint(%2,%1,%3,%4,%5)
 
stock NoNalog(playerid)
{
	/*if (pInfo[playerid][pMember] == 5 || pInfo[playerid][pMember] == 6 || pInfo[playerid][pMember] == 12
	|| pInfo[playerid][pMember] == 13 || pInfo[playerid][pMember] == 14|| pInfo[playerid][pMember] == 15
	|| pInfo[playerid][pMember] == 17 || pInfo[playerid][pMember] == 18 || pInfo[playerid][pMember] == 24
	|| pInfo[playerid][pMember] == 25 || pInfo[playerid][pMember] == 26) return 1;
	if (pInfo[playerid][pLevel] > 3) */
	if (pInfo[playerid][pLevel] < 3) return 1;
	if (pInfo[playerid][pMember] == 0 && pInfo[playerid][pJob] == 0) return 1;
	if (pInfo[playerid][pMember] == 0 && pInfo[playerid][pKrisha] > 0) return 1;
	return 0;
} 

#define TICKETS_TYPE_ASK		0
#define TICKETS_TYPE_REPORT 	1 
enum E_REPORT_DATA
{
	rID,
	rPlayerID,
	rName[MAX_PLAYER_NAME],
	rText[116],
	rType,
	rWhenWroted_Text[10],
	rWhenWroted_Time,
	bool:rIsTooked,
	adminID,
};
new aReportInfo[MAX_REPORT_SLOTS][E_REPORT_DATA];
new aReportRepute[MAX_PLAYERS];

enum E_ADMIN_DATA {
	aID,
	aReport,
	aRepute,
	aJail,
	aMute,
	aPrison,
	aWarn,
	aBan,
	aRegIP[16],
	aPrefix[46],
	aColor[10]
}
new aAdminInfo[MAX_PLAYERS][E_ADMIN_DATA];
//
new Float:t_shop_respawn [ 5 ] [ 5 ] [ 4 ] =
{
	{
		// LS
		{550.4520,-1290.2399,16.9069,359.9997},
		{550.4520,-1290.2399,16.9069,359.9997},
		{550.4520,-1290.2399,16.9069,359.9997},
		{550.4520,-1290.2399,16.9069,359.9997},
		{550.4520,-1290.2399,16.9069,359.9997}
	},
	{
		// SF
		{-1970.9114,299.6954,34.8294,122.0621},
		{-1970.9114,299.6954,34.8294,122.0621},
		{-1970.9114,299.6954,34.8294,122.0621},
		{-1970.9114,299.6954,34.8294,122.0621},
		{-1970.9114,299.6954,34.8294,122.0621}
	},
	{
		// SF Jizzi
		{-1645.0502,1214.9567,6.8407,224.5430},
		{-1645.0502,1214.9567,6.8407,224.5430},
		{-1645.0502,1214.9567,6.8407,224.5430},
		{-1645.0502,1214.9567,6.8407,224.5430},
		{-1645.0502,1214.9567,6.8407,224.5430}
	},
	{
		//LV
		{2183.0361,1386.6908,10.4808,265.3998},
		{2214.5801,1386.1807,10.4803,269.6396},
		{2183.0361,1386.6908,10.4808,265.3998},
		{2214.5801,1386.1807,10.4803,269.6396},
		{2214.5801,1386.1807,10.4803,269.6396}
	},
	{
		// aircraft
		{-1456.2777,-622.3053,15.0701,327.8458},
		{-1394.8322,-620.4044,15.0675,332.3776},
		{-1331.7809,-622.2115,15.0646,336.1505},
		{-1268.4862,-622.9453,15.0675,335.5498},
		{-1351.0011,-529.1708,15.0675,175.8927}
	}
} ;

new const Float:TrailerShopReSpawn[2][7][4] =
{
	{
		// LS
		{1558.3260,-1012.5910,24.2624,180.5779},// pos 1
		{1562.9399,-1012.3473,24.2625,180.0580},// pos 2
		{1567.3844,-1012.1165,24.2664,180.2978},// pos 3
		{1571.9407,-1012.1432,24.2623,180.8025},// pos 4
		{1576.4175,-1011.7966,24.2625,181.2955},// pos 5
		{1581.4573,-1011.7250,24.2625,187.1180},// pos 6
		{1585.8260,-1011.0723,24.2623,186.6297}// pos 7
	},
	{
		// SF
		{1558.3260,-1012.5910,24.2624,180.5779},// pos 1
		{1562.9399,-1012.3473,24.2625,180.0580},// pos 2
		{1567.3844,-1012.1165,24.2664,180.2978},// pos 3
		{1571.9407,-1012.1432,24.2623,180.8025},// pos 4
		{1576.4175,-1011.7966,24.2625,181.2955},// pos 5
		{1581.4573,-1011.7250,24.2625,187.1180},// pos 6
		{1585.8260,-1011.0723,24.2623,186.6297}// pos 7
	}
} ;
/* Штрафстоянка */
#include 								"../source/systems/medcard.pwn"

#include 								"../source/systems/achievement.pwn"
#include 								"../source/systems/hospital.pwn"

#include 								"../source/systems/businesses.pwn"
#include 								"../source/player/rating.pwn"
#include 								"../source/items_cooording/coorging_items.pwn" 
#include 								"../source/systems/family.pwn"
#include 								"../source/systems/promo_referal.pwn"
#include 								"../source/systems/fraction.pwn"
#include 								"../source/systems/atm.pwn"
#include 								"../source/systems/stalls.pwn"



#include 								"../source/systems/duels.pwn"
#include 								"../source/systems/casino_dice.pwn"
#include 								"../source/systems/poffer.pwn"
#include 								"../source/systems/crashfix.pwn"
#include 								"../source/systems/seatdown.pwn"
//#include "../source/systems/gym.pwn" 
#include 								"../source/systems/job.pwn" 
#include 								"../source/systems/voting.pwn"
#include 								"../source/systems/airdrop.pwn"
#include 								"../source/systems/capture_stats.pwn"
#include 								"../source/systems/theft_job.pwn"
#include 								"../source/systems/dice_game.pwn"

stock invite_team(playerid, teamid)
{
    if (teamid == 0 || teamid > FRACTIONBANK_COUNT-1) return 1;
	if (!Iter_Contains(PlayerTeam[teamid], playerid)) {
		Iter_Add(PlayerTeam[teamid], playerid);
	}
	if (IsABiker(playerid)) {
		if (BikersTimer > 0 && bikers_frac_id[0] > 0) {
			if (pInfo[playerid][pMember] == bikers_frac_id[0] || pInfo[playerid][pMember] == bikers_frac_id[1]) {
				ShowTextDrawCapture(playerid, TYPE_WAR_BIKERS);
				SetPlayerColor(playerid, gFractionColor[teamid]); 
			}
		}
		if (BikersWarGZ != INVALID_GANGZONE_ID) {
			GangZoneShowForPlayer(playerid, BikersWarGZ, 0xB2B2B2AA);
			GangZoneFlashForPlayer(playerid, BikersWarGZ, COLOR_RED);
		}
	}
	if (IsAMafia(playerid))
	{
		if (ZoneTimer > 0 && mafia_frac_id[0] > 0)
		{
			if (pInfo[playerid][pMember] == mafia_frac_id[0] || pInfo[playerid][pMember] == mafia_frac_id[1])
			{
				ShowTextDrawCapture(playerid, TYPE_WAR_MAFIA);
				SetPlayerColor(playerid, gFractionColor[teamid]);
			}
		}
	}
	if (IsAGang(playerid))
	{
		new band = capture_band(teamid);
		if (band != 0xFFFF) {
			if (capture_now[band] != 0)
			{
				new zone = capture_now[band]-1;
				GangZoneFlashForPlayer(playerid, GZInfo[zone][gZone], GetGZColorF(teamid)); 
				ShowTextDrawCapture(playerid,GZInfo[zone][gTD]);
				SetPlayerColor(playerid,gFractionColor[teamid]);
			}
		}
	}
	
	return 1;
}

stock leave_team(playerid, teamid)
{
    if (teamid == 0 || teamid > FRACTIONBANK_COUNT-1) return 1;
	Iter_Remove(PlayerTeam[teamid], playerid);
	if (IsABiker(playerid)) {
		if (BikersTimer > 0 && bikers_frac_id[0] > 0) {
			if (pInfo[playerid][pMember] == bikers_frac_id[0] || pInfo[playerid][pMember] == bikers_frac_id[1]) {
				HideTextDrawCapture(playerid, TYPE_WAR_BIKERS);
				/*for(new i_ = 0; i_ < 5; i_++)
				{
					if (!player_mobile[playerid])  SendDeathMessageToPlayer(playerid,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
				}*/
			}
		}
		if (BikersWarGZ != INVALID_GANGZONE_ID) {
			GangZoneStopFlashForPlayer(playerid, BikersWarGZ);
			GangZoneHideForPlayer(playerid, BikersWarGZ);
		} 
	}
	if (IsAMafia(playerid))
	{
		if (ZoneTimer > 0 && mafia_frac_id[0] > 0)
		{
			if (pInfo[playerid][pMember] == mafia_frac_id[0] || pInfo[playerid][pMember] == mafia_frac_id[1])
			{
				HideTextDrawCapture(playerid, TYPE_WAR_MAFIA);
				/*for(new i_ = 0; i_ < 5; i_++)
				{
					if (!player_mobile[playerid])  SendDeathMessageToPlayer(playerid,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
				}*/
			}
		}
	}
	if (IsAGang(playerid))
	{
		new band = capture_band(teamid);
		if (band != 0xFFFF) {
			if (capture_now[band] != 0)
			{
				/*for(new i_ = 0; i_ < 5; i_++)
				{
					if (!player_mobile[playerid]) SendDeathMessageToPlayer(playerid,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
				} */
				HideTextDrawCapture(playerid,GZInfo[capture_now[band]-1][gTD]);
			}
		}
	} 
	return 1;
}

main()
{
    new
		dd, mm, yy;
	gettime(hour,minute,second);
	getdate(yy,mm,dd);
	print("________________________________________________________________________________");
	print("—————————————    BOP    —————————————");
	print("________________________________________________________________________________");
	print("— "MODE_NAME" Loaded!");
	printf("— LIMITS: VEHICLE:%d", MAX_VEHICLES);
	printf("— Gamemode started in [%02d:%02d:%02d %02d/%02d/%02d]",hour,minute,second,dd,mm,yy);
	printf("— Current Pickups = %d",CountDynamicPickups());
	printf("— Current Objects = %d",CountDynamicObjects());
	printf("— Current 3DText  = %d",CountDynamic3DTextLabels());
	printf("— Current MapIcons = %d (SD: %f)",CountDynamicMapIcons(), STREAMER_MAP_ICON_SD);
	printf("— Current Checkpoints = %d",CountDynamicCPs());
	printf("— Current Race Checkpoints = %d",CountDynamicRaceCPs());
	printf("— Current Areas = %d", CountDynamicAreas());
	print("________________________________________________________________________________"); 
}
stock GetEngineStatus(vehicleid)
{
    GetVehicleParamsEx(vehicleid, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	return engine1;
}  
stock IsANews(playerid) {
	if (!IsPlayerConnected(playerid)) return 0;
	switch(pInfo[playerid][pMember]) {
		case FRACTION_SF_NEWS, FRACTION_LS_NEWS, FRACTION_LV_NEWS: return 1;
	}  
	return 0;
}
stock IsAMedic(playerid) {
	if (!IsPlayerConnected(playerid)) return 0;
	switch(pInfo[playerid][pMember]) {
		case FRACTION_HOSPITAL_SF, FRACTION_HOSPITAL_LS, FRACTION_HOSPITAL_LV: return 1;
	}  
	return 0;
} 
stock IsAMayor(playerid) {
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember] == FRACTION_CITYHALL) return 1;
	return 0;
}
stock IsAFBI(playerid) {
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember] == FRACTION_FBI) return 1;
	return 0;
}
stock IsALicenser(playerid) {
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember] == FRACTION_AUTOSCHOOL) return 1;
	return 0;
}
stock IsACop(playerid)
{
	if (!IsPlayerConnected(playerid)) return 0;
	switch(pInfo[playerid][pMember]) {
		case FRACTION_LSPD, FRACTION_SFPD, FRACTION_LVPD, FRACTION_FBI: return 1;
	} 
	return 0;
}
stock IsAGosFraction(playerid)
{
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember] == FRACTION_LSPD || pInfo[playerid][pMember] == FRACTION_FBI || pInfo[playerid][pMember] == FRACTION_SFPD 
		|| pInfo[playerid][pMember] == FRACTION_LVPD || pInfo[playerid][pMember] == FRACTION_ARMY_SF || pInfo[playerid][pMember] == FRACTION_ARMY_LV || pInfo[playerid][pMember] == FRACTION_CITYHALL) return 1; 
	return 0;
}
stock IsAArmy(playerid)
{
	if(!IsPlayerConnected(playerid)) return 0;
	if(pInfo[playerid][pMember] == 3 || pInfo[playerid][pMember] == 19) return 1;
	else if(pInfo[playerid][pLeader] == 3 || pInfo[playerid][pLeader] == 19) return 1;
	return 0;
}
/*
stock IsAArmy(playerid)
{
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember] == FRACTION_ARMY_SF || pInfo[playerid][pMember] == FRACTION_ARMY_LV) return 1; 
	return 0;
}*/
stock IsAMafia(playerid)
{
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember] == FRACTION_LCN || pInfo[playerid][pMember] == FRACTION_YAKUZA || pInfo[playerid][pMember] == FRACTION_RUSSIAN) return 1; 
	return 0;
}
stock IsABiker(playerid)
{
	if (!IsPlayerConnected(playerid)) return 0;
	if (pInfo[playerid][pMember]== 24 || pInfo[playerid][pMember]==25 || pInfo[playerid][pMember]==26) return 1; 
	return 0;
}
stock IsAGang(playerid)
{
	if (!IsPlayerConnected(playerid)) return 0;
	switch(pInfo[playerid][pMember])
	{
		case FRACTION_PIRUS, FRACTION_BALLAS, FRACTION_VAGOS, FRACTION_GROVE, FRACTION_RIFA, FRACTION_AZTEC: return 1;
		default: return 0;
	} 
	return 0;
}
stock IsATerra(playerid)
{
	if (pInfo[playerid][pMember] == FRACTION_BALLAS && IsPlayerInRangeOfPoint(playerid, 20.0,2651.4746,-2004.3387,13.3828) // Ballas
			||pInfo[playerid][pMember] == FRACTION_VAGOS && IsPlayerInRangeOfPoint(playerid, 20.0, 2770.7471,-1628.7227,12.1775) // Vagos
			||pInfo[playerid][pMember] == FRACTION_GROVE && IsPlayerInRangeOfPoint(playerid, 20.0, 2492.7532,-1676.3687,13.3380) // Groove
			||pInfo[playerid][pMember] == FRACTION_AZTEC && IsPlayerInRangeOfPoint(playerid, 20.0, 1672.0626,-2113.1340,13.5469) // Aztecas
			||pInfo[playerid][pMember] == FRACTION_RIFA && IsPlayerInRangeOfPoint(playerid, 20.0, 2184.1218,-1803.6334,13.3693)) return 1; // Rifa
	else return 0;
}
stock IsAMedKit(playerid)
{
    if (pInfo[playerid][pMember] == FRACTION_BALLAS && 	IsPlayerInRangeOfPoint(playerid, 20.0, -194.1146,88.6843,973.3170) && GetPlayerVirtualWorld(playerid) == 1 // Ballas Base
		||pInfo[playerid][pMember] == FRACTION_VAGOS && IsPlayerInRangeOfPoint(playerid, 20.0, 2794.1233,-1607.5570,-36.5231) // Vagos Base
		||pInfo[playerid][pMember] == FRACTION_GROVE && IsPlayerInRangeOfPoint(playerid, 20.0, 2496.0129,-1708.9232,1014.7422) // Groove Base
		||pInfo[playerid][pMember] == FRACTION_AZTEC && IsPlayerInRangeOfPoint(playerid, 20.0, -49.7558,1400.3553,1084.4297) // Aztecas Base
		||pInfo[playerid][pMember] == FRACTION_RIFA &&  IsPlayerInRangeOfPoint(playerid, 20.0, 2808.9631,-1169.0806,1025.5703) // rifa
		||pInfo[playerid][pMember] == FRACTION_LCN && GetPlayerInterior(playerid) == LCN_INTERIOR && GetPlayerVirtualWorld(playerid) == 1
		||pInfo[playerid][pMember] == FRACTION_YAKUZA && GetPlayerInterior(playerid) == YAKUZA_INTERIOR && GetPlayerVirtualWorld(playerid) == 1
		||pInfo[playerid][pMember] == FRACTION_RUSSIAN && GetPlayerInterior(playerid) == RM_INTERIOR && GetPlayerVirtualWorld(playerid) == 1) return 1;
	else return 0;
}  
stock IsAFoods(playerid)
{
	if (IsPlayerInRangeOfPoint(playerid, 2, -2420.219, 984.578, 44.297)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2420.180, 985.945, 44.297)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2225.203, -1153.422, 1025.906)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2576.703, -1284.430, 1061.094)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2155.906, 1606.773, 1000.055)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2209.906, 1607.195, 1000.055)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2222.203, 1606.773, 1000.055)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 495.969, -24.320, 1000.734)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 501.828, -1.430, 1000.734)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 373.828, -178.141, 1000.734)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 330.680, 178.500, 1020.070)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 331.922, 178.500, 1020.070)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 350.906, 206.086, 1008.477)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 361.563, 158.617, 1008.477)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 371.594, 178.453, 1020.070)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 374.891, 188.977, 1008.477)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2155.844, 1607.875, 1000.063)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2202.453, 1617.008, 1000.063)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2209.242, 1621.211, 1000.063)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2222.367, 1602.641, 1000.063)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 500.563, -1.367, 1000.734)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 379.039, -178.883, 1000.734)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2480.86,-1959.27,12.9609)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1634.11,-2237.53,12.8906)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2139.52,-1161.48,23.3594)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2153.23,-1016.15,62.2344)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -1350.12,493.859,10.5859)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2229.19,286.414,34.7031)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1659.46,1722.86,10.2188)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2647.7,1129.66,10.2188)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2845.73,1295.05,10.7891)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1398.84,2222.61,10.4219)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -1455.12,2591.66,55.2344)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -76.0312,1227.99,19.125)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 662.43,-552.164,15.7109)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -253.742,2599.76,62.2422)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2271.73,-76.4609,25.9609)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1789.21,-1369.27,15.1641)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1729.79,-1943.05,12.9453)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2060.12,-1897.64,12.9297)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1928.73,-1772.45,12.9453)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2325.98,-1645.13,14.2109)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2352.18,-1357.16,23.7734)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1154.73,-1460.89,15.1562)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -1350.12,492.289,10.5859)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2118.97,-423.648,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2118.62,-422.414,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2097.27,-398.336,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2092.09,-490.055,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2063.27,-490.055,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2005.65,-490.055,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2034.46,-490.055,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2068.56,-398.336,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2039.85,-398.336,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -2011.14,-398.336,34.7266)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -1980.79,142.664,27.0703)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2319.99,2532.85,10.2188)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1520.15,1055.27,10.00)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2503.14,1243.7,10.2188)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 2085.77,2071.36,10.4531)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -862.828,1536.61,21.9844)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -14.7031,1175.36,18.9531)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, -253.742,2597.95,62.2422)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 201.016,-107.617,0.898438)) return 1;
	else if (IsPlayerInRangeOfPoint(playerid, 2, 1277.84,372.516,18.9531)) return 1;
	else return 0;
}
stock IsABoat(carid){
	if (GetVehicleState(carid) == VEHICLE_STATE_BOAT) return 1;
	return 0;
}
stock IsAVehicle(carid) {
	if (GetVehicleState(carid) == VEHICLE_STATE_CAR) return 1;
	return 0;
}
stock IsARCVehicle(carid) {
	if (GetVehicleState(carid) == VEHICLE_RADIO_REMOTE) return 1;
	return 0;
}
stock IsANoSTO(carid) {
	switch(GetVehicleModel(carid)) {
		case 576: return 1;
	}
	return 0;
}

stock IsABike(carid){
	if (GetVehicleState(carid) == VEHICLE_STATE_BIKE) return 1;
	return 0;
} 
stock GetXYInBackOfPlayer(const playerid, &Float:x, &Float:y, const Float:distance)
{
	new Float:a;
	GetPlayerPos(playerid, x, y, a);
	GetPlayerFacingAngle(playerid, a);
	if (IsPlayerInAnyVehicle(playerid))
	{
		new vid=GetPlayerVehicleID(playerid);
		if (vid > 0 && vid <= MAX_VEHICLES)GetVehicleZAngle(vid, a);
	}
	x -= (distance * floatsin(-a, degrees)); y -= (distance * floatcos(-a, degrees));
}
stock IsAPlane(carid){
	if (GetVehicleState(carid) == VEHICLE_STATE_PLANE) return 1;
	return 0;
}

stock CreateTextDraws(playerid)
{ 

Push_PTD[playerid][0] = CreatePlayerTextDraw(playerid, 0.0588, 235.4999, "LD_SPAC:white"); // пусто
PlayerTextDrawTextSize(playerid, Push_PTD[playerid][0], 144.0000, 5.0000);
PlayerTextDrawAlignment(playerid, Push_PTD[playerid][0], 1);
PlayerTextDrawColor(playerid, Push_PTD[playerid][0], -5963521);
PlayerTextDrawBackgroundColor(playerid, Push_PTD[playerid][0], 255);
PlayerTextDrawFont(playerid, Push_PTD[playerid][0], 4);
PlayerTextDrawSetProportional(playerid, Push_PTD[playerid][0], 0);
PlayerTextDrawSetShadow(playerid, Push_PTD[playerid][0], 0);

Push_PTD[playerid][1] = CreatePlayerTextDraw(playerid, 130.8824, 227.9166, "LD_BEAT:chit"); // пусто
PlayerTextDrawTextSize(playerid, Push_PTD[playerid][1], 16.0000, 14.0000);
PlayerTextDrawAlignment(playerid, Push_PTD[playerid][1], 1);
PlayerTextDrawColor(playerid, Push_PTD[playerid][1], -5963521);
PlayerTextDrawBackgroundColor(playerid, Push_PTD[playerid][1], 255);
PlayerTextDrawFont(playerid, Push_PTD[playerid][1], 4);
PlayerTextDrawSetProportional(playerid, Push_PTD[playerid][1], 0);
PlayerTextDrawSetShadow(playerid, Push_PTD[playerid][1], 0);

Push_PTD[playerid][2] = CreatePlayerTextDraw(playerid, -4.6470, 230.2499, "LD_SPAC:white"); // пусто
PlayerTextDrawTextSize(playerid, Push_PTD[playerid][2], 142.0000, 15.0000);
PlayerTextDrawAlignment(playerid, Push_PTD[playerid][2], 1);
PlayerTextDrawColor(playerid, Push_PTD[playerid][2], -5963521);
PlayerTextDrawBackgroundColor(playerid, Push_PTD[playerid][2], 255);
PlayerTextDrawFont(playerid, Push_PTD[playerid][2], 4);
PlayerTextDrawSetProportional(playerid, Push_PTD[playerid][2], 0);
PlayerTextDrawSetShadow(playerid, Push_PTD[playerid][2], 0);

Push_PTD[playerid][3] = CreatePlayerTextDraw(playerid, 130.8823, 233.7500, "LD_BEAT:chit"); // пусто
PlayerTextDrawTextSize(playerid, Push_PTD[playerid][3], 16.0000, 14.0000);
PlayerTextDrawAlignment(playerid, Push_PTD[playerid][3], 1);
PlayerTextDrawColor(playerid, Push_PTD[playerid][3], -5963521);
PlayerTextDrawBackgroundColor(playerid, Push_PTD[playerid][3], 255);
PlayerTextDrawFont(playerid, Push_PTD[playerid][3], 4);
PlayerTextDrawSetProportional(playerid, Push_PTD[playerid][3], 0);
PlayerTextDrawSetShadow(playerid, Push_PTD[playerid][3], 0);

Push_PTD[playerid][4] = CreatePlayerTextDraw(playerid, 4.3529, 232.5832, "COOЂЉEH…E_OT_AѓM…H…CTPATOPA"); // пусто
PlayerTextDrawLetterSize(playerid, Push_PTD[playerid][4], 0.2432, 1.0224);
PlayerTextDrawAlignment(playerid, Push_PTD[playerid][4], 1);
PlayerTextDrawColor(playerid, Push_PTD[playerid][4], -1);
PlayerTextDrawBackgroundColor(playerid, Push_PTD[playerid][4], 255);
PlayerTextDrawFont(playerid, Push_PTD[playerid][4], 1);
PlayerTextDrawSetProportional(playerid, Push_PTD[playerid][4], 1);
PlayerTextDrawSetShadow(playerid, Push_PTD[playerid][4], 0);	

    Load_Textures[playerid][0] = CreatePlayerTextDraw(playerid, 392.333435, 368.196136, "usebox");
	PlayerTextDrawLetterSize(playerid, Load_Textures[playerid][0], 0.000000, 2.077160);
	PlayerTextDrawTextSize(playerid, Load_Textures[playerid][0], 248.666595, 0.000000);
	PlayerTextDrawAlignment(playerid, Load_Textures[playerid][0], 1);
	PlayerTextDrawColor(playerid, Load_Textures[playerid][0], 0);
	PlayerTextDrawUseBox(playerid, Load_Textures[playerid][0], true);
	PlayerTextDrawBoxColor(playerid, Load_Textures[playerid][0], COLOR_SERVER);
	PlayerTextDrawSetShadow(playerid, Load_Textures[playerid][0], 0);
	PlayerTextDrawSetOutline(playerid, Load_Textures[playerid][0], 0);
	PlayerTextDrawFont(playerid, Load_Textures[playerid][0], 0);

	Load_Textures[playerid][1] = CreatePlayerTextDraw(playerid, 255.666625, 369.599945, "LOADING TEXTURES...");
	PlayerTextDrawLetterSize(playerid, Load_Textures[playerid][1], 0.300333, 1.504592);
	PlayerTextDrawAlignment(playerid, Load_Textures[playerid][1], 1);
	PlayerTextDrawColor(playerid, Load_Textures[playerid][1], -1);
	PlayerTextDrawSetShadow(playerid, Load_Textures[playerid][1], 0);
	PlayerTextDrawSetOutline(playerid, Load_Textures[playerid][1], 1);
	PlayerTextDrawBackgroundColor(playerid, Load_Textures[playerid][1], 51);
	PlayerTextDrawFont(playerid, Load_Textures[playerid][1], 2);
	PlayerTextDrawSetProportional(playerid, Load_Textures[playerid][1], 1);

	Load_Textures[playerid][2] = CreatePlayerTextDraw(playerid, 390.000122, 370.855438, "usebox");
	PlayerTextDrawLetterSize(playerid, Load_Textures[playerid][2], 0.000000, 1.510493);
	PlayerTextDrawTextSize(playerid, Load_Textures[playerid][2], 250.999877, 0.000000);
	PlayerTextDrawAlignment(playerid, Load_Textures[playerid][2], 1);
	PlayerTextDrawColor(playerid, Load_Textures[playerid][2], 0);
	PlayerTextDrawUseBox(playerid, Load_Textures[playerid][2], true);
	PlayerTextDrawBoxColor(playerid, Load_Textures[playerid][2], 255);
	PlayerTextDrawSetShadow(playerid, Load_Textures[playerid][2], 0);
	PlayerTextDrawSetOutline(playerid, Load_Textures[playerid][2], 0);
	PlayerTextDrawFont(playerid, Load_Textures[playerid][2], 0);	

money_PTD[playerid][0] = CreatePlayerTextDraw(playerid, 564.9998, 81.3184, "10.000.000"); // пусто
PlayerTextDrawLetterSize(playerid, money_PTD[playerid][0], 0.2073, 1.3054);
PlayerTextDrawTextSize(playerid, money_PTD[playerid][0], 0.0000, 868.0000);
PlayerTextDrawAlignment(playerid, money_PTD[playerid][0], 2);
PlayerTextDrawColor(playerid, money_PTD[playerid][0], -1);
PlayerTextDrawBackgroundColor(playerid, money_PTD[playerid][0], 255);
PlayerTextDrawFont(playerid, money_PTD[playerid][0], 2);
PlayerTextDrawSetProportional(playerid, money_PTD[playerid][0], 1);
PlayerTextDrawSetShadow(playerid, money_PTD[playerid][0], 0);

	#if defined _casino_included
	CasinoRoulettePTD[playerid] = CreatePlayerTextDraw(playerid, 320.000000, 120.000000, " ");
	PlayerTextDrawLetterSize(playerid, CasinoRoulettePTD[playerid], 0.479583, 2.419258);
	PlayerTextDrawTextSize(playerid, CasinoRoulettePTD[playerid], 0.000000, 410.000000);
	PlayerTextDrawAlignment(playerid, CasinoRoulettePTD[playerid], 2);
	PlayerTextDrawColor(playerid, CasinoRoulettePTD[playerid], 336860415);
	PlayerTextDrawSetShadow(playerid, CasinoRoulettePTD[playerid], 0);
	PlayerTextDrawSetOutline(playerid, CasinoRoulettePTD[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, CasinoRoulettePTD[playerid], 255);
	PlayerTextDrawFont(playerid, CasinoRoulettePTD[playerid], 2);
	PlayerTextDrawSetProportional(playerid, CasinoRoulettePTD[playerid], 1);
	#endif
	tRace_PTD[playerid] = CreatePlayerTextDraw(playerid, 20.9993, 241.8366, "CONTROL_POINT:~w~00/52"); // пусто
	PlayerTextDrawLetterSize(playerid, tRace_PTD[playerid], 0.2304, 0.8533);
	PlayerTextDrawTextSize(playerid, tRace_PTD[playerid], 231.0000, 0.0000);
	PlayerTextDrawAlignment(playerid, tRace_PTD[playerid], 1);
	PlayerTextDrawColor(playerid, tRace_PTD[playerid], COLOR_SERVER);
	PlayerTextDrawSetOutline(playerid, tRace_PTD[playerid], -1);
	PlayerTextDrawBackgroundColor(playerid, tRace_PTD[playerid], -754100980);
	PlayerTextDrawFont(playerid, tRace_PTD[playerid], 1);
	PlayerTextDrawSetProportional(playerid, tRace_PTD[playerid], 1);
	PlayerTextDrawSetShadow(playerid, tRace_PTD[playerid], 0);
	//
	CapturePTD[playerid] = CreatePlayerTextDraw(playerid, 34.966316, 270.059020, "_");
	PlayerTextDrawLetterSize(playerid, CapturePTD[playerid], 0.214081, 0.870176);
	PlayerTextDrawTextSize(playerid, CapturePTD[playerid], 126.000000, 0.000000);
	PlayerTextDrawAlignment(playerid, CapturePTD[playerid], 1);
	PlayerTextDrawColor(playerid, CapturePTD[playerid], -1061109505);
	PlayerTextDrawSetShadow(playerid, CapturePTD[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, CapturePTD[playerid], 51);
	PlayerTextDrawFont(playerid, CapturePTD[playerid], 1);
	PlayerTextDrawSetProportional(playerid, CapturePTD[playerid], 0);
    // Кости
	PlayerBone[playerid][0] = CreatePlayerTextDraw(playerid, 556.603332, 142.333358, "Table_1");
	PlayerTextDrawLetterSize(playerid, PlayerBone[playerid][0], 0.491228, 1.524165);
	PlayerTextDrawAlignment(playerid, PlayerBone[playerid][0], 2);
	PlayerTextDrawColor(playerid, PlayerBone[playerid][0], 548012031);
	PlayerTextDrawUseBox(playerid, PlayerBone[playerid][0], true);
	PlayerTextDrawBoxColor(playerid, PlayerBone[playerid][0], 0);
	PlayerTextDrawSetShadow(playerid, PlayerBone[playerid][0], 0);
	PlayerTextDrawSetOutline(playerid, PlayerBone[playerid][0], 1);
	PlayerTextDrawBackgroundColor(playerid, PlayerBone[playerid][0], 51);
	PlayerTextDrawFont(playerid, PlayerBone[playerid][0], 0);
	PlayerTextDrawSetProportional(playerid, PlayerBone[playerid][0], 1);

	PlayerBone[playerid][1] = CreatePlayerTextDraw(playerid, 527.309020, 163.916000, "John_Turner~n~Andriano_Marez~n~Carl_Matador~n~--~n~--");
	PlayerTextDrawLetterSize(playerid, PlayerBone[playerid][1], 0.175188, 1.010665);
	PlayerTextDrawAlignment(playerid, PlayerBone[playerid][1], 1);
	PlayerTextDrawColor(playerid, PlayerBone[playerid][1], -1347440641);
	PlayerTextDrawUseBox(playerid, PlayerBone[playerid][1], true);
	PlayerTextDrawBoxColor(playerid, PlayerBone[playerid][1], 0);
	PlayerTextDrawSetShadow(playerid, PlayerBone[playerid][1], 0);
	PlayerTextDrawSetOutline(playerid, PlayerBone[playerid][1], 1);
	PlayerTextDrawBackgroundColor(playerid, PlayerBone[playerid][1], 51);
	PlayerTextDrawFont(playerid, PlayerBone[playerid][1], 1);
	PlayerTextDrawSetProportional(playerid, PlayerBone[playerid][1], 1);

	PlayerBone[playerid][2] = CreatePlayerTextDraw(playerid, 585.057067, 165.082687, "++~n~--~n~++~n~--~n~--");
	PlayerTextDrawLetterSize(playerid, PlayerBone[playerid][2], 0.175188, 1.010665);
	PlayerTextDrawAlignment(playerid, PlayerBone[playerid][2], 2);
	PlayerTextDrawColor(playerid, PlayerBone[playerid][2], -1347440641);
	PlayerTextDrawUseBox(playerid, PlayerBone[playerid][2], true);
	PlayerTextDrawBoxColor(playerid, PlayerBone[playerid][2], 0);
	PlayerTextDrawSetShadow(playerid, PlayerBone[playerid][2], 0);
	PlayerTextDrawSetOutline(playerid, PlayerBone[playerid][2], 1);
	PlayerTextDrawBackgroundColor(playerid, PlayerBone[playerid][2], 51);
	PlayerTextDrawFont(playerid, PlayerBone[playerid][2], 1);
	PlayerTextDrawSetProportional(playerid, PlayerBone[playerid][2], 1);

	PlayerBone[playerid][3] = CreatePlayerTextDraw(playerid, 527.086486, 214.666687, "Bet:_100000~n~Bank:_200000~n~Money:_330500");
	PlayerTextDrawLetterSize(playerid, PlayerBone[playerid][3], 0.186432, 1.115664);
	PlayerTextDrawAlignment(playerid, PlayerBone[playerid][3], 1);
	PlayerTextDrawColor(playerid, PlayerBone[playerid][3], -1347440641);
	PlayerTextDrawSetShadow(playerid, PlayerBone[playerid][3], 0);
	PlayerTextDrawSetOutline(playerid, PlayerBone[playerid][3], 1);
	PlayerTextDrawBackgroundColor(playerid, PlayerBone[playerid][3], 51);
	PlayerTextDrawFont(playerid, PlayerBone[playerid][3], 1);
	PlayerTextDrawSetProportional(playerid, PlayerBone[playerid][3], 1);

    FishingText[playerid] = CreatePlayerTextDraw(playerid,49.194732, 245.583328, "~y~Press: ~w~L.Alt~n~~n~~y~Tackle: ~w~0~n~~y~Worms: ~w~0~n~~y~Sonar: ~w~0");
	PlayerTextDrawAlignment(playerid,FishingText[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid,FishingText[playerid], 255);
	PlayerTextDrawFont(playerid,FishingText[playerid], 1);
	PlayerTextDrawLetterSize(playerid,FishingText[playerid], 0.388624, 1.220832);
	PlayerTextDrawColor(playerid,FishingText[playerid], 0xFFFF1FAA);
	PlayerTextDrawSetOutline(playerid,FishingText[playerid], 0);
	PlayerTextDrawSetProportional(playerid,FishingText[playerid], 1);
	PlayerTextDrawSetShadow(playerid,FishingText[playerid], 0);
	PlayerTextDrawSetSelectable(playerid,FishingText[playerid], 0);
	PlayerTextDrawHide(playerid,FishingText[playerid]);
    #include 	"../source/robGangMafia_server.pwn" 
	#include 	"../source/speedometr_server.pwn"
	#if !REMOVE_BUILDINGS_DISABLED 
		#include    "../source/map/removeObject_server.pwn"
		#include	"../source/map/removeObject_CR.pwn"
		#include	"../source/map/removeObject_LSa.pwn"
		#include	"../source/map/removeObject_LVa.pwn"
		#include	"../source/map/removeObject_SFa.pwn"
		#include    "../source/map/removeObject_FArm.pwn"
	#else
		SendClientMessage(playerid, -1, !"[debug] Функция RemovePlayerBuilding временно отключена!");
	#endif
	#if defined _poffer_inc
		poffer_OnPlayerConnect(playerid);
	#endif

	#if defined _quest_inc
		quest_OnPlayerConnect(playerid);
	#endif

	#if defined _casino_included
		casino_OnPlayerConnect(playerid);
	#endif
	achiev_OnPlayerConnect(playerid); 
} 

				
stock SetPlayerDataToDefault(playerid, time)
{
	ResetPlayerWeapons(playerid);
	SetPlayerColor(playerid, TEAM_HIT_COLOR);
	#if defined _capture_stats_inc
		CaptureInfo[playerid][pCaptureStatsGUI] = false;
	#endif
 
	player_sms_on{playerid} 				= 
	carshot_cheat_count { playerid } 		=
	is_player_nonpark_zone { playerid } 	= 
	anim_loaded{playerid} 					= 0;

	Sonar[playerid] = random(2000);

	pTemp[playerid] = defaultPlayerTemp; 
	pInfo[playerid] = defaultPlayerInfo;
	CallInfo[playerid] = defaultCallInfo; 
	gFollowInfo[playerid] = defaultFollowInfo; 
	ChristmasInfo[playerid] = defaultChristmasInfo; 
	SupportInfo[playerid] = defaultSupportInfo;
	YoutubeInfo[playerid] = defaultYoutubeInfo;
	ManagerInfo[playerid] = defaultManagerInfo;

	//trucker_PTD[playerid] = PlayerText:-1;
	TimerTrucker_PTD[playerid] = PlayerText:-1;
	#if defined _blackjack_included
		BJ_PlayerInfo[playerid] = NULL_BJ_PI;
	#endif 
	//Хуета
	PlayerVehicleIn[playerid] = 0;
	tipster[playerid] = 0; 
	tipsterlisten[playerid] = 0;
	recognition[playerid] = 0;  
	ContractInfo[playerid][cZakaz] 	= INVALID_PLAYER_ID;
	ContractInfo[playerid][cHitman] = INVALID_PLAYER_ID; 
	aAdminInfo[playerid][aID] 			=
	aAdminInfo[playerid][aReport] 		= 
	aAdminInfo[playerid][aRepute] 		= 
	aAdminInfo[playerid][aJail] 		= 
	aAdminInfo[playerid][aMute] 		= 
	aAdminInfo[playerid][aPrison] 		= 
	aAdminInfo[playerid][aWarn] 		= 
	aAdminInfo[playerid][aBan] 			= 
	gOnlinePlayer[playerid][0] 			=
	gOnlinePlayer[playerid][1] 			=
	gOnlinePlayerAFK[playerid][0] 		=
	gOnlinePlayerAFK[playerid][1] 		= 
	FirstFire[playerid] 				= 
	DamagerTime[playerid] 				= 
	Damager{playerid} 					= 
	ChangeSkin[playerid] 				= 0;  
	NewTazer[playerid] = false;  
	tookmoped[playerid] = INVALID_VEHICLE_ID;
	arenda[playerid] = INVALID_VEHICLE_ID;
	IsFind[playerid] = INVALID_PLAYER_ID; 
	MatsArmyCar[playerid] = 0;
	ShowBoxSearchWanted[playerid] = INVALID_GANGZONE_ID; 
	TDActText[playerid] = Text3D:0;
	LabelRecognition[playerid] = Text3D:0;
	SetPlayerArmour(playerid, 0);
     
	Select[playerid][SelectCharWedding] = 0;
	Select[playerid][SelectCharSkill] = 0; 
    Select[playerid][SelectCharEvict] = 0;
    Select[playerid][SelectCharTicket] = 0; 
	SpecAd[playerid] = INVALID_PLAYER_ID;
	SpecID[playerid] = INVALID_PLAYER_ID;
	//Spectate[playerid] = false;
	LastReconClick[playerid][0] = 0;
	LastReconClick[playerid][1] = 0;
	ReconSelect[playerid] = INVALID_TEXT_DRAW;
	ReconSelectSub[playerid] = INVALID_TEXT_DRAW;

	//Еще больше хуета чем выше
	KeysOffer[playerid] = 999;
	KeysGram[playerid]= 999;
	KeysPrice[playerid]= 999;
	FreeOffer[playerid]= 999;
	Pefir[playerid] = 0;
	JobAmmount[playerid] = 0;
    JobOffer[playerid] = 999;
	Employer[playerid] = 999;
	CP[playerid] = 0;
	TalkingLive[playerid] = 255;
	TalkingLivels[playerid] = 255;
	TalkingLivelv[playerid] = 255;
	LiveOffer[playerid] = 999;
	LiveOfferlv[playerid] = 999;
	LiveOfferls[playerid] = 999; 
	TieTime[playerid] = 0; 
	RefillPrice[playerid] = 0; 
	PlayerCuffedTime[playerid] = 0;
	Mobile[playerid] = 999;
	Tel[playerid] = 255;
	lNews[playerid] = true;
	gNews[playerid] = true;
	LvNews[playerid] = true;  
	aAdminInfo[playerid][aRegIP] 	= 0;
 	//
	for(new i = 0; i < AC_MAX_CODES; i++)
        pAntiCheatLastCodeTriggerTime[playerid][i] = -1;

    pAntiCheatSettingsPage{playerid} = 0; // Присваиваем значение 0 переменной, хранящей номер страницы настроек анти-чита, на которой находится игрок
    pAntiCheatSettingsEditCodeId[playerid] = -1; // Присваиваем переменной, хранящей идентификатор (ID) кода анти-чита, который редактирует игрок, занчение -1 
	WantNickChange[playerid] = "None";
	ResetPlayerMoney(playerid);
	
	pSpecture[playerid][sID] = INVALID_PLAYER_ID;
	for(new s; s < 3; s++)
	{
		pSpecture[playerid][sShout][s] = 0;
		pSpecture[playerid][sAFKplayer][s] = 0;
	}
	pSpecture[playerid][sShout][3] = 0; 
    GangZoneShowForPlayer(playerid, SFa, COLOR_YELLOW2);
	GangZoneShowForPlayer(playerid, LSport, COLOR_YELLOW2);
	GangZoneShowForPlayer(playerid, Army, COLOR_YELLOW2);
    GangZoneShowForPlayer(playerid, hunterGZ, 0x8ac8ff55);
	printf("[Clear Info ...] Данные из SetPlayerDataToDefault. Время: %d!", GetTickCount() - time); 
}
//Конец new

stock ProxDetector(playerid, Float:max_range, color, const string[], Float:max_ratio = 1.6)
{
    new
        Float:pos_x,
        Float:pos_y,
        Float:pos_z,
        Float:range,
        Float:range_ratio,
        Float:range_with_ratio,
        clr_r, clr_g, clr_b,
        Float:color_r, Float:color_g, Float:color_b;

    if (!GetPlayerPos(playerid, pos_x, pos_y, pos_z)) {
        return 0;
    }

    color_r = float(color >> 24 & 0xFF);
    color_g = float(color >> 16 & 0xFF);
    color_b = float(color >> 8 & 0xFF);
    range_with_ratio = max_range * max_ratio; 
    foreach(new i: PlayerInLogin)
    {
        if (!IsPlayerStreamedIn(playerid, i)) continue; 
        range = GetPlayerDistanceFromPoint(i, pos_x, pos_y, pos_z);
        if (range > max_range) continue;

        range_ratio = (range_with_ratio - range) / range_with_ratio;
        clr_r = floatround(range_ratio * color_r);
        clr_g = floatround(range_ratio * color_g);
        clr_b = floatround(range_ratio * color_b);

        SendClientMessage(i, (color & 0xFF) | (clr_b << 8) | (clr_g << 16) | (clr_r << 24), string);
    } 
    SendClientMessage(playerid, color, string);
    return 1;
} 

Convert(number)
{
	new hours = 0, mins = 0, secs = 0, str[100];
	hours = floatround(number / 3600);
	mins = floatround((number / 60) - (hours * 60));
	secs = floatround(number - ((hours * 3600) + (mins * 60)));
	if (hours > 0) format(str, 100, "%d:%02d:%02d", hours, mins, secs);
	else format(str, 100, "%d:%02d", mins, secs);
	return str;
}  
stock GetPlayerID(const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (strcmp(pInfo[i][pName], str, true, strlen(str)) == 0) return i;
	}
	return INVALID_PLAYER_ID;
}
stock GetCheckID(const name[])
{
    new ID = INVALID_PLAYER_ID;
	sscanf(name, "u", ID);
	if (IsPlayerConnected(ID)) return ID;
	return INVALID_PLAYER_ID;
}
TickRateUpdate3DTextServer()
{
    if (lsamatbi > 1000000) lsamatbi = 1000000;
    if (FractionInfo[1][fMaterials] > 1000000) FractionInfo[1][fMaterials] = 1000000; 
    if (FractionInfo[2][fMaterials] > 1000000) FractionInfo[2][fMaterials] = 1000000;
    if (FractionInfo[3][fMaterials] > 1000000) FractionInfo[3][fMaterials] = 1000000;
    if (FractionInfo[10][fMaterials] > 1000000) FractionInfo[10][fMaterials] = 1000000;
    if (FractionInfo[21][fMaterials] > 1000000) FractionInfo[21][fMaterials] = 1000000;
   // if (FractionInfo[3][fMaterials] > 100000) FractionInfo[3][fMaterials] = 100000;
    if (FractionInfo[19][fMaterials] > 1000000) FractionInfo[19][fMaterials] = 1000000;

    if (lsamatbi < 0) lsamatbi = 0;
    if (FractionInfo[1][fMaterials] < 0) FractionInfo[1][fMaterials] = 0;
	if (FractionInfo[2][fMaterials] < 0) FractionInfo[2][fMaterials] = 0;
    if (FractionInfo[3][fMaterials] < 0) FractionInfo[3][fMaterials] = 0;
    if (FractionInfo[10][fMaterials] < 0) FractionInfo[10][fMaterials] = 0;
    if (FractionInfo[21][fMaterials] < 0) FractionInfo[21][fMaterials] = 0;
    if (FractionInfo[19][fMaterials] < 0) FractionInfo[19][fMaterials] = 0;
	UpdateFractionStore(FRACTION_LSPD);
	UpdateFractionStore(FRACTION_SFPD);
	UpdateFractionStore(FRACTION_LVPD);
	UpdateFractionStore(FRACTION_FBI);
	
	new str[256];  
    format(str, sizeof(str), "Склад армии ЛВ: {FFFFFF}%d", FractionInfo[19][fMaterials]);
    UpdateDynamic3DTextLabelText(LvaLable[0], 0x33AA33FF, str);

    format(str, sizeof(str), "LV ARMY: {FFFFFF}%d/300000\n{33AA33}SF ARMY: {FFFFFF}%d/100000\n{33AA33}LSPD: {FFFFFF}%d/100000\n{33AA33}SFPD: {FFFFFF}%d/100000\n{33AA33}LVPD: {FFFFFF}%d/100000\n{33AA33}FBI: {FFFFFF}%d/100000",
		FractionInfo[19][fMaterials],FractionInfo[3][fMaterials],FractionInfo[1][fMaterials],FractionInfo[10][fMaterials],FractionInfo[21][fMaterials],FractionInfo[2][fMaterials]
	);
    UpdateDynamic3DTextLabelText(LvaLable[1], 0x33AA33FF, str);
	return 1;
}
stock Expirence(playerid)
{
	new
		exp = pInfo[playerid][pDExp],
		nxtlevel = pInfo[playerid][pDLevel] + 1,
		expamount = nxtlevel*levelDexp;
	if (exp >= expamount)
	{
		pInfo[playerid][pDLevel] += 1;
		pInfo[playerid][pDMgruz] += 1;
		pInfo[playerid][pDExp] = 0;
	} 
	return 1;
}
stock ToDevelopSkills(Slashes,Points)
{
	new SlashesAndPoints[200];
	new Slash[2] = "|";
	new Point[2] = "'";
	for(new i = 0; i < Slashes; i++) strcat(SlashesAndPoints, Slash);
	for(new i = 0; i < Points; i++) strcat(SlashesAndPoints, Point);
	return SlashesAndPoints;
}
stock SetPlayerSkills(playerid)
{
	SetPlayerSkillLevel(playerid, WEAPONSKILL_PISTOL_SILENCED, pInfo[playerid][pGunSkill][0]*10);
	SetPlayerSkillLevel(playerid, WEAPONSKILL_DESERT_EAGLE, pInfo[playerid][pGunSkill][1]*10);
	SetPlayerSkillLevel(playerid, WEAPONSKILL_SHOTGUN, pInfo[playerid][pGunSkill][2]*10);
	SetPlayerSkillLevel(playerid, WEAPONSKILL_MP5, pInfo[playerid][pGunSkill][3]*10);
	SetPlayerSkillLevel(playerid, WEAPONSKILL_AK47, pInfo[playerid][pGunSkill][4]*10);
	SetPlayerSkillLevel(playerid, WEAPONSKILL_M4, pInfo[playerid][pGunSkill][5]*10);
	return 1;
} 

stock SendAdvertToServer(playerid,newsid,advertid,type,text[])
{
	if (!IsANews(playerid) || newsid < 0 || newsid > 2) return 1;

	if (AdvertInfo[advertid][newsid][adPhone] == 0)
		return AdvertList(playerid);

	static AdvertTimeNews;
	new news_name[3][8] = {
		"LS News",
		"SF News",
		"LV News"
	};

	if (AdvertTimeNews > gettime())
	{
		if (type == 1)
		{
			if (AdvertInfo[advertid][newsid][adPhone] != 0) {
				format(AdvertInfo[advertid][newsid][adText],78,"%s",text);
				AdvertInfo[advertid][newsid][adEdit] = 1;
				SendClientMessage(playerid, COLOR_LIGHTGREEN, !"Объявление отредактировано и сохранено");
			}
			else SendClientMessage(playerid, CGRAY2, !"Объявление уже отправлено");
		}
		SendClientMessage(playerid, COLOR_GREY, !"Посылать объявление можно раз в 15 секунд!");
		return AdvertList(playerid);
	}
	AdvertTimeNews = gettime() + 15; 
	new
		string_[228];
	if (!AdvertInfo[advertid][newsid][adVIP]) {
		format(string_, sizeof string_, "Объявление: %s. Прислал: %s. Тел: %d",text, AdvertInfo[advertid][newsid][adName],AdvertInfo[advertid][newsid][adPhone]);
		SendAdvertMessage(TEAM_GROVE_COLOR, string_);
		format(string_, sizeof string_, "\t\t\tОтредактировал сотрудник %s: %s",news_name[newsid], pInfo[playerid][pName]); 
		SendAdvertMessage(TEAM_GROVE_COLOR, string_);
	}
	else {
		format(string_, sizeof string_,  "VIP Объявление: %s. Прислал: %s. Тел: %d",text, AdvertInfo[advertid][newsid][adName],AdvertInfo[advertid][newsid][adPhone]);
		SendAdvertMessage(COLOR_GOLD, string_);
		format(string_, sizeof string_,   "\t\t\tОтредактировал сотрудник %s: %s",news_name[newsid], pInfo[playerid][pName]);
		SendAdvertMessage(COLOR_GOLD, string_);
	}
	AdvertInfo[advertid][newsid][adPhone] = 0;
	AdvertInfo[advertid][newsid][adEdit] = 0; 
	kLibGivePlayerMoney(playerid, AdvertInfo[advertid][newsid][adPrice], "AD NEWS /edit");
	AdvertInfo[advertid][newsid][adPrice] = 0; 
	AdvertInfo[advertid][newsid][adVIP] = 0; 
	AdvertList(playerid);

	pInfo[playerid][edited_ads] ++; 

	format(string_, sizeof string_, "UPDATE `s_users` SET `edited_ads` = '%d' WHERE `pID` = '%d' LIMIT 1", pInfo[playerid][edited_ads], pInfo[playerid][pID]);
	mysql_tquery(dbHandle, string_);

	OnPlayerAchievProgress(playerid, 7);
	OnPlayerAchievProgress(playerid, 8);
	return 1;
}


stock AddToServerAdvertise(playerid,newsid)
{
	if (newsid < 0 || newsid > 2) return 1;
	new frac_id[3] = {16,9,20}; // id фракций news
	if (gFraction[ frac_id[newsid] ][fCoolDown] > gettime())
	{
		DeletePVar(playerid,"advert");
		SendClientMessage(playerid, COLOR_GREY, !"Посылать объявление можно раз в 15 секунд!");
		return AdvertList(playerid);
	}
	new
		text[78];
	GetPVarString(playerid,"advert", text, 78);
	DeletePVar(playerid,"advert");
	new price = GetPVarInt(playerid, "ad_price");
	if (kLibGetPlayerMoney(playerid) < price) return SendClientMessage(playerid, COLOR_WHITE, !"У Вас недостаточно денег");
	new pos_ad;
	for(new i; i < MAX_ADVERT_LIST ;i++)
	{
		if (AdvertInfo[i][newsid][adPhone] != 0) continue;
		AdvertInfo[i][newsid][adVIP] = pInfo[playerid][VIPRank];
		AdvertInfo[i][newsid][adPhone] = pInfo[playerid][PlayerNumber];
		format(AdvertInfo[i][newsid][adName],24,"%s",pInfo[playerid][pName]);
		format(AdvertInfo[i][newsid][adText],78,"%s",text);
		AdvertInfo[i][newsid][adPrice] = floatround(price/100*40);
		pos_ad = 1;
		break;
	}
	

	if (pos_ad == 0) return SendClientMessage(playerid, COLOR_GREY, !"Список объявлений заполнен. Попробуйте подать объявление позже.");

	kLibGivePlayerMoney(playerid, -price, "подача объявления");
	FractionInfo[ frac_id[newsid] ][fMoney] += floatround(price/100*50);
	SaveFractionInfoID(FractionInfo[ frac_id[newsid] ][fID], false);
	
	format(text, 16, "~r~-$%d", price);
	GameTextForPlayer(playerid, text, 5000, 1);
	DeletePVar(playerid, "ad_price");
	SendFamilyMessage(frac_id[newsid], COLOR_WHITE, !"[F] В редакцию поступило новое объявление!");
	SendClientMessage(playerid, COLOR_WHITE, !"Ваше обьявление будет подано после проверки");
	pInfo[playerid][tAdvertTimer] = gettime() + 60;

	gFraction[ frac_id[newsid] ][fCoolDown] = gettime()+15;
	return 1;
}


stock AdvertList(playerid)
{
	if (!IsANews(playerid)) return 1;
	new list_temp,
		pos_ad,
		full_str[940],
		temp_str[66];

	switch(pInfo[playerid][pMember])
	{
		case 16: list_temp = 0;
		case 9: list_temp = 1;
		case 20: list_temp = 2;
	}

	strcat(full_str, !""colserver"[№] Прислал\t"colserver"Номер телефона\n"); 

	for(new i; i < MAX_ADVERT_LIST ;i++)
	{
		if (AdvertInfo[i][list_temp][adPhone] == 0) continue;
		format(temp_str, sizeof (temp_str), 
			""colwhi"[%d] %s\t%d  %s", pos_ad + 1, AdvertInfo[i][list_temp][adName],
			AdvertInfo[i][list_temp][adPhone],
			AdvertInfo[i][list_temp][adEdit] == 1 ? (""c_green"Проверено\n"):("\n") 
		);
		strcat(full_str, temp_str);
		playerListItem[playerid][pos_ad] = i;
		pos_ad++;
	}
//floatround(price/100*40);
	format(temp_str, sizeof (temp_str), ""colserver"Объявления: "colwhi"%s", fInfo[pInfo[playerid][pMember]][fName]);
	if (pos_ad == 0) return ShowPlayerDialog(playerid, D_NULL, 0, temp_str, "\t"colwhi"Новых объявлений нет", "Назад", "");
	ShowPlayerDialog(playerid, D_NEWS_PANEL_0, DIALOG_STYLE_TABLIST_HEADERS, temp_str, full_str, "Принять", "Отмена");
	return 1;
}

stock ShowSettings(playerid)
{
	new string[148],
		gSettingName[SETTINGS_COUNT][22] = {
		"OOC оповещение",//0
		"Фракционный чат",//1
		"Отображение ников",//2
        "Hunger Бар",//3
        "Кейс с деньгами",//4
		"Damage Informer",//5
		"Семейный чат", //6
		"Чат начальных работ", // 7
		"Новостная волна", // 8
		"Объявления", // 9
		"Государственная волна", // 10
		"Чат VIP игроков", // 11
		"Тип Спидометра"		
	};
	/*if (pInfo[playerid][PlayerSpawn] > 4 || pInfo[playerid][PlayerSpawn] < 0){
		pInfo[playerid][PlayerSpawn] = 0;
		SavePlayerInteger(playerid, "playerspawn",0);
	}*/

	t_string[0] = EOS;
	strcat(t_string, ""colserver"[№] Настройка\t"colserver"Статус\n");
	for(new i; i < SETTINGS_COUNT; i++)
	{
		//new
		//	flag[32] = ""colwarn"Выключить"colwhi"";
		//if (pInfo[playerid][PlayerSettings] & (1 << i)) flag = ""collime"Включить"colwhi"";
		if (i != 12) {
			format(string, sizeof string, "[%d] %s\t%s\n", i, gSettingName[i], pInfo[playerid][PlayerSettings] & (1 << i) ?("{009933}Включено"): ("{ff3333}Выключено"));
		} else {
			format(string, sizeof string, "[%d] %s\t%s\n", i, gSettingName[i], pInfo[playerid][PlayerSettings] & (1 << i) ?("{009933}New"): ("{009933}Mobile"));
		}

		strcat(t_string, string);
	}
	strcat(t_string, "[13] Описание персонажа\n");	
	strcat(t_string, "[14] Сменить пароль\t[******]\n[15] Очистить чат\t[40 линий]\n");
	format(string, sizeof string,
		"[16] Место возрождения\t%s\n\
		[17] Смена NonRp ника\t[%s]\n[19] Смена пола\t{ffff66}%s",
		GetPlayerSpawnName(playerid),
		pInfo[playerid][pName], !pInfo[playerid][pSex] ? ("Ошибка/баг") : (pInfo[playerid][pSex] == 1 ? ("Мужской") : ("Женский")));
	strcat(t_string, string);
	strcat(t_string, "\n[20] "coldeport"Безопасность\t[Аккаунта]\n");
	return ShowPlayerDialog(playerid, D_MAINMENU_FUNC_7, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Настройки: "colwhi"Персональные", t_string, "Выбрать", "Отмена");
}


publics: Recognition()
{
	new 
		Float:x, 
		Float:y, 
		Float:z;
   	foreach(new i: PlayerInLogin)
 	{
        if (!pInfo[i][pWantedLevel] || !pInfo[i][pLogin]) continue;
        recognition[i] = 0;
        GetPlayerPos(i, x, y, z);//Посмотреть
        foreach(new p: PlayerInLogin)
        {
       		if (IsPlayerInRangeOfPoint(p, 150, x, y, z) && IsACop(p) && p != i) recognition[i]++;
		}
		if (!recognition[i])
		{
	 		scm(i,-1,!"Ваша узнаваемость понизилась");
	 		pInfo[i][pWantedLevel]--;
	 		SetPlayerWantedLevelEx(i, pInfo[i][pWantedLevel]);
	 		if (!pInfo[i][pWantedLevel])
			{
			    if (LabelOn[i] == 1)
			    {
			    	LabelOn[i] = 0;
					if (IsValidDynamic3DTextLabel(LabelRecognition[i])) {
						DestroyDynamic3DTextLabel(LabelRecognition[i]);
						LabelRecognition[i] = Text3D:0;
					}	
				}
			 	pInfo[i][pRecognition] = 0;
			}
	 		else
	 		{
	 		    if (pInfo[i][pRecognition] > 0) pInfo[i][pRecognition]--;
			}
		}
		else
		{
		    scm(i,-1,!"Ваша узнаваемость повысилась");
		    if (pInfo[i][pRecognition] < 3) pInfo[i][pRecognition]++;
		}
	}
}
stock ConvertSeconds(time)
{
	new str[128];
	if (time < 3600) format(str, sizeof(str), "%d", time);
	return str;
}
//DisableEnableReconButton(playerid, button, enable, show = 1)
stock DisableEnableReconButton(playerid, button, bool: enable, bool: show = true)
{
    PlayerTextDrawHide(playerid, ReconPlayer[playerid][button]);
	if (!enable) PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][button], 0x00000055);
	else PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][button], 0xD97700AA);
	if (show) PlayerTextDrawShow(playerid, ReconPlayer[playerid][button]);
	return 1;
}

stock SubTextDelete(playerid)
{
	for(new i = 16; i < 34; i++) {
		PlayerTextDrawHide(playerid, ReconPlayer[playerid][i]);
		DisableEnableReconButton(playerid, i, false, false);
	} 
    ReconSelectSub[playerid] = INVALID_TEXT_DRAW; 
    DisableEnableReconButton(playerid, ReconSelect[playerid], true);
	return 1;
}
publics: GetMoney() {
	foreach(new i: PlayerInLogin) {
		if (!pInfo[i][pLogin] || AntiCheatIsKickedWithDesync(i)) continue;
 		if (pInfo[i][pCash] != GetPlayerMoney(i) && pInfo[i][pLogin]) ResetPlayerMoney(i), GivePlayerMoneyEx(i);
	}
	return ;
}

stock CreateReconButtonn(playerid, Float:Xpos, Float:Ypos, const button_text[], txtInit)
{
	ReconPlayer[playerid][txtInit] = CreatePlayerTextDraw(playerid,Xpos, Ypos, button_text);
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][txtInit], 0x000000AA);
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][txtInit], 1);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][txtInit], 0.200, 1.100);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][txtInit], 0xAAAAAAAA);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][txtInit], 0);
	PlayerTextDrawAlignment(playerid,ReconPlayer[playerid][txtInit], 2);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][txtInit], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][txtInit], 0);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][txtInit], 1);
	PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][txtInit], 0x00000055);
	PlayerTextDrawTextSize(playerid,ReconPlayer[playerid][txtInit], 11.000, 60.000);
	PlayerTextDrawSetSelectable(playerid, ReconPlayer[playerid][txtInit], 1);
	return 1;
} 
/*stock GetSpeedRecon(playerid)
{
	new 
		Float:x, Float:y, Float:z;
	if (IsPlayerInAnyVehicle(playerid)) GetVehicleVelocity(GetPlayerVehicleID(playerid), x, y, z);
	else GetPlayerVelocity ( playerid, x, y, z ) ;
	return floatround ( floatsqroot ( x * x + y * y + z * z ) * 195  ) ;
} */
stock GetSpeedRecon(playerid)
{
	new 
		Float:ST[4];
	if(IsPlayerInAnyVehicle(playerid)) {
		GetVehicleVelocity(GetPlayerVehicleID(playerid), ST[0], ST[1], ST[2]);
	} else {
		 GetPlayerVelocity(playerid, ST[0], ST[1], ST[2]);
	}
	ST[3] = floatsqroot(floatpower(floatabs(ST[0]), 2.0) + floatpower(floatabs(ST[1]), 2.0) + floatpower(floatabs(ST[2]), 2.0)) * 100.3;
	return floatround(ST[3]);
}
stock UpdateVehicleHud(playerid, vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	if (IsPlayerGetSettings(playerid, setTypeSpeedometr)) {
		if (engine1) {
			PlayerTextDrawHide(playerid, gSpeedometr[playerid][4]);
			PlayerTextDrawColor(playerid, gSpeedometr[playerid][4], 16711935);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 16711935
			PlayerTextDrawShow(playerid, gSpeedometr[playerid][4]);
		}
		else {
			PlayerTextDrawHide(playerid, gSpeedometr[playerid][4]);
			PlayerTextDrawColor(playerid, gSpeedometr[playerid][4], -16776961);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 16711935
			PlayerTextDrawShow(playerid, gSpeedometr[playerid][4]);
		}
		if (lights2) {
			PlayerTextDrawHide(playerid, gSpeedometr[playerid][5]);
			PlayerTextDrawColor(playerid, gSpeedometr[playerid][5], 16711935);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 16711935
			PlayerTextDrawShow(playerid, gSpeedometr[playerid][5]);
		}
		else {
			PlayerTextDrawHide(playerid, gSpeedometr[playerid][5]);
			PlayerTextDrawColor(playerid, gSpeedometr[playerid][5], -16776961);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 16711935
			PlayerTextDrawShow(playerid, gSpeedometr[playerid][5]);
		}
		if (doors3) {
			PlayerTextDrawHide(playerid, gSpeedometr[playerid][6]);
			PlayerTextDrawColor(playerid, gSpeedometr[playerid][6], -16776961);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 16711935
			PlayerTextDrawShow(playerid, gSpeedometr[playerid][6]);
		}
		else {
			PlayerTextDrawHide(playerid, gSpeedometr[playerid][6]);
			PlayerTextDrawColor(playerid, gSpeedometr[playerid][6], 16711935);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 16711935
			PlayerTextDrawShow(playerid, gSpeedometr[playerid][6]);
		}
	} /*else {
		if (engine1) {
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][13]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][13], 1409220863);//??? ??????????? ????????? ??? ????? -13776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][13]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][14]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][14], 1409220863);//??? ??????????? ????????? ??? ????? -14776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][14]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][16]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][16], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][16]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][17]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][17], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][17]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][18]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][18], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][18]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][19]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][19], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][19]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][22]);//door
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][22], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][22]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][23]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][23], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][23]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][25]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][25], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][25]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][26]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][26], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][26]);
			PlayerTextDrawHide(playerid, tNewSpeedometr[playerid][27]);
			PlayerTextDrawColor(playerid, tNewSpeedometr[playerid][27], 1409220863);//??? ??????????? ????????? ??? ????? -16776961 ??? ?????????? 1409220863
			PlayerTextDrawShow(playerid, tNewSpeedometr[playerid][27]);

		} else {
			//1409220863 -green
		} 
		//for(new tj = 0; tj < 38; tj++) {
		//	TextDrawHideForPlayer(playerid, tNewSpeedometr[playerid][ tj ]); 
		//}/
	} */
	
	return 1;
} 
stock GetVehicleTT(playerid) {
	new V_IDX = GetPlayerVehicleID(playerid),
		bool: tt_ = false;
	if (VehicleInfo[ V_IDX - 1 ][vPT_Engine][1] > 0) {
		tt_ = true;
	}
	return tt_;
}
publics: UpdateSpeedometr(playerid)
{
	if (GetPlayerState(playerid) != 2)
	{
		if (IsPlayerGetSettings(playerid, setTypeSpeedometr)) {
			for(new tj = 0; tj < 18; tj++) {
				TextDrawHideForPlayer(playerid, tSpeedometr[ tj ]); 
			}
			for(new tx = 0; tx < 7; tx++) { 
				PlayerTextDrawHide(playerid, gSpeedometr[playerid][tx]);
			}
		} else {
			for(new tx = 0; tx < 8; tx++) { 
				PlayerTextDrawHide(playerid, TextDrawSpeedP[playerid][tx]);
			}
			for(new tj = 0; tj < 55; tj++) {
				TextDrawHideForPlayer(playerid, TextDrawSpeed[tj]);
			}
			/*for(new tj = 0; tj < 38; tj++) {
				PlayerTextDrawDestroy(playerid, tNewSpeedometr[playerid][ tj ]); 
			}*/
		} 
		return 1;
	}
	new V_IDX = GetPlayerVehicleID(playerid);

	GetVehicleParamsEx(V_IDX, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	
	new
		Float: _coord[3];
	GetVehicleVelocity(V_IDX, _coord[0], _coord[1], _coord[2]);
	new
		Float: v_speed = floatsqroot(floatpower(floatabs(_coord[0]), 2.0) + floatpower(floatabs(_coord[1]), 2.0) + floatpower(floatabs(_coord[2]), 2.0)) * 100.3 ;
		//Float: v_speed = GetVehicleSpeed(V_IDX);
	new
		Float: veh_health_now;
	GetVehicleHealth(V_IDX, veh_health_now);
	GetVehicleRotation(V_IDX, _coord[0], _coord[1], _coord[2]);
//	new Float:speedcar = _GetVehicleSpeed(vehicleid);
	/*if (pTemp[playerid][tSLimit]) {
		if (speedcar > pTemp[playerid][tSLimit]) {
			new Float:dif = pTemp[playerid][tSLimit] / speedcar;
			SetVehicleVelocity(vehicleid,Xx*dif,Yy*dif,Zz*dif);
			speedcar = pTemp[playerid][tSLimit];
		}
	}
	if (pTemp[playerid][pSLimit]) {
		new Float: speed_limit = floatround(GetVehicleSpeed(V_IDX));
		if (speed_limit > pTemp[playerid][pSLimit]) {
			new Float:dif = pTemp[playerid][pSLimit];
			SetVehicleSpeed(V_IDX, dif);  
		}
	}*/
	if ( veh_health_now - VehicleInfo[ V_IDX - 1 ] [ vHealth ] == 0/* && VehicleInfo[ vehicleid - 1 ] [ v_ems ] == false */)
	{ 
		new key_pressed, ud, lr;
	    GetPlayerKeys(playerid, key_pressed, ud, lr); 
		if (VehicleInfo[ V_IDX - 1 ][vPT_Engine][0] > 0) {
			if (key_pressed == KEY_SPRINT && v_speed > 5 && v_speed < GetModelStaticSpeed(VehicleInfo[ V_IDX - 1 ][vModel]) && engine1 == 1) { 
				if (v_speed < 250) {
					SetVehicleSpeed(V_IDX, v_speed + (engine1_ptune_boost [ VehicleInfo[ V_IDX - 1 ][vPT_Engine][0] ] * 2));  
					VehicleInfo[ V_IDX - 1 ][vOldZAngle] = _coord[2];
				}
				
			}
		}	
		if (VehicleInfo[ V_IDX - 1 ][vPT_Engine][3] > 0) {
			if (key_pressed == KEY_JUMP && v_speed > 30 && (_coord[2] - VehicleInfo[ V_IDX - 1 ][vOldZAngle] < 0.3 && _coord[2] - VehicleInfo[ V_IDX - 1 ][vOldZAngle] > - 0.3)) { 
				SetVehicleSpeed(V_IDX, v_speed - (brake_name_boost[VehicleInfo[ V_IDX - 1 ][vPT_Engine][3]] * 2)); 
				VehicleInfo[ V_IDX - 1 ][vOldZAngle] = _coord[2];
			}
		}
		VehicleInfo[ V_IDX - 1 ][vOldZAngle] = _coord[2];
	} 
	VehicleInfo[ V_IDX - 1 ][vOldZAngle] = _coord[2];
	VehicleInfo[ V_IDX - 1 ][vHealth] = veh_health_now; 
	
	UpdateVehicleHud(playerid, V_IDX);
	 
	
	new
		str_0[16],
		str_1[16],
		str_2[16],
		str_3[16],
		str_4[16];
	//VehicleInfo[ V_IDX - 1 ][vPT_Engine][0] //turbo
	if (IsPlayerGetSettings(playerid, setTypeSpeedometr)) {
		format(str_0, sizeof str_0, "%.0f%s", GetVehicleSpeed(V_IDX), (VehicleInfo[ V_IDX - 1 ][vPT_Engine][0] == 0) ? ("_"):("_~g~TURBO"));
		PlayerTextDrawSetString(playerid, gSpeedometr[playerid][0], str_0);//
		
		if (VehicleInfo[ V_IDX - 1 ][vFuel] <= 15) format(str_1, sizeof str_1, "~r~%.0f L", VehicleInfo[ V_IDX - 1 ][vFuel]);
		else if (VehicleInfo[ V_IDX - 1 ][vFuel] <= 25) format(str_1, sizeof str_1, "~y~%.0f L", VehicleInfo[ V_IDX - 1 ][vFuel]);
		else format(str_1, sizeof str_1, "~g~%.0f L", VehicleInfo[ V_IDX - 1 ][vFuel]);
		PlayerTextDrawSetString(playerid, gSpeedometr[playerid][1], str_1);
		
		format(str_2, sizeof str_2, "%.2f KM", VehicleInfo[ V_IDX - 1 ][vMillage]);
		PlayerTextDrawSetString(playerid, gSpeedometr[playerid][2], str_2);
		
		format(str_3, sizeof str_3, "%.0f", VehicleInfo[ V_IDX - 1 ][vHealth]);
		PlayerTextDrawSetString(playerid, gSpeedometr[playerid][3], str_3);
	} else {
		/*if (VehicleInfo[ V_IDX - 1 ][vFuel] <= 15) format(str_1, sizeof str_1, "~r~%.0f", VehicleInfo[ V_IDX - 1 ][vFuel]);
		else if (VehicleInfo[ V_IDX - 1 ][vFuel] <= 25) format(str_1, sizeof str_1, "~y~%.0f", VehicleInfo[ V_IDX - 1 ][vFuel]);
		else format(str_1, sizeof str_1, "~g~%.0f", VehicleInfo[ V_IDX - 1 ][vFuel]);
		PlayerTextDrawSetString(playerid, gOldSpeedometr[playerid][3], str_1); */

		format(str_1, sizeof str_1, "fuel:_%.0f%", VehicleInfo[ V_IDX - 1 ][vFuel]);
		PlayerTextDrawSetString(playerid, TextDrawSpeedP[playerid][6], str_1);



		if (!doors3) PlayerTextDrawColor(playerid,TextDrawSpeedP[playerid][2], -16776961), PlayerTextDrawShow(playerid,TextDrawSpeedP[playerid][2]);
		else PlayerTextDrawColor(playerid,TextDrawSpeedP[playerid][2], 0x20B220AA), PlayerTextDrawShow(playerid,TextDrawSpeedP[playerid][2]);

		if (!engine1) PlayerTextDrawColor(playerid,TextDrawSpeedP[playerid][1], -16776961), PlayerTextDrawShow(playerid,TextDrawSpeedP[playerid][1]);
		else PlayerTextDrawColor(playerid,TextDrawSpeedP[playerid][1], 0x20B220AA), PlayerTextDrawShow(playerid,TextDrawSpeedP[playerid][1]);

		if (!lights2) PlayerTextDrawColor(playerid,TextDrawSpeedP[playerid][3], -16776961), PlayerTextDrawShow(playerid,TextDrawSpeedP[playerid][3]);
		else PlayerTextDrawColor(playerid,TextDrawSpeedP[playerid][3], 0x20B220AA), PlayerTextDrawShow(playerid,TextDrawSpeedP[playerid][3]);
		
		format(str_0, sizeof str_0, "%.0f%s", GetVehicleSpeed(V_IDX), (VehicleInfo[ V_IDX - 1 ][vPT_Engine][0] == 0) ? ("_"):("_~g~TURBO"));
		PlayerTextDrawSetString(playerid,TextDrawSpeedP[playerid][4], str_0);

		format(str_4, sizeof str_4, "%s", VehicleNames[ GetVehicleModel(V_IDX) - 400 ]);
		PlayerTextDrawSetString(playerid,TextDrawSpeedP[playerid][0], str_4);

		format(str_2, sizeof str_2, "%.2f KM", VehicleInfo[ V_IDX - 1 ][vMillage]);
		PlayerTextDrawSetString(playerid, TextDrawSpeedP[playerid][5], str_2);

		PlayerTextDrawTextSize(playerid, TextDrawSpeedP[playerid][7], VehicleInfo[V_IDX - 1][vHealth]*0.052, 3.0);
		PlayerTextDrawShow(playerid, TextDrawSpeedP[playerid][7]);

		/*if (pInfo[playerid][pDrivingSkill] == 0) PlayerTextDrawSetString(playerid,gOldSpeedometr[playerid][7],"MAX");
		else PlayerTextDrawSetString(playerid,gOldSpeedometr[playerid][7],"~r~MAX"); */
	} 

	


	static
		Float:speed,
		Float:tmp___;

	speed = GetVehicleSpeed(V_IDX);
	tmp___ = VehicleInfo[ V_IDX - 1 ][vTempMillage] += (speed / 1.4) / 1000.0; 
	if (tmp___ >= TDW_VEHICLE_MILEAGE_MILE_FLOAT) {
		VehicleInfo[ V_IDX - 1 ][vMillage] += tmp___;
		VehicleInfo[ V_IDX - 1 ][vTempMillage] -= TDW_VEHICLE_MILEAGE_MILE_FLOAT;
	} 
	if (engine1 == 1) {
		if (VehicleInfo[ V_IDX - 1 ][vFuel] <= 0.1) { 
			toggle_engine1(playerid, V_IDX);
			VehicleInfo[ V_IDX - 1 ][vFuel] = 0.0; 
		} else {
			VehicleInfo[ V_IDX - 1 ][vFuel] -= (GetVehicleSpeed(V_IDX) + 0.1)/TDW_VEHICLE_FUEL_FLOAT;
		}
	} 
	return SetTimerEx("UpdateSpeedometr", SPEEDOMETR_TIMER_UPDATE, false, "d", playerid);
}  

stock GetGangZoneColor(gangzonex)
{
    new zx;
    switch(GZInfo[gangzonex][gFrakVlad])
    {
		case 8: zx = 0x9b2d3088;
	    case 12: zx = 0xd200ff99;
	    case 13: zx = 0xcfbe0899;
	    case 15: zx = 0x06b50699;
	    case 17: zx = 0x03c3b899;
	    case 18: zx = 0x007fffAA;
	    default: zx = 0xFEFEFEAA;
    }
    return zx;
}
stock GetGangZoneColor2(gangzonex)
{
    new zx;
    switch(gangzonex)
    {
        case FRACTION_BALLAS: zx = 0xd200ff99;
        case FRACTION_VAGOS: zx = 0xcfbe0899;
        case FRACTION_GROVE: zx = 0x06b50699;
        case FRACTION_AZTEC: zx = 0x03c3b899;
        case FRACTION_RIFA: zx = 0x007fff99;
		case FRACTION_PIRUS: zx = 0x9b2d3088;
		case FRACTION_LCN: zx = -5963540;
		case FRACTION_YAKUZA: zx = -2147483393;
		case FRACTION_RUSSIAN: zx = -1061109505;
		case FRACTION_MONGOLS_MC: zx = 0x49E789FF;
		case FRACTION_BANDIDOS_MC: zx = 0xF45000FF;
		case FRACTION_OUTLAWS_MC: zx = 0xFFEE8AFF;
        default: zx = 0xFEFEFE99;
    }
    return zx;
}
stock GetGZColorF(fnumber)
{
	new zx;
	switch(fnumber)
	{
	case FRACTION_PIRUS: zx = 0xFF0000AA;
	case FRACTION_BALLAS: zx = 0xFF0000AA;
	case FRACTION_VAGOS: zx = 0xFF0000AA;
	case FRACTION_GROVE: zx = 0xFF0000AA;
	case FRACTION_AZTEC: zx = 0xFF0000AA;
	case FRACTION_RIFA: zx = 0xFF0000AA;
	}
	return zx;
}
stock GetPlayerNearestVehicle(playerid)
{
    if (IsPlayerInAnyVehicle(playerid)) return GetPlayerVehicleID(playerid);
	new closest_vehicle = INVALID_VEHICLE_ID;
	new	
		Float: pos_x,
		Float: pos_y, 
		Float: pos_z;
	GetPlayerPos(playerid, pos_x, pos_y, pos_z);
	foreach(new i:StreamedVehicles[playerid])
	{
		if (!IsValidVehicle(i)) continue;
		if (GetVehicleDistanceFromPoint ( i, pos_x, pos_y, pos_z) > 4 ) continue;
		if (closest_vehicle == INVALID_VEHICLE_ID)
		{
			closest_vehicle = i;
			continue ;
		}
		if (GetVehicleDistanceFromPoint (i, pos_x, pos_y, pos_z) < GetVehicleDistanceFromPoint(closest_vehicle, pos_x, pos_y, pos_z))
        {
            closest_vehicle = i;
        }
    }
    return closest_vehicle;
}


stock ConvertTimeAFK(playerid, result_str[],length,size = sizeof(result_str))
{
    result_str[0] = '\0';
    if (length > size) {
        length = size - 1;
    }
    if (length < 1) {
        return 0;
    }
    new seconds = pTemp[playerid][PlayerAFK],
		minutes,
		sec;
    if (seconds > 59){
        minutes = seconds/60;
        sec = (seconds - (minutes*60));
        format(result_str, 10, "%d:%02d]", minutes, sec);
    }
    else{
        format(result_str, 9, "%d сек]", seconds);
    }
    strins(result_str, "[На паузе: ", 0,10);
    return 1;
}

publics: Fresh()
{
   	new 
	   	tickcount1 = GetTickCount();
    if (GrandEndOK > 0) {
	    printf("[TIMER DEBUG] Упал таймер Fresh. Этап: %d", GrandEndOK);
	}
    GrandEndOK = 1;
	gettime(hour, minute, second);
	TickRateUpdate3DTextServer();
	LoadingTrucker();

	SetTimer("ChangeServerName", 1000, true);

	GrandEndOK = 2;
	#if defined _casino_included
		casino_Timer();
	#endif
	GrandEndOK = 3;
	#if defined _poker_included
		poker_Timer();
	#endif
	GrandEndOK = 4;
	#if defined _blackjack_included
		blackjack_Timer();
	#endif
	GrandEndOK = 5;
	#if defined _capture_stats_inc
		CaptureStatsTimer(); 
	#endif
	GrandEndOK = 6;
	if (++SettingGlobalServer > 1200)//Каждые 20 минут
	{
	    printf("Последнее время прокрутки Fresh: %d мс. пик: %d мс.\n", SettingServer[2], SettingServer[3]);
	 	SettingGlobalServer = 0;
	} 
	GetMoney();
	md_Timer();
	GrandEndOK = 7;
	#if defined _voting_inc
		OnVotingTimer();
	#endif
	GrandEndOK = 8;
	#if defined _hospital_inc
		OnHospitalTimer();
	#endif
	GrandEndOK = 9;
	dicetable_Timer(); 
	GrandEndOK = 10;
 	foreach(new i: Player)
	{
		if (!pInfo[i][pLogin]) {
			if (pTemp[i][tWelcomeTimer] != -1){
				pTemp[i][tWelcomeTimer] ++;
				if(pTemp[i][tWelcomeTimer] == 15){hide_welcome_interface(i);}
			}			
     		if (pTemp[i][tTimeLogin] > 0) {
       			pTemp[i][tTimeLogin] --; 
         		if (pTemp[i][tTimeLogin] == 0)
          		{ 
           			SendClientMessage(i, COLOR_LIGHTRED, !"Время на ввод пароля ограничено!"); 
              		Kick(i);
					continue;
				}
           	}
	    }
		else
		{
			if ( pTemp [ i ] [ tIgnorePick ] != 0 )
				pTemp [ i ] [ tIgnorePick ] --;
				
			if (++pTemp[i][PlayerAFK] >= 3) { 
				new 
					afk_str_time[26];
			    ConvertTimeAFK(i, afk_str_time, sizeof(afk_str_time)-1);
		        SetPlayerChatBubble(i, afk_str_time, COLOR_GREEN, 30.0, 1100); 
				gOnlinePlayerAFK[i][0]++; 
			}
			else {
			    pTemp[i][TimeNoAFK]++;
				pTemp[i][gTimeNoAFK]++;
				gOnlinePlayer[i][0]++; 
			}//pInfo[playerid][gStars]
			
			if (pTemp[i][gTimeNoAFK] >= 10800) {
				pTemp[i][gTimeNoAFK] = 0;
				GiveFreeRoulette(i);
			}

			GrandEndOK = 11;
			#if defined _casino_included
				casino_PlayerTimer(i);
			#endif
			GrandEndOK = 12;
			Family_PlayerTime(i);
			GrandEndOK = 13;
			if (pTemp[i][tBoomboxArea] && !IsPlayerInDynamicArea(i, pTemp[i][tBoomboxArea] - 1)) {
				DestroyBoombox(i);
			}
			GrandEndOK = 14;
			if (pInfo[i][PlayerSettings] & setShowUseKeys)
			{
				if (pInfo[i][pCash] > 3_000_000 && GetPlayerWeapon(i) == 0 && pTemp[i][tTakeDrugsType] == 0 && GetPlayerState(i) == PLAYER_STATE_ONFOOT && pInfo[i][pLogin] == 1) {
					SetPlayerAttachedObject(i, ATTACHED_SLOT_JOB_2, 1210, 5, 0.299999, 0.099999, 0.000000, 0.000000, -83.000000, 0.000000, 1.000000, 1.000000, 1.000000);
				}
				else {
					if (IsPlayerAttachedObjectSlotUsed(i, ATTACHED_SLOT_JOB_2)) RemovePlayerAttachedObject(i, ATTACHED_SLOT_JOB_2);
				}
			} 
			GrandEndOK = 15;
			if (++pTemp[i][tPlayerUpdate] > 300) {
				pTemp[i][tPlayerUpdate] = 0;
				SavePlayerID(i); 
			}
			GrandEndOK = 15;
			if (++pTemp[i][tPlayerGiveStars] > 10800) {
				pTemp[i][tPlayerGiveStars] = 0;
				pInfo[i][gStars]++;
				ChristmasInfo[i][cGift]++;
				SavePlayerCristmasInteger(i, "cGift", ChristmasInfo[i][cGift]);
				SavePlayerInteger(i, "gStars", pInfo[i][gStars]);
				SendClientMessage(i, COLOR_YELLOW, !"[Подсказка] "colwhi"Вы отыграли 3 часа подряд вы получили звезду!"); 
				SendClientMessage(i, COLOR_YELLOW, !"[Подсказка] "colwhi"Обменять звезды можно в Палатке Мики на центральном рынке"); 
			}
			GrandEndOK = 16;
			if (pInfo[i][FullSatiety] == 0) { 
				if (++pTemp[i][tSatietyUpdate] > 15)
				{  
					pTemp[i][tSatietyUpdate] = 0;
					pInfo[i][Satiety] -= 1.0;
					if (pInfo[i][Satiety] < 50) SetPlayerHealth(i, GetPlayerHP(i) - 1.0); 

					if (pInfo[i][PlayerSettings] & setShowEatBar) {
						SetPlayerProgressBarValue(i, EatBar[i], pInfo[i][Satiety]);
					}
					if (pInfo[i][Satiety] <= 0) {
						pInfo[i][Satiety] = 0;
					}
					if (pInfo[i][Satiety] == 24 || pInfo[i][Satiety] == 49) {
						SendClientMessage(i, COLOR_ISPOLZUY, !"Вы проголодались! Посетите бар, закусочную или купите ХотДог. Узнать свою «Сытость» можно командой /satiety");
					}
				}
			}
			GrandEndOK = 17;
			if(GetPlayerDrunkLevel(i) > 0)
			{
				SetPVarInt(i, "DrunkTime", GetPVarInt(i, "DrunkTime") + 1);
				if(GetPVarInt(i, "DrunkTime") >= 100)
				{
					SetPlayerDrunkLevel(i, GetPlayerDrunkLevel(i) - 1000);
					SetPVarInt(i, "DrunkTime", 0);
				}
			}
			GrandEndOK = 18;
			if (GetPVarInt(i,"TimerCountWoods") != 0) {
				SetPVarInt(i,"TimerCountWoods", GetPVarInt(i,"TimerCountWoods") - 1);
				new 
					string[32];
				format(string, sizeof string, "~r~RETURN: %d SEC", GetPVarInt(i,"TimerCountWoods"));
				GameTextForPlayer(i, string, 1000, 6);
				pTemp[i][tArmyJob] = 0;
				if (GetPVarInt(i,"TimerCountWoods") == 0) { 
					if (pTemp[i][tArmyDuty] == 1) {
						SendClientMessage(i,COLOR_GREY, !"Ваше дежурство в карауле окончено!");
						pTemp[i][tArmyDuty] = 0; 
						pTemp[i][tArmyJob] = 0;
					}
				}
			}
			GrandEndOK = 19;
			if (GetPVarInt(i,"TimerCountHunter") != 0) {
				SetPVarInt(i,"TimerCountHunter", GetPVarInt(i,"TimerCountHunter") - 1);
				new 
					string[32];
				format(string, sizeof string, "~r~RETURN: %d SEC", GetPVarInt(i,"TimerCountHunter"));
				GameTextForPlayer(i, string, 1000, 6); 
				if (GetPVarInt(i,"TimerCountHunter") == 0) { 
					if (pTemp[i][tJobHunter] == true) { 
						LeaveJobPlayer(i, .text = true);
					}
				}
			} 
			GrandEndOK = 20;
			if (pTemp[i][tArmyDuty] == 1 && pTemp[i][PlayerAFK] <= 2) {
				pTemp[i][tArmyJob]++;
				if (pTemp[i][tArmyJob] == 60) { 
					GameTextForPlayer(i, !"Army Job ~g~+$100", 5000, 1);
					kLibGivePlayerMoney(i, 100, "Караул", .save = false);
					SetMoveCashServer(IN_SERVER, 100);
					OnPlayerAchievProgress(i, 21);
					pTemp[i][tArmyJob] = 0;
				}
			}
			if (pInfo[i][pDepInTime] > 0) {
				pInfo[i][pDepInTime] --; 
			}
			if (pInfo[i][pDepPutTime] > 0) {
				pInfo[i][pDepPutTime] --; 
			}
			if (pInfo[i][pDepCashBack] > 0 && pInfo[i][pDeposit] >= 10_000) {
				pInfo[i][pDepCashBack] --;  
				if (pInfo[i][pDepCashBack] == 0) {
					new 
						str_[100],
						deposit_old = floatround(pInfo[i][pDeposit]/100*DepCurrentCommission[ pInfo[i][VIPRank] ]),
						deposit = floatround(pInfo[i][pDeposit]/100*DepCurrentCommission[ pInfo[i][VIPRank] ]) + pInfo[i][pDeposit],
						dep_limit = 100_000_000;  
					pInfo[i][pDeposit] = deposit; 
					switch(pInfo[i][VIPRank]) {
						case VIP_PACK_NONE .. VIP_PACK_BRONZE: dep_limit = 100_000_000;
						case VIP_PACK_SILVER .. VIP_PACK_GOLD: dep_limit = 150_000_000;
						case VIP_PACK_PLATINUM .. VIP_PACK_DIAMOND: dep_limit = 200_000_000;
					}
				//	UPDATE s_users SET pDeposit = '100000000' WHERE pDeposit > '100000000' AND AND pLogin = '0'
					if (pInfo[i][pDeposit] >= dep_limit){
						
						pInfo[i][pDeposit] = dep_limit;
						format(str_, sizeof str_, "[Выписка из банка] "colwhi"Ваш счет депозита, достинг лимита в "collime"$%d", dep_limit);
						SendClientMessage(i, 0x6495EDFF, str_);
						SendClientMessage(i, 0x6495EDFF, "[Выписка из банка] "colwhi"Снимите средства со счета!");
					} 
					format(str_, sizeof str_, "[Выписка из банка] "colwhi"Пополнение депозита на "collime"$%d! Депозит: "collime"$%d", deposit_old, pInfo[i][pDeposit]);
					SendClientMessage(i, 0x6495EDFF, str_); 
					pInfo[i][pDepCashBack] = 3600;
				}
			} 
			GrandEndOK = 21;
			if(gFollowInfo[i][gtID] != INVALID_PLAYER_ID) {
				new cuffed = gFollowInfo[i][gtID];
				if(!PlayerInConnected(cuffed)) {
					gFollowInfo[i][gtID] = INVALID_PLAYER_ID;
					gFollowInfo[i][gtTPX] = 0.0;
					gFollowInfo[i][gtTPY] = 0.0;
					gFollowInfo[i][gtTPZ] = 0.0;
					gFollowInfo[cuffed][gtState] = 0;
					gFollowInfo[cuffed][gtStayed] = 0;
					gFollowInfo[cuffed][gtGoID] = INVALID_PLAYER_ID;
					gFollowInfo[cuffed][gtX] = 0.0;
					gFollowInfo[cuffed][gtY] = 0.0;
					gFollowInfo[cuffed][gtZ] = 0.0;
				}
			}
			if(gFollowInfo[i][gtGoID] != INVALID_PLAYER_ID) {
				new goid = gFollowInfo[i][gtGoID];
				if(PlayerInConnected(goid)) {
					new Float:xX, Float:xY, Float:xZ,Float:agle;
					GetPlayerPos(goid, xX, xY, xZ);
					GetPlayerFacingAngle(i, agle);
					if(!IsPlayerInRangeOfPoint(i, 20, xX, xY, xZ)) {
						pTemp[i][tVirtualWorld] = GetPlayerVirtualWorld(goid);
						pTemp[i][tInterior] = GetPlayerInterior(goid);
						SetPlayerFacingAngle(i,agle);
						SetPlayerPosAC(i, xX,xY,xZ, pTemp[i][tVirtualWorld], pTemp[i][tInterior]);
						//ClearAnimations(i); 
						ClearAnim(i);
					}
					if(GetPlayerState(goid)==1) {
						new ANIMATION;
						if(gFollowInfo[goid][gtTPX] != 0.0 || gFollowInfo[goid][gtTPY] != 0.0) {
							SetPlayerFaceToPoint(i, gFollowInfo[goid][gtTPX], gFollowInfo[goid][gtTPY]);
							ANIMATION = GoPlayerAnimation(i, gFollowInfo[goid][gtTPX], gFollowInfo[goid][gtTPY], gFollowInfo[goid][gtTPZ]);
						}
						else {
							TurnPlayerFaceToPlayer(i, goid);
							ANIMATION = GoPlayerAnimation(i, xX, xY, xZ);
						}
						if(ANIMATION != 1) {
							if(IsPlayerInRangeOfPoint(i, 0.05, gFollowInfo[i][gtX], gFollowInfo[i][gtY], gFollowInfo[i][gtZ])) {
								gFollowInfo[i][gtStayed] ++;
								if(gFollowInfo[i][gtStayed] >= 10) {
									new Float:xA;
									GetPlayerPos(i, xX, xY, xZ);
									GetPlayerFacingAngle(i, xA);
									ShiftCords(0, xX, xY, xZ, xA, 1.5);
									SetPlayerPosAC(i, xX, xY, xZ, pTemp[i][tVirtualWorld], pTemp[i][tInterior]); 
									gFollowInfo[i][gtStayed] = 0;
								}
							}
							else gFollowInfo[i][gtStayed] = 0;
							GetPlayerPos(i, gFollowInfo[i][gtX], gFollowInfo[i][gtY], gFollowInfo[i][gtZ]);
						}
					}
				}
				else {
					gFollowInfo[i][gtGoID] = INVALID_PLAYER_ID;
					gFollowInfo[i][gtX] = 0.0;
					gFollowInfo[i][gtY] = 0.0;
					gFollowInfo[i][gtZ] = 0.0;
				}
			}
			GrandEndOK = 22;
			if (pInfo[i][pMestoJail] > 0) {
				if(!IsPlayerInRangeOfPoint(i, 20.0, 2742.6187, 1396.9856, 1100.9045) && pInfo[i][pMestoJail] == 1 && GetPlayerVirtualWorld(i) == 1) {
					SetPlayerPosAC(i, 2742.6187, 1396.9856, 1100.9045, 1, 6);
					SetPlayerFacingAngle(i, 1.0000); 
				}
				if(!IsPlayerInRangeOfPoint(i, 20.0, 219.5400,109.9767,999.0156) && pInfo[i][pMestoJail] == 2 && GetPlayerVirtualWorld(i) == 0) {
					SetPlayerPosAC(i, 219.5400,109.9767,999.0156, 1, 6);
					SetPlayerFacingAngle(i, 1.0000); 
				}
				if(!IsPlayerInRangeOfPoint(i, 20.0, 198.3642,161.8103,1003.0300) && pInfo[i][pMestoJail] == 3 && GetPlayerVirtualWorld(i) == 3) {
					SetPlayerPosAC(i, 198.3642,161.8103,1003.0300, 1, 6);
					SetPlayerFacingAngle(i, 1.0000); 
				}
				if(!IsPlayerInRangeOfPoint(i, 100.0, 2.4973,803.3113,1033.0717) && pInfo[i][pMestoJail] == 4 && GetPlayerVirtualWorld(i) == 10) {
					SetPlayerPosAC(i,2.4973,803.3113,1033.0717, 10, MAD_HOUSE_INT);
					SetPlayerFacingAngle(i, 271.8828);  
				}
			}
			GrandEndOK = 23;
		    if (GetPVarInt(i,"h_stall") && !IsPlayerInRangeOfPoint(i, 5, StallInfo[GetPVarInt(i,"h_stall")][stPos][0], StallInfo[GetPVarInt(i,"h_stall")][stPos][1], StallInfo[GetPVarInt(i,"h_stall")][stPos][2]))
		    {
				if (StallInfo[GetPVarInt(i,"h_stall")][stType] == 1)
				{
				   // UpdateDynamic3DTextLabelText(StallInfo[GetPVarInt(i,"h_stall")][stText], 0xFF8C37FF,"Не работает");
					DeletePVar(i,"h_stall");
					SetPlayerSkinEx(i,pInfo[i][pChar][0]);
				}
			}
			if (pInfo[i][pNarcoLomka] == 1) {
				new ttt = random(2);
				if (ttt == 1) ApplyAnimation(i, "CRACK", "crckdeth1", 4.0, 0, 0, 1, 1, 1);
				else ApplyAnimation(i, "CRACK", "crckdeth3", 4.0, 0, 0, 1, 1, 1);
			}
			GrandEndOK = 24;
			if (SpecAd[i] != INVALID_PLAYER_ID)
			{
				new thewarns = 0;
				if (pInfo[SpecAd[i]][pWarns] == 0) thewarns = 0;
				if (pInfo[SpecAd[i]][pWarns] != 0 && pInfo[SpecAd[i]][pWarns] != 0) thewarns = thewarns-pInfo[SpecAd[i]][pWarns];
				if (pInfo[SpecAd[i]][pWarns] != 0 && pInfo[SpecAd[i]][pWarns] == 0) thewarns = pInfo[SpecAd[i]][pWarns];
				new tttgtg = GetPlayerAmmo(SpecAd[i]),
					RE_IDX = GetPlayerVehicleID(SpecAd[i]);
				new Float:health;
				GetVehicleHealth(RE_IDX, health); 

				new httpquery[325];
				format(httpquery, sizeof(httpquery), "%s~n~ID: %d %s", pInfo[SpecAd[i]][pName], SpecAd[i], pTemp[SpecAd[i]][PlayerAFK] >3 ?("~r~AFK"):("~g~Online"));
				PlayerTextDrawSetString(i, ReconPlayer[i][6],httpquery);
	            new e_status[12], v_turbo[16], l_turbo = 0;
	            new maxspeed = 0;
				if (IsPlayerInAnyVehicle(SpecAd[i]))
				{
				    if (GetPlayerState(SpecAd[i]) == PLAYER_STATE_DRIVER)
					{
						GetVehicleParamsEx(RE_IDX, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
						if (engine1) e_status = "On";
	            		else e_status = "Off";
					} 
					if (VehicleInfo[ RE_IDX - 1 ][vPT_Engine][0]) {
						l_turbo = VehicleInfo[ RE_IDX - 1 ][vPT_Engine][0];
						v_turbo = "_~g~TURBO~w~";
					} 
				    maxspeed = GetModelStaticSpeed(GetVehicleModel(RE_IDX));
			     	if (pTemp[i][specUpdate] == true)
			     	{
			     	    pTemp[i][specUpdate] = false;
						PlayerSpectateVehicle(i, RE_IDX);
					}
				}
				else
				{
				    e_status = "-";
					v_turbo = "-";
					if (pTemp[i][specUpdate] == false)
			     	{
			     	    pTemp[i][specUpdate] = true;
						PlayerSpectatePlayer(i, SpecAd[i]);
					}
				}
				SetPlayerInterior(i, GetPlayerInterior(SpecAd[i]));
				SetPlayerVirtualWorld(i, GetPlayerVirtualWorld(SpecAd[i]));  
	 		  	format(httpquery, sizeof httpquery, "\
					~n~%d : %d / %d\
					~n~%d\
					~n~%s (%i)\
					~n~%.0f\
					~n~%.0f\
					~n~%.0f\
					~n~%d / %d\
					~n~%d~n~%d : %d\
					~n~%d / %d : %d%%\
					~n~%d / %d : %d%%\
					~n~%d : %d\
					~n~%s\
					~n~%s (%d)\
					~n~%.2f",
					pInfo[ SpecAd[i] ][pLevel], pInfo[ SpecAd[i] ][pExp], (pInfo[ SpecAd[i] ][pLevel]+1)*4,
					thewarns,  
					gFraction[ pInfo[ SpecAd[i] ][pMember] ][fReconName], pInfo[ SpecAd[i] ][pRank],
					GetPlayerHP( SpecAd[i] ), 
					GetPlayer_Armour( SpecAd[i] ), 
					health,

					GetSpeedRecon( SpecAd[i] ), maxspeed,
					GetPlayerPing( SpecAd[i] ),
					tttgtg, GetPlayerWeapon( SpecAd[i] ),

					pSpecture[SpecAd[i]][sShout][0], pSpecture[SpecAd[i]][sShout][2], ((pSpecture[SpecAd[i]][sShout][2]*100)/
					(pSpecture[SpecAd[i]][sShout][0] <= 1 ? 1: pSpecture[SpecAd[i]][sShout][0] )),
					pSpecture[SpecAd[i]][sShout][1],pSpecture[SpecAd[i]][sShout][3], ((pSpecture[SpecAd[i]][sShout][3]*100)/
					(pSpecture[SpecAd[i]][sShout][1] <= 1 ? 1: pSpecture[SpecAd[i]][sShout][1])),

					pTemp[ SpecAd[i] ][PlayerAFK], 1000, 
					e_status, 
					v_turbo, l_turbo,
					NetStats_PacketLossPercent( SpecAd[i] )
				);

				PlayerTextDrawSetString(i, ReconPlayer[i][5], httpquery);
			}
			GrandEndOK = 24;// Kill Timer = 24 = Рекону пизда
			if (GetPlayerState(i) == PLAYER_STATE_PASSENGER && (GetPlayerWeapon(i) == 24 || GetPlayerWeapon(i) == 25 || GetPlayerWeapon(i) == 29)) SetPlayerArmedWeapon(i, 0);
			
	        theft_timer(i);
			GrandEndOK = 25;
			if (pTemp[i][tDMArea][0]) UpdateInfoTD(i);
	        if (sms_timer[i] > 0) sms_timer[i]--;
            if (PressedPickup[i] > -1)
            {
                new Float:x, Float:y, Float:z,Float:dis;
                GetPlayerPos(i, x, y, z);
                Streamer_GetDistanceToItem(x, y, z, STREAMER_TYPE_PICKUP, PressedPickup[i], dis, 3);
                if (dis > 1.5)PressedPickup[i] = -1;
            }
			if (GetPVarInt(i,"fish_ready") == 3 && GetPVarInt(i,"fish_began") && GetPVarInt(i,"fish_time") < gettime())
			{
			    ApplyAnimation(i, "SWORD", "sword_IDLE", 50.0, 0, 1, 1, 1, 1);
				if (Sonar[i] > 0) {
					SetPVarInt(i,"fish_chanse",random(20));
				}
				if (IsABoat(i)) SetPVarInt(i,"fish_chanse",random(10));
			    if (GetPVarInt(i,"fish_chanse") == 0) GameTextForPlayer(i,"~g~~n~!", 5000, 6), SetPVarInt(i,"fish_time", gettime() + random(5) + 2);
			    else if (GetPVarInt(i,"fish_chanse") == 1) GameTextForPlayer(i,"~n~~n~~y~!", 5000, 6), SetPVarInt(i,"fish_time", gettime() + random(5) + 2);
			    else if (GetPVarInt(i,"fish_chanse") == 2) GameTextForPlayer(i,"~n~~n~~r~~n~!", 5000, 6), SetPVarInt(i,"fish_time", gettime() + random(3) + 2);
			    else GameTextForPlayer(i,"~b~!",11000,6);
			}
			if (TDActTextTime[i] != -1) {
			    if (TDActTextTime[i] == 0) {
					if (IsValidDynamic3DTextLabel(TDActText[i])) {
						DestroyDynamic3DTextLabel(TDActText[i]);
						TDActText[i] = Text3D:0;
					}
				}
			    TDActTextTime[i]--;
			}
			GrandEndOK = 26;
			if (SupportInfo[i][sDuty]) {
				SupportInfo[i][sOnline]++;
			}
	    	SurfingVehicle(i); //tTimeAddiction
			if (pTemp[i][tTimeAddiction] < gettime() && pInfo[i][pAddiction] > 2000 && !pInfo[i][pNarcoLomka] && !pTemp[i][tPaintTeam] && !IsPlayerInDuel(i) && !pTemp[i][tDMArea][0] && !pInfo[i][pHospital])
			{
				SendClientMessage(i, COLOR_LI_RED, !"[Оповещение] "colwhi"У Вас началась ломка");
				SendClientMessage(i, COLOR_YELLOW, !"[Подсказка] "colwhi"Принять наркотик: "colrose"\"/usedrugs\" "colwhi"или вызвать скорую помощь: "colrose"\"/call\"");
				pInfo[i][pNarcoLomka] = 1; 
				pTemp[i][StartAddiction] = true; 
			} 
   			GrandEndOK = 27; 
			if (CellTime[i] > 0)
			{
			    new string_[64];
				if (CellTime[i] == 60)
				{
					CellTime[i] = 1;
					if (Mobile[ Mobile[i] ] == i) pInfo[i][pMobile] = pInfo[i][pMobile] + PRICE_PHONE_MIN;
					CellTime[i] = CellTime[i] +1;
					if (Mobile[ Mobile[i] ] == 999 && CellTime[i] == 5)
					{
						if (IsPlayerConnected(Mobile[i])) {
							format(string_, sizeof string_, "У %s звонит мобильник",pInfo[Mobile[i]][pName]);
							MeAction(Mobile[i], string_, SELECT_ACTION_IN_CHAT); 
						}
					}
				}
				if (CellTime[i] == 0 && pInfo[i][pMobile] > 0)
				{
					format(string_, sizeof string_, "~w~Phone~n~~r~%d", pInfo[i][pMobile]);
					GameTextForPlayer(i, string_, 5000, 1);
				}
			}
			if (IsFind[i] != INVALID_PLAYER_ID)
			{
				if (IsPlayerConnected(IsFind[i]) && !GetPlayerInterior(IsFind[i])) {
					new Float:Pos[3];
					GetPlayerPos(IsFind[i], Pos[0],Pos[1],Pos[2]);
					SetPlayerCheckpoint(i, Pos[0],Pos[1],Pos[2],3.0);
				} else {
					DisablePlayerCheckpoint(i);
					SendClientMessage(i, COLOR_GREY, !"Цель скрылась.");
					IsFind[i] = INVALID_PLAYER_ID;
				}
			}
			GrandEndOK = 28;
			if (pTemp[i][tTruckerLoadTime] > 0 && pTemp[i][tTruckerTrailerBuy] != INVALID_VEHICLE_ID )
			{
				pTemp[i][tTruckerLoadTime] --;
				new str_[32]; 
				format(str_, sizeof str_, "Time:_~y~%s", Converts(pTemp[i][tTruckerLoadTime]));
				PlayerTextDrawSetString(i, TimerTrucker_PTD[i], str_); 

				if (pTemp[i][tTruckerLoadTime] == 0)
				{
					new vehicleid = pTemp[i][tTruckerTrailerBuy];
					trailer_count [ vehicleid - 1 ] = 0;
					_DestroyVehicle(vehicleid);
					for ( new j = 0 ; j < LOADING_ALL ; j ++ ) {
						if (TurnLoadingTrucker[j][0] == i) {
							TurnLoadingTrucker[j][0] = INVALID_PLAYER_ID;
						}
						if (TurnLoadingPlayerID[j] == i ) {
							TurnLoadingPlayerID[j] = INVALID_PLAYER_ID;
							DeletePVar(i, "truck_waiting");
						}
					}
					HideTruckerMainMenu(i); 
					pTemp[i][tTruckerTrailerBuy]= INVALID_VEHICLE_ID;
					SendClientMessage(i, COLOR_LI_RED, !"[Оповещение] "colwhi"Ваше время для прицепления фуры истекло. Деньги вам не будут возвращены");
					pTemp[i][tTruckerLoadTime] = -1;
				} 
			}
			if (pTemp[i][tTruckerLeaveTime] > 0 && pTemp[i][tTruckerTrailerBuy] != INVALID_VEHICLE_ID)
			{
				pTemp[i][tTruckerLeaveTime] -- ;
				new str_[32]; 
				format(str_, sizeof str_, "Time:_~y~%s", Converts(pTemp[i][tTruckerLeaveTime]));
				PlayerTextDrawSetString(i, TimerTrucker_PTD[i], str_); 
				if (pTemp[i][tTruckerLeaveTime] == 0)
				{
					new vehicleid = pTemp[i][tTruckerTrailerBuy];
					trailer_count [ vehicleid - 1 ] = 0;
					_DestroyVehicle(vehicleid);
					HideTruckerMainMenu(i);
					pTemp[i][tTruckerTrailerBuy] = INVALID_VEHICLE_ID; 
					SendClientMessage(i, COLOR_LI_RED, !"[Оповещение] "colwhi"Ваше время для выезда с зоны загрузки истекло. Деньги Вам не будут возвращены" ) ;
				}
			}


			if (GetVehicleTrailer( GetPlayerVehicleID(i) ) == pTemp[i][tTruckerTrailerBuy] && pTemp[i][tTruckerTrailerBuy] != INVALID_VEHICLE_ID && GetPVarInt (i, "truck_waiting") > 0)
			{
				SendClientMessage(i, COLOR_LI_RED, !"[Оповещение] "colwhi"Вы прицепили фуру. У Вас есть 1 минута, чтобы покинуть место загрузки." ) ;
				//AttachTrailerToVehicle(pTemp[i][tTruckerTrailerBuy], GetPlayerVehicleID(i));
				pTemp[i][tTruckerLoadTime] = -1;
				pTemp[i][tTruckerLeaveTime] = 60;
				DeletePVar(i, "truck_waiting"); 
				SetTimerEx("UpdateTruckerTrailerMinute", 60_000, false, "i", i);
			}
			GrandEndOK = 29;
			if (pInfo[i][pRecognition] > 1 && LabelOn[i] == 0 && pInfo[i][pWantedLevel] >= 1)
			{
				LabelOn[i] = 1;
				if (IsValidDynamic3DTextLabel(LabelRecognition[i])) {
					DestroyDynamic3DTextLabel(LabelRecognition[i]);
					LabelRecognition[i] = Text3D:0;
				}
				LabelRecognition[i] = CreateDynamic3DTextLabel("Преступник!",0xFF0000FF, 30.0, 40.0, 50.0, 40.0,i);
			}
	 		if (LabelOn[i] == 1 && pInfo[i][pRecognition] <= 1)
		 	{
				if (IsValidDynamic3DTextLabel(LabelRecognition[i])) {
					DestroyDynamic3DTextLabel(LabelRecognition[i]);
					LabelRecognition[i] = Text3D:0;
				}
				LabelOn[i] = 0;
			}
	 		GrandEndOK = 30;
	  		if (pTemp[i][PlayerIsSmoking] == 1)
	    	{
	    	    MeAction(i, "докуривает сигарету", SELECT_ACTION_IN_CHAT, 25.0); 
		    	if (GetPlayerHP(i) < 120) SetPlayerHealth(i, GetPlayerHP(i) + 3);
		    	SetPlayerSpecialAction(i, SPECIAL_ACTION_NONE);
			}
	  		if (pTemp[i][PlayerIsSmoking] == 51 || pTemp[i][PlayerIsSmoking] == 31 || pTemp[i][PlayerIsSmoking] == 11)
	    	{ 
				MeAction(i, "курит сигарету", SELECT_ACTION_IN_CHAT, 25.0); 
	   			if (GetPlayerHP(i) < 120) SetPlayerHealth(i, GetPlayerHP(i) + 3);
		    }
		    GrandEndOK = 31;
		    if (pTemp[i][PlayerIsSmoking] > 0) pTemp[i][PlayerIsSmoking] -= 1;
			if (Flood[i] > 0) Flood[i] -=1; 
			if (pInfo[i][pMuted] > 1) pInfo[i][pMuted] --;
			if (pInfo[i][pMuted] == 1) pInfo[i][pMuted] = 0, SendClientMessage(i,COLOR_LIGHTRED, !"Вам включили чат. Пожалуйста соблюдайте правила");
			if (pInfo[i][rMuted] > 1) pInfo[i][rMuted] --;
			if (pInfo[i][rMuted] == 1) pInfo[i][rMuted] = 0, SendClientMessage(i,COLOR_LIGHTRED, !"Вам сняли бан репорта. Пожалуйста соблюдайте правила");
			if (pInfo[i][FractionMute] > 1) pInfo[i][FractionMute] --;
			if (pInfo[i][FractionMute] == 1) {
				pInfo[i][FractionMute] = 0;
				SendClientMessage(i, COLOR_LIGHTRED, !"Вам включили чат организации. Пожалуйста соблюдайте правила");	
			}
			
			if (pInfo[i][pMember] == 0) {
				pInfo[i][pInGame]++;
				pInfo[i][pInGameDay]++;
				pInfo[i][pInGameAllTime]++;
			}
			else {
				pInfo[i][pInGameMember]++; 
				pInfo[i][pInGame]++; 
				pInfo[i][pInGameDay]++; 
				pInfo[i][pInGameAllTime]++;
			}
			pTemp[i][tTimeInHour] ++;
			if (pInfo[i][pJailTime] > 0)
			{
				if (pInfo[i][pJailTime] > 1) pInfo[i][pJailTime]--;
				if (pInfo[i][pJailTime] == 1)
				{
					if (pInfo[i][pMestoJail] == 1) SetPlayerPosAC(i, 1553.4962, -1675.2714, 16.1953, 0, 0); 
					if (pInfo[i][pMestoJail] == 2) SetPlayerPosAC(i, -1607.1873, 721.3649, 12.2721, 0, 0);  
					if (pInfo[i][pMestoJail] == 3) SetPlayerPosAC(i, 2334.8467, 2454.9456, 14.9688, 0, 0);  
					if (pInfo[i][pMestoJail] == 4) SetPlayerPosAC(i, 86.9821, 1181.0541, 18.6641, 0, 0);
					pInfo[i][pJailTime] = 0;
					pTemp[i][tPlayerCuffed] = 0;
					SendClientMessage(i, COLOR_ISPOLZUY, !"Вы заплатили свой долг обществу, теперь вы свободны!");
					pInfo[i][pMestoJail] = 0; 
					pInfo[i][pWantedLevel] = 0;
					SetPlayerWantedLevelEx(i, pInfo[i][pWantedLevel]);
					SetPlayerVirtualWorld(i, 0);
					SetPlayerInterior(i, 0);
					GameTextForPlayer(i, !"~g~Freedom", 5000, 1);
				}
			} 
		 	GrandEndOK = 32;
			
			#if defined _casino_included
				UpdateCasinoChipsPTD(i);
			#endif
			GrandEndOK = 33;
			duels_TimerPlayer(i);
			GrandEndOK = 34;
			if (TieTime[i] > 0) TieTime[i]--; 
			if (pTemp[i][tPlayerCuffed] == 1)
			{
				if (PlayerCuffedTime[i] <= 0)
				{
					TogglePlayerControllable(i, 1);
					pTemp[i][tPlayerCuffed] = 0;
					PlayerCuffedTime[i] = 0;
				}
				else PlayerCuffedTime[i] -= 1;
			}
			if (pTemp[i][tPlayerCuffed] == 2)
			{
				if (PlayerCuffedTime[i] <= 0)
				{
					TogglePlayerControllable(i, 1);
					pTemp[i][tPlayerCuffed] = 0;
					PlayerCuffedTime[i] = 0;
				}
				else PlayerCuffedTime[i] -= 1;
			}
			GrandEndOK = 35;
		}
	}

	AirDrop_SecondTimer();

	drugs_timer();

	GrandEndOK = 36;  
	if (minute == 59 && second == 05)
	{
	    FractionInfo[12][fMoney] += TotalGzB*300;
		FractionInfo[13][fMoney] += TotalGzV*300;
		FractionInfo[15][fMoney] += TotalGzG*300;
		FractionInfo[17][fMoney] += TotalGzA*300;
		FractionInfo[18][fMoney] += TotalGzR*300; 
		GetHome(); 
		GetFarm();
		GetFamilyHome();
		#if defined _businesses_inc
			CheckBusiness();
		#endif
	}
	if (minute == 15 && second == 01) {
		SendGangMessage(0xEEDC82FF, "« Через 15 минут в порт Los Santos Army прибудет поставка боеприпасов »");
	}
	if (minute == 30 && second == 00) {
		gEconomyServer[eMaterialsLSa][0] = 
    	gEconomyServer[eMaterialsLSa][1] = 400_000; 
		SendGangMessage(0xEEDC82FF, "« В порт Los Santos Army прибыли боеприпасы »");
	}
	if (minute == 30 && second == 50) {
		if(Spawncartime) {
			SetTimer ( "spawn_carsooc", 15000, false) ;
 			SendClientMessageToAll(COLOR_YELLOW, "* Через 30 секунд произойдет респавн незанятого транспорта.");
	        SendClientMessageToAll(COLOR_YELLOW, "* Чтобы транспорт не пропал - сядьте в него.");
		}
	}
	if (minute == 25 && second == 00 || minute == 35 && second == 00 || minute == 55 && second == 00) {
		if(ReklamaOOC) {

			    SendClientMessageToAll(COLOR_LIGHTGREEN,!"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
			    SendClientMessageToAll(COLOR_GREEN,!"Получение дополнительных средств "Namesait"/donate.");
			    SendClientMessageToAll(COLOR_LIGHTGREEN,!"Приведи друга, получи деньги. При регистрации необходимо указать ваш ник.");
			    SendClientMessageToAll(COLOR_GREEN,!"Для связи с администрацией введите /mm  Далее выберите репорт.");
			    SendClientMessageToAll(COLOR_LIGHTGREEN,!"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
		}
	}	

	GrandEndOK = 37;
	if ((hour > ghour) || (hour == 0 && ghour == 23))
	{
		SendMesAll(-1, " Сейчас времени %d:00 часов", hour);
		capture_fix = gettime() + RandomFIX(10, 70);
		ghour = hour;
		curdate = getdate(year, month, day);
		if (hour == 00) {
			PayDayTemp(true);
			CheckBusinessToday();
		}
		else {
			PayDayTemp();
			if (VACANCY_COUNT) SendClientMessageToAll(COLOR_YELLOW, "[Подсказка] "colwhi"Доступные вакансии в организации \"/vacancy\"");
		}
		
		SetWorldTime(hour);
		if (hour == 18 && getDay() == 1) {//Воскресенье 
			mysql_tquery (dbHandle, "SELECT `fID`, `fRepute` FROM `s_fractionbank` WHERE `fID` IN (12,13,15,17,18) ORDER BY `fRepute` DESC LIMIT 3", "ItogWeekGangStats");
		}
		
		if (hour == 14 || hour == 16 || hour == 18) {
			StartDeliveryMats();
		}
	}
	GrandEndOK = 38;
	getdate(year, month, day);
	format(t_string, 56, "%02d:%02d:%02d %02d/%02d/%02d",hour,minute,second,day,month,year);
	TextDrawSetString(CamsTD[11], t_string), t_string[0] = EOS;
	/*for(new i; i < S_ACTOR_COUNT; i++) {
		if(ActorsInfo[i][aTalkTime] > 0 ) {
			ActorsInfo[i][aTalkTime]--;
			if(ActorsInfo[i][aTalkTime] == 0) {
				UpdateDynamic3DTextLabelText(ActorsInfo[i][aTalk], COLOR_GREY, "");
				ApplyDynamicActorAnimation(ActorsInfo[i][aID], "BD_FIRE", "BD_Fire1", 4.1, 0, 0, 0, 0, 1);
				if(i == 6 || i == 7 || i == 8 || i == 9 || i == 10 || i == 11 || i == 12) ApplyDynamicActorAnimation(ActorsInfo[i][aID], "DEALER","Dealer_idle",4.1,0,0,0,1,1);
			}
		}
	}*/

	if (++CheckDeerReSpawn > 120) {
		for(new i = 0; i < S_DEER_COUNT; i++) {
			if (gDeerHunterInfo[i][deerSpawned] && gDeerHunterInfo[i][deerKilled] && !gDeerHunterInfo[i][deerUsePlayer]) {
				if (++gDeerHunterInfo[i][deerCoolDown] > 3) {
					DestroyHunter(i);
				}
			}
			if (!gDeerHunterInfo[i][deerSpawned])  {
				gDeerHunterInfo[i][deerObject] = CreateDynamicObject(19315, gDeerHunterInfo[i][deerPos][0], gDeerHunterInfo[i][deerPos][1], gDeerHunterInfo[i][deerPos][2], 0.000000, 0.000000, 0.000000, 0, 0, -1, 200.00, 200.00);
				gDeerHunterInfo[i][deerSpawned] = true;
				gDeerHunterInfo[i][deerUsePlayer] = false;
			}
		}
		CheckDeerReSpawn = 0;
		//SendClientMessageToAll(COLOR_RED, !"Spawn Deer");
	}

	GrandEndOK = 39;
	//старый
	/*if (hour == 05 && minute == 01 && (second == 15 || second == 16))
	{
		ServerRestart();
		SetTimer("GameModeExitDelay", 30_000, false);
		SendClientMessageToAll(COLOR_RED, !"");
		SendClientMessageToAll(COLOR_RED, !"");
		SendClientMessageToAll(COLOR_RED, !"_______________=======[Внимание!Рестарт сервера через 30 секунд]=======_______________");
		SendClientMessageToAll(COLOR_RED, !"");
		SendClientMessageToAll(COLOR_RED, !"");
	}*/
	//новый
	if(hour == 05 && minute == 01 && second == 05)
	{
		ServerRestart();
		SetTimer("GameModeExitDelay",5000,false);
		SendClientMessageToAll(COLOR_RED, !"");
		SendClientMessageToAll(COLOR_RED, !"");
		SendClientMessageToAll(COLOR_RED, !"_______________=======[Внимание!Рестарт сервера через 5 секунд]=======_______________");
		SendClientMessageToAll(COLOR_RED, !"");
		SendClientMessageToAll(COLOR_RED, !"");
	}
	GrandEndOK = 40;
	Event_SecondTimer();  
	#if defined _a_event_inc 
		Event:OnSecondTimer();
	#endif
	Fraction_SecondTimer();
	GrandEndOK = 41;
	MoveCash_SecondTimer();
	SettingServer[2] = GetTickCount() - tickcount1;
	if (SettingServer[2] > SettingServer[3]) SettingServer[3] = SettingServer[2];
	GrandEndOK = 0;
	return 1;
}
stock ShowStats(playerid, targetid)
{
	if (!PlayerInConnected(targetid)) return 1;
	SetPlayerUpdateRating(targetid);
	new 
		drank[20], 
		vip_name[25], boost_name[25]; 
	switch(pInfo[targetid][pLevel])
	{
		case 1 .. 5: drank = "Новичок";
		case 6 .. 15: drank = "Освоившийся";
		case 16: drank = "Постоянный игрок";
		default: drank = "Дед";
	} 
	GetVIPRankName(targetid, vip_name);
	
	new exp = pInfo[targetid][pExp],
		nxtlevel = pInfo[targetid][pLevel]+1,
		expamount = nxtlevel * 4,
		Float: fishes = pInfo[targetid][pFishes],
		str_[128];
    t_string[0] = EOS;
	new temp_warn[40];

	new date_[6];
	if (pInfo[targetid][punWarns] != 0)
	{
		TimestampToDate(pInfo[targetid][punWarns],date_[0],date_[1],date_[2],date_[3],date_[4],date_[5],3);
		format(temp_warn,sizeof(temp_warn),"%02d/%02d/%02d %02d:%02d:%02d",date_[2],
		date_[1],date_[0],date_[3],date_[4],date_[5]);
	}
	format(str_, sizeof str_,""colwhi"Донат счётчик::\t\t\t"colwarn"%d\n", pInfo[targetid][pDonate]);
	strcat(t_string, str_);
	format(str_, sizeof str_,""colwhi"Устройство:\t\t\t%s\n", player_mobile[targetid] ? ("Mobile") : ("PC"));
	strcat(t_string, str_);
	format(str_, sizeof str_, ""colwhi"Имя:\t\t\t%s\n", pInfo[targetid][pName]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Уровень:\t\t\t%d\nРейтинг:\t\t\t%.2f\n", pInfo[targetid][pLevel], pInfo[targetid][pRating]);
	strcat(t_string, str_); 
	format(str_, sizeof(str_),""colwhi"Exp:\t\t\t\t%d/%d\n", exp,expamount);
	strcat(t_string, str_);
	format(str_, sizeof str_, ""colwhi"Статус VIP:\t\t\t%s\n", vip_name);
	strcat(t_string, str_);
	GetBoostRankName(targetid, boost_name);
	format(str_, sizeof str_, ""colwhi"Стартовый пакет:\t\t%s\n", boost_name);//convert_money(
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Деньги:\t\t\t$%s\n", convert_money(pInfo[targetid][pCash]));
	strcat(t_string, str_); 
	format(str_, sizeof str_,""colwhi"Деньги в банке:\t\t\t$%s\n", convert_money(pInfo[targetid][pBank]));
	strcat(t_string, str_);
	if (pInfo[playerid][pAdmin] > 0) {  
		format(str_, sizeof str_,""colwhi"Деньги на депозите:\t\t%d\n", pInfo[targetid][pDeposit]);
		strcat(t_string, str_);  
	}
	format(str_, sizeof(str_),""colwhi"Телефон:\t\t\t%d\n", pInfo[targetid][PlayerNumber]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Варнов:\t\t\t%d\n", pInfo[targetid][pWarns]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Снятие варна:\t\t\t%s\n", !pInfo[targetid][punWarns] ? ("нет варна") : temp_warn);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Законопослушность:\t\t%d\n", pInfo[targetid][pZakonp]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Преступлений:\t\t\t%d\n", pInfo[targetid][pCrimes]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Арестов:\t\t\t%d\n", pInfo[targetid][pArrested]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Смертей в розыске:\t\t%d\n", pInfo[targetid][pWantedDeaths]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Уровень розыска:\t\t%d\n", pInfo[targetid][pWantedLevel]);
	strcat(t_string, str_);
	TimestampToDate(pInfo[targetid][DataReg],date_[0],date_[1],date_[2],date_[3],date_[4],date_[5],3);
	format(temp_warn,sizeof(temp_warn),"%02d/%02d/%02d %02d:%02d:%02d",date_[2],
	date_[1],date_[0],date_[3],date_[4],date_[5]);
	format(str_, sizeof(str_),""colwhi"Дата регистрации:\t\t%s\n", temp_warn);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Зависимость:\t\t\t%d\n", pInfo[targetid][pAddiction]);
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Тяжелые наркотики:\t\t%d/%d\n", pInfo[targetid][pDrugs], GetVIPLimitDrugs(targetid));
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Легкие наркотики:\t\t%d/%d\n", pInfo[targetid][pLDrugs], GetVIPLimitDrugs(targetid));
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Материалы:\t\t\t%d/%d\n", pInfo[targetid][pMats], GetVIPLimitMaterials(targetid));
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Рыб поймано:\t\t\t%.1f кг\n", fishes);
	strcat(t_string, str_);///

	format(str_, sizeof(str_),""colwhi"Организация:\t\t\t%s\n", gFraction[pInfo[targetid][pMember]][fName]);
	strcat(t_string, str_);
	if (pInfo[targetid][pMember] != 0)
	{
		format(str_, sizeof(str_),""colwhi"Ранг:\t\t\t\t%s (%d)\n", fFractionRank[pInfo[targetid][pMember]][pInfo[targetid][pRank] - 1], pInfo[targetid][pRank]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),""colwhi"Выговоры:\t\t\t(%d/3)\n", pInfo[targetid][FractionWarn]);
		strcat(t_string, str_);
	}
	format(str_, sizeof(str_),""colwhi"Работа:\t\t\t\t%s\n", gJobNames[ pInfo[targetid][pJob] ] );
	strcat(t_string, str_);
	format(str_, sizeof(str_),""colwhi"Статус:\t\t\t\t%s\n", drank);
	strcat(t_string, str_);


	if (!GetString(pInfo[targetid][pMarriedTo],"-")) format(str_, sizeof(str_),""colwhi"%s:\t\t\t\t%s\n", (pInfo[targetid][pSex] == 1)?("Жена"):("Муж"),  pInfo[targetid][pMarriedTo]);
	else format(str_, sizeof(str_),""colwhi"%s:\t\t\t\tНе состоит в браке\n", (pInfo[targetid][pSex] == 1)?("Жена"):("Муж"));
	strcat(t_string, str_);

	format(str_, sizeof str_, ""colwhi"Пол:\t\t\t\t%s\n", (pInfo[targetid][pSex] == 1)?("Мужской"):("Женский"));
	strcat(t_string, str_);



	if (pInfo[targetid][pHouseID] != -1) { 
		format(str_, sizeof str_, ""colwhi"Дом:\t\t\t\t"collime"%d\n", pInfo[targetid][pHouseID]);
		strcat(t_string, str_);
	}  
	else strcat(t_string, ""colwhi"Дом:\t\t\t\t"colwarn"Отсутствует\n");
	if (pInfo[targetid][pRentHouse] != -1) {
		format(str_, sizeof str_, ""colwhi"Прописка в доме:\t\t"collime"%d\n", pInfo[targetid][pRentHouse]);
		strcat(t_string, str_); 
	}  
	else strcat(t_string, ""colwhi"Прописка в доме:\t\t"colwarn"Отсутствует\n");  

	new
        strTitle[122]; 
    format(strTitle, sizeof strTitle, ""colserver"Рейтинг:\t\t"colwhi"%.2f "colserver"| %s", pInfo[targetid][pRating]);

	/*if (Iter_Count(PlayerListVehicle[targetid]) != 0) {
		foreach(new V_IDX:PlayerListVehicle[targetid]) {
			GetVehicleParamsEx(V_IDX, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
			format(str_, sizeof str_, "\n{AFAFAF}%s(%d)\nСтатус блокировки: [%s] \nНе оплаченый налог: [$%d]\n",
				VehicleNames[ VehicleInfo[ V_IDX - 1 ][vModel] - 400], VehicleInfo[ V_IDX - 1 ][vModel], doors3 >= 1 ? ("Закрыт"):("Открыт"), VehicleInfo[ V_IDX - 1 ][vTax]
			);
			strcat(t_string, str_);
		}
	}*/
	
	/*if (pInfo[playerid][pAdmin] > 0)
	{
		#if defined _promo_referal_inc PromoCode:getPlayerPromoName(PromoCode:GetPlayerData(targetid, uCodeID))
			format(str_, sizeof str_,
				""colserver"Промокод указаный при регистрации: %s.\n", 
				PromoCode:getPlayerPromoName(PromoCode:GetPlayerData(targetid, uCodeID))
			);
			strcat(t_string, str_);
		#else
			format(str_,sizeof(str_),""colserver"Промокод указаный при регистрации: %s.\n", GetPlayerPromoCodeSearch(pInfo[targetid][PromoCode]));
			strcat(t_string, str_);
		#endif
		 промо
	    format(str_,sizeof(str_),"\n\n\n"colserver"В игре с момента последнего входа уже: %s.\n", Convert(pInfo[targetid][pInGame]));
		strcat(t_string, str_);
		format(str_,sizeof(str_),""colserver"В игре пробыл в последний день входа: %s.\n", Convert(pInfo[targetid][pInGameDay]));
		strcat(t_string, str_);
		format(str_,sizeof(str_),""colserver"С момента регистрации уже играет: %s.\n\n", Convert(pInfo[targetid][pInGameAllTime]));
		strcat(t_string, str_);
		format(str_,sizeof(str_),""colserver"ID Аккаунта: %d\n", pInfo[targetid][pID]);
		strcat(t_string, str_);
		if (pInfo[targetid][pMember] > 0) {
		    format(str_,sizeof(str_),""colserver"В организации состоит уже: %s.\n\n", Convert(pInfo[targetid][pInGameMember]));
			strcat(t_string, str_);
		}
	}*/
	ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_LIST, ""colserver"Статистика: "colwhi"Персонажа", t_string, "Готово", "");
	return 1;
}


stock ShowStatsMDC(playerid,targetid)
{
	if (IsPlayerConnected(playerid) && IsPlayerConnected(targetid))
	{
		new ttext[21];
		switch(pInfo[targetid][pMember])
		{
		    case 1: ttext = "LSPD";
		    case 2: ttext = "ФБР";
		    case 3: ttext = "Армия СФ";
		    case 4: ttext = "Медики СФ";
		    case 5: ttext = "La Cosa Nostra";
		    case 6: ttext = "Yakuza";
		    case 7: ttext = "Мэрия";
		    case 8: ttext = "Casino";
		    case 9: ttext = "SF News";
		    case 10: ttext = "SFPD";
		    case 11: ttext = "Автошкола";
		    case 12: ttext = "Ballas Gang";
		    case 13: ttext = "Vagos Gang";
		    case 14: ttext = "Русская Мафия";
		    case 15: ttext = "Grove Street";
		    case 16: ttext = "LS News";
		    case 17: ttext = "Aztecas Gang";
		    case 18: ttext = "Rifa Gang";
		    case 19: ttext = "Армия ЛВ";
		    case 20: ttext = "LV News";
		    case 21: ttext = "LVPD";
		    case 22: ttext = "Медики ЛС";
		    case 23: ttext = "Медики ЛВ";
		    case 24: ttext = "Mongols MC";
		    case 25: ttext = "Bandidos MC";
		    case 26: ttext = "Outlaws MC";
			default: ttext = "Нет";
		}
		new str_[64];
		t_string[0] = EOS;
		format(str_, sizeof(str_),"Имя:\t\t\t\t%s\n", pInfo[targetid][pName]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Пол:\t\t\t\t%s\n", (pInfo[targetid][pSex] == 1)?("Мужской"):("Женский"));
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Телефон:\t\t\t%d\n\n", pInfo[targetid][PlayerNumber]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Преступлений:\t\t%d\n", pInfo[targetid][pCrimes]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Арестов:\t\t\t%d\n", pInfo[targetid][pArrested]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Уровень розыска:\t\t%d\n", pInfo[targetid][pWantedLevel]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Организация:\t\t\t%s\n", ttext);
		strcat(t_string, str_);
		if (pInfo[targetid][pMember] != 0)
		{
			format(str_, sizeof(str_),"Ранг:\t\t\t\t%s\n", fFractionRank[ pInfo[targetid][pMember]][pInfo[targetid][pRank] - 1]);
			strcat(t_string, str_);
		}
		format(str_, sizeof(str_),"Работа:\t\t\t%s\n", gJobNames[pInfo[targetid][pJob]]);
		strcat(t_string, str_);
		format(str_, sizeof(str_),"Жена/Муж:\t\t\t%s\n", pInfo[targetid][pMarriedTo]);
		strcat(t_string, str_);
		ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_MSGBOX, "Подробная информация", t_string, "Закрыть", "");
	}
	return 1;
}

new lastDShot[MAX_PLAYERS];

#define CBUG_INTERVAL_DEAGLE    700
#define CBUG_INTERVAL_SHOTGUN   1000
//#define CBUG_INTERVAL_COMBATSG  340
//#define CBUG_INTERVAL_COUNTRY   850
//#define CBUG_INTERVAL_SNIPER    850

stock IsCbugWeapon(weaponID)
{
    if(weaponID == 22 || weaponID == 24 || weaponID == 25 || weaponID == 27)
    {
        return 1;
    }
    return 0;
}

stock IsCbugTime(weaponid)
{
	switch (weaponid)
	{
		case 24: return CBUG_INTERVAL_DEAGLE;
		case 25: return CBUG_INTERVAL_SHOTGUN;
	}
	return 0;
}

stock GetWeaponSkill(weaponid)
{
    switch(weaponid)
    {
        case 23: return 0;
        case 24: return 1;
        case 25: return 2;
        case 29: return 3;
        case 30: return 4;
        case 31: return 5;
        default: return 0xFFFF;
    }
    return 0xFFFF;
}
stock GetShotsSkillLevel(type)
{
    switch(type)
    {
        case 0: return 10;
        case 1: return 7;
        case 2: return 5;
        case 3: return 25;
        default: return 35;
    }
    return 35;
}


stock GetSkillLevel(weaponid)
{
    switch(weaponid)
    {
        case 23: return WEAPONSKILL_PISTOL_SILENCED;
        case 24: return WEAPONSKILL_DESERT_EAGLE;
        case 25: return WEAPONSKILL_SHOTGUN;
        case 29: return WEAPONSKILL_MP5;
        case 30: return WEAPONSKILL_AK47;
        case 31: return WEAPONSKILL_M4;
        default: return 0;
    }
    return 0;
}


stock MySQLConnectToServerDataBase()
{
	dbHandle = mysql_connect("", "", "", ""); // dragon
    mysql_log(ERROR);
	switch(mysql_errno(dbHandle))
	{
	    case 0:
		{
			print(!"[MySQL] Подключение к базе данных удалось");
			mysql_set_charset("cp1251");
            mysql_tquery(dbHandle, "SET CHARACTER SET 'utf8'", "", "");
		    mysql_tquery(dbHandle, "SET NAMES 'utf8'", "", "");
		    mysql_tquery(dbHandle, "SET character_set_client = 'cp1251'", "", "");
		    mysql_tquery(dbHandle, "SET character_set_connection = 'cp1251'", "", "");
		    mysql_tquery(dbHandle, "SET character_set_results = 'cp1251'", "", "");
		    mysql_tquery(dbHandle, "SET SESSION collation_connection = 'utf8_general_ci'", "", "");
			
			// Очистка логов позднее 30 суток
			mysql_query(dbHandle, "DELETE FROM `s_logs_money` WHERE date < NOW() - INTERVAL 30 DAY;");
			mysql_query(dbHandle, "DELETE FROM `s_logs_f_money` WHERE date < NOW() - INTERVAL 30 DAY;");
			mysql_query(dbHandle, "DELETE FROM `sh_connect` WHERE Timestamp < NOW() - INTERVAL 30 DAY;");
			mysql_query(dbHandle, "DELETE FROM `sl_users` WHERE timestsamp < NOW() - INTERVAL 30 DAY;");
			mysql_query(dbHandle, "DELETE FROM `sl_admins` WHERE timestsamp < NOW() - INTERVAL 30 DAY;");

			LoadBusinesses(); // 
			House_OnGameModeInit();
			SeatDown_OnGameModeInit();
			MoveCash_OnGameModeInit(); 
			OnLoadDiplomationCriminals();//Cache
			mysql_tquery(dbHandle, "SELECT * FROM `s_fraction`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_FRACTION, -1, "");  
			mysql_tquery(dbHandle, "SELECT * FROM `farms`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_FARMS, -1, "");// AND `vJakcer` > '0'
			Vehicle_OnGameModeInit(); 
		    mysql_tquery(dbHandle, "SELECT * FROM `casino`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_CASINO, -1, ""); 
		    mysql_tquery(dbHandle, "SELECT * FROM `s_stall`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_OTHER_STALL, -1, "");
		    mysql_tquery(dbHandle, "SELECT * FROM `s_gangzone`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_GANGZONE, -1, "");
		    mysql_tquery(dbHandle, "SELECT * FROM `s_graffiti`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_GRAFFITI, -1, "");
		    mysql_tquery(dbHandle, "SELECT * FROM `s_fractionbank`", "OnMySQL_QUERY", "iis", MYSQL_LOAD_FRACTION_BANK, -1, ""); 
			mysql_tquery(dbHandle, "SELECT * FROM `s_billboards`", "LoadBilbords",""); 
  			mysql_tquery(dbHandle, "SELECT * FROM anticheat_settings ORDER BY ac_code","UploadAntiCheatSettings");
			mysql_tquery(dbHandle, "SELECT * FROM `ac_settings`", "LoadAcSettings","");	
			Family_OnGameModeInit();
			Fraction_OnGameModeInit();
			BoostServer_OnGameModeInit();
			ATM_OnGameModeInit();
			LoadBoostPack(); 
			LoadVIPPack();

			if ((((gettime()+2*3600)/86400)%7) == 4){
				mysql_tquery(dbHandle, "\
					UPDATE `s_admin` SET `s_Reports` = '0', `s_Ask` = '0', `s_Bans` = '0', `s_Warns` = '0', \
					`s_Mutes` = '0', `s_Reputes` = '0', `s_Jails` = '0', `s_Prisons` = '0', `s_OTime` = '0'", "", ""
				);
				mysql_tquery(dbHandle, "UPDATE "TABLE_SUPPORTS" SET sOnline = '0'");
			}
			if (day == 1) {
				mysql_tquery(dbHandle, "UPDATE s_users SET MadTime = '0', pCharity = '0'"); 
			}
			mysql_tquery (dbHandle, "SELECT `Name`,`pLevel`,`pCharity` FROM `s_users` WHERE `pLevel` != 0 ORDER BY `pCharity` DESC LIMIT 5", "LoadTopServer");
			mysql_tquery (dbHandle, "SELECT `Name`,`MadTime` FROM `s_users` WHERE `MadTime` != 0 ORDER BY `MadTime` DESC LIMIT 5", "LoadTopMadHouse");
		}
	    case 1044: print(!"[MySQL] Подключение к базе данных не удалось [Указано неизвестное имя пользователя]");
	    case 1045: print(!"[MySQL] Подключение к базе данных не удалось [Указан неизвестный пароль]");
	    case 1049: print(!"[MySQL] Подключение к базе данных не удалось [Указана неизвестная база данных]");
	    case 2003: print(!"[MySQL] Подключение к базе данных не удалось [Хостинг с базой данных недоступен]");
	    case 2005: print(!"[MySQL] Подключение к базе данных не удалось [Указан неизвестный адрес хостинга]");
	    default: printf("[MySQL] Подключение к базе данных не удалось [Неизвестная ошибка. Код ошибки: %d]", mysql_errno());
	}
	return 1;
}

publics: GetClosestforeach(p1)
{
	new Float:dis,Float:dis2,player;
	player = -1;
	dis = 99999.99;
	foreach(new x: PlayerInLogin)
	{
		if (x != p1)
		{
			dis2 = GetDistanceBetweenPlayers(x,p1);
			if (dis2 < dis && dis2 != -1.00)
			{
				dis = dis2;
				player = x;
			}
		}
	}
	return player;
}
stock PayChecks(i)
{
    if (pInfo[i][pZakonp] < 100) pInfo[i][pZakonp]++;
    if (pInfo[i][pZakonp] > 100) pInfo[i][pZakonp] = 100;
    //if (pTemp[i][tDutyWork] == 0) return 0;
	/*if (IsACop(i) && IsAArmy(i) && IsAMedic(i) && IsAMayor(i) && IsALicenser(i) && IsANews(i)) {
		SendClientMessageToAll(-1, "GOS FRACTINO");
		if (FractionInfo[7][fMoney] <=0) {
			scm(i, COLOR_GREY, !"[Мэрия] Казна штата пуста, зарплаты нет...");
			return 0;
		}
	} */
	if (!IsAMafia(i) && !IsAGang(i) && pInfo[i][pMember] && fFractionSalary[pInfo[i][pMember]][pInfo[i][pRank] - 1]) 
	{
		new salary = 0;
		if (FractionInfo[7][fMoney] <=0) {
			SendClientMessage(i, COLOR_GREY, !"[Мэрия] Казна штата пуста, зарплаты нет...");
			return salary;
		}
		salary = fFractionSalary[pInfo[i][pMember]][pInfo[i][pRank] - 1];
		if (salary > FRACTION_MAX_SALARY) salary = FRACTION_MAX_SALARY;
		return salary;
	}
	else if (IsAMafia(i)) return 3500+(pInfo[i][pRank]*1000); 
	else if (IsAGang(i))
	{
	    new null = 0;
        for(new idx = 1; idx <= TOTALGZ; idx++) {
			if (GZInfo[idx][gFrakVlad] == pInfo[i][pMember]) {
				null++;
			}
		}
        return null*50;
	}
	return 0;
}
stock PayDayTemp(bool: newday = false)
{
    for(new i; i < max_war_capture; i++) {
	    if (capture_now[i] == 0 && capture_start[i] > 0) {
	        capture_start[i] --;
	    }
	}
	for(new i; i < FRACTION_COUNT; i++ )
	{
		if(gFraction[ i ][fPrizeTime] > 0 ){
			gFraction[ i ][fPrizeTime]--;
		}
	}
	foreach(new i: PlayerInLogin)
	{
		if (!IsPlayerConnected(i) || (!pInfo[i][pLogin])) continue;
		PayDay(i);
		Sonar[i] = random(2000);
		pTemp[i][tTimeInHour] = 0;
		if (newday == true) {
			gOnlinePlayer[i][1]      = gOnlinePlayer[i][0];
			gOnlinePlayerAFK[i][1]   = gOnlinePlayerAFK[i][0];
			gOnlinePlayer[i][0]      = 0;
			gOnlinePlayerAFK[i][0]   = 0;
		}
	    if (pInfo[i][pWantedLevel] > 0)
		{
   			new tip_city = -1; 
			if (AC_Info[i][acPosX] < 0) tip_city = 1;
			else if (AC_Info[i][acPosY] > 100.0) tip_city = 2;
			else tip_city = 0;
			switch(tip_city)
			{
			  case 0: INFOPD[0]++;
			  case 1: INFOPD[1]++;
			  case 2: INFOPD[2]++;
			  default: INFOPD[3]++;
			} 
		}
		traning[i] = false;
		if (GetPlayerTaxi{i} == 1) UpdatePlayerTaxiExp(i,1);
	}
	return 1;
}

stock UpdatePlayerExp(playerid, count_exp = 1)
{ 
	OnPlayerAchievProgress(playerid, 0);
	OnPlayerAchievProgress(playerid, 3);
	OnPlayerAchievProgress(playerid, 5); 
	new query_[128];
	pInfo[playerid][pExp] += count_exp;
	if (pInfo[playerid][pExp] >= ((pInfo[playerid][pLevel]+1)*4)-1)
	{
		pInfo[playerid][pLevel] ++;
		pInfo[playerid][pExp] = 0;

		PromoCode:CheckingForPromoCodePlayer(playerid);
		//#endif
		if (pInfo[playerid][pLevel] == REFERAL_LEVEL_AWARD){
			new referalid; 
			sscanf(pInfo[playerid][Referal], "u", referalid);
	
			if (!strcmp(pInfo[playerid][Referal], "-", false)) {
				SendClientMessage(playerid, COLOR_BLUE, !"Вы не указали своего реферала. А он мог получить $"#REFERAL_MONEY_AWARD"");
			}
			else if (IsPlayerConnected(referalid) && pInfo[referalid][pLogin] && !strcmp(pInfo[referalid][pName], pInfo[playerid][Referal], true)) {
				pInfo[referalid][pBank] += REFERAL_MONEY_AWARD;
				SavePlayerInteger(referalid, "pBank", pInfo[referalid][pBank]);

				LogMoney(playerid, REFERAL_MONEY_AWARD, "за рефералла");
				
				format(t_string, sizeof t_string, "Вы получили за приглашения %s. +$%d на банковский счет!",
					pInfo[playerid][pName], REFERAL_MONEY_AWARD
				);
				SendClientMessage(referalid, COLOR_GREEN, t_string), t_string[0] = EOS;
			} else {
				mysql_format(dbHandle, query_, sizeof query_, "UPDATE `s_users` SET `pBank` = `pBank`+"#REFERAL_MONEY_AWARD" WHERE `Name` = '%s' LIMIT 1",
					pInfo[playerid][Referal]
				);
				mysql_tquery(dbHandle, query_, "", "");
			}
		}

		format(query_, sizeof query_,"`pLevel` = '%i', `pExp` = '%i', `pBank` = '%i'",pInfo[playerid][pLevel], pInfo[playerid][pExp], pInfo[playerid][pBank]);
		SavePlayerStr(playerid, query_); 
		SendClientMessage(playerid, COLOR_LIGHTGREEN, !"Поздравляем! Ваш уровень повысился");
	 	SetPlayerScore(playerid, pInfo[playerid][pLevel]);
		// обновление ЛВЛ
	}
	else {
		format(query_, sizeof query_,"`pExp` = '%i', `pBank` = '%i'", pInfo[playerid][pExp], pInfo[playerid][pBank]);
		SavePlayerStr(playerid, query_); 
	}
	return 1;
}
publics: OnPlayerGivePromoItems(playerid) {
	if (cache_num_rows()) {
		new	
			items_id; 
		cache_get_value_name_int(0, "items", items_id);
		if (items_id != 0) {
			GivePlayerItem(playerid, items_id, 1); 
			new 
				string_[128];
			format(string_, sizeof string_, "Поздравляем! За активацию промо-кода вы получили акссесуар: %s", 
				inventory_items[ items_id ][ITEM_NAME]);
			SendClientMessage(playerid, COLOR_BLUE, string_);
		}
	}
	return 1;
}
stock UpdatePlayerTaxiExp(playerid, count_exp = 1)
{
	pInfo[playerid][pTaxiExp] += count_exp;
	if (pInfo[playerid][pTaxiExp] >= ((pInfo[playerid][pTaxiLevel]+1)*4)-1)
	{
		pInfo[playerid][pTaxiLevel]++;
		pInfo[playerid][pTaxiExp] = 0;
		SendClientMessage(playerid, COLOR_BLUE, !"Поздравляем! Ваш лвл таксиста повысился"); 
	} 
}

stock GetPlayerBoostName(playerid,result_str[],length,size = sizeof(result_str))
{
	result_str[0] = '\0';
    if (length > size) {
        length = size - 1;
    }
    if (length < 1) {
        return 0;
    }
	static const boost_name[6][19] = {
		"[server]",
		"[Стартовый]",
		"[Профессиональный]",
		"[Авторитет]",
		"[Босс]",
		"[Гетто тащер]"
	};
	if(pInfo[playerid][BoostRank] < 0 || pInfo[playerid][BoostRank] > 5) format(result_str,19,"[ERROR]");
	else { 
		format(result_str,19,"%s",boost_name[pInfo[playerid][BoostRank]]);
	}
	return 1;
}

stock GetPlayerVipName(playerid,result_str[],length,size = sizeof(result_str))
{
	result_str[0] = '\0';
    if (length > size) {
        length = size - 1;
    }
    if (length < 1) {
        return 0;
    }
	static const vip_name[5][19] = {
		"{D2691E}[BRONZE]",
		"{C0C0C0}[SILVER]",
		"{FFD700}[GOLD]",
		"{FF00FF}[PLATINUM]",
		"{4285b4}[DIAMOND]"
	};
	if(pInfo[playerid][VIPRank] < 1 || pInfo[playerid][VIPRank] > 5) format(result_str,19,"[ERROR]");
	else {
		format(result_str,19,"%s",vip_name[pInfo[playerid][VIPRank]-1]); 
	}
	return 1;
}

stock PayDay(playerid)
{ 
 	new
		string_[160];
  	if (pInfo[playerid][pLastData] != curdate)
	{
		mysql_format(dbHandle, string_, sizeof string_, 
			"UPDATE `s_users` SET `LastData` = '%d', `InGameDay` = '0', `pGetonDate` = '%d/%d/%d %d:%d' WHERE `pID` = '%d' LIMIT 1",
			curdate, day, month, year, hour, minute, pInfo[playerid][pID]
		);
		mysql_tquery(dbHandle, string_, "", "");
		pInfo[playerid][pInGameDay] = 0;
		pInfo[playerid][pLastData] = curdate;
	}
	PlayerTraning[playerid] = false;
    pTemp[playerid][TempUseHealth] = 0;
	
	new pay_checks = pInfo[playerid][pPayCheck]; 
	pay_checks += PayChecks(playerid);
	SendClientMessage(playerid, COLOR_GRAD1, !"--------===[ КЛИЕНТ БАНКА SA ]===-------"); 
	GameTextForPlayer(playerid, !"PayDay", 5000, 1);
	if (!NoNalog(playerid))
	{
		if (pay_checks >= 500)
		{ 
			format(string_, sizeof(string_), "***** Налог государству: -$%d *****", FractionInfo[7][fTaxState]);
			SendClientMessage(playerid, 0xFF8C37AA, string_);
			pay_checks -= FractionInfo[7][fTaxState];
			SetMoveCashServer(IN_NALOG_SERVER, FractionInfo[7][fTaxState]); 
			FractionInfo[7][fMoney] += FractionInfo[7][fTaxState];
		}
		else SendClientMessage(playerid, 0xFF8C37AA, !"***** Налог государству: -$0 *****");
	}//20000
	
	if (pInfo[playerid][pBank] > 50 && pInfo[playerid][pKrisha] != 0)
	{
		pInfo[playerid][pBank] -= 50;
		pInfo[playerid][pDolg] += 50;
	}
	if (kLibGetPlayerMoney(playerid) > 50 && pInfo[playerid][pKrisha] != 0)
	{
		kLibGivePlayerMoney(playerid, -50, "[pKrisha] [pDolg] += 50;", .save = false);
		pInfo[playerid][pDolg] += 50;
	}
	format(string_, sizeof(string_), " Счёт за телефон: -$%d", pInfo[playerid][pMobile]);
	SendClientMessage(playerid, 0xFF8C37AA, string_);
	pInfo[playerid][pBank] -= pInfo[playerid][pMobile]; 
	pInfo[playerid][pMobile] = 0;
	SendClientMessage(playerid, COLOR_WHITE, !" ");

	new pay_checks_default = pay_checks,
		pay_checks_vip;

	if(gBoostServer[sBoost] || pInfo[playerid][BoostRank] > 1) pay_checks = GetVipBoostMaxPlayerValue(playerid, vPercentfSalary, bPercentfSalary, pay_checks);

	if(pay_checks > pay_checks_default) pay_checks_default = pay_checks-pay_checks_default;
	else pay_checks_default = 0;

	pay_checks_vip = pay_checks;

	pay_checks += GetVipPackPlayerValue(playerid, vMoney);
	if(pay_checks > pay_checks_vip) pay_checks_vip = pay_checks-pay_checks_vip;
	else pay_checks_vip = 0; 

	new pay_check_no_boost = pay_checks-pay_checks_default-pay_checks_vip;

	switch(pInfo[playerid][pMember])
	{
		case 1, 10, 21: format(string_, sizeof string_, " Зарплата Полиции: $%d", pay_check_no_boost);
		case 2: format(string_, sizeof string_, " Зарплата ФБР: $%d", pay_check_no_boost);
		case 3, 19: format(string_, sizeof string_, " Зарплата Армии: $%d", pay_check_no_boost);
		case 4, 22, 23: format(string_, sizeof string_, " Зарплата Медиков: $%d", pay_check_no_boost);
		case 5, 6, 14: format(string_, sizeof string_, " Зарплата организации: $%d", pay_check_no_boost);
		case 7: format(string_, sizeof string_, " Зарплата Мэрии: $%d", pay_check_no_boost);
		case 9, 16, 20: format(string_, sizeof string_, " Зарплата Новостей: $%d", pay_check_no_boost);
		case 11: format(string_, sizeof string_, " Зарплата Автошколы: $%d", pay_check_no_boost);
		case 8, 12, 13, 15, 17, 18: {
			format(string_, sizeof string_, " Зарплата Бандитов: $%d + за граффити $%d", pay_check_no_boost, tFractionGraffiti[pInfo[playerid][pMember]] * 20);
			pInfo[playerid][pBank] += tFractionGraffiti[pInfo[playerid][pMember]] * 20;
		}
		default: format(string_, sizeof string_, " Зарплата: $%d", pay_check_no_boost);
	}
	SendClientMessage(playerid, COLOR_WHITE, string_); 
	if(pInfo[playerid][pLevel] >= GetEconomyServer(ePensionAge) && !GetString(fInfo[FRACTION_CITYHALL][fLeader], "None")) {
		format(string_, sizeof string_, " Пенсия: $%i", GetEconomyServer(ePension));
		SendClientMessage(playerid, COLOR_WHITE, string_);
		pInfo[playerid][pBank] += GetEconomyServer(ePension);
		SetMoveCashServer(IN_PENSION, GetEconomyServer(ePension)); 
	}
	if (pay_checks_default > 0 ) {
		new pack_boost[19];
		GetPlayerBoostName(playerid,pack_boost,sizeof(pack_boost)-1);

		format(string_, sizeof string_, " Зарплата от %s pack'a : $%d", pack_boost,pay_checks_default);
		SendClientMessage(playerid, COLOR_WHITE, string_);
	}
	if (pay_checks_vip > 0 ) {
		new vip_boost[19];
		GetPlayerVipName(playerid,vip_boost,sizeof(vip_boost)-1);

		format(string_, sizeof string_, " Зарплата от %s {FFFFFF}pack'a : $%d", vip_boost,pay_checks_vip);
		SendClientMessage(playerid, COLOR_WHITE, string_);
	}


	pInfo[playerid][pBank] += pay_checks;
	LogMoney(playerid, pay_checks, "зарплата PayDay");

	if (SupportInfo[playerid][sDuty]) {
	    SendClientMessage(playerid, -1, !" Зарплата Support's: {66CC00}$5.000");
		pInfo[playerid][pBank] += 5000;
		LogMoney(playerid, pay_checks, "зарплата Supports");
	}
	if (pInfo[playerid][pAdmin] && pInfo[playerid][pMember] == 0) {
		new 
			salary_adm = (pInfo[playerid][pAdmin]*10000);
		format(string_, sizeof string_, " Зарплата администратора: {66CC00}$%d", salary_adm);
		SendClientMessage(playerid, -1, string_), pInfo[playerid][pBank] += salary_adm;
		LogMoney(playerid, salary_adm, "зарплата администратора");
	}  
	if (pInfo[playerid][pHouseID] != -1) {
		format(string_, sizeof(string_), " Текущий баланс: $%d", pInfo[playerid][pBank]);
		SendClientMessage(playerid, COLOR_WHITE, string_);
		format(string_, sizeof(string_), " Домашний счёт: $%d", HouseInfo[ pInfo[playerid][pHouseID] ][hTakings]);
		SendClientMessage(playerid, COLOR_WHITE, string_); 
	} else {
		format(string_, sizeof(string_), " Текущий баланс: $%d", pInfo[playerid][pBank]);
		SendClientMessage(playerid, COLOR_WHITE, string_); 
	} 
	if (Iter_Count(PlayerListVehicle[playerid]) != 0 && fInfo[FRACTION_CITYHALL][fCost][0] != 0)
	{
		foreach(new V_IDX: PlayerListVehicle[playerid])
		{
			if(GetString(VehicleInfo[ V_IDX - 1 ][vNumber], "None")) {
				VehicleInfo[ V_IDX - 1 ][vTax] += (fInfo[FRACTION_CITYHALL][fCost][0]*2); 
				format(string_, sizeof string_, "[Оповещение] "colwhi"транспорт %s не стоит на учете, сумма налога повышена в 2 раза", VehicleNames[ VehicleInfo[ V_IDX - 1 ][vModel] - 400 ]);
				SendClientMessage(playerid, COLOR_LI_RED, string_); 
			} else {
				VehicleInfo[ V_IDX - 1 ][vTax] += fInfo[FRACTION_CITYHALL][fCost][0];
			}
			if (VehicleInfo[ V_IDX - 1 ][vTax] > MAX_VALUE_FOR_SALE_GOS) {
				SendClientMessage(playerid, COLOR_WHITE, !"Ваш транспорт был продан государству за неуплату налогов!");
				format(string_, sizeof string_, "DELETE FROM "TABLE_VEHICLE_PLAYER" WHERE vID = '%d'", VehicleInfo[ V_IDX - 1 ][vID]);
				mysql_tquery(dbHandle, string_, "", ""); 
				Iter_Remove(PlayerListVehicle[playerid], V_IDX);
				_DestroyVehicle(V_IDX);
			} 
		}
	}
	SendClientMessage(playerid,COLOR_GRAD1, !"================================"); 

	new exp = 1, vbExp = GetVipBoostMaxPlayerValue(playerid, vPayDayExp, bPayDayExp, 0);
    if (gBoostServer[sBoost]) exp = gBoostServer[sBoostExp];
    if (vbExp > exp) exp = vbExp;

	UpdatePlayerExp(playerid, exp);

	if (pTemp[playerid][GetHomePlayer] == true)
	{
		SendClientMessage(playerid, COLOR_LIGHTRED, !" Вы были выселены за неуплату квартплаты");
		SendClientMessage(playerid, COLOR_LIGHTRED, !" Ваши деньги за дом были перечислены на ваш счет");
		pTemp[playerid][GetHomePlayer] = false;
		pInfo[playerid][pHouseID] = -1;
	} 
	if (pTemp[playerid][GetFarmPlayer] == true)
	{
		SendClientMessage(playerid, COLOR_LIGHTRED, !" Ваша ферма была выставлена на аукцион за неуплату налогов");
		SendClientMessage(playerid, COLOR_LIGHTRED, !" Деньги с банка автомастерской были перечислены на ваш счет");
		pTemp[playerid][PlayerFarmID] = -1;
		pTemp[playerid][GetFarmPlayer] = false;
	}
	seans[playerid] = false;
	if (pInfo[playerid][pRobHouse] == 1) {
		pInfo[playerid][pRobHouse] = 0; 
	}
	pInfo[playerid][pPayCheck] = 0;

	new rand_up_down = random(2);// рандом вырастет курс или упадет
	if(!rand_up_down)
	{// упадет
		priceeu -= random(100);		
	}
	else
	{// вырастет
		priceeu += random(100);								
	}		

	CheckPlayerVipTime(playerid);
	CheckPlayerLicenseTime(playerid);
	CheckPlayerBoostTime(playerid); 
	if (mysql_unprocessed_queries() > SettingServer[6]) {
		SettingServer[6] = mysql_unprocessed_queries(); 
	}
	return 1;
}
stock split(const strsrc[], strdest[][], delimiter)
{
	new i, li;
	new aNum;
	new len;
	while(i <= strlen(strsrc))
	{
		if (strsrc[i] == delimiter || i == strlen(strsrc))
		{
			len = strmid(strdest[aNum], strsrc, li, i, 128);
			strdest[aNum][len] = 0;
			li = i+1;
			aNum++;
		}
		i++;
	}
	return 1;
}
stock SendACMessageAdmins(color, const string[], level)
{
    foreach(new i: AdminsTeam)
    {
        if (pInfo[i][pAdmin] < level || !pTemp[i][PlayerADostup] || !pTemp[i][tAdminInfo]) continue;
        SendClientMessage(i, color, string);
    }
    return 1;
}
stock ABroadCast(color, const string[], level)
{
    foreach(new i: AdminsTeam)
    {
        if (pInfo[i][pAdmin] < level || !pTemp[i][PlayerADostup]) continue;
        SendClientMessage(i, color, string);
    }
    return 1;
}
stock SendAdminMessage(color, const string[])
{
    foreach(new i: AdminsTeam)
	{
        SendClientMessage(i, color, string);
    }
    return 1;
}
stock GameTextForAdmin(const string[])
{
    foreach(new i: AdminsTeam)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pTemp[i][tAdminInfoReport]) {
			GameTextForPlayer(i, string, 2000, 1);
		}
		
    }
    return 1; 
}
stock SendGovermentMessage(color, const str[])
{
    foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][PlayerSettings] & setGovChat) {
			SendClientMessage(i,color,str);
		}
	}
	return 1;
}

stock SendAdvertMessage(color, const str[])
{
    foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][PlayerSettings] & setNewsAddChat) {
			SendClientMessage(i,color,str);
		}
	}
	return 1;
}
stock LSNews(color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin] || !IsPlayerGetSettings(i, setNewsChat)) continue;
	 	if (!lNews[i] || pInfo[i][pMember] == 16 && lNews[i] == true) SendClientMessage(i, color, str);
	}
	return 1;
}
stock LVNews(color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin] || !IsPlayerGetSettings(i, setNewsChat)) continue;
 		if (!LvNews[i] || pInfo[i][pMember] == 20 && LvNews[i] == true) SendClientMessage(i, color, str);
	}
	return 1;
}
stock OOCNews(color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin] || !IsPlayerGetSettings(i, setNewsChat)) continue;
 		if (!gNews[i] || pInfo[i][pMember] == 9 && gNews[i] == true) SendClientMessage(i, color, str);
	}
	return 1;
}

stock SendTeamMessage(color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
	    if (pTemp[i][tDutyWork] == 1) 
		{
		    if(IsAArmy(i) ||
		    IsAMedic(i) ||
		    IsAMayor(i) ||
		    IsACop(i) ||
		    IsALicenser(i))
		    {
		        SendClientMessage(i, color, str);
		    }
		}
	}
	return 1;
}
stock SendHospitalMessage(color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
	    if (pTemp[i][tDutyWork] == 1) {
		    if (IsAMedic(i)) {
		        SendClientMessage(i, color, str);
		    }
		}
	}
	return 1;
}

stock SendPoliceMessage(color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if ((pInfo[i][pMember] == 1 || pInfo[i][pMember] == 2 || pInfo[i][pMember] == 10 || pInfo[i][pMember] == 21) && pTemp[i][tDutyWork] == 1) SendClientMessage(i, color, str);
	}
	return 1;
} 
stock SendRadioMessage(member, color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]/* && !pTemp[i][tDutyWork]*/) continue;
		if (pInfo[i][pMember] == member && IsPlayerGetSettings(i, setFractionChat) && pTemp[i][tDutyWork]) {
			SendClientMessage(i, color, str);
		}
	}
	return 1; 
} 
stock SendJobMessage(job, color, const str[])
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][pJob] == job){
			if (pInfo[i][PlayerSettings] & setJobChat){
				SendClientMessage(i, color, str);
			}
		}
	}
	return 1;
}
stock SendPlayerFamilyMessage(family_id, color, const text[], evict_house = false) {
	foreach(new i: PlayerInFamily[family_id]) 
    {
		if (!pInfo[i][pLogin]) continue;
		if (IsPlayerGetSettings(i, setFamilyChat)){
        	SendClientMessage(i, color, text);
		}
        //if (pInfo[i][pFamily] != family_id)continue;
        //SendClientMessage(i, color, text);
		if (evict_house) {
			if (pInfo[i][PlayerSpawn] == 5) {
				pInfo[i][PlayerSpawn] = 0;
			}
		}
    }
    return 1;
}
stock SendGangMessage(color, const str[]) {
	SendFamilyMessage(FRACTION_PIRUS, color, str);
	SendFamilyMessage(FRACTION_BALLAS, color, str);
	SendFamilyMessage(FRACTION_VAGOS, color, str);
	SendFamilyMessage(FRACTION_GROVE, color, str);
	SendFamilyMessage(FRACTION_AZTEC, color, str);
	SendFamilyMessage(FRACTION_RIFA, color, str); 
	return 1;
}

stock SendMafiaMessage(color, const str[]) {

	SendFamilyMessage(FRACTION_LCN, color, str);
	SendFamilyMessage(FRACTION_RUSSIAN, color, str);
	SendFamilyMessage(FRACTION_YAKUZA, color, str);
	return 1;
}
stock SendBikersMessage(color, const str[]) {

	SendFamilyMessage(FRACTION_MONGOLS_MC, color, str);
	SendFamilyMessage(FRACTION_BANDIDOS_MC, color, str);
	SendFamilyMessage(FRACTION_OUTLAWS_MC, color, str);
	return 1;
}

stock SendFamilyMessage(family, color, const str[], bool:dliv = false)
{
    foreach(new playerid : PlayerTeam[family])
	{
	    if (pTemp[playerid][tDutyWork] == 0) continue;
		if (dliv) {
			if (pInfo[playerid][pAdmin]) continue; 
		}
	    if (pInfo[playerid][PlayerSettings] & setFractionChat) SendClientMessage(playerid, color, str);
	}
	foreach(new i: AdminsTeam)
    {
		if (GetPVarInt(i, "Atisper") != family) continue;
        SendClientMessage(i, color, str);
    }
    return 1;
}
stock SendOOCMessage(color, const str[])
{
    foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][PlayerSettings] & setOOCChat) scm(i,color,str);
	}
	return 1;
}
/*static const Float:cam_start_pos[][] = {
	{22.611024, -1959.371337, 84.940864, 22.611024, -1959.371337, 84.940864}//????
};
 
static const Float:cam_start_look[][] = {
	{26.822828, -1956.851684, 83.985832, 26.822828, -1956.851684, 83.985832}//????
};
new cam_start_time_pos[] = {2000, 1000, 1000, 1000, 1000, 1000, 1000},
	cam_start_time_look[] = {2000, 1000, 1000, 1000, 1000, 1000, 1000}; */
publics: FlyCameraForPlayer(playerid) {
	for(new i; i < 5; i++){TextDrawShowForPlayer(playerid, Text:TD_welcome[i]);}
	//new rand = random(sizeof(cam_start_pos));
	SetPlayerWeather(playerid, 18);
	SetPlayerTime(playerid, hour, minute);

/*1720.840087,-1791.590942,25.770624

1711.797363,-1787.649414,27.412099*/

    InterpolateCameraPos(playerid, 1711.797363,-1787.649414,27.412099, 1711.797363,-1787.649414,27.412099, 30000);
    return InterpolateCameraLookAt(playerid, 1720.840087,-1791.590942,25.770624, 1720.840087,-1791.590942,25.770624, 30000);
}

publics: PlayerSpawnEx(playerid)
{
    if (IsPlayerNPC(playerid)) return true;
    if (IsPlayerInAnyVehicle(playerid))
	{
	    new
			Float:	pos_X,
			Float:	pos_Y,
			Float:	pos_Z;
	    GetPlayerPos(playerid, pos_X, pos_Y, pos_Z);
		SetPlayerPosAC(playerid, pos_X, pos_Y, pos_Z, pTemp[playerid][tVirtualWorld], pTemp[playerid][tInterior]);
	    SetTimerEx("PlayerSpawnEx", 50, false, "i", playerid);
	    return 1;
	}
	SettingSpawn(playerid);
	if (AC_Info[playerid][acSpectate] != 0) TogglePlayerSpectating(playerid, 0);
	else SpawnPlayer(playerid);
	return 1;
}
stock ChosePlayerSkin(playerid)
{
	pTemp[playerid][tSelectSkin] = true;
	print("ChosePlayerSkin");
	switch(pInfo[playerid][pSex])
	{
	    case 1: pInfo[playerid][pChar][0] = BomjPedMale[ChangeSkin[playerid]];
		case 2: pInfo[playerid][pChar][0] = BomjPedFeMale[ChangeSkin[playerid]];
	}
	//SetPlayerSkinEx(playerid, pInfo[playerid][pChar][0]);
	pTemp[playerid][tVirtualWorld] = playerid;
	pTemp[playerid][tInterior] = 0;
	SetSpawnInfo(playerid, 0, pInfo[playerid][pChar][0], 1716.1293,-1789.9769,26.3864,58.1617, 0, 0, 0, 0, 0, 0);
	if (AC_Info[playerid][acSpectate] != 0) TogglePlayerSpectating(playerid, 0);
	SetPlayerPos(playerid, 1716.1293,-1789.9769,26.3864);
	SetPlayerFacingAngle(playerid, 58.1617);
	setFreezePlayerForTime(playerid, 3);

	SetPlayerVirtualWorld(playerid, playerid);
	SetPlayerInterior(playerid, 0);
	ApplyAnimation(playerid, !"DEALER", !"DEALER_IDLE", 4.0, 1, 0, 0, 1, 1);

    InterpolateCameraPos(playerid, 1711.797363,-1787.649414,27.412099, 1711.797363,-1787.649414,27.412099, 30000);
    InterpolateCameraLookAt(playerid, 1720.840087,-1791.590942,25.770624, 1720.840087,-1791.590942,25.770624, 30000);

	pTemp[playerid][tPlayerReg] = 1;
	for(new i = 0; i < 29; i++)
		TextDrawShowForPlayer(playerid, SelectSkinTD[i]);

	SelectTextDraw(playerid, 0xFF4040AA);
	
    SendClientMessage(playerid, COLOR_WHITE, !"Используйте стрелки "collime"\"<\""colwhi" и "collime"\">\""colwhi" чтобы изменять одежду");
	SendClientMessage(playerid, COLOR_WHITE, !"Для подтверждения нажмите "collime"\"SELECT\"");
	return SetPlayerSkinEx(playerid, pInfo[playerid][pChar][0]);
}

publics: OnPlayerRequestSearch(playerid, time)
{ 
	ClearChatbox(playerid, 20);
	SendClientMessage(playerid, COLOR_WHITE, !"Добро пожаловать на "colserver##NameServer"");
    if (cache_num_rows()) { 
		
		cache_get_value_name_int(0, "pID", pTemp[playerid][tPlayerCurrentID]);
		cache_get_value_name(0, "pvIp", pInfo[playerid][LastIP], 17);
		cache_get_value_name_int(0, "pConfirmVK", pInfo[playerid][pConfirmVK]);
		cache_get_value_name(0, "pVK_ID", pInfo[playerid][pVK_ID], 32);
		cache_get_value_name_int(0, "pConfirmTG", pInfo[playerid][pConfirmTG]);
        cache_get_value_name(0, "pTG_ID", pInfo[playerid][pTG_ID], 32); 
		cache_get_value_name_int(0, "Settings", pInfo[playerid][PlayerSettings]);
		new	
			query_[128];
		mysql_format(dbHandle, query_, sizeof query_, "SELECT Text, NameAdmin, Date, Unban FROM `s_ban` WHERE `Name` = '%e' LIMIT 1", pInfo[playerid][pName]);
		mysql_tquery(dbHandle, query_, "StatusBan", "i", playerid);  

		PlayAudioStreamForPlayer(playerid, "http://www.mboxdrive.com/welcome.mp3");

	} else {
		static const server_rulles[] = ""colserver"1. Игровой процесс"colwhi"\nЗапрещено:\n\
			- Использование любых программ скриптов читов и.т.п. дающие нечестное преймущество в игре.\n\
			- Использование багов (Ошибок, Неисправностей мода)\n\
			- Использовать ESC в целях ухода от погони/смерти.\n\
			- Убивать игроков на спавне (Место возрождения, базы организаций)\n\
			- Убивать игроков при помощи транспорта (Давить, Стрелять с водительского места)\n\
			- Убийство/нанесение физического вреда игрокам без причины (ДМ - Death Match)\n\
			- Злоупотребление игровыми возможностями для создания неудобств игрокам.\n\n\
			"colserver"2. Ник в игре:\n\
			"colwhi"- (сменить ник можно через /mm >> Настройки >> Смена ника)\n\
			- Ник должен состоять из Имени_Фамилии с заглавных букв.\nЗапрещено:\n\
			- Запрещено использовать чужие (уже кем-то занятые) ники.\n\
			- Запрещено использовать ники, содержащие нецензурные или оскорбительные слова.\n\
			- Отправлять более одной заявки в час (Исключение: Просьба Администрации)\n\
			- Если вам отказали в смене ника, Значит нельзя.\n";
			
		ShowPlayerDialog(playerid, D_REG_RULES, DIALOG_STYLE_MSGBOX, ""colserver"Правила сервера", server_rulles, "Согласен", "Выйти"); 
	}
	printf("[UpTime ...] Данные из OnPlayerRequestSearch. Время: %d!", GetTickCount() - time);
	return 1;
}
ShowLoginAccountServer(playerid)
{
 	t_string[0] = EOS;
    format(t_string, sizeof t_string, ""colwhi"_______________________________________\n\n\
		Добро пожаловать на сервер "colserver"Warrior Role Play"colwhi"\n\
		Этот аккаунт зарегистрирован\n\n\
		Аккаунт: "colserver"%s"colwhi"\n\n\
		Введите пароль:\n\
		_______________________________________",
			pInfo[playerid][pName]
	);
	ShowPlayerDialog(playerid, D_LOGIN_PLAYER, DIALOG_STYLE_PASSWORD, ""colserver"{FFFFFF}Вход | "colserver"Авторизация", t_string, "Войти", "Отмена");
	return 1;
}  
publics: StatusBan(const playerid)
{
    new 
		query_[256]; 
	if (!cache_num_rows()) { 
		ShowLoginAccountServer(playerid);  
	}
    else {
	    new
			NameAdm[MAX_PLAYER_NAME],
			Reason[64],
			BanDate, UnBanDate;
	    cache_get_value_name(0, "Text", Reason, sizeof Reason);
	    cache_get_value_name(0, "NameAdmin", NameAdm, MAX_PLAYER_NAME);
		cache_get_value_name_int(0,"Date", BanDate);
		cache_get_value_name_int(0,"Unban", UnBanDate); 

		if (gettime() >= UnBanDate) { 
			mysql_format(dbHandle, query_, sizeof query_, "DELETE FROM `s_ban` WHERE `Name` = '%e'", pInfo[playerid][pName]);
            mysql_tquery(dbHandle, query_, "", ""); 
			printf(query_);
			ShowLoginAccountServer(playerid);  
		}
		else { 
			
			format(t_string, sizeof t_string, ""colwhi"Аккаунт: "colwarn"%s "colwhi"заблокирован!\n\n\
				Заблокировал: "colwarn"%s\n\
				"colwhi"Причина: "colwarn"%s\n\
				"colwhi"Дата блокировки: "colwarn"%s\n\
				"colwhi"Дата разблокировки: "colwarn"%s",
				pInfo[playerid][pName], NameAdm, Reason, 
				date("%dd.%mm.%yyyy", BanDate), 
				date("%dd.%mm.%yyyy", UnBanDate) 
			);
			ShowPlayerDialog(playerid, D_NULL, 0, ""colwarn"Аккаунт заблокирован!", t_string, !"Закрыть",""), t_string[0] = EOS;
			scmKick(playerid, !"Для выхода из игры используйте /q(uit)"); 
		}  
	} 
	return 1;
} 
publics: CheckEmailSmena(playerid, email[])
{
	new rows;
	cache_get_row_count(rows);
	if (rows) {
		SendClientMessage(playerid, COLOR_GREY, !"[Ошибка] Данный E-Mail уже используется!");
		ShowPlayerDialog(playerid, D_MAINMENU_FUNC_16, DIALOG_STYLE_INPUT, "Изменить E-Mail", "Введите ваш E-Mail:", "Ввести", "Отмена");
	}
	else
	{
		strmid(pInfo[playerid][pEmail], email, 0, strlen(email), 32);
    	new query_[128];
		mysql_format(dbHandle, query_, sizeof query_, "UPDATE `s_users` SET pEmail = '%e' WHERE pID = '%d'", pInfo[playerid][pEmail], pInfo[playerid][pID]);
		mysql_tquery(dbHandle, query_, "", "");
		SendClientMessage(playerid, COLOR_LI_RED, !"[Оповещение] "colwhi"Вы изменили свой E-Mail");
	}
	return 1;
}
publics: CheckReferal(playerid,refer[])
{
	new rows;
	cache_get_row_count(rows);
	if (rows)
	{
		strmid(pInfo[playerid][Referal], refer, 0, strlen(refer), MAX_PLAYER_NAME);
		ShowPlayerDialog(playerid,D_REG_SEX,DIALOG_STYLE_MSGBOX, ""colserver"Регистрация", ""colwhi"Выберите пол персонажа, за которого Вы будете отыгрывать роль!\n\n", "Мужчина", "Женщина");
	}
	else
	{
        SendClientMessage(playerid, COLOR_GREY, !"Аккаунт не найден в базе данных");
 		ShowPlayerDialog(playerid,D_REG_REFERAL,DIALOG_STYLE_INPUT, ""colserver"Реферал", "\
			"colwhi"Если на сервер Вас пригласил определенный человек, введите его ник.\n\
			Когда Вы достигните "#REFERAL_LEVEL_AWARD" игрового уровня, пригласивший Вас игрок получит игровую валюту в качестве вознаграждения!", 
			"Далее", "Пропуск"
		);
	}
	return 1;
} 

publics: LoadPlayer(const playerid)
{
    new rows, 
		query_[128]; 
	cache_get_row_count(rows);
	
    if (!rows) {//ORDER BY
		if (GetPVarInt(playerid, "wrongPass") == 2) {
			new 
				playersip[16];
			GetPlayerIp(playerid, playersip, sizeof playersip);
		    mysql_format(dbHandle,query_,sizeof query_, "UPDATE `s_users` SET `pIp` = '%e' WHERE Name = '%e' LIMIT 1", playersip, pInfo[playerid][pName]);
			mysql_tquery(dbHandle, query_, "", "");
			return scmKick(playerid, !"Неверный пароль. Используйте /q для выхода.");
		} 
		SetPVarInt(playerid, "wrongPass", GetPVarInt(playerid, "wrongPass")+1);
		format(query_, sizeof query_, "\
			\t{FFFFFF}У вас осталось (%d) %s\n\
			После Вы будете на время забанены", 
			3-GetPVarInt(playerid, "wrongPass"), 
			Declension_ReturnWord(3-GetPVarInt(playerid, "wrongPass"), "попытка", "попытки", "попыток")
		);
		ShowPlayerDialog(playerid, D_LOGIN_PLAYER, DIALOG_STYLE_MSGBOX, ""colserver"Ошибка: "colwhi"Неверный пароль!", query_, "Повтор", "Выйти");
		ShowNotification(playerid, 0xb00000DD, 0xFFFFFFDD, "Неверный пароль", 2000);
		PlayerPlaySound(playerid, 1150, 0.0, 0.0, 0.0); 
	}
	else {   
		new  
			player_ip[16],
			string_[256];
		GetPlayerIp(playerid, player_ip, sizeof player_ip); 
		if (pInfo[playerid][pConfirmVK] && strcmp(pInfo[playerid][LastIP], player_ip) != 0) {
			SetPVarInt(playerid, #ip_wrongpass, 2);
			new 
				number = random(999999) % 900000 + 100000;
			SetPVarInt(playerid, "VkGuardCodeAuth", number);
			format(bigstring, 144, 
				"%s, Your security code: %d IP: %s", pInfo[playerid][pName], number, player_ip
			);
			SendVk(pInfo[playerid][pVK_ID], bigstring); 
            bigstring[0] = EOS;

		    format(string_, sizeof string_, 
					""colwhi"Дорогой "collime"%s"colwhi"!\n\n\
					У Вас включена защита "col_VK"VK Guard"colwhi", мы уже отправили Вам код в "col_VK"сообщения\n\
					"colwhi"Введите шестизначный ключ в поле ниже и затем нажмите кнопку «Принять»\n\n", pInfo[playerid][pName]
				); 
			ShowPlayerDialog(playerid, D_VK_GUARD_INPUT, DIALOG_STYLE_INPUT, ""colserver"Авторизация: "col_VK"VK Guard", string_, "Принять", "Назад");
			return 1;
		} 
		else if (pInfo[playerid][pConfirmTG] && strcmp(pInfo[playerid][LastIP], player_ip, false)) {
			SetPVarInt(playerid, #ip_wrongpass, 2);
			new 
				number = random(999999) % 900000 + 100000;
			SetPVarInt(playerid, "TGGuardCodeAuth", number);
			format(query_, sizeof query_, 
				"%s, Ваш код для авторизации: %d IP: %s", pInfo[playerid][pName], number, player_ip
			);
			SendTelegramMessage(playerid, query_, pInfo[playerid][pTG_ID]); 

		    format(string_, sizeof string_, 
				""colwhi"Дорогой "collime"%s"colwhi"!\n\n\
				У Вас включена защита "col_TG"Telegram Guard"colwhi". мы уже отправили Вам код в "col_TG"сообщения\n\
				"colwhi"Введите шестизначный ключ в поле ниже и затем нажмите на кнопку «Принять»\n\n", pInfo[playerid][pName]
			); 
			ShowPlayerDialog(playerid, D_TG_GUARD_INPUT, DIALOG_STYLE_INPUT, ""colserver"Авторизация: "col_TG"Telegram Guard", string_, "Принять", "Назад");
			return 1;
		} 
		mysql_format(dbHandle, query_, sizeof query_, "SELECT * FROM `s_users` WHERE `Name` = '%e' LIMIT 1",pInfo[playerid][pName]);
		mysql_tquery(dbHandle, query_, "OnPlayerLoginAuth", "d", playerid); 
	}
	return 1;
}  
stock LoadRecon(playerid)
{
    ReconPlayer[playerid][0] = CreatePlayerTextDraw(playerid,530.000000, 180.000000, "x");
	PlayerTextDrawBackgroundColor(playerid, ReconPlayer[playerid][0], 0x000000AA);
	PlayerTextDrawFont(playerid, ReconPlayer[playerid][0], 3);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][0], 0.000000, 20.600000);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][0], 0xE1E1E1AA);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][0], 1);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][0], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][0], 2);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][0], 1);
	PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][0], 0x00000055);
	PlayerTextDrawTextSize(playerid,ReconPlayer[playerid][0], 640.000, 0.000000);
	ReconPlayer[playerid][1] = CreatePlayerTextDraw(playerid,529.000000, 179.000000, "x");
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][1], 0x000000AA);
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][1], 3);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][1], 0.000000, 20.600000);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][1], 0xE1E1E1AA);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][1], 1);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][1], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][1], 2);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][1], 1);
	PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][1], 0xAAAAAA33);
	PlayerTextDrawTextSize(playerid,ReconPlayer[playerid][1], 641.000000, 0.000000);
	ReconPlayer[playerid][2] = CreatePlayerTextDraw(playerid,0.000, 180.000, "x");
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][2], 0x000000AA);
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][2], 3);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][2], 0.000000, 18.540);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][2], 0xE1E1E1AA);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][2], 1);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][2], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][2], 2);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][2], 1);
	PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][2], 0x00000055);
	PlayerTextDrawTextSize(playerid,ReconPlayer[playerid][2], 70.000, 0.000000);
	ReconPlayer[playerid][3] = CreatePlayerTextDraw(playerid,0.000, 179.000, "x");
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][3], 0x000000AA);
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][3], 3);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][3], 0.000000, 18.746);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][3], 0xE1E1E1AA);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][3], 1);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][3], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][3], 2);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][3], 1);
	PlayerTextDrawBoxColor(playerid,ReconPlayer[playerid][3], 0xAAAAAA33);
	PlayerTextDrawTextSize(playerid,ReconPlayer[playerid][3], 71.000, 0.000000);
	ReconPlayer[playerid][4] = CreatePlayerTextDraw(playerid,535.000, 200.000, "~n~~g~::Level:~n~~g~::Warns:~n~~r~::Fraction:~n~~r~::WC_HP:~n~~r~::WC_Arm:~n~~b~::CarHP:~n~~b~::Speed:~n~~y~::Ping:~n~~y~::Ammo:~n~~p~::Shot:~n~~p~::TimeShot:~n~~g~::AFKTime:~n~~g~::Engine:~n~~g~::Turbo:~n~~y~::PacketLoss:");
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][4], 0x000000AA);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][4], 1);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][4], 0.200, 1.100);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][4], 0xFFFFFFFF);//0xFFFFFFAA
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][4], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][4], 2);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][4], 1);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][4], 0);
	ReconPlayer[playerid][5] = CreatePlayerTextDraw(playerid,575.000, 200.000, " ");
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][5], 0x000000AA);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][5], 1);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][5], 0.200, 1.100);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][5], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][5], 1);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][5], 2);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][5], 1);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][5], 0);
	ReconPlayer[playerid][6] = CreatePlayerTextDraw(playerid,585.000000, 185.000000, " ");
	PlayerTextDrawBackgroundColor(playerid,ReconPlayer[playerid][6], 0x000000AA);
	PlayerTextDrawSetProportional(playerid,ReconPlayer[playerid][6], 1);
	PlayerTextDrawLetterSize(playerid,ReconPlayer[playerid][6], 0.300, 1.400);
	PlayerTextDrawColor(playerid,ReconPlayer[playerid][6], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid,ReconPlayer[playerid][6], 1);
	PlayerTextDrawAlignment(playerid,ReconPlayer[playerid][6], 2);
	PlayerTextDrawSetShadow(playerid,ReconPlayer[playerid][6], 2);
	PlayerTextDrawSetOutline(playerid,ReconPlayer[playerid][6], 1);
	PlayerTextDrawUseBox(playerid,ReconPlayer[playerid][6], 0);

	CreateReconButtonn(playerid,35.000, 195.000, "Change", 7);
 	CreateReconButtonn(playerid,35.000, 212.000, "Check >>", 8);
	CreateReconButtonn(playerid,35.000, 229.000, "Drop >>", 9);
	CreateReconButtonn(playerid,35.000, 246.000, "Kick >>", 10);
	CreateReconButtonn(playerid,35.000, 263.000, "Warn", 11);
	CreateReconButtonn(playerid,35.000, 280.000, "Ban >>", 12);
	CreateReconButtonn(playerid,35.000, 297.000, "Stats >>", 13);
	CreateReconButtonn(playerid,35.000, 314.000, "Refresh", 14);
	CreateReconButtonn(playerid,35.000, 331.000, "Exit", 15);
	CreateReconButtonn(playerid,100.000, 212.000, "Check-GM", 16);//Check >>
	CreateReconButtonn(playerid,100.000, 229.000, "Check-GM2", 17);//Check >>
	CreateReconButtonn(playerid,100.000, 246.000, "Check-GMCar", 18);//Check >>
	CreateReconButtonn(playerid,100.000, 263.000, "ResetShot", 19);//Check >>
	CreateReconButtonn(playerid,100.000, 229.000, "Mute", 20);//Drop >>
	CreateReconButtonn(playerid,100.000, 246.000, "Slap", 21);//Drop >>
	CreateReconButtonn(playerid,100.000, 263.000, "Prison", 22);//Drop >>
	CreateReconButtonn(playerid,100.000, 280.000, "Freeze", 23);//Drop >>
	CreateReconButtonn(playerid,100.000, 297.000, "UnFreeze", 24);//Drop >>
	CreateReconButtonn(playerid,100.000, 246.000, "SKick", 25);//Kick >>
	CreateReconButtonn(playerid,100.000, 263.000, "Kick", 26);//Kick >>
	CreateReconButtonn(playerid,100.000, 280.000, "Ban", 27);//Ban >>
	CreateReconButtonn(playerid,100.000, 297.000, "SBan", 28);//Ban >>
	CreateReconButtonn(playerid,100.000, 314.000, "IBan", 29);//Ban >>
	CreateReconButtonn(playerid,100.000, 297.000, "Stats", 30);//Stats >>
	CreateReconButtonn(playerid,100.000, 314.000, "IWep", 31);//Stats >>
	CreateReconButtonn(playerid,100.000, 331.000, "GetIP", 32);//Stats >>
	CreateReconButtonn(playerid,100.000, 348.000, "Serial/S0b", 33);//Stats >>
	//CreateReconButtonn(playerid,585.00, 350.00, "Help", 34); // Рекон клавиша

	Seriu[playerid][0] = CreatePlayerTextDraw(playerid,589.00, 145.00, "Nik Anson~n~ID: 666");
	PlayerTextDrawAlignment(playerid,Seriu[playerid][0], 2);
    PlayerTextDrawLetterSize(playerid,Seriu[playerid][0],  0.240000, 0.899999);
	Seriu[playerid][1] = CreatePlayerTextDraw(playerid,578.00, 165.00, "1 : 1 / 8~n~0~n~0~n~50~n~0~n~0 / 0~n~86~n~0 : 0 ~n~0 / 0 : 0%~n~0 / 0 : 0%~n~23 : 0");
    PlayerTextDrawLetterSize(playerid,Seriu[playerid][1], 0.199999, 0.899999);
	for(new h; h < 2; h ++)
	{
		PlayerTextDrawBackgroundColor(playerid,Seriu[playerid][h], 255);
		PlayerTextDrawFont(playerid,Seriu[playerid][h], 1);
		PlayerTextDrawColor(playerid,Seriu[playerid][h], -1);
		PlayerTextDrawSetOutline(playerid,Seriu[playerid][h], 1);
		PlayerTextDrawSetProportional(playerid,Seriu[playerid][h], 1);
		PlayerTextDrawSetShadow(playerid,Seriu[playerid][h],0);
	}
}
stock UpdateFish(playerid)
{
	new string_[128];
	if (GetPVarInt(playerid,"fish_sonar")) {
		format(string_, sizeof string_,
		"~y~Tackle: ~w~%d~n~~y~Worms: ~w~%d~n~~y~Sonar: ~w~%.2f~n~~n~~y~Press: ~g~L.ALT",
		pInfo[playerid][pFishesTicle], pInfo[playerid][pFishesWorms], Sonar[playerid]);
	}
	else format(string_, sizeof string_,"~y~Tackle: ~w~%d~n~~y~Worms: ~w~%d~n~~n~~y~Press: ~g~L.ALT", pInfo[playerid][pFishesTicle], pInfo[playerid][pFishesWorms]);
	PlayerTextDrawSetString(playerid,FishingText[playerid], string_);
	return 1;
}
stock PlayerLeaveCollector(playerid) { 
	if (pTemp[playerid][tTakeCashATM]) {
		if (IsPlayerAttachedObjectSlotUsed(playerid, ATTACHED_SLOT_JOB_1)) RemovePlayerAttachedObject(playerid, ATTACHED_SLOT_JOB_1);
		pTemp[playerid][tTakeCashATM] = false;
	} 
	if (pTemp[playerid][pRentCar] != INVALID_VEHICLE_ID)
    {
		new 
            vehicleid = pTemp[playerid][pRentCar];
		if (IsValidVehicle(vehicleid)) {
			if (VehicleInfo[vehicleid - 1][vType] == VEHICLE_TYPE_JOB && VehicleInfo[vehicleid - 1][vFraction] == PLAYER_JOB_COLLECTOR)     
			{
				SetVehicleToRespawn(vehicleid);
				if (VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobLoad]) {
					if (VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vFarmText] != Text3D:-1) { 
						DestroyDynamic3DTextLabel(VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vFarmText]); 
						VehicleInfo[ pTemp[playerid][pRentCar]  - 1 ][vFarmText] = Text3D:-1;
					} 
					DestroyDynamicArea(VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobArea]);
					DestroyDynamicPickup(VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobPickup]);
					VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobLoad] = false; 
				}  
				VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobAmount] = 0;
				pTemp[playerid][pRentCar] = INVALID_VEHICLE_ID;
			}
		}
    }
        
}
stock PlayerLeaveRobHouse(playerid) { 
	if (pTemp[playerid][tRobVeh] != INVALID_VEHICLE_ID)
	{
		_DestroyVehicle(pTemp[playerid][tRobVeh]);
		if (VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobLoad]) {
			if (VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vFarmText] != Text3D:-1) { 
				DestroyDynamic3DTextLabel(VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vFarmText]); 
				VehicleInfo[ pTemp[playerid][tRobVeh]  - 1 ][vFarmText] = Text3D:-1;
			} 
			DestroyDynamicArea(VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobArea]);
			DestroyDynamicPickup(VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobPickup]);
			VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobLoad] = false; 

			new	
				H_IDX = GetPVarInt(playerid, "playerRobIDX");
			DestroyDynamicPickup(HouseInfo[H_IDX][hPickupRob]); 
			DestroyDynamic3DTextLabel(HouseInfo[H_IDX][hTextRob]);
			UpdateHouseInfo(H_IDX);
			HouseInfo[H_IDX][hCountItemRob][0] = 0;
			HouseInfo[H_IDX][hCountItemRob][1] = 0; 
			//clear mass player 
			pTemp[playerid][tRobItems] = false;
			DeletePVar(playerid, "playerRobIDX"); 
		}  
		VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobAmount] = 0;
		pTemp[playerid][tRobVeh] = INVALID_VEHICLE_ID;
	}
}

stock SetWeaponFraction(playerid)
{
 	if (pInfo[playerid][pLevel] <= 1) return 1;

	#if defined _ac_inc

	player_weapon_id[playerid][0] = 0;
	player_weapon_ammo[playerid][0] = 0;
	player_weapon_id[playerid][1] = 0;
	player_weapon_ammo[playerid][1] = 0;
	player_weapon_id[playerid][9] = 0;
	player_weapon_ammo[playerid][9] = 0;

	player_weapon_id[playerid][11] = 0;
	player_weapon_ammo[playerid][11] = 0;

	switch(pInfo[playerid][pMember])
	{
		case 5:{
			player_weapon_id[playerid][1] = 2;
			player_weapon_ammo[playerid][1] = 1;
		}
		case 6:{
			player_weapon_id[playerid][1] = 8;
			player_weapon_ammo[playerid][1] = 1;
		}
		case 7: {
		    if (pInfo[playerid][pRank] > 2 && pInfo[playerid][pRank] < 5) {
				player_weapon_id[playerid][2] = 24;
				player_weapon_ammo[playerid][2] = 28;
			    SetPlayerArmour(playerid, 100);
			}
		}
		case 9: {
		    gNews[playerid] = false;
			player_weapon_id[playerid][9] = 43;
			player_weapon_ammo[playerid][9] = 40;
		}
		case 12, 13, 15, 17, 18:{
			player_weapon_id[playerid][1] = 5;
			player_weapon_ammo[playerid][1] = 1;
		}
		case 14: {
			player_weapon_id[playerid][0] = 1;
			player_weapon_ammo[playerid][0] = 1;
		}
		case 16: {
		    lNews[playerid] = false;
			player_weapon_id[playerid][9] = 43;
			player_weapon_ammo[playerid][9] = 40;
		}
		case 20: {
		    LvNews[playerid] = false;
			player_weapon_id[playerid][9] = 43;
			player_weapon_ammo[playerid][9] = 40;
		}
	}
	GetWeaponClear(playerid);

	#else

	switch(pInfo[playerid][pMember])
	{
		case 5: GivePlayerWeapon(playerid,2,1);
		case 6: GivePlayerWeapon(playerid,8,1);
		case 7: {
		    if (pInfo[playerid][pRank] > 2 && pInfo[playerid][pRank] < 5) {
				GivePlayerWeapon(playerid, 24, 29);
			    SetPlayerArmour(playerid, 100);
			}
		}
		case 9: {
		    gNews[playerid] = false;
			GivePlayerWeapon(playerid, 43, 60);
		}
		case 12, 13, 15, 17, 18: GivePlayerWeapon(playerid,5,1);
		case 14: GivePlayerWeapon(playerid,1,1);
		case 16: {
		    lNews[playerid] = false;
			GivePlayerWeapon(playerid, 43, 60);
		}
		case 20: {
		    LvNews[playerid] = false;
			GivePlayerWeapon(playerid, 43, 60);
		}
	}

	#endif
	return 1;
}

stock SettingSpawn(const playerid)
{
    #if defined debug_mode 
		printf("[GM debug] stock SettingSpawn(%d)", playerid); 
	#endif
    if (/*pTemp[playerid][tPaintTeam] != 0 || */pTemp[playerid][tPlayerReg] == 1 || SpecAd[playerid] != INVALID_PLAYER_ID) return 1;

    SetPlayerScore(playerid, pInfo[playerid][pLevel]);

	pTemp[playerid][tVirtualWorld] = 0;
    pTemp[playerid][tInterior] = 0;

	new
		skin;
	if (pInfo[playerid][pMember] && pTemp[playerid][tDutyWork])
	{
		skin = pInfo[playerid][pModel];
	}
	else skin = pInfo[playerid][pChar][0]; 
	if (pInfo[playerid][pJailTime] > 0)
	{ 
		static const Float: PrisonPositionSpawn[][3] = {
			{2743.4106, 1392.7045, 1100.9045},
			{219.5400, 109.9767, 999.0156},
			{198.3642, 161.8103, 1003.0300}
		};  
		if (pInfo[playerid][pMestoJail] < 4) {
			new rand = pInfo[playerid][pMestoJail]-1;
			SetSpawnInfoEx(playerid, skin, PrisonPositionSpawn[ rand ][0], PrisonPositionSpawn[rand][1], PrisonPositionSpawn[rand][2], 1.0);
			pTemp[playerid][tVirtualWorld] = 6;
			pTemp[playerid][tInterior] = 1;
		} else {
			SetSpawnInfoEx(playerid, skin, 2.4973,803.3113,1033.0717,271.8828);
			pTemp[playerid][tVirtualWorld] = 10;
			pTemp[playerid][tInterior] = MAD_HOUSE_INT;
		} 
		return 1;
	}  
	
	if (pTemp[playerid][tDMArea][0]) { 
		if (pTemp[playerid][tDMArea][3] == 1) {
			new rand = random(sizeof(DM_Arena_OneSpawnPos));
			SetSpawnInfoEx(playerid, skin, DM_Arena_OneSpawnPos[rand][0], DM_Arena_OneSpawnPos[rand][1], DM_Arena_OneSpawnPos[rand][2], DM_Arena_OneSpawnPos[rand][3]);
			GivePlayerWeapon(playerid, DM_ArenaGun[pTemp[playerid][tDMArea][4]], 1000);
			pTemp[playerid][tVirtualWorld] = 1;
			pTemp[playerid][tInterior] = INTERIOR_NONE;
		} 
		if (pTemp[playerid][tDMArea][3] == 2) 
		{
			new rand = random(sizeof(DM_Arena_TwoSpawnPos));
			SetSpawnInfoEx(playerid, skin, DM_Arena_TwoSpawnPos[rand][0], DM_Arena_TwoSpawnPos[rand][1], DM_Arena_TwoSpawnPos[rand][2], DM_Arena_TwoSpawnPos[rand][3]);
			GivePlayerWeapon(playerid, DM_ArenaGun[pTemp[playerid][tDMArea][4]], 1000);
			pTemp[playerid][tVirtualWorld] = 1;
			pTemp[playerid][tInterior] = INTERIOR_NONE;
		}
		if (pTemp[playerid][tDMArea][3] == 3) 
		{
			new rand = random(sizeof(DM_Arena_ThreeSpawnPos));
			SetSpawnInfoEx(playerid, skin, DM_Arena_ThreeSpawnPos[rand][0], DM_Arena_ThreeSpawnPos[rand][1], DM_Arena_ThreeSpawnPos[rand][2], DM_Arena_ThreeSpawnPos[rand][3]);
			GivePlayerWeapon(playerid, DM_ArenaGun[pTemp[playerid][tDMArea][4]], 1000);
			pTemp[playerid][tVirtualWorld] = 1;
			pTemp[playerid][tInterior] = AIM_DEAGLE_DM;
		} 
		SetPlayerColor(playerid, 0x56FB4EFF);
		SetPlayerHealth(playerid, 160);
		return 1;
	}  
	if (pTemp[playerid][tPaintTeam] && StartPaintBall != 1)
	{
		if (!StartPaintBall) {
			pTemp[playerid][tPaintTeam] 	=
			pTemp[playerid][tPaintKills] 	=
			pTemp[playerid][tPaintDeath] 	= 0;
			pTemp[playerid][tPaintDMG] 		= 0.0;
			for(new td; td < sizeof (paint_TD); td++) {
				TextDrawHideForPlayer(playerid, paint_TD[td]); 
			} 
			PlayerTextDrawDestroy(playerid, tPaintStats[playerid]);
			tPaintStats[playerid] = PlayerText:-1 ;
			SetSpawnInfoEx(playerid, skin, 286.1364, -30.7176, 1001.5156, 181.0381);
			pTemp[playerid][tVirtualWorld] = 1;
			pTemp[playerid][tInterior] = 1; 
		}
		else if (StartPaintBall == 2) {
			skin = SetPlayerSkin(playerid, SkinPaint[ pInfo[playerid][pSex] ][ pTemp[playerid][tPaintTeam] - 1 ] );  
			GivePlayerWeapon(playerid, 24, 1000);
			GivePlayerWeapon(playerid, 25, 1000);
			GivePlayerWeapon(playerid, 31, 1000);

			new rand = random(9); 
			switch(pTemp[playerid][tPaintTeam]) {
				case 1: {  
					SetSpawnInfoEx(playerid, skin, SpawnBlueTeam[PaintBallMap-1][rand][0], SpawnBlueTeam[PaintBallMap-1][rand][1], SpawnBlueTeam[PaintBallMap-1][rand][2], SpawnBlueTeam[PaintBallMap-1][rand][3]);	
				}
				case 2: {  
					SetSpawnInfoEx(playerid, skin, SpawnRedTeam[PaintBallMap-1][rand][0], SpawnRedTeam[PaintBallMap-1][rand][1], SpawnRedTeam[PaintBallMap-1][rand][2], SpawnRedTeam[PaintBallMap-1][rand][3]);
				}
			} 
			
			pTemp[playerid][tVirtualWorld] = 10;
			pTemp[playerid][tInterior] = INTERIOR_NONE;
			SetPlayerColor(playerid, (pTemp[playerid][tPaintTeam] == 1) ? (0x33AAFFFF) : (0xAA3333FF));
			SetPlayerHealth(playerid, 100);
		} 
		SetCameraBehindPlayer(playerid);
		return 1;
	}
	if (pInfo[playerid][pHospital] != 0) {
		new 
			hospital_loc = pInfo[playerid][pHospital];
		switch(hospital_loc) {/* 255 Error, 1 SF, 2 LS, 3 LV */
			
			case 4: {//SF
				static const Float: pos_hospital[][] = {
					{141.7930,1640.4346,995.5758, 0.0},
					{140.0364,1644.9146,995.5768, 270.0},
					{143.5682,1645.1893,995.5768, 90.0}
				}; 
				new rand = random(sizeof(pos_hospital));
				SetSpawnInfoEx(playerid, skin, pos_hospital[rand][0], pos_hospital[rand][1], pos_hospital[rand][2], pos_hospital[rand][3]);
				pTemp[playerid][tVirtualWorld] = 1;
				pTemp[playerid][tInterior] = HOSPITAL_ARMY_INT;
			}
			case 5: {//LV
				static const Float: pos_hospital[][] = {
					{141.7930,1640.4346,995.5758, 0.0},
					{140.0364,1644.9146,995.5768, 270.0},
					{143.5682,1645.1893,995.5768, 90.0}
				}; 
				new rand = random(sizeof(pos_hospital));
				SetSpawnInfoEx(playerid, skin, pos_hospital[rand][0], pos_hospital[rand][1], pos_hospital[rand][2], pos_hospital[rand][3]);
				pTemp[playerid][tVirtualWorld] = 2;
				pTemp[playerid][tInterior] = HOSPITAL_ARMY_INT;
			}
			default: /*case 1, 2, 3: */{ 
				if (hospital_loc == 1) {//sf
					static const Float: pos_hospital[][] = {//sf
						{-2619.8391,616.7123,1338.9753,175.9508},
						{-2619.9187,597.7809,1338.9753,359.5425},
						{-2632.0356,597.7874,1338.9773,0.8193},
						{-2632.5234,615.4747,1338.9773,180.9877} 
					};  
					new
						rand_ = random(sizeof(pos_hospital)); 
					SetSpawnInfoEx(playerid, skin, pos_hospital[rand_][0], pos_hospital[rand_][1], pos_hospital[rand_][2], pos_hospital[rand_][3]);
					pTemp[playerid][tVirtualWorld] = 1;
					pTemp[playerid][tInterior] = HOSPITAL_SF_INT; 
				}
				else if (hospital_loc == 2) {//Ls
					static const Float: pos_hospital[][] = {
						{814.5046,1351.7714,1071.4810,270.0},
						{812.4384,1341.7186,1071.4810,270.0} 
					}; 
					new
						rand_ = random(sizeof(pos_hospital)); 
					SetSpawnInfoEx(playerid, skin, pos_hospital[rand_][0], pos_hospital[rand_][1], pos_hospital[rand_][2], pos_hospital[rand_][3]);
					pTemp[playerid][tVirtualWorld] = 1;
					pTemp[playerid][tInterior] = 7; 
				}
				else if (hospital_loc == 3) { //LV
					static const Float: pos_hospital[][] = {
						{1670.7317, 1765.5059, 1098.1624, 0.0},
						{1675.1631, 1765.1787, 1098.1624, 0.0},
						{1685.0067, 1765.4033, 1098.1624, 0.0},
						{1689.4738, 1765.7302, 1098.1624, 0.0},
						{1674.4651, 1797.5742, 1098.1624, 180.0},
						{1670.1683, 1796.9137, 1098.1624, 180.0},
						{1689.2827, 1797.3920, 1098.1624, 180.0},
						{1684.6625, 1797.0137, 1098.1624, 180.0}
					};
					new
						rand_ = random(sizeof(pos_hospital)); 
					SetSpawnInfoEx(playerid, skin, pos_hospital[rand_][0], pos_hospital[rand_][1], pos_hospital[rand_][2], pos_hospital[rand_][3]);
					pTemp[playerid][tVirtualWorld] = 1;
					pTemp[playerid][tInterior] = HOSPITAL_LV_INT; 
				} 
			}
		}
		SetCameraBehindPlayer(playerid);
		return 1;
	} 
	if ((pInfo[playerid][PlayerSpawn] == 3 || pInfo[playerid][PlayerSpawn] == 4) && Iter_Count(PlayerListVehicle[playerid]) != 0)  
	{
		new temp_house,temp_yacht;
		foreach(new veh_id : PlayerListVehicle[playerid])
		{
			if (!IsVehicleInterior(veh_id)) continue;
			if (IsVehicleInterior(veh_id) == 2)  temp_house = veh_id;
			else if (IsVehicleInterior(veh_id) == 1) temp_yacht = veh_id;
		}
		
		if (temp_house != 0 && pInfo[playerid][PlayerSpawn] == 3)
		{
			SetSpawnInfoEx(playerid, skin, 1515.4413, 1605.8478, 10.9062, 265.3904); 
			pTemp[playerid][tVirtualWorld] 		=
			pTemp[playerid][tPlayerTrailerHome] = temp_house;
			pTemp[playerid][tInterior] = CARAVAN_INTERIOR; 
			return 1;
		}
		else if (temp_yacht != 0)
		{
			SetSpawnInfoEx(playerid, skin, 60.2538,1265.3412,1171.5360,88.7730); 
			pTemp[playerid][tVirtualWorld] 		=
			pTemp[playerid][tPlayerTrailerHome] = temp_yacht;
			pTemp[playerid][tInterior] = YACHT_INTERIOR; 
			return 1;
		}
		else 
		{
			if (pInfo[playerid][pMember] != 0) {
				pInfo[playerid][PlayerSpawn] = 2;
			} else {
				pInfo[playerid][PlayerSpawn] = 0;
			}
			SendClientMessage(playerid, COLOR_GREY, !"Произошла ошибка при загрузке Яхты/ДНК");
			//ClearPlayerSpawn(playerid);
		}
	}
	if (pInfo[playerid][pMember] != 0 && pInfo[playerid][PlayerSpawn] == 2/* && pTemp[playerid][tDutyWork]*/) // ФРАКЦИЯ
	{ 
		new
			idx = pInfo[playerid][pMember];
			
		if (pInfo[playerid][pMember] == 19)
		{ 
			static const Float: pos_army_lva[][] = {
				{978.7611, -354.4218, 999.9739, 270.0000},
				{982.7961, -354.0909, 999.9739, 91.7117},
				{982.7137, -356.9391, 999.9739, 88.5783},
				{978.7281, -357.0419, 999.9739, 270.0001} }; 
			new
				rand_ = random(sizeof(pos_army_lva));
			SetSpawnInfoEx(playerid, skin, pos_army_lva[rand_][0], pos_army_lva[rand_][1], pos_army_lva[rand_][2], pos_army_lva[rand_][3]); 
			pTemp[playerid][tVirtualWorld] = 1;
			pTemp[playerid][tInterior] = 1;
			return 1;
		} 
        else
		{
			SetSpawnInfoEx(playerid, skin, gFraction[idx][fPos][0], gFraction[idx][fPos][1], gFraction[idx][fPos][2],  gFraction[idx][fPos][3]);
			pTemp[playerid][tVirtualWorld] = gFraction[idx][fWorld];
			pTemp[playerid][tInterior] = gFraction[idx][fInt]; 
			/*if (gFraction[idx][fFreezeSpawn]) {
				setFreezePlayerForTime(playerid, 1);
			}*/
			
		}
        SetPlayerColor(playerid, gFractionColor[idx]); 
		return 1;
	}
	if (pInfo[playerid][pFamily] != 0 && FamilyInfo[ pInfo[playerid][pFamily] - 1][fHouse] != -1 && pInfo[playerid][PlayerSpawn] == 5) {
		new 
			H_IDX = FamilyInfo[ pInfo[playerid][pFamily] - 1][fHouse],
        	idx = FamilyHouse[H_IDX][fhIntID];

		SetSpawnInfoEx(playerid, skin, FamilyInterior[idx][fSpawn][0], FamilyInterior[idx][fSpawn][1], FamilyInterior[idx][fSpawn][2], FamilyInterior[idx][fSpawn][3]);
   		pTemp[playerid][tVirtualWorld] = (FamilyHouse[H_IDX][fhID]+50);
    	pTemp[playerid][tInterior] = FamilyInterior[idx][fInterior];
		pTemp[playerid][tSelectFamilyHouse] = H_IDX;
		return 1;
	}
	if (pInfo[playerid][pFamily] != 0 && FamilyInfo[ pInfo[playerid][pFamily] - 1][fDefHouse] != -1 && pInfo[playerid][PlayerSpawn] == 6) {
		new 
			H_IDX = FamilyInfo[ pInfo[playerid][pFamily] - 1][fDefHouse],
        	idx = HouseInfo[H_IDX][hIntID];
		SetSpawnInfoEx(playerid, skin, HouseInt[idx][hIntPos][0], HouseInt[idx][hIntPos][1], HouseInt[idx][hIntPos][2], 1.0);
		pTemp[playerid][tVirtualWorld] = H_IDX+50;
		pTemp[playerid][tInterior] = HouseInt[idx][hIntInterior];
		pTemp[playerid][tCurrentHouseID] = H_IDX; 
		return 1;
	}
    if ((pInfo[playerid][pHouseID] != -1 || pInfo[playerid][pRentHouse] != -1) && pInfo[playerid][PlayerSpawn] == 1) // ДОМ 
	{ 
		new house_id = pInfo[playerid][pHouseID];
		if (pInfo[playerid][pHouseID] == -1) {
			house_id = pInfo[playerid][pRentHouse];
		}
  		new 
			idx = HouseInfo[house_id][hIntID]; 
        SetSpawnInfoEx(playerid, skin, HouseInt[idx][hIntPos][0], HouseInt[idx][hIntPos][1], HouseInt[idx][hIntPos][2], 1.0);
		pTemp[playerid][tVirtualWorld] = house_id+50;
		pTemp[playerid][tInterior] = HouseInt[idx][hIntInterior];
		pTemp[playerid][tCurrentHouseID] = house_id;
		return 1;
	} 
	static const Float: pos_spawn_noob[][] = {
			{1157.0867,-1768.9376,16.5938,2.0257},
			{1150.9722,-1768.7898,16.5938,358.8923},
			{1157.0867,-1768.9376,16.5938,2.0257},
			{1150.9722,-1768.7898,16.5938,358.8923}
		};  
	new
		rand_ = random(sizeof(pos_spawn_noob)); 
   	if (Iter_Count(PlayerInLogin) < 200)
    { 
		
        if (pInfo[playerid][pLevel] < 2)
        {
            if (pInfo[playerid][pExp] >= 4) SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);
            else {
				SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]); 
			}
        }
        else SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);//jefferson // ls
    }
    else if (Iter_Count(PlayerInLogin) < 300) 
    { 
        if (pInfo[playerid][pLevel] < 2) {
            if (pInfo[playerid][pExp] >= 4) SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);
            else {
				SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]); 
			}
        }
        else if (pInfo[playerid][pLevel] < 3) SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);//jefferson
        else SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);//sf
    }
    else 
    {
        if (pInfo[playerid][pLevel] < 2) 
        {
            if (pInfo[playerid][pExp] >= 4) SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);
            else {
				SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]); 
			}
        }
        else if (pInfo[playerid][pLevel] < 3) SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);//jefferson
        else if (pInfo[playerid][pLevel] < 5) SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);//sf
        else SetSpawnInfoEx(playerid, skin, pos_spawn_noob[rand_][0], pos_spawn_noob[rand_][1], pos_spawn_noob[rand_][2], pos_spawn_noob[rand_][3]);//lv
    }
	pTemp[playerid][tVirtualWorld] = 0;
	pTemp[playerid][tInterior] = 0;
	SetCameraBehindPlayer(playerid); 

    if (GetPVarInt(playerid, "FirstSpawnPlayer") == 1)
    {
        SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Поздравляем Вас с успешной регистрацией!"); 
        SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Мы настоятельно рекомендуем вам прочесть "colserver"\"Помощь\"");
        SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Желаем вам приятной игры на нашем сервере!");
		SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Обратитесь к \"Илье\" он Вам поможет с арендой");
        PlayerPlaySound(playerid, 1069, 0.0, 0.0, 0.0);
        DeletePVar(playerid, "FirstSpawnPlayer");
    }
	printf("SettingSpawn: %f, %f, %f", setX[playerid], setY[playerid], setZ[playerid]);
	return 1;
}


new legalmods[48][22] =
{
	{400, 1024, 1021, 1020, 1019, 1018, 1013, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{401, 1145, 1144, 1143, 1142, 1020, 1019, 1017, 1013, 1007, 1006, 1005, 1004, 1003, 1001, 0000, 0000, 0000, 0000},
	{404, 1021, 1020, 1019, 1017, 1016, 1013, 1007, 1002, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{405, 1023, 1021, 1020, 1019, 1018, 1014, 1001, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{410, 1024, 1023, 1021, 1020, 1019, 1017, 1013, 1007, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{415, 1023, 1019, 1018, 1017, 1007, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{418, 1021, 1020, 1016, 1006, 1002, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{420, 1021, 1019, 1005, 1004, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{421, 1023, 1021, 1020, 1019, 1018, 1016, 1014, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{422, 1021, 1020, 1019, 1017, 1013, 1007, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{426, 1021, 1019, 1006, 1005, 1004, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{436, 1022, 1021, 1020, 1019, 1017, 1013, 1007, 1006, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{439, 1145, 1144, 1143, 1142, 1023, 1017, 1013, 1007, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{477, 1021, 1020, 1019, 1018, 1017, 1007, 1006, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{478, 1024, 1022, 1021, 1020, 1013, 1012, 1005, 1004, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{489, 1024, 1020, 1019, 1018, 1016, 1013, 1006, 1005, 1004, 1002, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{491, 1145, 1144, 1143, 1142, 1023, 1021, 1020, 1019, 1018, 1017, 1014, 1007, 1003, 0000, 0000, 0000, 0000, 0000},
	{492, 1016, 1006, 1005, 1004, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{496, 1143, 1142, 1023, 1020, 1019, 1017, 1011, 1007, 1006, 1003, 1002, 1001, 0000, 0000, 0000, 0000, 0000, 0000},
	{500, 1024, 1021, 1020, 1019, 1013, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{516, 1021, 1020, 1019, 1018, 1017, 1016, 1015, 1007, 1004, 1002, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{517, 1145, 1144, 1143, 1142, 1023, 1020, 1019, 1018, 1017, 1016, 1007, 1003, 1002, 0000, 0000, 0000, 0000, 0000},
	{518, 1145, 1144, 1143, 1142, 1023, 1020, 1018, 1017, 1013, 1007, 1006, 1005, 1003, 1001, 0000, 0000, 0000, 0000},
	{527, 1021, 1020, 1018, 1017, 1015, 1014, 1007, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{529, 1023, 1020, 1019, 1018, 1017, 1012, 1011, 1007, 1006, 1003, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{534, 1185, 1180, 1179, 1178, 1127, 1126, 1125, 1124, 1123, 1122, 1106, 1101, 1100, 0000, 0000, 0000, 0000, 0000},
	{535, 1121, 1120, 1119, 1118, 1117, 1116, 1115, 1114, 1113, 1110, 1109, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{536, 1184, 1183, 1182, 1181, 1128, 1108, 1107, 1105, 1104, 1103, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{540, 1145, 1144, 1143, 1142, 1024, 1023, 1020, 1019, 1018, 1017, 1007, 1006, 1004, 1001, 0000, 0000, 0000, 0000},
	{542, 1145, 1144, 1021, 1020, 1019, 1018, 1015, 1014, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{546, 1145, 1144, 1143, 1142, 1024, 1023, 1019, 1018, 1017, 1007, 1006, 1004, 1002, 1001, 0000, 0000, 0000, 0000},
	{547, 1143, 1142, 1021, 1020, 1019, 1018, 1016, 1003, 1000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{549, 1145, 1144, 1143, 1142, 1023, 1020, 1019, 1018, 1017, 1012, 1011, 1007, 1003, 1001, 0000, 0000, 0000, 0000},
	{550, 1145, 1144, 1143, 1142, 1023, 1020, 1019, 1018, 1006, 1005, 1004, 1003, 1001, 0000, 0000, 0000, 0000, 0000},
	{551, 1023, 1021, 1020, 1019, 1018, 1016, 1006, 1005, 1003, 1002, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{558, 1168, 1167, 1166, 1165, 1164, 1163, 1095, 1094, 1093, 1092, 1091, 1090, 1089, 1088, 0000, 0000, 0000, 0000},
	{559, 1173, 1162, 1161, 1160, 1159, 1158, 1072, 1071, 1070, 1069, 1068, 1067, 1066, 1065, 0000, 0000, 0000, 0000},
	{560, 1170, 1169, 1141, 1140, 1139, 1138, 1033, 1032, 1031, 1030, 1029, 1028, 1027, 1026, 0000, 0000, 0000, 0000},
	{561, 1157, 1156, 1155, 1154, 1064, 1063, 1062, 1061, 1060, 1059, 1058, 1057, 1056, 1055, 1031, 1030, 1027, 1026},
	{562, 1172, 1171, 1149, 1148, 1147, 1146, 1041, 1040, 1039, 1038, 1037, 1036, 1035, 1034, 0000, 0000, 0000, 0000},
	{565, 1153, 1152, 1151, 1150, 1054, 1053, 1052, 1051, 1050, 1049, 1048, 1047, 1046, 1045, 0000, 0000, 0000, 0000},
	{567, 1189, 1188, 1187, 1186, 1133, 1132, 1131, 1130, 1129, 1102, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{575, 1177, 1176, 1175, 1174, 1099, 1044, 1043, 1042, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{576, 1193, 1192, 1191, 1190, 1137, 1136, 1135, 1134, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{580, 1023, 1020, 1018, 1017, 1007, 1006, 1001, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{589, 1145, 1144, 1024, 1020, 1018, 1017, 1016, 1013, 1007, 1006, 1005, 1004, 1000, 0000, 0000, 0000, 0000, 0000},
	{600, 1022, 1020, 1018, 1017, 1013, 1007, 1006, 1005, 1004, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000, 0000},
	{603, 1145, 1144, 1143, 1142, 1024, 1023, 1020, 1019, 1018, 1017, 1007, 1006, 1001, 0000, 0000, 0000, 0000, 0000}
};
stock IsWheelModel(modelid)
{
	new wheelmodels[17] = {1025, 1073, 1074, 1075, 1076, 1077, 1078, 1079, 1080, 1081, 1082, 1083, 1084, 1085, 1096, 1097, 1098};
	for (new i = 0; i < 17; i++)
	{
		if (modelid == wheelmodels[i])
			return true;
	}
	return false;
}
stock IsLegalCarNitroIde(carmodel)
{
	new illegalvehs[29] = { 581, 523, 462, 521, 463, 522, 461, 448, 468, 586, 509, 481, 510, 472, 473, 493, 595, 484, 430, 453, 452, 446, 454, 590, 569, 537, 538, 570, 449 };
	for (new i = 0; i < 29; i++)
	{
		if (carmodel == illegalvehs[i])
			return true;
	}
	return false;
}
stock IsLegal_Nos_Vehicle(PlayerID)
{
	new carid = GetPlayerVehicleID(PlayerID);
	new playercarmodel = GetVehicleModel(carid);
	return IsLegalCarNitroIde(playercarmodel);
}

stock IsLegalCarMod(vehicleide, componentid)
{
	new modok = false;
	if ((IsWheelModel(componentid)) || (componentid == 1086) || (componentid == 1087) || ((componentid >= 1008) && (componentid <= 1010)))
	{
		new nosblocker = IsLegalCarNitroIde(vehicleide);
		if (!nosblocker)
			modok = true;
	}
	else
	{
		for (new I = 0; I < 48; I++)
		{
			if (legalmods[I][0] == vehicleide)
			{
				for (new J = 1; J < 22; J++)
				{
					if (legalmods[I][J] == componentid)
						modok = true;
				}
			}
		}
	}
	return modok;
}

stock LockCar(carid)
{
	GetVehicleParamsEx(carid,engine1,lights2,alarm2,doors3,bonnet2,boot1,objective1);
	return SetVehicleParamsEx(carid,engine1,lights2,alarm2,true,bonnet2,boot1,objective1);
}

stock UnLockCar(carid)
{
	GetVehicleParamsEx(carid,engine1,lights2,alarm2,doors3,bonnet2,boot1,objective1);
	return SetVehicleParamsEx(carid,engine1,lights2,alarm2,false,bonnet2,boot1,objective1);
}

stock IsARussianText(const inputtext[])
{
	for(new i = strlen(inputtext); i != -1; --i)
	{
		switch(inputtext[i])
		{
			case 'А'..'Я', 'а'..'я',' ': return 1;
		}
	}
	return 0;
}

stock CheckPassword(const pass[]) {
	for(new i; i < strlen(pass); i ++) {
	    if ( (pass[i] >= 'a' && pass[i] <= 'z') ||
		(pass[i] >= 'A' && pass[i] <= 'Z') ||
		(pass[i] >= '?' && pass[i] <= '?') ||
		(pass[i] >= '?' && pass[i] <= '?') ||
		(pass[i] >= '0' && pass[i] <= '9')  ) continue;
		else return false;
	}
	return true;
}

stock FindSpecifiersInString(message[])
{
    for(new i; i < strlen(message); i++){
            if (message[i] == 0x25) message[i] = 0x23;
        }
    return 1;
} 


stock IntToStr(value) {
	new tmp[30];
	valstr(tmp, value);
	return tmp;
}


stock IsAtFishPlace(playerid) {
	for(new i; i < sizeof(FishZone); i ++) {
		if (IsPlayerInRangeOfPoint(playerid, 5.0,FishZone[i][0],FishZone[i][1],FishZone[i][2])) return 1;
	}
	return 0;
}
stock SaveCasinoIDManager(idx)
{
 	new query_[180];
    format(query_, sizeof query_,"UPDATE `casino` SET `Manager`= '%s', `Manager2`= '%s', `Manager3`= '%s' WHERE ID = '%d' LIMIT 1",
    CasinoInfo[idx][caManager], CasinoInfo[idx][caManager2], CasinoInfo[idx][caManager3], CasinoInfo[idx][caID]);
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
}
stock SaveCasinoIDDealer(idx)
{
	new query_[512];
    format(query_, sizeof query_,"UPDATE `casino` SET `Krupie`= '%s', `Krupie2`= '%s', `Krupie3`= '%s', `Krupie4`= '%s', `Krupie5`= '%s', `Krupie6`= '%s', `Krupie7`= '%s', `Krupie8`= '%s', `Krupie9`= '%s', `Krupie10`= '%s' WHERE ID = '%d' LIMIT 1",
	CasinoInfo[idx][caKrupie], CasinoInfo[idx][caKrupie2], CasinoInfo[idx][caKrupie3],
	CasinoInfo[idx][caKrupie4], CasinoInfo[idx][caKrupie5], CasinoInfo[idx][caKrupie6],
	CasinoInfo[idx][caKrupie7], CasinoInfo[idx][caKrupie8], CasinoInfo[idx][caKrupie9],
	CasinoInfo[idx][caKrupie10], CasinoInfo[idx][caID]);
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
}


stock SaveFermIDStats(idx)
{
    new Year, Month, Day, str[2][256];
	getdate(Year, Month, Day);
 	FarmBizStats[idx][4] = FarmBizStats[idx][3];
	FarmBizStats[idx][3] = FarmBizStats[idx][2];
	FarmBizStats[idx][2] = FarmBizStats[idx][1];
	FarmBizStats[idx][1] = FarmBizStats[idx][0];
	FarmBizStats[idx][0] = FarmInfo[idx][fStart];

	FarmBizStatsDate[idx][4] = FarmBizStatsDate[idx][3];
	FarmBizStatsDate[idx][3] = FarmBizStatsDate[idx][2];
	FarmBizStatsDate[idx][2] = FarmBizStatsDate[idx][1];
	FarmBizStatsDate[idx][1] = FarmBizStatsDate[idx][0];
	FarmBizStatsDate[idx][0] = gettime();


	format(str[0], 128, "%d|%d|%d|%d|%d", FarmBizStats[idx][0], FarmBizStats[idx][1], FarmBizStats[idx][2], FarmBizStats[idx][3], FarmBizStats[idx][4]);
	format(str[1], 256, "%d|%d|%d|%d|%d", FarmBizStatsDate[idx][0], FarmBizStatsDate[idx][1], FarmBizStatsDate[idx][2], FarmBizStatsDate[idx][3], FarmBizStatsDate[idx][4]);

	new query_[512];
    format(query_, sizeof query_,"UPDATE `farms` SET `farmBizStats`= '%s', `farmBizStatsDate`= '%s' WHERE `id` = '%d' LIMIT 1",
	str[0], str[1], FarmInfo[idx][fID]);
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
}
stock SaveFermIDFarmers(idx)
{
 	new query_[512];
    format(query_, sizeof query_,"UPDATE `farms` SET `deputy_1`= '%s', `deputy_2`= '%s', `deputy_3`= '%s', `farmer_1`= '%s', `farmer_2`= '%s', `farmer_3`= '%s', `farmer_4`= '%s', `farmer_5`= '%s' WHERE id = '%d' LIMIT 1",
	FarmInfo[idx][fDeputy_1], FarmInfo[idx][fDeputy_2], FarmInfo[idx][fDeputy_3], FarmInfo[idx][fFarmer_1], FarmInfo[idx][fFarmer_2],FarmInfo[idx][fFarmer_3],FarmInfo[idx][fFarmer_4],
	FarmInfo[idx][fFarmer_5], FarmInfo[idx][fID]);
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
}
stock SaveActionsFerm(idx)
{
    new query_[256];
	format(query_, sizeof query_,"UPDATE `farms` SET `auctions` = '%d,%d,%d,%d,%d', `auction_name` = '%s'  WHERE `id` = '%d' LIMIT 1",
	FarmInfo[idx][fAuction][0], FarmInfo[idx][fAuction][1], FarmInfo[idx][fAuction][2], FarmInfo[idx][fAuction][3], FarmInfo[idx][fAuction][4], FarmInfo[idx][fAuctionName], FarmInfo[idx][fID]);
    mysql_tquery(dbHandle, query_, "", "");
    return 1;
}
stock SaveFermID(idx)
{
    new query_[400];
	format(query_, sizeof query_,"UPDATE `farms` SET `owner` = '%s', `bank` = '%d', `landtax` = '%d', `zp` = '%d', `grain_price` = '%d', `grain` = '%d', `grain_sown` = '%d', `prods_selling` = '%d', `prods` = '%d', `prods_price` = '%d'  WHERE `id` = '%d' LIMIT 1",
	FarmInfo[idx][fOwner], FarmInfo[idx][fBank], FarmInfo[idx][fLandTax], FarmInfo[idx][fZp],
	FarmInfo[idx][fGrain_Price], FarmInfo[idx][fGrain], FarmInfo[idx][fGrain_Sown],
	FarmInfo[idx][fProds_Selling], FarmInfo[idx][fProds], FarmInfo[idx][fProds_Price], FarmInfo[idx][fID]);
    mysql_tquery(dbHandle, query_, "", "");
    return 1;
}

publics: player_register(playerid) {
	PlayerRegister(playerid);
	return 1;
}
publics: PlayerRegister(playerid) {
	pInfo[playerid][pID] = cache_insert_id();
	pTemp[playerid][tPlayerCurrentID] = cache_insert_id();
	new
		query[100];
	SetPVarInt(playerid, "First_Enter", 1);
	format(query,sizeof query,"SELECT * FROM `s_users` WHERE `pID` = '%d' LIMIT 1",pInfo[playerid][pID]);
	mysql_tquery(dbHandle, query, "OnPlayerLoginAuth", "d", playerid);
	pTemp[playerid][tSelectSkin] = false;
	SetPlayerCheckpoint(playerid, 1243.0922,-1701.3489,14.8672, 1.0);//ЧП на квест ботиху
	return 1;
}
/* Удалить pText*/
publics: OnPlayerLoginAuth(playerid)
{
    new rows;
	cache_get_row_count(rows);
	if (rows)
	{
	    cache_get_value_name_int(0, "pID", pInfo[playerid][pID]);
		if (pTemp[playerid][tPlayerCurrentID] != pInfo[playerid][pID]) {
			scmKick(playerid, "Вы были кикнуты по подозрению в читерстве (AC - D4)");
			printf("Call OnPlayerLoginAuth [pID != CurrentID] ID: %d | Kick D4", playerid); 
			return 1;
		}
		cache_get_value_name_int(0, "pLeader", pInfo[playerid][pLeader]);
		cache_get_value_name_int(0, "pMember", pInfo[playerid][pMember]);
		cache_get_value_name_int(0, "pRank", pInfo[playerid][pRank]);
		cache_get_value_name_int(0, "pModel", pInfo[playerid][pModel]);
		new kickout[300];
		cache_get_value_name(0, "pChars", kickout, sizeof kickout);
		sscanf(kickout, "p<,>a<d>[6]", pInfo[playerid][pChar]);
		for(new i = 0; i < 6; i++) {   
			if (pInfo[playerid][pChar][i] > 311) {
				pInfo[playerid][pChar][i] = 292;
				SendClientMessage(playerid, COLOR_WHITE, !"Произошла ошибка при загрузке скину, сообщите в тех. раздел");
			} 
		}
		cache_get_value_name_int(0, "playerspawn", pInfo[playerid][PlayerSpawn]);
		cache_get_value_name_int(0, "pLevel", pInfo[playerid][pLevel]);
		cache_get_value_name_int(0, "pHouseID", pInfo[playerid][pHouseID]);
		cache_get_value_name_int(0, "pTransfer", pInfo[playerid][p_Transfer]); 
		new captureStats[14];
		cache_get_value_name(0, "pCaptureStats", captureStats, sizeof (captureStats));
		sscanf(captureStats, "p<|>iif", CaptureInfo[playerid][pKills], CaptureInfo[playerid][pDeaths], CaptureInfo[playerid][pDMG]);
	
	
		
		cache_get_value_name(0, "pFracIntBlock", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>["#FRACTION_COUNT"]", pInfo[playerid][pFracIntBlock]);
		cache_get_value_name(0, "pFracIntKeys", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>["#FRACTION_COUNT"]", pInfo[playerid][pFracIntKeys]);
	
		cache_get_value_name(0, "playerItems", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>["#MAX_ITEMS_SLOTS"]", pInfo[playerid][PlayerItems]);
			
		cache_get_value_name(0, "playerItemsCount", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>["#MAX_ITEMS_SLOTS"]", pInfo[playerid][PlayerItemsCount]);
		

		cache_get_value_name(0, "playerUseItems", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>[20]", pInfo[playerid][PlayerUseItems]);

		cache_get_value_name(0, "pBoombox", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>[3]", pInfo[playerid][pBoombox]);
 
		cache_get_value_name_int(0, "InGameDay", pInfo[playerid][pInGameDay]);
		cache_get_value_name_int(0, "InGameAllTime", pInfo[playerid][pInGameAllTime]);
		cache_get_value_name_int(0, "LastData", pInfo[playerid][pLastData]);
		cache_get_value_name_int(0, "InGameMember", pInfo[playerid][pInGameMember]);

		// house oplata

		cache_get_value_name_int(0, "rent_0", pInfo[playerid][pRent][0]);
		cache_get_value_name_int(0, "rent_1", pInfo[playerid][pRent][1]);

		cache_get_value_name(0, "pPame", pInfo[playerid][pPame], 200); 

		cache_get_value_name_int(0, "pEuro", pInfo[playerid][pEuro]);

		cache_get_value_name(0, "pEmail", pInfo[playerid][pEmail], 32); 
		cache_get_value_name(0, "pIp", pInfo[playerid][SuperIP], 16);
		cache_get_value_name(0, "pvIp", pInfo[playerid][LastIP], 16);
		cache_get_value_name(0, "pIpReg", pInfo[playerid][RegIP], 16); 
		cache_get_value_name_int(0, "pMestoJail", pInfo[playerid][pMestoJail]);//
	
		cache_get_value_name_float(0, "pHP", pInfo[playerid][PlayerHealth]);
		cache_get_value_name_float(0, "pRating", pInfo[playerid][pRating]);
		cache_get_value_name_float(0, "Satiety", pInfo[playerid][Satiety]);
		cache_get_value_name_int(0, "FullSatiety", pInfo[playerid][FullSatiety]); 
		cache_get_value_name_int(0, "DataReg", pInfo[playerid][DataReg]); 
		cache_get_value_name_int(0, "u_donate", pInfo[playerid][pDonate]);
		cache_get_value_name_int(0, "u_nodonate", pInfo[playerid][pNoDonate]);

		cache_get_value_name_int(0, "pDepInTime", pInfo[playerid][pDepInTime]);
		cache_get_value_name_int(0, "pDepPutTime", pInfo[playerid][pDepPutTime]);
		cache_get_value_name_int(0, "pDepCashBack", pInfo[playerid][pDepCashBack]);
		cache_get_value_name_int(0, "pDeposit", pInfo[playerid][pDeposit]); 
		cache_get_value_name_int(0, "pMats", pInfo[playerid][pMats]);
		cache_get_value_name_int(0, "pSex", pInfo[playerid][pSex]);
		cache_get_value_name_int(0, "pArrested", pInfo[playerid][pArrested]);
		cache_get_value_name_int(0, "pMuted", pInfo[playerid][pMuted]);//Muted
		cache_get_value_name_int(0, "rMuted", pInfo[playerid][rMuted]);
		cache_get_value_name_int(0, "fmute", pInfo[playerid][FractionMute]);
		cache_get_value_name_int(0, "fwarn", pInfo[playerid][FractionWarn]);
		cache_get_value_name_int(0, "pCrimes", pInfo[playerid][pCrimes]);
		cache_get_value_name_int(0, "pExp", pInfo[playerid][pExp]);
		cache_get_value_name_int(0, "pCash", pInfo[playerid][pCash]);
		cache_get_value_name_int(0, "pCasinoChips", pInfo[playerid][pCasinoChips]);
		cache_get_value_name_int(0, "pWantedDeaths", pInfo[playerid][pWantedDeaths]);
		cache_get_value_name_int(0, "pPayCheck", pInfo[playerid][pPayCheck]);
		cache_get_value_name_int(0, "pJailTime", pInfo[playerid][pJailTime]);
		cache_get_value_name_int(0, "pDrugs", pInfo[playerid][pDrugs]);
		cache_get_value_name_int(0, "pLDrugs", pInfo[playerid][pLDrugs]);
		cache_get_value_name_int(0, "pJob", pInfo[playerid][pJob]);
		cache_get_value_name_int(0, "pPnumber", pInfo[playerid][PlayerNumber]);
		cache_get_value_name_int(0, "pDirectory", pInfo[playerid][pDirectory]);
		cache_get_value_name_int(0, "sAptechka", pInfo[playerid][sAptechka]);
		cache_get_value_name_int(0, "sTool", pInfo[playerid][sTool]);
		cache_get_value_name_int(0, "gStars", pInfo[playerid][gStars]);
		cache_get_value_name_int(0, "pVotingID", pInfo[playerid][pVotingID]);
		cache_get_value_name_int(0, "pKeys", pInfo[playerid][pKeys]);
		if (pInfo[playerid][pKeys] < 0) pInfo[playerid][pKeys] = 0;
		cache_get_value_name_int(0, "pZakonp", pInfo[playerid][pZakonp]);
		cache_get_value_name_int(0, "pAddiction", pInfo[playerid][pAddiction]);
		cache_get_value_name_int(0, "pNarcoLomka", pInfo[playerid][pNarcoLomka]);
		if (pInfo[playerid][pNarcoLomka] > 0) {
			pTemp[playerid][tTimeAddiction] = (gettime()+60);
		}
		else {
			pTemp[playerid][tTimeAddiction] = (gettime()+2400);
		}
		cache_get_value_name_int(0, "pHospital", pInfo[playerid][pHospital]);
		cache_get_value_name_int(0, "pWarns", pInfo[playerid][pWarns]);
		cache_get_value_name_int(0, "punWarns", pInfo[playerid][punWarns]);
		cache_get_value_name_int(0, "pFuel", pInfo[playerid][pFuel]);
		cache_get_value_name(0, "pMarriedTo", pInfo[playerid][pMarriedTo], 32);
		cache_get_value_name(0, "pDrug", pInfo[playerid][Referal], 32);
		cache_get_value_name_int(0, "pMushrooms", pInfo[playerid][pMushrooms]);
		cache_get_value_name_float(0, "pFishes", pInfo[playerid][pFishes]);
		cache_get_value_name_int(0, "pFishesTrade", pInfo[playerid][pFishesTrade]); 
		cache_get_value_name_int(0, "pFishesWorms", pInfo[playerid][pFishesWorms]);
		cache_get_value_name_int(0, "pFishesTicle", pInfo[playerid][pFishesTicle]); 
		cache_get_value_name_int(0, "pBank", pInfo[playerid][pBank]);
		cache_get_value_name_int(0, "pMobile", pInfo[playerid][pMobile]);
		cache_get_value_name_int(0, "pDolg", pInfo[playerid][pDolg]);
		cache_get_value_name_int(0, "pKrisha", pInfo[playerid][pKrisha]);
		cache_get_value_name_int(0, "pUseKrisha", pInfo[playerid][pUseKrisha]);
		cache_get_value_name_int(0, "pWantedLevel", pInfo[playerid][pWantedLevel]);
		cache_get_value_name_int(0, "pFamily", pInfo[playerid][pFamily]);
		if (pInfo[playerid][pFamily] != 0) { 
			Invite_Family(playerid, pInfo[playerid][pFamily]); 
		}
		cache_get_value_name_int(0, "pFamilyRank", pInfo[playerid][pFamilyRank]);
		cache_get_value_name_int(0, "pFamilyMute", pInfo[playerid][pFamilyMute]);
		//cache_get_value_name_int(0, "pFamilyWarn", pInfo[playerid][pFamilyWarn]);
		cache_get_value_name_int(0, "boost_rank", pInfo[playerid][BoostRank]);
		cache_get_value_name_int(0, "boost_time", pInfo[playerid][BoostTime]);
		cache_get_value_name_int(0, "vip_rank", pInfo[playerid][VIPRank]); 
		cache_get_value_name_int(0, "vip_time", pInfo[playerid][VIPTime]);
    	cache_get_value_name_int(0, "ptaxiexp", pInfo[playerid][pTaxiExp]);
		cache_get_value_name_int(0, "ptaxilvl", pInfo[playerid][pTaxiLevel]);
		cache_get_value_name_int(0, "pBoxSkill", pInfo[playerid][pBoxSkill]);
		cache_get_value_name_int(0, "pKongfuSkill", pInfo[playerid][pKongfuSkill]);
		cache_get_value_name_int(0, "pKickboxSkill", pInfo[playerid][pKickboxSkill]);
		cache_get_value_name_int(0, "pDLevel", pInfo[playerid][pDLevel]);
		cache_get_value_name_int(0, "pDExp", pInfo[playerid][pDExp]);
		cache_get_value_name_int(0, "pDMgruz", pInfo[playerid][pDMgruz]);
		cache_get_value_name_int(0, "pSkilla", pInfo[playerid][pSkilla]);
		cache_get_value_name_int(0, "pRentHouse", pInfo[playerid][pRentHouse]);
		cache_get_value_name_int(0, "pTheftQuest", pInfo[playerid][pTheftQuest]); 
		cache_get_value_name_int(0, "pCharity", pInfo[playerid][pCharity]); 
		cache_get_value_name_int(0, "pLighter", pInfo[playerid][pLighter]);
		cache_get_value_name_int(0, "pCigarettes", pInfo[playerid][pCigarettes]);
		cache_get_value_name_int(0, "pRecognition", pInfo[playerid][pRecognition]);
		cache_get_value_name_int(0, "pRobHouse", pInfo[playerid][pRobHouse]);
		cache_get_value_name_int(0, "pFishesPach", pInfo[playerid][pFishesPach]);
		cache_get_value_name_int(0, "activate_mail", pInfo[playerid][MailConfirm]);
		cache_get_value_name_int(0, "pDrivingSkill", pInfo[playerid][pDrivingSkill]);  
		//Новый год - После сезона удалить.
		/*cache_get_value_name_int(0, "questtype", pInfo[playerid][questtype]);  
		cache_get_value_name_int(0, "pHPcoin", pInfo[playerid][pHPcoin]);  
		cache_get_value_name_int(0, "pPostcard", pInfo[playerid][pPostcard]); */ 
	
		cache_get_value_name(0, "licenses", kickout, sizeof kickout);
	 	sscanf(kickout, "p<,>a<d>[6]", pInfo[playerid][pLicense]);

		cache_get_value_name(0, "licensesTime", kickout, sizeof kickout);
	 	sscanf(kickout, "p<|>a<d>[6]", pInfo[playerid][pLicenseTime]);
	 	
		cache_get_value_name(0, "phoneList", kickout, 64);
		sscanf(kickout, "p<,>a<d>[8]", pInfo[playerid][PhoneBook]);
		 

		cache_get_value_name(0, "pGunSkills", kickout, 32);
		sscanf(kickout, "p<,>a<d>[6]", pInfo[playerid][pGunSkill]);

		cache_get_value_name(0, "pRecordArena", kickout, 32);
		sscanf(kickout, "p<|>a<d>[6]", pInfo[playerid][pRecordArena]);
		//pRecordArena[6],
		cache_get_value_name(0, "pWeapons", kickout, 48);
		sscanf(kickout, "p<,>a<d>[13]", player_weapon_id[playerid]);
		
		cache_get_value_name(0, "pAmmos", kickout, 48);
		sscanf(kickout, "p<,>a<d>[13]", player_weapon_ammo[playerid]);


		cache_get_value_name_int(0, "pDailyReward", pInfo[playerid][pDailyReward]);
		cache_get_value_name(0, "pRewardDate", pInfo[playerid][pRewardDate], 32);
		cache_get_value_name(0, "pRewardRegDate", pInfo[playerid][pRewardRegDate], 32);
 
		cache_get_value_name(0, "pQuestID", kickout, sizeof kickout);
		sscanf(kickout, "p<,>a<d>[8]", pQuest[playerid][pQuestID]); 


		cache_get_value_name(0, "pQuestTemp", kickout, sizeof kickout);
		sscanf(kickout, "p<,>a<d>[8]", pQuest[playerid][pQuestTemp]);

		cache_get_value_name_int(0, "gRoulleteTime", pTemp[playerid][gTimeNoAFK]);
		cache_get_value_name_int(0, "PromoCode", pInfo[playerid][PromoCode]);

		cache_get_value_name_int(0, "edited_ads", pInfo[playerid][edited_ads]);
		cache_get_value_name_int(0, "CaptureKills", pInfo[playerid][pCaptureKills]);
 
		cache_get_value_name(0, "SkillProd", kickout, 32);
		sscanf(kickout, "p<,>a<d>[3]", pInfo[playerid][JobDriverProdInfo]);
		
		
		cache_get_value_name(0, "pAchivID", kickout, sizeof kickout);
		sscanf(kickout, "p<|>a<d>[50]", pAchivID[playerid]);
		cache_get_value_int(0, "w_rSpins", pInfo[playerid][pSpins]);

 
		kickout[0] = EOS;



		#if defined _businesses_inc
			new tempBusinessID[MAX_PLAYER_BUSINESS];
			cache_get_value_name(0, "pBusinessID", kickout, sizeof (kickout));
			sscanf(kickout, "p<,>a<i>["#MAX_PLAYER_BUSINESS"]", tempBusinessID);
	
			for (new i = 0; i < MAX_PLAYER_BUSINESS; i++) 
				pInfo[playerid][pBusinessID][i] = 0;
			for (new id = 0; id < sizeof (BusinessInfo); id++) {
				if (!IsValidBusiness(id)) 
					continue;
				for (new i = 0; i < MAX_PLAYER_BUSINESS; i++) {
					if (tempBusinessID[i] && tempBusinessID[i] == BusinessInfo[id][bID]) {
						if (!strcmp(BusinessInfo[id][bOwner], pInfo[playerid][pName], true)) {
							pInfo[playerid][pBusinessID][i] = id + 1;
						}
						tempBusinessID[i] = 0;
					}
				}
			}
			for (new i = 0, id; i < MAX_PLAYER_BUSINESS; i++) {
				if (!pInfo[playerid][pBusinessID][i]) continue;
				id = pInfo[playerid][pBusinessID][i] - 1;
				if (strcmp(BusinessInfo[id][bOwner], pInfo[playerid][pName], true)) {
					pInfo[playerid][pBusinessID][i] = 0;
				}
			}
		#endif
		OW_OnPlayerLogin(playerid);
		#if defined _hpquest_inc
			LoadPlayerNYQuest(playerid);
		#endif
		#if defined _medcard_inc
			LoadPlayerMedcardData(playerid);
		#endif

		#if defined _inventory_inc
            InventoryMain:LoadPlayerData(playerid);
        #endif

		for(new gangzone = 1; gangzone <= TOTALGZ; gangzone++) {
			GangZoneShowForPlayer(playerid,GZInfo[gangzone][gZone],GetGangZoneColor(gangzone));
			if (GZInfo[gangzone][gTimer]) { 
				GangZoneStopFlashForPlayer(playerid, GZInfo[gangzone][gZone]);
				GangZoneFlashForPlayer(playerid, GZInfo[gangzone][gZone], COLOR_RED);
			}
		} 
		pTemp[playerid][tTimeLogin] = -2;
		pInfo[playerid][pLogin] = 1;
		/* Загрузка данных */
		ResetPlayerMoney(playerid);
		GivePlayerMoneyEx(playerid);
        if (pInfo[playerid][pCash] < 0) pInfo[playerid][pCash] = 0;  
		GetPlayerFarm(playerid);
		SetPlayerSkills(playerid);  

		new query_[256];/*SELECT * FROM s_vehicle_player WHERE vOwner = '%d' AND vSellCost = 0 AND `vFine`='0' LIMIT 5*/
		if (!GetPVarInt(playerid, "First_Enter")) {
			mysql_format(dbHandle, query_, sizeof query_, "SELECT * FROM s_vehicle_player WHERE (vOwner = '%d' AND vSellCost = 0) AND (vFine='0' OR vModel = '508') LIMIT 5", pInfo[playerid][pID]);
			mysql_tquery(dbHandle, query_, "OnPlayerTypeLoadVehicle", "iii", playerid, 0, 0);
		}
		
		format(query_, sizeof query_, "SELECT * FROM `s_christmas` WHERE `cID` = %d LIMIT 1", pInfo[playerid][pID]);
		mysql_tquery(dbHandle, query_, "LoadPlayerCristmas" , "i", playerid); 

		#if defined _promo_referal_inc
			format(query_, sizeof query_, "SELECT * FROM "TABLE_PROMO_TEMP" WHERE `promoID` = %d LIMIT 1", pInfo[playerid][pID]);
			mysql_tquery(dbHandle, query_, "OnLoadPlayerDataPromoCode" , "i", playerid); 
		#endif
		
		EatBar[playerid] = CreatePlayerProgressBar(playerid, 548.00, 58.00, 62.0, 3.9, COLOR_SERVER, 1000.0, BAR_DIRECTION_RIGHT);
		SetPlayerProgressBarMaxValue(playerid, EatBar[playerid], 1000.0);
		if (pInfo[playerid][PlayerSettings] & setShowEatBar) {
		    ShowPlayerProgressBar(playerid, EatBar[playerid]);
			SetPlayerProgressBarValue(playerid, EatBar[playerid], pInfo[playerid][Satiety]);
		}
		else HidePlayerProgressBar(playerid, EatBar[playerid]);
		
       	if (pInfo[playerid][punWarns] != 0) {
			if (pInfo[playerid][punWarns] <= gettime()) {
			    SendClientMessage(playerid, 0xFFCD00FF, !"- Время действия варна истекло! Приятной игры!");
			    pInfo[playerid][pWarns] 	=
				pInfo[playerid][punWarns] 	= 0; 
			}
		}

		if(pInfo[playerid][pRentHouse] != -1)
		{
			new days = floatround((pInfo[playerid][pRent][1]-gettime())/U_Day);
			if(days <= 0) 
			{
				    pInfo[playerid][pRentHouse] = -1;
					pInfo[playerid][pRent][0] = 0;
					pInfo[playerid][pRent][1] = 0;
					SavePlayerInteger(@p,"rent_0",0);
					SavePlayerInteger(@p,"rent_1",0);
					SavePlayerInteger(@p,"pRentHouse",-1);
					SCM(playerid, COLOR_LIGHTBLUE, "Вы выселились из дома!");

					new  query[128]; 
					format(query, sizeof query, "UPDATE `s_users` SET `pRentHouse`='-1', `rent_1` = '0', `rent_0` = '0' WHERE `pID`='%d'",  pInfo[playerid][pID]);
					mysql_query(dbHandle, query); 

					return 1;
			}
		}

		if(pInfo[playerid][pRentHouse] != -1)
		{
			new days = floatround((pInfo[playerid][pRent][1]-gettime())/U_Day);
			if(days) 
			{
				format(query_,sizeof(query_),"Вы арендуете дом. Напомнинаем вам, что до окончания срока аренды осталось %d дней(-я).",days);
				SCM(playerid,COLOR_LIGHTGREEN,query_);
				if(days < 3) SCM(playerid,COLOR_LIGHTGREEN,"Для продления аренды подойдите к дому и введите команду /rentable."),SetPVarInt(playerid,#P_HArend,1);
			}
			else 
			{
				SCM(playerid,COLOR_LIGHTGREEN,"Вы арендуете дом. Напомнинаем вам, что сегодня последний день аренды.");
				SCM(playerid,COLOR_LIGHTGREEN,"Для продления аренды подойдите к дому и введите команду /rent.");
				SetPVarInt(playerid,#P_HArend,1);
			}
		}

		//CheckPlayerUnWarn(playerid);
		CheckPlayerVipTime(playerid);
		CheckPlayerLicenseTime(playerid);
		CheckPlayerBoostTime(playerid);
        new
			playersip[16],
			strstre[50]; 
		GetPlayerIp(playerid, playersip, sizeof(playersip));
		
		gettime(hour, minute, second);
		
		format(strstre, sizeof strstre,"%d/%d/%d %d:%d",day,month,year,hour,minute);
        SetPlayerConnection(pInfo[playerid][pID], pInfo[playerid][pName], playersip);
		if (pInfo[playerid][pLastData] != curdate) {
			pInfo[playerid][pInGameDay] = 0;
			pInfo[playerid][pLastData] = curdate; 
			for(new i; i < sizeof(aInfo); i++) {
				if (aInfo[i][aType] != DAY_ACHIEV) continue; 
				pAchivID[playerid][i] = 0;
			}
		}

		format(query_,sizeof query_, "UPDATE `s_users` SET pWarns = '%d', punWarns = '%d', pGetonDate = '%s', InGameDay = '%d', pLogin = '1', pIp = '%s', pvIp = '%s', LastData = '%d' WHERE pID = '%d'",
			pInfo[playerid][pWarns], pInfo[playerid][punWarns], strstre, pInfo[playerid][pInGameDay], playersip, playersip, curdate, pInfo[playerid][pID]
		);
		mysql_tquery(dbHandle, query_, "", "");

		SendClientMessage(playerid, 0xFFCD00FF, !"Здравствуйте, уважаемый игрок!");
		new str_[40];
		format(str_, sizeof str_, "~w~Welcome ~n~~b~   %s", pInfo[playerid][pName]);
		GameTextForPlayer(playerid, str_, 5000, 1);

		StopAudioStreamForPlayer(playerid);

		/*if (!pInfo[playerid][pConfirmVK]) { VK Guard
			SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"У вас не подключен "col_VK"VK Guard!"); 
			SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Используйте {FFCD00}/mm"colwhi" -> [0] Настройки -> [10] Безопасность -> [0] VK Guard");
		}*/
		/*if (!pInfo[playerid][MailConfirm]) {
			SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"У вас не подтвержден {EB6B56}E-Mail "colwhi"Используйте {FFCD00}/mm"colwhi" -> [0] Настройки -> [10] Безопасность -> [1] E-Mail");
			SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Обратите внимание! В случае утери пароля, вы не сможете восстановить доступ с неподтвержденным {EB6B56}E-Mail");
		}*/

		ShowGoogleAuth(playerid);

		if(!GetString(pInfo[playerid][pPame], "None"))
    	{
	   		new format_str[200];
			format(format_str, sizeof(format_str),"%s", pInfo[playerid][pPame]);
			for(new i; i < strlen(format_str); i++) if(format_str[i] == '/') format_str[i] = '\n';
	    	pame_text[playerid] = CreateDynamic3DTextLabel(format_str, 0x999999FF, 0.0, 0.0, -1.0, 5, playerid,-1, 0, -1, -1, -1);
			format(format_str,sizeof(format_str), "Описание персонажа: {ffcc00}%s", pInfo[playerid][pPame]);
			for(new i; i < strlen(format_str); i++) if(format_str[i] == '/') format_str[i] = ' ';
			SendClientMessage(playerid, COLOR_GREY, format_str);
    	}

        OnPlayerLoginVoting(playerid);
		if (ZoneID != 0) GangZoneShowForAll(ZoneWar, 0xB2B2B2AA), GangZoneFlashForAll(ZoneWar,COLOR_RED);

		new sdate[32];
		format(sdate, sizeof sdate, "%d.%d.%d", year, month, day);

		if (pInfo[playerid][pDailyReward] == 0 && strcmp(pInfo[playerid][pRewardDate], sdate, true))
		{
		    SendClientMessage(playerid, COLOR_SERVER, "Ежедневный бонус:"colwhi" Зайдя завтра, Вы начнёте получать ежедневный бонус за вход, приятной игры!");
			format(pInfo[playerid][pRewardDate], 32, "%s", nextdate(year, month, day));
			SavePlayerString(playerid, "pRewardDate", pInfo[playerid][pRewardDate]);
			pInfo[playerid][pDailyReward] ++;
			SavePlayerInteger(playerid, "pDailyReward", pInfo[playerid][pDailyReward]);
			format(pInfo[playerid][pRewardRegDate], 32, "%s", sdate);
			SavePlayerString(playerid, "pRewardRegDate", pInfo[playerid][pRewardRegDate]);
		}
		else if (pInfo[playerid][pDailyReward] > 0 && !strcmp(pInfo[playerid][pRewardDate], sdate, true))
		{
			SendMes(playerid, COLOR_SERVER, "Ежедневный бонус:"colwhi" Вы вошли "collime"%d"colwhi" %s подряд, Ваше вознаграждение: "collime"$%d", pInfo[playerid][pDailyReward], Declension_ReturnWord(pInfo[playerid][pDailyReward], "день", "дня", "дней"), (1000 * pInfo[playerid][pDailyReward]));
			kLibGivePlayerMoney(playerid, 1000 * pInfo[playerid][pDailyReward], "ежедневный бонус 1");
			SetMoveCashServer(IN_SERVER, 1000 * pInfo[playerid][pDailyReward]);
			pInfo[playerid][pDailyReward] ++;
			SavePlayerInteger(playerid, "pDailyReward", pInfo[playerid][pDailyReward]);
			strdel(pInfo[playerid][pRewardDate], 0, 32);
			format(pInfo[playerid][pRewardDate], 32, "%s", nextdate(year, month, day));
			SavePlayerString(playerid, "pRewardDate", pInfo[playerid][pRewardDate]);
			strdel(pInfo[playerid][pRewardRegDate], 0, 32);
			format(pInfo[playerid][pRewardRegDate], 32, "%s", sdate);
			SavePlayerString(playerid, "pRewardRegDate", pInfo[playerid][pRewardRegDate]);
		}
		else if (pInfo[playerid][pDailyReward] > 0 && (strcmp(pInfo[playerid][pRewardDate], sdate, true) && strcmp(pInfo[playerid][pRewardRegDate], sdate, true)))
		{
			SendClientMessage(playerid, COLOR_SERVER, !"Ежедневный бонус:"colwhi" Вы пропустили ежедневный бонус, зайдите завтра чтобы начать получать его заново!");
			pInfo[playerid][pDailyReward] = 1;
			SavePlayerInteger(playerid, "pDailyReward", pInfo[playerid][pDailyReward]);
			strdel(pInfo[playerid][pRewardDate], 0, 32);
			format(pInfo[playerid][pRewardDate], 32, "%s", nextdate(year, month, day));
			SavePlayerString(playerid, "pRewardDate", pInfo[playerid][pRewardDate]);
			strdel(pInfo[playerid][pRewardRegDate], 0, 32);
			format(pInfo[playerid][pRewardRegDate], 32, "%s", sdate);
			SavePlayerString(playerid, "pRewardRegDate", pInfo[playerid][pRewardRegDate]);
		}
		
        if (strcmp("None", fInfo[ pInfo[playerid][pMember] ][fMessage], true) && pInfo[playerid][pMember] > 0) {
			SendClientMessage(playerid, COLOR_SERVER, !"- Сообщение от лидера фракции:");
			SendClientMessage(playerid, COLOR_SERVER, fInfo[ pInfo[playerid][pMember] ][fMessage]);
		} 

		SetPlayerScore(playerid, pInfo[playerid][pLevel]);
        SetPlayerHealth(playerid, pInfo[playerid][PlayerHealth]);
		invite_team(playerid, pInfo[playerid][pMember]);


		if (pInfo[playerid][pMember] > 0) {
			if (FractionInfo[ pInfo[playerid][pMember] ][fPosDuty][0] == 0.0) {
				pTemp[playerid][tDutyWork] = 1;
			}
		}  
		#if defined _ac_ser_inc 
			AC_Info[playerid][acSetPos] = GetTickCount() + 2850;

		#endif
			

		SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Не забывайте выполнять ежедневные достижения! (( "colserver"\"/achievement\""colwhi" ))");
		if (SPECPL_SPAWN_ON) TogglePlayerSpectating(playerid, 0);
		PlayerSpawnEx(playerid); 
		LoadMessagePlayerOffline(playerid);
		LoadPlayerDj(playerid);

		#if defined debug_mode 
			printf("[GM debug] [LOGIN] OnPlayerLoginAuth(%s(%d), %d, %d, %d, %s) NAME: %s", pInfo[playerid][pName], playerid); 
		#endif 
		
	}
	else return scmKick(playerid, "Для выхода из игры используйте /q(uit)");

	return 1;
}

publics: OnMySQL_QUERY(idx, playerid, str[])
{
    new
		rows;
	cache_get_row_count(rows);
	switch(idx)
	{ 
        case MYSQL_LOAD_CASINO:
        {
            new time = GetTickCount();
            if (!rows) return print("[Загрузка ...] Данные из Casino не получены!");
		    for(idx = 1; idx <= rows; idx++)
		    {
		    	cache_get_value_name_int(idx-1, "ID", CasinoInfo[idx][caID]);
		    	cache_get_value_name(idx-1, "Name", CasinoInfo[idx][caName], 32);
		    	cache_get_value_name_int(idx-1, "Mafia", CasinoInfo[idx][caMafia]);
		    	cache_get_value_name(idx-1, "Krupie", CasinoInfo[idx][caKrupie], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie2", CasinoInfo[idx][caKrupie2], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie3", CasinoInfo[idx][caKrupie3], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie4", CasinoInfo[idx][caKrupie4], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie5", CasinoInfo[idx][caKrupie5], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie6", CasinoInfo[idx][caKrupie6], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie7", CasinoInfo[idx][caKrupie7], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie8", CasinoInfo[idx][caKrupie8], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie9", CasinoInfo[idx][caKrupie9], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Krupie10", CasinoInfo[idx][caKrupie10], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Manager", CasinoInfo[idx][caManager], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Manager2", CasinoInfo[idx][caManager2], MAX_PLAYER_NAME);
		    	cache_get_value_name(idx-1, "Manager3", CasinoInfo[idx][caManager3], MAX_PLAYER_NAME);
		    	cache_get_value_name_float(idx-1, "posX", CasinoInfo[idx][caPos][0]);
		    	cache_get_value_name_float(idx-1, "posY", CasinoInfo[idx][caPos][1]);
		    	cache_get_value_name_float(idx-1, "posZ", CasinoInfo[idx][caPos][2]);
				new 
					data_[128],
					string_[128],
					map_icon = 25;
				//printf("Name: %s | IDX %d, cID %d", CasinoInfo[idx][caName], idx, CasinoInfo[idx][caID]);
				
				cache_get_value_name(idx-1, "enter", data_, sizeof data_), sscanf(data_,"p<|>a<f>[3]", CasinoInfo[idx][cEnter]);
				new mafiaName[16];
				switch(CasinoInfo[idx][caMafia]) {
					case INVALID_FRACTION_ID: mafiaName = "Свободна";
					case FRACTION_LCN: mafiaName = "LCN";
					case FRACTION_YAKUZA: mafiaName = "Yakuza";
					case FRACTION_RUSSIAN: mafiaName = "Русская Мафия";
				}
				format(string_, sizeof string_, ""colwhi"Казино:  "C_PODS"%s\n"colwhi"Управляет:  "C_PODS"%s", CasinoInfo[idx][caName], mafiaName);
				CasinoInfo[idx][cLabel] = CreateDynamic3DTextLabel(string_, 0xFFFFFFFF, 
					CasinoInfo[idx][cEnter][0], 
					CasinoInfo[idx][cEnter][1], 
					CasinoInfo[idx][cEnter][2]+0.7, 
					5.0,
					.worldid = 0, .interiorid = 0
				);
				if (CasinoInfo[idx][caID] == 1) map_icon = 43;
				else map_icon = 25;
				CasinoInfo[idx][cMapIcon] = CreateDynamicMapIcon(
					CasinoInfo[idx][cEnter][0], 
					CasinoInfo[idx][cEnter][1], 
					CasinoInfo[idx][cEnter][2], 
					map_icon, 0,
					.worldid = 0, .interiorid = 0
				); 
		    	TOTALCASINO++;
            } 
			CreateDynamic3DTextLabel("Устроиться: "colserver"\"Крупье\"", -1, 1963.7473,1063.2229,994.4688, 7.0, .worldid = 1, .interiorid = 10);
			CreateDynamic3DTextLabel("Устроиться: "colserver"\"Крупье\"", -1, 2150.5393,1603.1434,1006.1802, 7.0, .worldid = 999, .interiorid = 1);
			RouletCloakroom[0] = CreateDynamicPickup(1275, 23, 1963.7473,1063.2229,994.4688,-1); // Four Dragons
			RouletCloakroom[1] = CreateDynamicPickup(1275, 23, 2150.5393,1603.1434,1006.1802,-1); // Caligula

			caligula[0] = CreateDynamicPickup(19132,23,2233.9912,1714.6836,1012.3828,-1);// Выход Caligula
			caligula[1] = CreateDynamicPickup(19132,23,2196.9653,1677.1547,12.3672);// Вход Caligula

			dragons[0] = CreateDynamicPickup(19132,23,2018.2197,1017.6940,996.8750,-1);// Выход 4'Dragons
			dragons[1] = CreateDynamicPickup(19132,23,2019.3192,1007.7440,10.8203);// Вход 4'Dragons
            printf("[Загрузка ...] Данные из Casino получены! (%d шт.) Время: %d", TOTALCASINO, GetTickCount() - time);
		}  
		case MYSQL_LOAD_FRACTION_BANK://
		{
		    new time = GetTickCount();
		    if (!rows) return print("[Загрузка ...] Данные из Fraction Bank не получены!");
		    for(new bank = 1, position_mass[128]; bank <= rows; bank++)
		    {
		        cache_get_value_name_int(bank-1, "fID", FractionInfo[bank][fID]);
		        cache_get_value_name_int(bank-1, "fMats", FractionInfo[bank][fMaterials]);

				cache_get_value_name_int(bank-1, "fDrugs", FractionInfo[bank][fDrugs]);
				cache_get_value_name_int(bank-1, "fSpeedDrugs", FractionInfo[bank][fSpeedDrugs]);
		        cache_get_value_name_int(bank-1, "fMoney", FractionInfo[bank][fMoney]);
		        cache_get_value_name_int(bank-1, "fHeal", FractionInfo[bank][fHeal]);
		        cache_get_value_name_int(bank-1, "fLock", FractionInfo[bank][fLock]);
		        cache_get_value_name_int(bank-1, "fHouseLock", FractionInfo[bank][fHouseLock]);
		        cache_get_value_name_int(bank-1, "fRepute", FractionInfo[bank][fRepute]); 

		        cache_get_value_name(bank-1, "fPosWareHouse", position_mass, sizeof position_mass);
				sscanf(position_mass,"p<|>a<f>[3]", FractionInfo[bank][fPosWareHouse]);
				cache_get_value_name_int(bank-1, "fWorldWH", FractionInfo[bank][fWorldWH]);
				cache_get_value_name_int(bank-1, "fIntWH", FractionInfo[bank][fIntWH]);

				cache_get_value_name(bank-1, "fPosDuty", position_mass, sizeof position_mass);
				sscanf(position_mass,"p<|>a<f>[3]", FractionInfo[bank][fPosDuty]);
				cache_get_value_name_int(bank-1, "fWorldDuty", FractionInfo[bank][fWorldDuty]);
				cache_get_value_name_int(bank-1, "fIntDuty", FractionInfo[bank][fIntDuty]);
				cache_get_value_name_int(bank-1, "fPoints", FractionInfo[bank][fPoints]); 
				cache_get_value_name_int(bank-1, "fTaxState", FractionInfo[bank][fTaxState]); 
				cache_get_value_name_int(bank-1, "fCDPrize", FractionInfo[bank][fCDPrize]);
				FractionInfo[bank][fViolation][0] = FractionInfo[bank][fViolation][1] = FractionInfo[bank][fViolation][2] = FractionInfo[bank][fViolation][3] = 0; 
				if (FractionInfo[bank][fPosDuty][0] + FractionInfo[bank][fPosDuty][1] + FractionInfo[bank][fPosDuty][2] != 0.0)
				{
					CreateDynamic3DTextLabel(
						""colmaline"[ Переодеться ]", -1, 
						FractionInfo[bank][fPosDuty][0], 
						FractionInfo[bank][fPosDuty][1], 
						FractionInfo[bank][fPosDuty][2], 
						10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 1, 
						FractionInfo[bank][fWorldDuty], 
						FractionInfo[bank][fIntDuty]
					);
					CreateDynamicPickup(1275, 23, 
						FractionInfo[bank][fPosDuty][0], 
						FractionInfo[bank][fPosDuty][1], 
						FractionInfo[bank][fPosDuty][2],
						FractionInfo[bank][fWorldDuty], 
						FractionInfo[bank][fIntDuty]
					);
					FractionInfo[bank][fDutySphere] = CreateDynamicSphere(
					FractionInfo[bank][fPosDuty][0], 
					FractionInfo[bank][fPosDuty][1], 
					FractionInfo[bank][fPosDuty][2], 1, 
					FractionInfo[bank][fWorldDuty], 
					FractionInfo[bank][fIntDuty]
					);	  
				}  
				if (FractionInfo[bank][fPosWareHouse][0] + FractionInfo[bank][fPosWareHouse][1] + FractionInfo[bank][fPosWareHouse][2] != 0.0)
				{// FractionInfo[bank][fPosWareHouse][0] + FractionInfo[bank][fPosWareHouse][1] + FractionInfo[bank][fPosWareHouse][2] != 0.0
				    new
				        string_[320];
					
				    if (FractionInfo[bank][fID] == FRACTION_LSPD || FractionInfo[bank][fID] == FRACTION_FBI 
						|| FractionInfo[bank][fID] == FRACTION_SFPD || FractionInfo[bank][fID] == FRACTION_LVPD) {
						format(string_, sizeof string_, "{FFD700}Склад оружия\nМатериалов: %d ед.\n \n{CAFA0A}Используйте: ALT",
							FractionInfo[bank][fMaterials]
						);
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, 
							FractionInfo[bank][fPosWareHouse][0], 
							FractionInfo[bank][fPosWareHouse][1], 
							FractionInfo[bank][fPosWareHouse][2], 
							10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, 
							FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]
						);
				    } 
				    else if (FractionInfo[bank][fID] == FRACTION_LCN)
					{
						format(string_, sizeof string_, "{FFD700}Склад La Cosa Nostra\n{FFFFFF}Материалы: {F58B11}%d\n{FFFFFF}Аптечек: {F58B11}%d\n{FFFFFF}Деньги: {F58B11}$%s\n\n{CAFA0A}Используйте: ALT",
						FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], convert_money(FractionInfo[bank][fMoney]));
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    }
				    else if (FractionInfo[bank][fID] == FRACTION_YAKUZA)
				    {
						format(string_, sizeof string_, "{FFD700}Склад Yakuza\n{FFFFFF}Материалы: {F58B11}%d\n{FFFFFF}Аптечек: {F58B11}%d\n{FFFFFF}Деньги: {F58B11}$%s\n\n{CAFA0A}Используйте: ALT",
						FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], convert_money(FractionInfo[bank][fMoney]));
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    }
				    else if (FractionInfo[bank][fID] == FRACTION_CITYHALL) 
				    {
						format(string_, sizeof string_, "{FFD700}Казна\n{FFFFFF}Денег: {F58B11}$%s\n{FFFFFF}Налог: {F58B11}%d\n\n{CAFA0A}Используйте: ALT",
						convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fTaxState]);
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    }
					else if (FractionInfo[bank][fID] == FRACTION_PIRUS)
				    {
						format(string_, sizeof string_, "{FFD700}Склад The Pirus\n\
							"colwhi"Кол-во территорий: {F58B11}%d\n\
							"colwhi"Кол-во граффити: {F58B11}%d\n\
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}%s\n\
							"colwhi"G-Points:  {F58B11}%d points\n\n\
							{CAFA0A}Используйте: ALT", TotalGzB, tFractionGraffiti[FRACTION_PIRUS], FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
                        FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
					}
				    else if (FractionInfo[bank][fID] == FRACTION_BALLAS)
				    {
						format(string_, sizeof string_, "{FFD700}Склад Ballas\n\
							"colwhi"Кол-во территорий: {F58B11}%d\n\
							"colwhi"Кол-во граффити: {F58B11}%d\n\
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\
							"colwhi"G-Points:  {F58B11}%d points\n\n\
							{CAFA0A}Используйте: ALT", TotalGzB, tFractionGraffiti[FRACTION_BALLAS], FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
                        FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
					}
				    else if (FractionInfo[bank][fID] == FRACTION_VAGOS)
				    {
						format(string_, sizeof string_, "{FFD700}Склад Vagos\n\
							"colwhi"Кол-во территорий: {F58B11}%d\n\
							"colwhi"Кол-во граффити: {F58B11}%d\n\
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\
							"colwhi"G-Points:  {F58B11}%d points\n\n\
							{CAFA0A}Используйте: ALT", TotalGzV, tFractionGraffiti[FRACTION_VAGOS], FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
                        FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
					}
				    else if (FractionInfo[bank][fID] == FRACTION_RUSSIAN) 
				    {
						format(string_, sizeof string_, "{FFD700}Склад Русской мафии\n{FFFFFF}Материалы: {F58B11}%d\n{FFFFFF}Аптечек: {F58B11}%d\n{FFFFFF}Деньги: {F58B11}$%s\n\n{CAFA0A}Используйте: ALT",
						FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], convert_money(FractionInfo[bank][fMoney]));
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    }
				    else if (FractionInfo[bank][fID] == FRACTION_GROVE)
				    {
						format(string_, sizeof string_, "{FFD700}Склад Grove\n"colwhi"Кол-во территорий: {F58B11}%d\n"colwhi"Кол-во граффити: {F58B11}%d\n\
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\
							"colwhi"G-Points:  {F58B11}%d points\n\n\
							{CAFA0A}Используйте: ALT", TotalGzG, tFractionGraffiti[FRACTION_GROVE], FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
				        FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    }
				    else if (FractionInfo[bank][fID] == FRACTION_AZTEC)
				    {
						format(string_, sizeof string_, "{FFD700}Склад Aztec\n\
							"colwhi"Кол-во территорий: {F58B11}%d\n\
							"colwhi"Кол-во граффити: {F58B11}%d\n\
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\
							"colwhi"G-Points:  {F58B11}%d points\n\n\
							{CAFA0A}Используйте: ALT", TotalGzA, tFractionGraffiti[FRACTION_AZTEC], FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
				        FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    }
				    else if (FractionInfo[bank][fID] == FRACTION_RIFA)
				    {
						format(string_, sizeof string_, "{FFD700}Склад Rifa\n\
							"colwhi"Кол-во территорий: {F58B11}%d\n\
							"colwhi"Кол-во граффити: {F58B11}%d\n\
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\
							"colwhi"G-Points:  {F58B11}%d points\n\n\
							{CAFA0A}Используйте: ALT", TotalGzR, tFractionGraffiti[FRACTION_RIFA], FractionInfo[bank][fMaterials], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
                        FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
					} 
					else if (FractionInfo[bank][fID] == FRACTION_MONGOLS_MC) {
						format(string_, sizeof string_, "{FFD700}Склад Mongols MC\n\ 
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
							"colwhi"Легкие наркотики: {F58B11}%d гр\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\n\
							{CAFA0A}Используйте: ALT", FractionInfo[bank][fMaterials], FractionInfo[bank][fDrugs], FractionInfo[bank][fSpeedDrugs], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, 
							FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, 
							FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]
						);
						format(string_, sizeof string_, "На складе:\n\n\
							"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
							"colwhi"Легкие наркотики: {F58B11}%d гр\n\n{CAFA0A}Используйте: ALT", FractionInfo[bank][fDrugs], FractionInfo[bank][fSpeedDrugs]
						);
						FractionInfo[bank][fLabText] = CreateDynamic3DTextLabel(string_, -1, 
							2025.2013,-1234.9845,1147.3027, 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, 
							FractionInfo[bank][fWorldWH], DRUGS_LAB_INT
						);
						FractionInfo[bank][fLabSphere] = CreateDynamicSphere(2025.2013,-1234.9845,1147.3027, 1.5, FractionInfo[bank][fWorldWH], DRUGS_LAB_INT);
				    	CreateDynamicTrigger(2025.2013,-1234.9845,1147.3027, FractionInfo[bank][fWorldWH], DRUGS_LAB_INT, 1);
					}//fLabSphere // 2025.2013,-1234.9845,1147.3027//fLabText
					else if (FractionInfo[bank][fID] == FRACTION_BANDIDOS_MC) {
						format(string_, sizeof string_, "{FFD700}Склад Bandidos MC\n\ 
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
							"colwhi"Легкие наркотики: {F58B11}%d гр\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\n\
							{CAFA0A}Используйте: ALT", FractionInfo[bank][fMaterials], FractionInfo[bank][fDrugs], FractionInfo[bank][fSpeedDrugs], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
						format(string_, sizeof string_, "На складе:\n\n\
							"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
							"colwhi"Легкие наркотики: {F58B11}%d гр\n\n{CAFA0A}Используйте: ALT", FractionInfo[bank][fDrugs], FractionInfo[bank][fSpeedDrugs]
						);
						FractionInfo[bank][fLabText] = CreateDynamic3DTextLabel(string_, -1, 
							2025.2013,-1234.9845,1147.3027, 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, 
							FractionInfo[bank][fWorldWH], DRUGS_LAB_INT
						);
						FractionInfo[bank][fLabSphere] = CreateDynamicSphere(2025.2013,-1234.9845,1147.3027, 1.5, FractionInfo[bank][fWorldWH], DRUGS_LAB_INT);
				    	CreateDynamicTrigger(2025.2013,-1234.9845,1147.3027, FractionInfo[bank][fWorldWH], DRUGS_LAB_INT, 1);
					}
					else if (FractionInfo[bank][fID] == FRACTION_OUTLAWS_MC) {
						format(string_, sizeof string_, "{FFD700}Склад Outlaws MC\n\ 
							"colwhi"Материалы: {F58B11}%d\n\
							"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
							"colwhi"Легкие наркотики: {F58B11}%d гр\n\
							"colwhi"Аптечек: {F58B11}%d\n\
							"colwhi"Деньги: {F58B11}$%s\n\n\
							{CAFA0A}Используйте: ALT", FractionInfo[bank][fMaterials], FractionInfo[bank][fDrugs], FractionInfo[bank][fSpeedDrugs], FractionInfo[bank][fHeal], 
							convert_money(FractionInfo[bank][fMoney]), FractionInfo[bank][fPoints]
						);
						FractionInfo[bank][fText] = CreateDynamic3DTextLabel(string_, -1, FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
						format(string_, sizeof string_, "На складе:\n\n\
							"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
							"colwhi"Легкие наркотики: {F58B11}%d гр\n\n{CAFA0A}Используйте: ALT", FractionInfo[bank][fDrugs], FractionInfo[bank][fSpeedDrugs]
						);
						FractionInfo[bank][fLabText] = CreateDynamic3DTextLabel(string_, -1, 
							2025.2013,-1234.9845,1147.3027, 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, 
							FractionInfo[bank][fWorldWH], DRUGS_LAB_INT
						);
						FractionInfo[bank][fLabSphere] = CreateDynamicSphere(2025.2013,-1234.9845,1147.3027, 1.5, FractionInfo[bank][fWorldWH], DRUGS_LAB_INT);
				    	CreateDynamicTrigger(2025.2013,-1234.9845,1147.3027, FractionInfo[bank][fWorldWH], DRUGS_LAB_INT, 1);
					}
				    FractionInfo[bank][fSphere] = CreateDynamicSphere(FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], 1.5, FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH]);
				    CreateDynamicTrigger(FractionInfo[bank][fPosWareHouse][0], FractionInfo[bank][fPosWareHouse][1], FractionInfo[bank][fPosWareHouse][2], FractionInfo[bank][fWorldWH], FractionInfo[bank][fIntWH], 1);
				}
				TOTALFRACTIONBANK++;
			}
			printf("[Загрузка ...] Данные из s_fractionbank получены! (%d складов) Время: %d",TOTALFRACTIONBANK-1, GetTickCount() - time);
		} 
		case MYSQL_LOAD_FRACTION:
		{
		    new time = GetTickCount();
		    if (!rows) return print("[Загрузка ...] Данные из Fraction не получены!");
		    for(new frac = 1; frac <= rows; frac++)
		    {
		        cache_get_value_name_int(frac - 1, "fID", fInfo[frac][fID]);
		        cache_get_value_name(frac - 1, "fName", fInfo[frac][fName], 32);
		        cache_get_value_name(frac - 1, "fLeader", fInfo[frac][fLeader], MAX_PLAYER_NAME);
		        cache_get_value_name(frac - 1, "fAssistant", fInfo[frac][fAssistant], MAX_PLAYER_NAME);
		        new
					helpers_mass[32],
					salary_mass[128],
					fraction_cost[32];
					
		        cache_get_value_name(frac - 1, "fHelper", helpers_mass, 32);
	 			sscanf(helpers_mass, "p<,>a<d>[7]", fInfo[frac][fHelper]);
		        cache_get_value_name(frac - 1, "fCost", fraction_cost, 32);
	 			sscanf(fraction_cost, "p<|>a<d>[4]", fInfo[frac][fCost]);

				cache_get_value_name(frac - 1, "fWarehouse", salary_mass, sizeof salary_mass);
	 			sscanf(salary_mass, "p<|>a<d>[20]", fInfo[frac][fWarehouse]); 
				 
                cache_get_value_name_int(frac - 1, "fFreeze", fInfo[frac][fFreeze]);
                cache_get_value_name_int(frac - 1, "fAntiTK", fInfo[frac][fAntiTK]);
	 			cache_get_value_name(frac - 1, "rank_0", fFractionRank[frac][0], 25);
	 			cache_get_value_name(frac - 1, "rank_1", fFractionRank[frac][1], 25);
	 			cache_get_value_name(frac - 1, "rank_2", fFractionRank[frac][2], 25);
	 			cache_get_value_name(frac - 1, "rank_3", fFractionRank[frac][3], 25);
	 			cache_get_value_name(frac - 1, "rank_4", fFractionRank[frac][4], 25);
	 			cache_get_value_name(frac - 1, "rank_5", fFractionRank[frac][5], 25);
	 			cache_get_value_name(frac - 1, "rank_6", fFractionRank[frac][6], 25);
	 			cache_get_value_name(frac - 1, "rank_7", fFractionRank[frac][7], 25);
	 			cache_get_value_name(frac - 1, "rank_8", fFractionRank[frac][8], 25);
	 			cache_get_value_name(frac - 1, "rank_9", fFractionRank[frac][9], 25);
	 			cache_get_value_name(frac - 1, "rank_10", fFractionRank[frac][10], 25);
	 			cache_get_value_name(frac - 1, "rank_11", fFractionRank[frac][11], 25);
	 			cache_get_value_name(frac - 1, "rank_12", fFractionRank[frac][12], 25);
	 			cache_get_value_name(frac - 1, "rank_13", fFractionRank[frac][13], 25);
	 			cache_get_value_name(frac - 1, "rank_14", fFractionRank[frac][14], 25);
	 			cache_get_value_name(frac - 1, "fSalary", salary_mass, 128);
	 			sscanf(salary_mass, "p<,>a<d>[15]", fFractionSalary[frac]);
	 			cache_get_value_name(frac - 1, "fMessage", fInfo[frac][fMessage], 256);
	 			
				TOTAL_FRACTION++;
			}
			printf("[Загрузка ...] Данные из s_fraction получены! (%d шт.) Время: %d",TOTAL_FRACTION-1, GetTickCount() - time);
		}  
		case MYSQL_LOGIN_ADMINS://14:
		{
		    if (!rows) return 1;
		    new 
				query[64] ;
		    cache_get_value_name(0, "password", query, 64);
		    SetPVarString(playerid,"password", query); 
			
			if (!strcmp(query, "qwerty", true))
			{
				ShowPlayerDialog(playerid, D_ADMIN_FUNC_15, DIALOG_STYLE_PASSWORD, 
					""colserver"Авторизация: "colwhi"Администратор", 
					""colwhi"Введите пароль\n\nПароль должен состоять из латинских букв и цифр\n\tразмером от 6 до 15 символов", 
					"Вход", "Отмена"
				);
				SetPVarInt(playerid, "AdminloginServer", 1);
			}
		    else
			{
				ShowPlayerDialog(playerid, D_ADMIN_FUNC_15, DIALOG_STYLE_PASSWORD, 
					""colserver"Авторизация: "colwhi"Администратор", 
					""colwhi"Введите пароль\n\nПароль должен состоять из латинских букв и цифр\n\tразмером от 6 до 15 символов", 
					"Вход", "Отмена"
				);
				new
					admins_ip[16];
				cache_get_value_name(0, "IP", admins_ip, sizeof admins_ip);
				SetPVarString(playerid, "adminsIP", admins_ip);

				if (admins_ip[0] == 0) {
					t_string[0] = EOS;

					mysql_format(dbHandle, t_string, sizeof t_string, "\
						UPDATE `s_admin` SET  IP = '%s' WHERE Name = '%s' LIMIT 1", 
						pInfo[playerid][RegIP], pInfo[playerid][pName]
					);
					mysql_tquery(dbHandle, t_string, "", ""), t_string[0] = EOS;
				} 
				SetPVarInt(playerid, "AdminloginServer", 2);
			}
  		}  
		case MYSQL_SELECT_GETON:
		{
		    if (!rows) return SendClientMessage(playerid, COLOR_GREY, !"Аккаунт не найден!");
		    new str_[32];
			cache_get_value_name(0, "pGetonDate", str_, 32);
			new string_[64];
			format(string_,sizeof(string_),"Ник: %s | Последний вход: %s", str, str_);
			SendClientMessage(playerid,COLOR_BLUE, string_);
		}
		case 27:
		{
		    if (!rows)
			{
				ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_MSGBOX, "Ошибка", "Вы ошиблись при вводе кодов", "Готово", "");
				DeletePVar(playerid,"d_code1");
				DeletePVar(playerid,"d_code2");
				return 1;
			}
		    new donate,
				string_[256], 
				query_[128];
		    cache_get_value_name_int(0, "money", donate);
		    SendClientMessage(playerid, COLOR_GOLD, !"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
			//Старый donatecode
			/*format(string_,sizeof(string_),"На ваш банковский счет зачислено: $%d", donate);
			SendClientMessage(playerid,COLOR_GOLD,string_);

		    format(string_,sizeof(string_),"Старый баланс: $%d", pInfo[playerid][pBank]);
			SendClientMessage(playerid,COLOR_YELLOW,string_);

			//pInfo[playerid][pBank] += donate;
			SavePlayerInteger(playerid, "pBank", pInfo[playerid][pBank]);
			LogMoney(playerid, donate, "донат новый баланс");

			format(string_,sizeof(string_),"Новый баланс: $%d", convert_money(pInfo[playerid][pBank]));
			SendClientMessage(playerid,COLOR_YELLOW,string_);*/
			//новый
			format(string_,sizeof(string_),"На ваш банковский счет зачислено: %d$", donate);
			SendClientMessage(playerid,COLOR_GOLD,string_);
		    format(string_,sizeof(string_),"Старый баланс: %d$", pInfo[playerid][pBank]);
			SendClientMessage(playerid,COLOR_YELLOW,string_);
			pInfo[playerid][pBank] += donate;
			SavePlayerInteger(playerid, "pBank", pInfo[playerid][pBank]);
			format(string_,sizeof(string_),"Новый баланс: %d$", pInfo[playerid][pBank]);
			SendClientMessage(playerid,COLOR_YELLOW,string_);

			SendClientMessage(playerid, COLOR_GOLD, !"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");  

			mysql_format(dbHandle, query_, sizeof query_, "UPDATE `s_donate` SET name = '%s', used = '1' WHERE code_one = '%d' AND code_two = '%d'",pInfo[playerid][pName], GetPVarInt(playerid,"d_code1"), GetPVarInt(playerid,"d_code2"));
			mysql_tquery(dbHandle, query_, "", "");
			DeletePVar(playerid,"d_code1");
			DeletePVar(playerid,"d_code2");
		}
		case MYSQL_LOAD_FARMS:
        {
            new
				time = GetTickCount(),
				data_[128];
            if (!rows) return print("[Загрузка ...] Данные из Farms не получены!");
		    for(new F_IDX = 1; F_IDX <= rows; F_IDX++)
		    {
		    	cache_get_value_name_int(F_IDX-1, "id", FarmInfo[F_IDX][fID]);
		    	cache_get_value_name(F_IDX-1, "owner", FarmInfo[F_IDX][fOwner], MAX_PLAYER_NAME);
		    	
		    	cache_get_value_name(F_IDX-1, "menu", data_, 128), sscanf(data_,"p<|>a<f>[3]", FarmInfo[F_IDX][fMenu]);
		    	cache_get_value_name(F_IDX-1, "cloakroom", data_, 128), sscanf(data_,"p<|>a<f>[3]", FarmInfo[F_IDX][fCloakroom]);
		    	
		    	cache_get_value_name_int(F_IDX-1, "bank", FarmInfo[F_IDX][fBank]);
		    	cache_get_value_name_int(F_IDX-1, "landtax", FarmInfo[F_IDX][fLandTax]);
		    	cache_get_value_name_int(F_IDX-1, "zp", FarmInfo[F_IDX][fZp]);
		    	
		    	cache_get_value_name_int(F_IDX-1, "grain_price", FarmInfo[F_IDX][fGrain_Price]);
		    	cache_get_value_name_int(F_IDX-1, "grain", FarmInfo[F_IDX][fGrain]);
		    	cache_get_value_name_int(F_IDX-1, "grain_sown", FarmInfo[F_IDX][fGrain_Sown]);
		    	
		    	cache_get_value_name_int(F_IDX-1, "prods_selling", FarmInfo[F_IDX][fProds_Selling]);
		    	cache_get_value_name_int(F_IDX-1, "prods", FarmInfo[F_IDX][fProds]);
		    	cache_get_value_name_int(F_IDX-1, "prods_price", FarmInfo[F_IDX][fProds_Price]);
		    	
		    	cache_get_value_name(F_IDX-1, "deputy_1", FarmInfo[F_IDX][fDeputy_1], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "deputy_2", FarmInfo[F_IDX][fDeputy_2], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "deputy_3", FarmInfo[F_IDX][fDeputy_3], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "farmer_1", FarmInfo[F_IDX][fFarmer_1], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "farmer_2", FarmInfo[F_IDX][fFarmer_2], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "farmer_3", FarmInfo[F_IDX][fFarmer_3], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "farmer_4", FarmInfo[F_IDX][fFarmer_4], MAX_PLAYER_NAME);
		    	cache_get_value_name(F_IDX-1, "farmer_5", FarmInfo[F_IDX][fFarmer_5], MAX_PLAYER_NAME);

				new
					action_sum[64],
					string[256],
					string_[128];
					
                cache_get_value_name(F_IDX-1, "auctions", action_sum, 64);
	 			sscanf(action_sum, "p<,>a<d>[5]", FarmInfo[F_IDX][fAuction]);

				cache_get_value_name(F_IDX-1, "auction_name", FarmInfo[F_IDX][fAuctionName], MAX_PLAYER_NAME);

				cache_get_value_name(F_IDX-1, "farmBizStats", string, 128);
				sscanf(string, "p<|>ddddd", FarmBizStats[F_IDX][0], FarmBizStats[F_IDX][1], FarmBizStats[F_IDX][2], FarmBizStats[F_IDX][3], FarmBizStats[F_IDX][4]);
				cache_get_value_name(F_IDX-1, "farmBizStatsDate", string, 256);
				sscanf(string, "p<|>ddddd", FarmBizStatsDate[F_IDX][0], FarmBizStatsDate[F_IDX][1], FarmBizStatsDate[F_IDX][2], FarmBizStatsDate[F_IDX][3], FarmBizStatsDate[F_IDX][4]);



		    	FarmInfo[F_IDX][fPickup][0] = CreateDynamicPickup(1239, 23, FarmInfo[F_IDX][fMenu][0], FarmInfo[F_IDX][fMenu][1], FarmInfo[F_IDX][fMenu][2]);
		        FarmInfo[F_IDX][fPickup][1] = CreateDynamicPickup(1275, 23, FarmInfo[F_IDX][fCloakroom][0], FarmInfo[F_IDX][fCloakroom][1], FarmInfo[F_IDX][fCloakroom][2]);
		        FarmInfo[F_IDX][fSphere] = CreateDynamicSphere(FarmInfo[F_IDX][fMenu][0], FarmInfo[F_IDX][fMenu][1], FarmInfo[F_IDX][fMenu][2], 15.5,0,0);
				format(string_, sizeof string_, "Ферма ID: {FFFFFF}%d\n{DDB201}Информация: {FFFFFF}/finfo",F_IDX - 1);
				FarmInfo[F_IDX][fLabel] = CreateDynamic3DTextLabel(string_, COLOR_ORANGE, FarmInfo[F_IDX][fMenu][0], FarmInfo[F_IDX][fMenu][1], FarmInfo[F_IDX][fMenu][2] + 1, 20.0);
				CreateDynamicMapIcon(FarmInfo[F_IDX][fMenu][0], FarmInfo[F_IDX][fMenu][1], FarmInfo[F_IDX][fMenu][2], 56, 0);
		    	TOTALFARM++;
            }
            printf("[Загрузка ...] Данные из Farm получены! (%d шт.) Время: %d m.s",TOTALFARM, GetTickCount() - time);
		}
		case 29:
		{
			gettime(hour, minute, second);
			strmid(FarmInfo[playerid][fOwner],"None",0,strlen("None"),MAX_PLAYER_NAME);
			strmid(FarmInfo[playerid][fDeputy_1],"None",0,strlen("None"),MAX_PLAYER_NAME);
			strmid(FarmInfo[playerid][fDeputy_2],"None",0,strlen("None"),MAX_PLAYER_NAME);
			strmid(FarmInfo[playerid][fDeputy_3],"None",0,strlen("None"),MAX_PLAYER_NAME);
			SaveFermIDFarmers(playerid);
			FarmInfo[playerid][fLandTax] = 12000;
			FarmInfo[playerid][fBank] = (FarmInfo[playerid][fAuction][0]/100)*30;
			FarmInfo[playerid][fProds] = 0;
			FarmInfo[playerid][fZp] = 30;
			FarmInfo[playerid][fGrain_Price] = 5;
			FarmInfo[playerid][fGrain] = 0;
			FarmInfo[playerid][fGrain_Sown] = 0;
			FarmInfo[playerid][fProds_Selling] = 1;
			FarmInfo[playerid][fProds_Price] = 21;
			strmid(FarmInfo[playerid][fOwner],FarmInfo[playerid][fAuctionName], 0, strlen(FarmInfo[playerid][fAuctionName]), MAX_PLAYER_NAME);
		 	new select_id, query_[128];
		    sscanf(FarmInfo[playerid][fAuctionName], "u", select_id);
     		if (IsPlayerConnected(select_id))
		 	{
			 	SendClientMessage(select_id,COLOR_WHITE, !"Вы приобрели Ферму с аукциона!");
			 	pTemp[select_id][JobInFarmRank] = 4;
			 	GetPlayerFarm(select_id);
			}
     		else
     		{
				mysql_format(dbHandle, query_, sizeof query_, "SELECT `pID` FROM `s_users` WHERE `Name` = '%e' LIMIT 1", FarmInfo[playerid][fAuctionName]);
    			mysql_tquery(dbHandle, query_, "OnPlayerSelectTextType", "iis", sqlTextBuyFerm, playerid, FarmInfo[playerid][fAuctionName]);  
			}
			SaveFermID(playerid);
			strmid(FarmInfo[playerid][fAuctionName], "None", 0, strlen("None"), 10);
			FarmInfo[playerid][fAuction][0] = 0;
			FarmInfo[playerid][fAuction][1] = 0;
			FarmInfo[playerid][fAuction][2] = 0;
			FarmInfo[playerid][fAuction][3] = 0;
			SaveActionsFerm(playerid);
		}
		case MYSQL_LOAD_OTHER_STALL:
		{
		    new time = GetTickCount();
		    if (!rows) return print("[Загрузка ...] Данные из Stall не получены!");
		   /* new TOTALPHONE = 0,
				string_[64];*/
		    for(new S_IDX = 0, TempStallInfo[STALL_e], Float:stallPos[4]; S_IDX < rows; S_IDX++) {
		        cache_get_value_name_int(S_IDX, "id", TempStallInfo[stallID]);
                cache_get_value_name_float(S_IDX, "pos_x", stallPos[0]);
                cache_get_value_name_float(S_IDX, "pos_y", stallPos[1]);
                cache_get_value_name_float(S_IDX, "pos_z", stallPos[2]);
                cache_get_value_name_float(S_IDX, "pos_r", stallPos[3]);
                cache_get_value_name_int(S_IDX, "type", TempStallInfo[stallType]);

				TempStallInfo[stallType] = random(2) + 1;
				CreateStall(S_IDX, TempStallInfo[stallType], stallPos[0], stallPos[1], stallPos[2], stallPos[3], .stream_distance = 200.0);

                /*if (StallInfo[S_IDX][stType] == 1)
                {
		    		StallInfo[S_IDX][stObject] = CreateDynamicObject(1340, StallInfo[S_IDX][stPos][0], StallInfo[S_IDX][stPos][1], StallInfo[S_IDX][stPos][2], 0, 0, StallInfo[S_IDX][stPos][3]);
		    		StallInfo[S_IDX][stText] = CreateDynamic3DTextLabel( "Не работает", 0xFF8C37FF, StallInfo[S_IDX][stPos][0], StallInfo[S_IDX][stPos][1], StallInfo[S_IDX][stPos][2]+1, 8.0 );
		        }
		        else//объект таксафона найти
		        {
		            TOTALPHONE++;
		            StallInfo[S_IDX][stObject] = CreateDynamicObject(1216, StallInfo[S_IDX][stPos][0], StallInfo[S_IDX][stPos][1], StallInfo[S_IDX][stPos][2], 0, 0, StallInfo[S_IDX][stPos][3]);
					format(string_, sizeof string_, "Таксафон: %d",TOTALPHONE);
		    		StallInfo[S_IDX][stText] = CreateDynamic3DTextLabel(string_, 0xFF8C37FF, StallInfo[S_IDX][stPos][0], StallInfo[S_IDX][stPos][1], StallInfo[S_IDX][stPos][2] + 1, 8.0 );
		        }
		        StallInfo[TOTALSTALL][stArea] = CreateDynamicSphere(StallInfo[TOTALSTALL][stPos][0], StallInfo[TOTALSTALL][stPos][1], StallInfo[TOTALSTALL][stPos][2],1.5,0,0);

				TOTALSTALL++;*/
			}
			printf("[Загрузка ...] Данные из Stall получены! (%d шт.) Время: %d",TOTALSTALL, GetTickCount() - time);
		}
		case MYSQL_LOAD_GANGZONE:
		{
		    new time = GetTickCount();
		    if (!rows) return print("[Загрузка ...] Данные из Gangzone не получены!");
		    for(new G_IDX = 1; G_IDX <= rows; G_IDX++)
		    {
		    	cache_get_value_name_int(G_IDX-1, "id", GZInfo[G_IDX][gID]);
		    	cache_get_value_name_float(G_IDX-1, "coord_one", GZInfo[G_IDX][gCoords][0]);
		    	cache_get_value_name_float(G_IDX-1, "coord_two", GZInfo[G_IDX][gCoords][1]);
		    	cache_get_value_name_float(G_IDX-1, "coord_three", GZInfo[G_IDX][gCoords][2]);
		    	cache_get_value_name_float(G_IDX-1, "coord_four", GZInfo[G_IDX][gCoords][3]);
		    	cache_get_value_name_int(G_IDX-1, "gang_owner", GZInfo[G_IDX][gFrakVlad]);
		    	TOTALGZ++;
		    	GZInfo[G_IDX][gTimer] = 0;
				GZInfo[G_IDX][gZone] = GangZoneCreate(GZInfo[G_IDX][gCoords][0],GZInfo[G_IDX][gCoords][1],GZInfo[G_IDX][gCoords][2],GZInfo[G_IDX][gCoords][3]);
			}
			TotalGzB = 0, TotalGzV = 0, TotalGzG = 0, TotalGzA = 0, TotalGzR = 0;
			for(new i = 1; i <= TOTALGZ; i++)
			{
				if (GZInfo[i][gFrakVlad] == 12) TotalGzB++;
				if (GZInfo[i][gFrakVlad] == 13) TotalGzV++;
				if (GZInfo[i][gFrakVlad] == 15) TotalGzG++;
				if (GZInfo[i][gFrakVlad] == 17) TotalGzA++;
				if (GZInfo[i][gFrakVlad] == 18) TotalGzR++;
			}
			printf("[Загрузка ...] Данные из Gangzone получены! (%d шт.) Время: %d",TOTALGZ, GetTickCount() - time);
		}
		case MYSQL_LOAD_GRAFFITI:
		{
		    new time = GetTickCount();
		    if (!rows) return print("[Загрузка ...] Данные из Graffiti не получены!");
		    tFractionGraffiti[FRACTION_GROVE] = tFractionGraffiti[FRACTION_BALLAS] = tFractionGraffiti[FRACTION_RIFA] = tFractionGraffiti[FRACTION_AZTEC] = tFractionGraffiti[FRACTION_PIRUS] = tFractionGraffiti[FRACTION_VAGOS] = 0;
		    for(new graffiti = 1; graffiti <= rows; graffiti++)
			{
		        cache_get_value_name_int(graffiti-1, "tID", TagInfo[graffiti][tID]);
		    	cache_get_value_name_float(graffiti-1, "tX", TagInfo[graffiti][tPos][0]);//18659 - Groove
		    	cache_get_value_name_float(graffiti-1, "tY", TagInfo[graffiti][tPos][1]);//18661 - Aztec
		    	cache_get_value_name_float(graffiti-1, "tZ", TagInfo[graffiti][tPos][2]);//18663 - Rifa
		    	cache_get_value_name_float(graffiti-1, "tRX", TagInfo[graffiti][tRPos][0]);//18664 - Ballas
		    	cache_get_value_name_float(graffiti-1, "tRY", TagInfo[graffiti][tRPos][1]); //18665 - Vagos
		    	cache_get_value_name_float(graffiti-1, "tRZ", TagInfo[graffiti][tRPos][2]);
		        cache_get_value_name_int(graffiti-1, "tFraction", TagInfo[graffiti][tFraction]);
				TOTALGRAFFITI++;
            	TagInfo[graffiti][tSphere] = CreateDynamicSphere(TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2], 2.0, 0, 0);
				if (TagInfo[graffiti][tFraction] == FRACTION_GROVE) {
					TagInfo[graffiti][tID] = CreateDynamicObject(18659,TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2],TagInfo[graffiti][tRPos][0],TagInfo[graffiti][tRPos][1],TagInfo[graffiti][tRPos][2]); /// object (SprayTag4) (52) ///
					tFractionGraffiti[TagInfo[graffiti][tFraction]] ++;
				}
				else if (TagInfo[graffiti][tFraction] == FRACTION_PIRUS) {
					TagInfo[graffiti][tID] = CreateDynamicObject(18666,TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2],TagInfo[graffiti][tRPos][0],TagInfo[graffiti][tRPos][1],TagInfo[graffiti][tRPos][2]); /// object (SprayTag4) (52) ///
                    tFractionGraffiti[TagInfo[graffiti][tFraction]] ++;
				}
				else if (TagInfo[graffiti][tFraction] == FRACTION_BALLAS) {
					TagInfo[graffiti][tID] = CreateDynamicObject(18664,TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2],TagInfo[graffiti][tRPos][0],TagInfo[graffiti][tRPos][1],TagInfo[graffiti][tRPos][2]); /// object (SprayTag4) (52) ///
                    tFractionGraffiti[TagInfo[graffiti][tFraction]] ++;
				}
				else if (TagInfo[graffiti][tFraction] == FRACTION_RIFA) {
					TagInfo[graffiti][tID] = CreateDynamicObject(18663,TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2],TagInfo[graffiti][tRPos][0],TagInfo[graffiti][tRPos][1],TagInfo[graffiti][tRPos][2]); /// object (SprayTag4) (52) ///
					tFractionGraffiti[TagInfo[graffiti][tFraction]] ++;
				}
				else if (TagInfo[graffiti][tFraction] == FRACTION_AZTEC) {
					TagInfo[graffiti][tID] = CreateDynamicObject(18661,TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2],TagInfo[graffiti][tRPos][0],TagInfo[graffiti][tRPos][1],TagInfo[graffiti][tRPos][2]); /// object (SprayTag4) (52) ///
					tFractionGraffiti[TagInfo[graffiti][tFraction]] ++;
				}
				else if (TagInfo[graffiti][tFraction] == FRACTION_VAGOS) {
					TagInfo[graffiti][tID] = CreateDynamicObject(18665,TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2],TagInfo[graffiti][tRPos][0],TagInfo[graffiti][tRPos][1],TagInfo[graffiti][tRPos][2]); /// object (SprayTag4) (52) ///
					tFractionGraffiti[TagInfo[graffiti][tFraction]] ++;
				}
				else if (TagInfo[graffiti][tFraction] == INVALID_FRACTION_ID) {
				    TagInfo[graffiti][tText] = CreateDynamic3DTextLabel("Spray", COLOR_ORANGE, TagInfo[graffiti][tPos][0],TagInfo[graffiti][tPos][1],TagInfo[graffiti][tPos][2], 5.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, -1, -1, -1, 100.0);
				}
			}
			printf("[Загрузка ...] Данные из Graffiti получены! (%d шт.) Время: %d",TOTALGRAFFITI-1, GetTickCount() - time);
		}   
	}
	return 1;
}

publics: LoadBilbords()
{
	new rows;
	cache_get_row_count(rows);
	new time = GetTickCount();
    if (!rows)
        return print("[Загрузка ...] Данные из s_bilboards не получены!");
    for(new b_idx; b_idx < rows; b_idx++)
    {
        cache_get_value_name_int(b_idx , "id", BildInfo[b_idx][bID]);
        cache_get_value_name(b_idx, "bText", BildInfo[b_idx][bText], 144);
        cache_get_value_name(b_idx, "bPosText", BildInfo[b_idx][bPosText], 32);
        cache_get_value_name(b_idx, "bOwner", BildInfo[b_idx][bOwner], MAX_PLAYER_NAME);

        cache_get_value_name_int(b_idx, "bOwned", BildInfo[b_idx][bOwned]);
        cache_get_value_name_int(b_idx, "bBackColor", BildInfo[b_idx][bBackColor]);
        cache_get_value_name_int(b_idx, "bFontFace",  BildInfo[b_idx][bFontFace]);
        cache_get_value_name_int(b_idx, "bAligment", BildInfo[b_idx][bAligment]);
        cache_get_value_name_int(b_idx, "bFontSize", BildInfo[b_idx][bFontSize]);
        //cache_get_value_name(b_idx - 1, "pos", data_, 128), sscanf(data_,"p<|>a<f>[3]", FarmInfo[x][fMenu]);
        cache_get_value_name_float(b_idx, "PosX", BildInfo[b_idx][bPos][0]);
        cache_get_value_name_float(b_idx, "PosY",  BildInfo[b_idx][bPos][1]);
        cache_get_value_name_float(b_idx, "PosZ", BildInfo[b_idx][bPos][2]);
        cache_get_value_name_float(b_idx, "PosA", BildInfo[b_idx][bPos][3]);
        cache_get_value_name_int(b_idx, "bMember", BildInfo[b_idx][bMember]);
        cache_get_value_name_int(b_idx, "bDay", BildInfo[b_idx][bDay]);
        cache_get_value_name_int(b_idx, "bModel", BildInfo[b_idx][bObjectModel]);
		BildInfo[b_idx][bObjectID] = CreateDynamicObjectEx(BildInfo[b_idx][bObjectModel],BildInfo[b_idx][bPos][0], BildInfo[b_idx][bPos][1], BildInfo[b_idx][bPos][2], 0.00000000, 0.00000000, BildInfo[b_idx][bPos][3],1000.000,1000.000); // bObject
        UpdateBuildText(b_idx);
		TOTALBILBOARD ++;
    }

	new curent_time = gettime(), bilbord_reset,query_[190];
	for(new i; i < TOTALBILBOARD; i++)
	{
		if (BildInfo[i][bOwned] != 1) continue;
		if (curent_time > BildInfo[i][bDay])
		{
			BildInfo[i][bFontSize] = 0;
		    BildInfo[i][bBackColor] = 0;
			BildInfo[i][bFontFace] = 0;
			BildInfo[i][bOwned] = 0;
			BildInfo[i][bDay] = 0;
			format(BildInfo[i][bOwner],2,"-");
			UpdateBuildText(i);

			format(query_, sizeof(query_), "UPDATE `s_billboards` SET `bDay` = '0',\
			`bOwned` = '0', `bOwner` = '-', `bText` = '-', `bFontSize` = 25, `bAligment` = 1, \
			`bBackColor` = '1', `bFontFace` = '0' WHERE `id` = '%i' LIMIT 1",i);
			mysql_tquery(dbHandle, query_);

			bilbord_reset++;
		}
	}

    printf("[Загрузка ...] Данные из BilBoards получены! (%d шт.) Обнулено: %d шт Время: %d",TOTALBILBOARD,bilbord_reset, GetTickCount() - time);
	return 1;
}
        
stock GetVehicleID()
{
	new veh_id = _AddStaticVehicleEx( 400, -100, -100, -100, 0, 0, 0, 0);
	_DestroyVehicle(veh_id);
	return veh_id;
}


stock IsAGreenZone(playerid)
{
    for(new i; i < sizeof(gAreas[arGreenZone]); i++) {
		if (IsPlayerInDynamicArea(playerid, gAreas[arGreenZone][i])) return 1;
	}
	return 0;
}

stock IsANoLimiter(carid)
{
	if (IsABoat(carid) || IsAPlane(carid) || IsARCVehicle(carid) || GetVehicleModel(carid) == 462 || GetVehicleModel(carid) == 481 || GetVehicleModel(carid) == 509 || GetVehicleModel(carid) == 510) return 1;
	return 0;
} 
   
stock GetPlayerFarm(playerid)
{
    new farm = 0;
	for(new i = 1; i <= TOTALFARM; i++)
	{
	    if (strcmp(FarmInfo[i][fOwner],"None",true) == 0) continue;
	    if (strcmp(FarmInfo[i][fOwner],pInfo[playerid][pName],false) == 0)
		{
	 		farm  = i;
	 		pTemp[playerid][PlayerFarmID] = i; 
	 	}
	} 
	return farm;
}

stock GetHome()
{
	for(new idx = 1; idx <= TOTALHOUSE; idx++)
	{
        if (strcmp("None", HouseInfo[idx][hOwner],true) == 0 || HouseInfo[idx][hKlass] == 5) continue;
		if (HouseInfo[idx][hTakings] < GetHouseOplata(idx))
		{
		    new
				playerid,
				query_[154];
			
			sscanf(HouseInfo[idx][hOwner], "u", playerid);
			if (IsPlayerConnected(playerid))
			{
			    pInfo[playerid][pBank] += HouseInfo[idx][hValue] / 2;
			    SavePlayerInteger(playerid, "pBank", pInfo[playerid][pBank]);
				LogMoney(playerid, HouseInfo[idx][hValue] / 2, "дом был продан");
			    pTemp[playerid][GetHomePlayer] = true;
				if (pInfo[playerid][PlayerSpawn] == 1) {
				    if (pInfo[playerid][pMember] != 0) pInfo[playerid][PlayerSpawn] = 2;
				    else pInfo[playerid][PlayerSpawn] = 0;
				    SavePlayerInteger(playerid, "playerspawn", pInfo[playerid][PlayerSpawn]);
				}
			}
			else//`answers` = `answers`+1
			{
				mysql_format(dbHandle, query_, sizeof query_, "SELECT `pID`,`pBank` FROM `s_users` WHERE `Name` = '%e' LIMIT 1", HouseInfo[idx][hOwner]);
    			mysql_tquery(dbHandle, query_, "OnPlayerSelectTextType", "iis", sqlTextSellHouse, idx, HouseInfo[idx][hOwner]);  
			}
			if (HouseInfo[idx][hValue] == 0) {
				HouseInfo[idx][hValue] = HouseInfo[idx][hReturnValue];
			}
			strmid(HouseInfo[idx][hOwner],"None", 0, strlen("None"), MAX_PLAYER_NAME);
			HouseInfo[idx][hTakings] = 0;
			HouseInfo[idx][hLock] = 1;
			//for(new h = 0; h < 10; h++) HouseInfo[i][hSafe][h] = 0;
			UpdateHouseInfo(idx, false);
			CheckEvictFree(idx);
			CheckFamilyHouseFree(idx);
		}
		else {
			HouseInfo[idx][hTakings] -= GetHouseOplata(idx);
			SetMoveCashServer(IN_NALOG_SERVER, GetHouseOplata(idx)); 
		}
		SaveHouseID(idx);
		HouseInfo[idx][hRobHouse] = false;
	}
	return 1;
}

publics: OnPlayerSelectTextType(type, index, owner[])
{
	new 
        rows;
	cache_get_row_count(rows);
	switch(type) {
		case sqlTextSellHouse: {
			if (!rows) {
				printf("OnPlayerSelectTextType: sqlTextSellHouse -> INVALID_PLAYER_ID (%s)", owner);
				return 1;
			}
			new bank_amount, 
				targetid,
				string_[144];
			cache_get_value_name_int(0, "pID", targetid);
			cache_get_value_name_int(0, "pBank", bank_amount); 
			format(string_, sizeof string_, ""colinfo"[Уведомления] "colwhi"Ваш дом был продан государству, Ваши деньги на банковском счету");
			MessagePlayerOffline(targetid, string_);

			bank_amount += HouseInfo[index][hValue] / 2;
			format(string_, sizeof string_, "UPDATE `s_users` SET `pBank` = '%d', `playerspawn` = '0', `pHouseID` = '-1' WHERE `pID` = '%d'", bank_amount, targetid);
			mysql_tquery(dbHandle, string_);
			printf("OnPlayerSelectTextType: sqlTextSellHouse -> (%s)", owner);
		} 
		case sqlTextBuyFerm: {
			if (!rows) {
				printf("OnPlayerSelectTextType: sqlTextBuyFerm -> INVALID_PLAYER_ID (%s) (Index: %d)", owner, index);
				return 1; 
			}
			new targetid,
				string_[144];
			cache_get_value_name_int(0, "pID", targetid); 
			format(string_, sizeof string_, ""colinfo"[Уведомления] "colwhi"Вы приобрели Ферму с аукциона!");
			MessagePlayerOffline(targetid, string_);
			printf("OnPlayerSelectTextType: sqlTextBuyFerm -> (%s)  (Index: %d)", owner, index);
		}
		case sqlTextSellFerm: {
			if (!rows) {
				printf("OnPlayerSelectTextType: sqlTextSellFerm -> INVALID_PLAYER_ID (%s) (Index: %d)", owner, index);
				return 1; 
			}
			new bank_amount, 
				targetid,
				string_[144];
			cache_get_value_name_int(0, "pID", targetid);
			cache_get_value_name_int(0, "pBank", bank_amount); 
			format(string_, sizeof string_, ""colinfo"[Уведомления] "colwhi"Ваша ферма была продана государству, Половина стоимости зачислена на Ваш счет");
			MessagePlayerOffline(targetid, string_);

			bank_amount += FarmInfo[index][fBank]+FarmInfo[index][fLandTax];
			format(string_, sizeof string_, "UPDATE `s_users` SET `pBank` = '%d' WHERE `pID` = '%d'", bank_amount, targetid);
			mysql_tquery(dbHandle, string_);
			printf("OnPlayerSelectTextType: sqlTextSellFerm -> (%s)", owner);
		}
	}
	return 1;
}

stock GetFarm()
{
	for(new i = 1; i <= TOTALFARM; i++)
	{
	    new query_[128];
	    if (FarmInfo[i][fAuction][0] > 0 && strcmp(FarmInfo[i][fOwner],"None",true) == 0 && FarmInfo[i][fAuction][2] > 0)
		{
			FarmInfo[i][fAuction][2]--;
			SaveActionsFerm(i);
		}
	    if (FarmInfo[i][fAuction][2] == 0 && FarmInfo[i][fAuction][0] > 0)
	    {
	       	format(query_, sizeof query_,"SELECT `Name` FROM `s_users` WHERE `Name` = '%s'",FarmInfo[i][fAuctionName]);
			mysql_tquery(dbHandle, query_, "OnMySQL_QUERY", "iis", 29, i, "");
		}
        if (strcmp("None",FarmInfo[i][fOwner],true) == 0) continue;
		if (FarmInfo[i][fLandTax] < 500)
		{
		    new playerid;
			sscanf(FarmInfo[i][fOwner], "u", playerid);
			if (IsPlayerConnected(playerid))
			{
				pTemp[playerid][GetFarmPlayer] = false;
				pInfo[playerid][pBank] += FarmInfo[i][fBank]+FarmInfo[i][fLandTax];
				SavePlayerInteger(playerid, "pBank", pInfo[playerid][pBank]);
				LogMoney(playerid, FarmInfo[i][fBank]+FarmInfo[i][fLandTax], "ферма была продана");
			}
			else { 
				mysql_format(dbHandle, query_, sizeof query_, "SELECT `pID`,`pBank` FROM `s_users` WHERE `Name` = '%e' LIMIT 1", FarmInfo[i][fOwner]);
				mysql_tquery(dbHandle, query_, "OnPlayerSelectTextType", "iis", sqlTextSellFerm, i, FarmInfo[i][fOwner]);  
			}
			strmid(FarmInfo[i][fOwner],"None",0,strlen("None"),MAX_PLAYER_NAME);
			strmid(FarmInfo[i][fDeputy_1],"None",0,strlen("None"),MAX_PLAYER_NAME);
			strmid(FarmInfo[i][fDeputy_2],"None",0,strlen("None"),MAX_PLAYER_NAME);
			strmid(FarmInfo[i][fDeputy_3],"None",0,strlen("None"),MAX_PLAYER_NAME);
			SaveFermIDFarmers(i);
			FarmInfo[i][fAuction][0] = 0;
			FarmInfo[i][fAuction][1] = 0;
			FarmInfo[i][fAuction][2] = 0;
			FarmInfo[i][fAuction][3] = 0;
			FarmInfo[i][fLandTax] = 0;
			FarmInfo[i][fBank] = 0;
			FarmInfo[i][fProds] = 0;
			FarmInfo[i][fZp] = 30;
			FarmInfo[i][fGrain_Price] = 5;
			FarmInfo[i][fGrain] = 0;
			FarmInfo[i][fGrain_Sown] = 0;
			FarmInfo[i][fProds_Selling] = 1;
			FarmInfo[i][fProds_Price] = 21;
		}
		else {
			FarmInfo[i][fLandTax] -= 500;
		}
		SaveFermID(i);
	}
	return 1;
}
stock GetFarmjob(playerid, idx)
{
    if (strcmp(pInfo[playerid][pName],FarmInfo[idx][fDeputy_1],true) == 0 || strcmp(pInfo[playerid][pName],FarmInfo[idx][fDeputy_2],true) == 0 || strcmp(pInfo[playerid][pName],FarmInfo[idx][fDeputy_3],true) == 0) return 2;
    if (strcmp(pInfo[playerid][pName],FarmInfo[idx][fFarmer_1],true) == 0 || strcmp(pInfo[playerid][pName],FarmInfo[idx][fFarmer_2],true) == 0 || strcmp(pInfo[playerid][pName],FarmInfo[idx][fFarmer_3],true) == 0
    || strcmp(pInfo[playerid][pName],FarmInfo[idx][fFarmer_4],true) == 0 || strcmp(pInfo[playerid][pName],FarmInfo[idx][fFarmer_5],true) == 0) return 1;
    return 0;
}



stock ShowHelpDialog(playerid, dialog)
{
	t_string[0] = EOS;
	if (dialog+2 != 19) SetPVarInt(playerid, "help_dialog", dialog + 2);
 	else SetPVarInt(playerid, "help_dialog", 2);
	switch(dialog)
 	{
  		case 0:
        {
              ShowPlayerDialog(playerid,D_PLAYER_HELP,2,"Помощь","[1] Общение\n[2] Список игроков\n[3] Транспорт\n[4] Транспорт часть 2\n[5] Общее\n[6] Оружие и Убийство\n[7] Role Play\n[8] Первые шаги\n[9] Первые шаги часть 2\n[10] Первые шаги часть 3\n[11] Часовая зарплата\n[12] Зарплата фракции\n[13] Бизнес\n[14] Местность\n[15] Законопослушность\n[16] Дома\n[17] Дом часть 2","Далее","Выход");
              return SetPVarInt(playerid,"help_dialog", 1);
       	}
        case 1:
        {
        	strcat(t_string,"<< Общение >>\n\n");
         	strcat(t_string,"Вы можете обращаться с другими игроками через чат в левом верхнем углу.\n");
          	strcat(t_string,"Чтобы напечатать сообщение нажмите клавишу \"F6\" или \"T\"(на латинеце)\n");
           	strcat(t_string,"Так же с помощью чата используются все команды сервера, к примеру \"/mm\".\n\n\n");
            strcat(t_string,"Используйте \"/mm\" для просмотра команд...\n");
            //strcat(t_string,"Более подробное описание вы найдете на нашем сайте warrior-rp.ru");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Общение",t_string,"Далее","Меню");
        }
        case 2:
        {
       		strcat(t_string,"<< Список игроков >>\n\n");
            strcat(t_string,"Данный список можно посмотреть нажав клавишу \"TAB\".\n");
            strcat(t_string,"Там вы увидете:\n\n");
            strcat(t_string,"\"ID\" игрока(используется в командах)\n");
            strcat(t_string,"\"Ник(РП имя игрока)\"\n");
            strcat(t_string,"\"Уровень(lvl)\" в графе score(Повышается автоматически каждый отыгранный час)\n");
            strcat(t_string,"\"Пинг\" это не слишком важно, поэтому я не буду нагружать вас лишней информацией.\n\n");
            strcat(t_string,"Для просмотра списка полностью, используйте прокрутку с право.\n");
            strcat(t_string,"Вы в этой табличке всегда отображаетесь первым, независимо от ID.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Список игроков",t_string,"Далее","Меню");
		}
  		case 3:
    	{
     		strcat(t_string,"<< Транспорт >>\n\n");
       		strcat(t_string,"Я надеюсь вы умеете ездить, но даже если нет, наши Инструкторы вас научат.\n");
         	strcat(t_string,"В Автошколу вам придется идти в любом случае, поскольку езда разрешена только\n");
          	strcat(t_string,"с правами. Ну а пока вы можете воспользоваться мотороллером,\n");
           	strcat(t_string,"Или же общественным транспортом\n\n");
            strcat(t_string,"Для того чтобы сесть на пассажирское место используйте клавишу \"G\"");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Транспорт",t_string,"Далее","Меню");
       	}
        case 4:
        {
            strcat(t_string,"<< Транспорт >>\n\n");
       		strcat(t_string,"Для управления автомобилем необходимы водительские права, а для пилотирования самолета\n");
         	strcat(t_string,"лицензия пилота. Транспорту нужен бензин, которым можно заправиться на любой заправке.\n");
          	strcat(t_string,"При нарушении Правил дорожного движения(превышение скорости), вас могут оштрафовать.\n\n");
           	strcat(t_string,"<< Работа >>\n\n");
            strcat(t_string,"Многие профессии доступны каждому гражданскому. Устроиться на работу можно в Мэрии.\n");
            strcat(t_string,"К примеру Водитель автобуса, Таксист, Механик.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Транспорт часть 2",t_string,"Далее","Меню");
        }
        case 5:
        {
     		strcat(t_string,"<< Общее >>\n\n");
         	strcat(t_string,"Играя на сервере ваш лвл повышается автоматически.\n");
          	strcat(t_string,"После получения определенного левла открываются новые возможности\n\n");
           	strcat(t_string,"Но уровень персонажа не главное! На нашем сервере можно зарабатывать\n");
            strcat(t_string,"деньги, после покупать дома, машины и т.д. Можно вступить в банду и воевать за\n");
            strcat(t_string,"территории, тем самым расширяя бизнес. Или стать членом мафии.\n\n");
            strcat(t_string,"Можно работать полицейским защищая гражданских. И это только малая часть доступного!");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Общее",t_string,"Далее","Меню");
       	}
        case 6:
        {
        	strcat(t_string,"<< Оружие и Убийство >>\n\n");
         	strcat(t_string,"Для ношения оружия необходима лицензия, без нее вас не впустят в магазин.\n");
          	strcat(t_string,"Но оружие можно достать и другими способами.\n\n");
       	 	strcat(t_string,"За убийcтво человека вы будете объявлены в розыск, как опасный преступник,\n");
          	strcat(t_string,"а при аресте вы лишитесь крупной суммы денег и сядете в тюрьму!\n");
           	strcat(t_string,"Изначально ваши навыки владения оружием будут малы, но со временем вы сможете\n");
            strcat(t_string,"стать элитным стрелком, и относиться к вам будут с уважением!");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Оружие и Убийство",t_string,"Далее","Меню");
        }
        case 7:
        {
        	strcat(t_string,"Role Play - Ролевая игра, игра по ролям.\n");
         	strcat(t_string,"Я объясню более понятно. Вам предоставлены уже готовые роли, к примеру\n");
          	strcat(t_string,"Бандит, Полицейский.\n");
           	strcat(t_string,"Состоя в банде вы продаете наркотики, оружие. Грабите военные склады и т.п.\n");
            strcat(t_string,"Состоя в Полиции вы следите за порядком, и пытаетесь посадить тех же бандитов.\n");
            strcat(t_string,"Если вам не нравиться выше написанное, то можете стать к примеру репортером, и\n");
            strcat(t_string,"вести собственную передачу по радио.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Role Play",t_string,"Далее","Меню");
        }
        case 8:
        {
        	strcat(t_string,"<< Первые шаги (Первые деньги) >>\n\n");
         	strcat(t_string,"Вам потребуется не много денег, заработать их можно на складу подрабатывая \"Грузчиком\".\n");
          	strcat(t_string,"Добраться на завод вы можете на автобусе \'Внутригородской LS\' или на такси,\n");
           	strcat(t_string,"таксист отвезет вас бесплатно, просто сядьте в свободное такси.\n");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Первые шаги",t_string,"Далее","Меню");
        }
        case 9:
        {
        	strcat(t_string,"<< Первые шаги (Водительские права) >>\n\n");
         	strcat(t_string,"Как только вы заработаете немного денег, отправляйтесь в автошколу.\n");
          	strcat(t_string,"Автошкола находиться в Сан Фиерро (2ой город)\n");
           	strcat(t_string,"Стоимость сдачи экзамена составляет $500.\n");
           	strcat(t_string,"Добраться вы можете на автобусе \'Лос Сантос - Сан Фиерро\'.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Первые шаги часть 2",t_string,"Далее","Меню");
        }
        case 10:
        {
        	strcat(t_string,"<< Первые шаги (Постоянная работа) >>\n\n");
         	strcat(t_string,"После того как вы заработаете денег и получите права,\n");
          	strcat(t_string,"вы сможете устроиться на официальную работу.\n");
           	strcat(t_string,"Устроиться на работу, и ознакомиться со списком профессий, вы можете в мэрии.\n");
            strcat(t_string,"Добирайтесь на \'Внутригородском LS\'");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Первые шаги часть 3",t_string,"Далее","Меню");
        }
        case 11:
        {
        	strcat(t_string,"<< Часовая зарплата >>\n\n");
         	strcat(t_string,"Каждый час в 00 игроки получают банковский чек, в котором указаны все доходы и\n");
          	strcat(t_string,"расходы.\n");
           	strcat(t_string,"Доходы: Зарплата с работы.\n");
           	strcat(t_string,"Расходы: Налог государству (после 5 лвл), Счет за телефон (если вы звонили),\n");
            strcat(t_string,"Кварплата (если вы владелец дома)");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Часовая зарплата",t_string,"Далее","Меню");
        }
        case 12:
        {
        	strcat(t_string,"<< Зарплата фракции >>\n\n");
         	strcat(t_string,"В некоторых фракциях вы получаете Зарплату каждый час от государства.\n");
          	strcat(t_string,"В других эта зарплата выдается лидером. Все организации на сервере имеют\n");
           	strcat(t_string,"свой заработок. Где то нелегальный бизнес, где то постоянная зарплата.\n\n");
            strcat(t_string,"Банды: Бизнес(Нелегальный), Оружие и Наркотики, Ограбление.\n");
            strcat(t_string,"Репортеры: Бизнес(Легальный), Реклама.\n");
            strcat(t_string,"Мэрия: От юриста до Управления казной.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Зарплата фракции",t_string,"Далее","Меню");
        }
        case 13:
        {
        	strcat(t_string,"<< Бизнес >>\n\n");
         	strcat(t_string,"Все клубы, бары, забегаловки являются бизнесами, которые можно арендовать.\n");
          	strcat(t_string,"По мимо этого еще есть Бензоправки и Магазины.\n");
           	strcat(t_string,"Чтобы заработать на бизнесе нужен начальный капитал. Для лицензии,\n");
            strcat(t_string,"Аренды помещения, Продуктов.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Бизнес",t_string,"Далее","Меню");
        }
        case 14:
        {
        	strcat(t_string,"<< Местность >>\n\n");
         	strcat(t_string,"Лос Сантос(1 город) самый опасный город, так как здесь большое количество\n");
          	strcat(t_string,"бандитов. Районы банд выделены на карте особыми цветами, но только там\n");
           	strcat(t_string,"можно купить оружие по дешевле и ни кто не спросит у вас лицензии\n\n");
            strcat(t_string,"Сан Фиерро(2 город). Если не хотите каждый день сталкиваться с беззаконием,\n");
            strcat(t_string,"то поселитесь в этом городе.\n\n");
            strcat(t_string,"Лас Вентурас(3 город). Город азарта, город богачей. Конечно здесь не такие раскошные\n");
            strcat(t_string,"особняки как на VINEWOOD, но улицы самые красивые.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Местность",t_string,"Далее","Меню");
        }
        case 15:
        {
        	strcat(t_string,"<< Законопослушность >>\n\n");
         	strcat(t_string,"У каждого игрока есть индикатор, который показывает как вы относитесь к закону.\n");
          	strcat(t_string,"-100 и +100 Минимум и максимум. Узнать можно заглянув в ваш пасспорт \"/showpass [ид]\"\n");
           	strcat(t_string,"С плохим отношением к закону вас могут не принять во многии Фракции, но в банду\n");
           	strcat(t_string,"попасть легче.\n\n");
            strcat(t_string,"Законопослушность повышается каждый час на 1, однако может резко упасть если\n");
            strcat(t_string,"совершите преступление");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Законопослушность",t_string,"Далее","Меню");
        }
        case 16:
        {
        	strcat(t_string,"<< Дома >>\n\n");
         	strcat(t_string,"Вы можете в любой момент купить себе дом, тогда при смерти или входе в игру\n");
            strcat(t_string,"вы будете появляться там. По мимо этого у вас появиться место для парковки машины,\n");
            strcat(t_string,"а значит вы можете купить себе красивое авто.\n");
            strcat(t_string,"Дома поделенны по классам - [Nope] [D] [C] [B] [A] [S]. Класс говорит о цене и красоте\n");
            strcat(t_string,"дома как внутри, так и снаружи.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Дома",t_string,"Далее","Меню");
        }
        case 17:
        {
            strcat(t_string,"После покупки дома с вашего банковского счета будут сниматься Кварплата, она зависит от класса дома.\n");
            strcat(t_string,"Важное примечание! Деньги снимаются каждый час даже когда вы оффлайн.\n\n");
            strcat(t_string,"<< Личный транспорт >>\n\n");
            strcat(t_string,"У нас есть несколько Автосалонов, где вы можете приобрести себе машину. Все они\n");
            strcat(t_string,"указаны в \"/GPS\". Транспорт как и дома разделены по классам.\n");
        	strcat(t_string,"Чтобы выбрать себе машину, воспользуйтесь командой \"/Buycar\". Далее вы\n");
        	strcat(t_string,"увидете подсказку по клавишам с правой стороны, а снизу цену и цвет.");
            return ShowPlayerDialog(playerid, D_PLAYER_HELP, 0,"Дома часть 2",t_string,"Далее","Меню");
		}
	}
	return 1;
}
publics: Farmduty(playerid)
{
	new
		string_[64],
		V_IDX = GetPlayerVehicleID(playerid);
    DisablePlayerRaceCheckpoint(playerid);
    SetVehicleParamsEx(V_IDX, false, false, false, false, false, false, false);
	SetVehicleVelocity(V_IDX, 0.0, 0.0, 0.0);
	new
		Float: veh_pos[4];
	GetVehiclePos(V_IDX, veh_pos[0], veh_pos[1], veh_pos[2]);
	GetVehicleZAngle(V_IDX,veh_pos[3]);

	GetXYInBackOfPlayer(playerid, veh_pos[0], veh_pos[1],3.0);

	Farmcar_pickup[V_IDX] = CreateDynamicPickup(19197, 23, veh_pos[0], veh_pos[1], veh_pos[2]+0.3);
	DeletePVar(playerid,"farm_status");

	format(string_, sizeof string_, "Загружено\n{ffffff}%d / 1000", Farmcar_prods[V_IDX]); 
	if (VehicleInfo[ V_IDX - 1 ][vFarmText] == Text3D:-1) { 
		VehicleInfo[ V_IDX - 1 ][vFarmText] = CreateDynamic3DTextLabel(string_, 0x5CABBDFF, veh_pos[0], veh_pos[1], veh_pos[2]+0.6, 15.0);//, INVALID_PLAYER_ID, V_IDX);
	}  
	VehicleInfo[ V_IDX - 1 ][vJobLoad] = true;
	RemovePlayerFromVehicle(playerid);
	TogglePlayerControllable(playerid, 1);
	return 1;
}
publics: Farm_Duty(playerid)
{
	TogglePlayerControllable(playerid, 1);
	ClearAnim(playerid);
	KillTimer(Farmtimer[playerid]);
	DisablePlayerCheckpoint(playerid);
	DeletePVar(playerid,"farm_status");
	if (!IsPlayerInRangeOfPoint(playerid,2.0, Farm_coord[playerid][0], Farm_coord[playerid][1], Farm_coord[playerid][2])) 
		return SendClientMessage(playerid,COLOR_RED,"Вы должны находиться на красной метке");
    new
		FARM_ID = pTemp[playerid][TempFermID];
	if (!FarmInfo[FARM_ID][fGrain_Sown]) return SendClientMessage(playerid,COLOR_RED,"На поле недостаточно урожая");
	if (FarmInfo[FARM_ID][fBank] < FarmInfo[FARM_ID][fZp]) return SendClientMessage(playerid,COLOR_RED,"На балансе фермы недостаточно средств");
	SetPVarInt(playerid,"farm_status",2);
	SetPlayerAttachedObject(playerid, ATTACHED_SLOT_JOB_0, 856, 6, 0.086999, 0.036999, 0.000000, 0.000000, 0.000000, 0.000000, 0.010999, 0.009000, 0.085999);
	FarmInfo[FARM_ID][fGrain_Sown]--;
	return 1;
}
 
stock SetPlayerCriminal(playerid, const killerid[], const reason[])
{
	new string_[145], query_[128];
	pInfo[playerid][pCrimes] ++;
	strmid(PlayerCrime[playerid][pVictim], killerid, 0, strlen(killerid), 50);
	strmid(PlayerCrime[playerid][pAccusedof], reason, 0, strlen(reason), 50);
	if (pInfo[playerid][pWantedLevel] > 6) pInfo[playerid][pWantedLevel] = 6;
	format(string_, sizeof string_, "Вы совершили преступление: [%s]. Сообщает: %s.",reason, killerid);
	SendClientMessage(playerid,COLOR_LIGHTRED, string_);
	format(string_, sizeof string_, "Ваш уровень розыска: %d", pInfo[playerid][pWantedLevel]);
	SendClientMessage(playerid,COLOR_YELLOW, string_);
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][pMember] == 1 || pInfo[i][pMember] == 10 || pInfo[i][pMember] == 2 || pInfo[i][pMember] == 21)
		{
			format(string_, sizeof string_, "Рация: Cообщает: %s. Преступление: %s. Подозреваемый: %s. Розыскиваемость: %d",killerid,reason,pInfo[playerid][pName],pInfo[playerid][pWantedLevel]);
			SendClientMessage(i, 0xFEBC41AA, string_);
		}
	}
	format(query_, sizeof(query_), "UPDATE `s_users` SET `pCrimes` = '%d' WHERE `pID` = '%d'", pInfo[playerid][pCrimes], pInfo[playerid][pID]);
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
}

stock GetCasino(playerid, idx)
{
	if (strcmp(pInfo[playerid][pName],CasinoInfo[idx][caManager],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caManager2],true) == 0
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caManager3],true) == 0) return 2;
    if (strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie2],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie3],true) == 0
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie4],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie5],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie6],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie7],true) == 0
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie8],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie9],true) == 0 
		|| strcmp(pInfo[playerid][pName],CasinoInfo[idx][caKrupie10],true) == 0) return 1;
    return 0;
}


enum(<<=1)
{
    CMD_ADMIN = 1,
    CMD_NO_DIALOG
}

flags:time(CMD_NO_DIALOG);
//flags:ban(CMD_NO_DIALOG);
flags:cleardialog(CMD_NO_DIALOG);
flags:sban(CMD_NO_DIALOG);
flags:iban(CMD_NO_DIALOG);
//flags:kick(CMD_NO_DIALOG);
flags:skick(CMD_NO_DIALOG);
flags:sms(CMD_NO_DIALOG);
//flags:ahelp(CMD_ADMIN);
//flags:getskill(CMD_ADMIN);
//flags:hbject(CMD_ADMIN);
//flags:hbjectedit(CMD_ADMIN);
//flags:qn(CMD_ADMIN);
//flags:qp(CMD_ADMIN);
//flags:admin(CMD_ADMIN);
//flags:asms(CMD_ADMIN);
//flags:giveroulette(CMD_ADMIN); 
//flags:select(CMD_ADMIN);


stock GetString(const param1[], const param2[])
{
	return !strcmp(param1, param2, false);
}
stock SetString(param_1[], const param_2[], size = 300)
{
    return strmid(param_1, param_2, 0, strlen(param_2), size);
}

stock IsAAssis(playerid)
{
	if (IsABiker(playerid) && pInfo[playerid][pRank] >= 8
	|| IsAArmy(playerid) && pInfo[playerid][pRank] > 12
	|| pInfo[playerid][pMember] == 1 && pInfo[playerid][pRank] >= 13
	|| pInfo[playerid][pMember] == 10 && pInfo[playerid][pRank] >= 13
	|| pInfo[playerid][pMember] == 21 && pInfo[playerid][pRank] >= 13
	|| pInfo[playerid][pMember] == 2 && pInfo[playerid][pRank] >= 9
	|| IsAMedic(playerid) && pInfo[playerid][pRank] >= 9
	
	|| IsAMafia(playerid) && pInfo[playerid][pRank] >= 9
	|| pInfo[playerid][pMember] == 11 && pInfo[playerid][pRank] >= 7

	|| pInfo[playerid][pMember] == 12 && pInfo[playerid][pRank] >= 9
	|| pInfo[playerid][pMember] == 13 && pInfo[playerid][pRank] >= 9
	|| pInfo[playerid][pMember] == 15 && pInfo[playerid][pRank] >= 9
	|| pInfo[playerid][pMember] == 17 && pInfo[playerid][pRank] >= 9
	|| pInfo[playerid][pMember] == 18 && pInfo[playerid][pRank] >= 9

	|| IsANews(playerid) && pInfo[playerid][pRank] > 7
	|| IsAMayor(playerid) && pInfo[playerid][pRank] >= 5) return 1;
	return 0;
} 
stock IsUnInviteAssistant(playerid)
{
	new fraction_id = pInfo[playerid][pMember],
		rank = pInfo[playerid][pRank];
	if (rank >= fInfo[fraction_id][fHelper][1]) return 1;
	return 0;
}
stock IsGiveRankAssistant(playerid)
{
	new fraction_id = pInfo[playerid][pMember],
		rank = pInfo[playerid][pRank];
	if (rank >= fInfo[fraction_id][fHelper][2]) return 1;
	return 0;
}
stock IsUnGiveRankAssistant(playerid)
{
	new fraction_id = pInfo[playerid][pMember],
		rank = pInfo[playerid][pRank];
	if (rank >= fInfo[fraction_id][fHelper][3]) return 1;
	return 0;
} 
stock UpdatePlayerDonate123(playerid)
{
	new string_[128];
	    strcat(string_, "{FFFFFF}На данной странице вы можете узнать номер своего\n");
		strcat(string_, "aккаунта, текущее состояние счета, сумму последнего\n");
		strcat(string_, " -пополнения и общую сумму пополнений счета. \n\n");
		strcat(string_, " Чтобы воспользоваться счетом нажмите {B83434}'Заказать'{FFFFFF}.\n");
		strcat(string_, " Для пополнения счета посетите сайт: warrior-rp.ru\n");
		strcat(string_, "Курс пополнения счета можно посмотреть на сайте\n ");
		strcat(string_, "{B83434}Информация:{FFFFFF}\n");
		strcat(string_, "Номер аккаунта: \t\t\t%i\n",pInfo[playerid][pID]);
		strcat(string_, "{AFAFAF}\nОстальную информацию можно узнать пополнив счет.\n\n");
		ShowPlayerDialog(playerid, D_OBNOVKA_DONATE,DIALOG_STYLE_MSGBOX, "{FFFFFF}Донат счёт", string_, "Заказать", "Отмена");
	return 1;	
	
}
stock UpdatePlayerDonate(playerid)
{
	new 
		get_nodonate = 0,
		query_[128];
	format(query_, sizeof query_, "SELECT `u_nodonate` FROM s_users WHERE pID = '%d'", pInfo[playerid][pID]);
	new Cache:tempQuery = mysql_query (dbHandle, query_);
	/*printf("Выполнение запроса \"SELECT `u_nodonate` FROM s_users WHERE pID\" заняло %d м.с / %d мик.с	",
		cache_get_query_exec_time(MILLISECONDS), cache_get_query_exec_time(MICROSECONDS)
	);*/
	cache_get_value_name_int(0, "u_nodonate", get_nodonate);
	if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
	if (get_nodonate == 0) {
		SendClientMessage(playerid, 0xFF6600AA, !"Новых пополнений не найдено.");
		ShowDonateMaxPidaras(playerid); 
		return 1;
	}
	if (get_nodonate >= 1) {
		new
			string_[128];
		if (gBoostServer[sBoost]) {
			format(string_, sizeof string_, "Вы пополнили счет на "collime"%d "DonatePoint".", get_nodonate*gBoostServer[sBoostDonate]);
			SendClientMessage(playerid, COLOR_WHITE, string_);
			pInfo[playerid][pDonate] += get_nodonate*gBoostServer[sBoostDonate];
		}
		else {
			format(string_, sizeof string_, "Вы пополнили счет на "collime"%d "DonatePoint".", get_nodonate);
			SendClientMessage(playerid, COLOR_WHITE, string_);
			pInfo[playerid][pDonate] += get_nodonate;
		}  
		OnPlayerAchievProgress(playerid, 38, get_nodonate);
		pInfo[playerid][pNoDonate] = 0; 
		format(query_, sizeof query_, "`u_donate` = '%i', `u_nodonate` = '%i'", 
			pInfo[playerid][pDonate],pInfo[playerid][pNoDonate]
		);
		SavePlayerStr(playerid, query_); 
		ShowDonateMaxPidaras(playerid);
	} 
	return 1;
}
stock ShowDonateMaxPidaras(playerid)
{
	t_string[0] = EOS;
	new get_donate = 5120; 
	format(t_string, sizeof t_string, ""colserver"[№] Привилегия\t"colserver"Цена\n\
		"colwhi"[0] Игровая валюта\t"collime"1 "DonatePoint" = $%d\n\
		"colwhi"[1] Смена ника\t"collime"50 "DonatePoint"\n\
		"colwhi"[2] Снятие варна\t"collime"250 "DonatePoint"\n\ 
		"colwhi"[3] Анти-Голод\t"collime"150 "DonatePoint"\n\ 
		"colwhi"[4] Дополнительные привилегии\t"collime"от 3 "DonatePoint"\n\
		"colwhi"[5] Уникальные аксессуары\n\
		"colwhi"[6] Стартовые пакеты\t"collime"от 300 "DonatePoint"\n\
		"colwhi"[7] VIP пакеты\t"collime"от 500 "DonatePoint"\n\
		"colwhi"[8] SIM-карты Форматов(44444, 55555)\t"collime"от 1500 "DonatePoint"\n\
		"collime"Обновить баланс", 
		(gBoostServer[sBoost]) ? get_donate*gBoostServer[sBoostCash] : get_donate )
	; 
 	ShowPlayerDialog(playerid, D_DONATE_MENU_0, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Донат: "colwhi"Привилегии", t_string, "Далее", "Отмена");
	return 1;
}

stock v_velo(vehicleid)
{
	switch(GetVehicleModel(vehicleid))
	{
		case 481, 509, 510: return 1;
	}
	return 0;
}

stock ToggleLights(vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	SetVehicleParamsEx(vehicleid, engine1, ( lights2 == VEHICLE_PARAMS_UNSET || lights2 == VEHICLE_PARAMS_OFF ) ? VEHICLE_PARAMS_ON : VEHICLE_PARAMS_OFF, alarm2, doors3, bonnet2, boot1, objective1);
	return 1;
}
stock toggle_engine1(playerid, vehicle_id)
{
	//new	Float: veh_health;
	//GetVehicleHealth(vehicle_id, veh_health);
	if (VehicleInfo[ vehicle_id - 1 ][vEngBreaked]) {
		SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Двигатель данного транспорта неисправен!");
		SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Используйте телефон "colserver"\"/call\" "colwhi"чтобы вызвать механика / таксиста");
		return GameTextForPlayer(playerid, !"~r~ENGINE HAS BROKENED", 5000, 3);
	}
	if (VehicleInfo[ vehicle_id - 1 ][vFineSlots] != -1) {
		NewFinePositionSlots[ VehicleInfo[ vehicle_id - 1 ][vFineSlots] ] = false;
		VehicleInfo[ vehicle_id - 1 ][vFineSlots] = -1;
	}
	GetVehicleParamsEx(vehicle_id, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	if (engine1 == VEHICLE_PARAMS_UNSET || engine1 == VEHICLE_PARAMS_OFF)
	{
		if (VehicleInfo[ vehicle_id - 1 ][vFuel] <= 0.1) {
			SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Используйте телефон "colserver"\"/call\" "colwhi"чтобы вызвать механика / таксиста");
			SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Используйте "colserver"\"/get fuel\" "colwhi"чтобы купить канистру возле АЗС");
			return SetVehicleParamsEx(vehicle_id, VEHICLE_PARAMS_OFF, lights2, alarm2, doors3, bonnet2, boot1, objective1);
		}
		else SetVehicleParamsEx(vehicle_id, VEHICLE_PARAMS_ON, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	}
	else SetVehicleParamsEx(vehicle_id, VEHICLE_PARAMS_OFF, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	return 1;
}

stock ShowPlayerReferals(playerid, page = 1) {
    format(t_string, sizeof (t_string), "SELECT Name, pLevel FROM s_users WHERE pDrug = '%s' ORDER BY `pLevel` DESC", 
        pInfo[playerid][pName]
    );
    new rows, Cache:tempQuery = mysql_query(dbHandle, t_string);
    cache_get_row_count(rows);
    t_string[0] = EOS;
    
    if (!rows) {
        SendClientMessage(playerid, COLOR_GREY, !"У вас нет действующих рефералов.");
        if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
        return true;
    }
    new max_page = (MAX_DIALOG_LIST_ITEMS + rows) / MAX_DIALOG_LIST_ITEMS, idx = 0;
    if (page < 1) page = 1;
    else if (page > max_page) page = max_page; 

    t_string = ""colserver"Никнейм\t"colserver"Уровень\n"colwhi"";
    for (new i = ((page - 1) * MAX_DIALOG_LIST_ITEMS), tempName[32], tempLevel; i < (page * MAX_DIALOG_LIST_ITEMS); i++) {
        if (i >= rows) continue;
        cache_get_value_name(i, "Name", tempName, sizeof (tempName));
        cache_get_value_name_int(i, "pLevel", tempLevel); 

        format(t_string, sizeof (t_string), "%s[%i] %s\t%d уровень\n", t_string, (page - 1) * MAX_DIALOG_LIST_ITEMS + idx, tempName, tempLevel);
        playerListItem[playerid][idx++] = -1;
    }
    if (page > 1) {
        strcat(t_string, "[<<<] Предыдущая страница\n");
        playerListItem[playerid][idx++] = 2; // (-)
    }
    if (page < max_page) {
        strcat(t_string, "Следующая страница [>>>] \n");
        playerListItem[playerid][idx++] = 1; // (+)
    }
    pTemp[playerid][tSelectPage] = page; 

    new titleSTR[46];
    format(titleSTR, sizeof (titleSTR), ""colserver"Список рефераллов (всего: %d)", rows);
    ShowPlayerDialog(playerid, D_REFERALS, DIALOG_STYLE_TABLIST_HEADERS, titleSTR, t_string, "Выбрать", "Закрыть");

    if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
    t_string[0] = EOS;
    return true;
}
stock FarmStats(playerid, idx)
{
	new str_[128],
		getid_ = GetCheckID(FarmInfo[idx][fOwner]); 
	t_string[0] = EOS;
	format(str_, sizeof str_,""colwhi"  Владелец: %s\n",FarmInfo[idx][fOwner], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);
	format(str_, sizeof str_," Баланс банка: %d\n",FarmInfo[idx][fBank]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Баланс счета 'LandTax': %d\n",FarmInfo[idx][fLandTax]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Цена за работу: %d\n\n",FarmInfo[idx][fZp]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Цена зерна: %d\n",FarmInfo[idx][fGrain_Price]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Зерна закуплено: %d / 10000\n",FarmInfo[idx][fGrain]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Зерна засеяно: %d / 5000\n",FarmInfo[idx][fGrain_Sown]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Продаваемый продукт: %s\n", (FarmInfo[idx][fProds_Selling] == 1)?("Картофель"):("Веселая трава"));
	strcat(t_string, str_);
	format(str_, sizeof str_," Количество на складе: %d / 10000\n",FarmInfo[idx][fProds]);
	strcat(t_string, str_);
	format(str_, sizeof str_," Цена продукта: %d\n\n",FarmInfo[idx][fProds_Price]);
	strcat(t_string, str_);//( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]")
	

	getid_ = GetCheckID(FarmInfo[idx][fDeputy_1]); 
	format(str_, sizeof str_,""colwhi" Заместитель: %s %s\n",FarmInfo[idx][fDeputy_1], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);
	
	getid_ = GetCheckID(FarmInfo[idx][fDeputy_2]); 
	format(str_, sizeof str_,""colwhi" Заместитель: %s %s\n",FarmInfo[idx][fDeputy_2], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);

	getid_ = GetCheckID(FarmInfo[idx][fDeputy_3]); 
	format(str_, sizeof str_,""colwhi" Заместитель: %s %s\n\n",FarmInfo[idx][fDeputy_3], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);
	
	getid_ = GetCheckID(FarmInfo[idx][fFarmer_1]); 
	format(str_, sizeof str_,""colwhi" Фермер: %s %s\n",FarmInfo[idx][fFarmer_1], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);

	getid_ = GetCheckID(FarmInfo[idx][fFarmer_2]); 
	format(str_, sizeof str_,""colwhi" Фермер: %s %s\n",FarmInfo[idx][fFarmer_2], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);

	getid_ = GetCheckID(FarmInfo[idx][fFarmer_3]); 
	format(str_, sizeof str_,""colwhi" Фермер: %s %s\n",FarmInfo[idx][fFarmer_3], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);

	getid_ = GetCheckID(FarmInfo[idx][fFarmer_4]); 
	format(str_, sizeof str_,""colwhi" Фермер: %s %s\n",FarmInfo[idx][fFarmer_4], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);

	getid_ = GetCheckID(FarmInfo[idx][fFarmer_5]); 
	format(str_, sizeof str_,""colwhi" Фермер: %s %s\n",FarmInfo[idx][fFarmer_5], ( getid_ == INVALID_PLAYER_ID ) ? ("[{ff001c}Offline"colwhi"]") : ("[{22ff00}Online"colwhi"]"));
	strcat(t_string, str_);
	return ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_MSGBOX, "Информация о Ферме", t_string, "Скрыть", "");
}
ShowFarmPanel(playerid)
{
    new message_[] =
	{"[0] Установить цену зерна\n\
	[1] Установить цену продуктов\n\
	[2] Установить цену работы\n\
	[3] Ввести деньги на счёт 'LandTax'\n\
	[4] Ввести деньги на ферму\n\
	[5] Вывести деньги с фермы\n\
	[6] Статистика за прошлый час\n\
	[7] Статистика за этот день\n\
	[8] Сменить продаваемый продукт\n\
	[9] Назначить Зама [1]\n\
	[10] Назначить Зама [2]\n\
	[11] Назначить Зама [3]\n\
	[12] Назначить Фермера [1]\n\
	[13] Назначить Фермера [2]\n\
	[14] Назначить Фермера [3]\n\
	[15] Назначить Фермера [4]\n\
	[16] Назначить Фермера [5]" };
    ShowPlayerDialog(playerid, D_FARM_FUNC_0, DIALOG_STYLE_LIST, "Панель настроек",message_, "Выбрать", "Отмена");
	return 1;
}

stock IsDeputyPlayer(const nickname[], idx)
{
	if (!strcmp(nickname, FarmInfo[idx][fDeputy_1], true)) return true;
	else if (!strcmp(nickname, FarmInfo[idx][fDeputy_2], true)) return true;
	else if (!strcmp(nickname, FarmInfo[idx][fDeputy_3], true)) return true;
	return false;
}
stock IsFermerPlayer(const nickname[], idx)
{
	if (!strcmp(nickname, FarmInfo[idx][fFarmer_1], true)) return true;
	else if (!strcmp(nickname, FarmInfo[idx][fFarmer_2], true)) return true;
	else if (!strcmp(nickname, FarmInfo[idx][fFarmer_3], true)) return true;
	else if (!strcmp(nickname, FarmInfo[idx][fFarmer_4], true)) return true;
	else if (!strcmp(nickname, FarmInfo[idx][fFarmer_5], true)) return true;
	return false;
}

stock SaveGangZone(i)
{
    new query_[100];
	format(query_, sizeof query_, "UPDATE `s_gangzone` SET `gang_owner` = '%d' WHERE `id` = '%d'", GZInfo[i][gFrakVlad], GZInfo[i][gID]);
	mysql_tquery(dbHandle, query_, "", "");

	GangZoneHideForAll(GZInfo[i][gZone]);
	GangZoneShowForAll(GZInfo[i][gZone], GetGangZoneColor(i));
	return 1;
} 

publics: GzCheck(const i, const napad, const vlad)
{
    GZInfo[i][gCaptureTime]--;
    UpdateSeconds(i);
    if (GZInfo[i][gCaptureTime] < 1)
    {
        new count_on_zone[2] = {0, ...};

        foreach(new x: PlayerTeam[vlad])
        {
            if (GetPlayerState(x) == PLAYER_STATE_ONFOOT && pTemp[x][PlayerAFK] <= 2 && IsPlayerToSquare(x, GZInfo[i][gCoords][0], GZInfo[i][gCoords][1],GZInfo[i][gCoords][2],GZInfo[i][gCoords][3]))
            {
                count_on_zone[0]++; 
                if (count_on_zone[0] == CAPTURE_EXTENSION_MIN_PLAYER) break;
            }
        }
        foreach(new x: PlayerTeam[napad])
        {
            if (GetPlayerState(x) == PLAYER_STATE_ONFOOT && pTemp[x][PlayerAFK] <= 2 && IsPlayerToSquare(x, GZInfo[i][gCoords][0], GZInfo[i][gCoords][1], GZInfo[i][gCoords][2], GZInfo[i][gCoords][3])) 
            {
                count_on_zone[1]++; 
                if (count_on_zone[1] == CAPTURE_EXTENSION_MIN_PLAYER) break;
            }
        }
        if (count_on_zone[0] == CAPTURE_EXTENSION_MIN_PLAYER && count_on_zone[1] == CAPTURE_EXTENSION_MIN_PLAYER)
        {
			new 
				dop_time = RandomFIX(60, 120);
            GZInfo[i][gCaptureTime] = dop_time;//120; RandomFIX(60, 120)
			GZInfo[i][gCaptureOverTime] = 1;
            UpdateSeconds(i);
            SendFamilyMessage(napad, 0x00cc44FF, !"Война за территорию продлена");
			SendFamilyMessage(vlad, 0x00cc44FF, !"Война за территорию продлена"); 
			new 
				string_[128];
			format(string_, sizeof string_, "[Оповещение]: CAPTURE: %s/%s "colwhi"продлен на %d секунд [Счетчик: %d/%d]",
				name_band[capture_band(napad)], name_band[capture_band(vlad)], dop_time, capture_kills[capture_band(napad)], capture_kills[capture_band(vlad)]
			);
			SendAdminMessage(0xEB6B56FF, string_);  
            return 1;
        } 
		if (count_on_zone[0] < count_on_zone[1])
		{
			SendFamilyMessage(napad, 0x00B953AA, !"Вы взяли под свой контроль новую территорию (+ 10 G-Points)");
			GiveFractionPoints(napad, 10);
			SendFamilyMessage(vlad, 0xC56565AA, !"Вы потеряли контроль одной из своих территорий");
			GZInfo[i][gFrakVlad] = napad;
			GangZoneStopFlashForAll(GZInfo[i][gZone]);
			SaveGangZone(i);

			foreach(new idx: PlayerTeam[napad])
			{
				OnPlayerQuestProgress(idx, QUEST_GHETTO, QUEST_TASK_WIN_CAPTURE);
			}
		}
		else
		{
			SendFamilyMessage(vlad, 0x00B953AA, !"Вы отстояли свою территорию (+ 10 G-Points)");
			GiveFractionPoints(vlad, 10);
			SendFamilyMessage(napad, 0xC56565AA, !"Вам не удалось захватить территорию");
			GangZoneStopFlashForAll(GZInfo[i][gZone]);
		} 


        new bestPlayerID;
        foreach(new idx: PlayerTeam[napad]) {
			if (CaptureInfo[idx][pDMG]) {
				if (bestPlayerID == -1 || CaptureInfo[idx][pDMG] > CaptureInfo[bestPlayerID][pDMG]) {
					bestPlayerID = idx;
				}
			}
			/*for(new i_ = 0; i_ < 5; i_++) {
				if (!player_mobile[idx]) SendDeathMessageToPlayer(idx,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
			} */
            HideTextDrawCapture(idx,GZInfo[i][gTD]);
			new query_[128];
			mysql_format(dbHandle, query_,sizeof query_,"UPDATE s_users SET CapturesCount = CapturesCount + 1 WHERE pID = '%d' LIMIT 1", pInfo[idx][pID]);
			mysql_tquery(dbHandle, query_, "", "");
 		}
        foreach(new idx: PlayerTeam[vlad]) {
			if (CaptureInfo[idx][pDMG]) {
				if (bestPlayerID == -1 || CaptureInfo[idx][pDMG] > CaptureInfo[bestPlayerID][pDMG]) {
					bestPlayerID = idx;
				}
			}
			/*for(new i_ = 0; i_ < 5; i_++) {
				if (!player_mobile[idx]) SendDeathMessageToPlayer(idx,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
			} */
            HideTextDrawCapture(idx,GZInfo[i][gTD]);
			new query_[128];
			mysql_format(dbHandle, query_,sizeof query_,"UPDATE s_users SET CapturesCount = CapturesCount + 1 WHERE pID = '%d' LIMIT 1", pInfo[idx][pID]);
			mysql_tquery(dbHandle, query_, "", "");
 		}
		if (bestPlayerID != -1) {
			format(t_string, sizeof (t_string), "Лучший игрок - %s[%i], который совершил %d уб. и нанёс %.1f!",
				pInfo[bestPlayerID][pName], bestPlayerID, CaptureInfo[bestPlayerID][pKills], CaptureInfo[bestPlayerID][pDMG]
			);
			GiveFractionRepute(pInfo[bestPlayerID][pMember], 5);
		} 
		SendFamilyMessage(napad, 0x00B953AA, t_string);
		SendFamilyMessage(vlad, 0xC56565AA, t_string);

		ClearKillFeed(napad);
		ClearKillFeed(vlad);

		t_string[0] = EOS;

        capture_now[capture_band( napad )] = 0;
        capture_now[capture_band( vlad )] = 0;

        capture_start[capture_band( napad )] = CoolDownHourCapture();
        capture_start[capture_band( vlad )] = CoolDownHourCapture();

        g_capture_attack[capture_band( napad )] = false;
        g_capture_attack[capture_band( vlad )] = false;

        TotalGzB = 0, TotalGzV = 0, TotalGzG = 0, TotalGzA = 0, TotalGzR = 0, TotalGzP = 0;
        for(new x = 1; x <= TOTALGZ; x++)
		{
			if (GZInfo[x][gFrakVlad] == 8) TotalGzP++;
			if (GZInfo[x][gFrakVlad] == 12) TotalGzB++;
			if (GZInfo[x][gFrakVlad] == 13) TotalGzV++;
			if (GZInfo[x][gFrakVlad] == 15) TotalGzG++;
			if (GZInfo[x][gFrakVlad] == 17) TotalGzA++;
			if (GZInfo[x][gFrakVlad] == 18) TotalGzR++;
		}
		DestroyDynamicArea(GZInfo[i][gCaptureArea]);

		
		//captureid_slots[capture_id] = pInfo[playerid][pMember];
        if (GZInfo[i][gTimer] != 0)
		{
			KillTimer(GZInfo[i][gTimer]);
			GZInfo[i][gTimer] = 0;
        } 
		#if defined _capture_stats_inc
			if (CAPTURE_STATS_ENABLED) {
				//new capture_id = GetGangCaptureID(napad);
				new capture_id = GZInfo[i][gTD];
				if (capture_id != -1) {
					#if !defined CAPTURE_SHOW_ALWAYS
					if (capture_band(capture_gangs[capture_id][0]) < sizeof (capture_band_captureid))
						capture_band_captureid[capture_band(capture_gangs[capture_id][0])] = -1;
					if (capture_band(capture_gangs[capture_id][1]) < sizeof (capture_band_captureid))
						capture_band_captureid[capture_band(capture_gangs[capture_id][1])] = -1;
					#endif
					captureid_slots[capture_id] = 
					capture_gangs[capture_id][0] = 
					capture_gangs[capture_id][1] = 0;
				}
			}
			setCaptureFreeID[ GZInfo[i][gTD] ] = -1;
        #endif
    }
	return 1;
}

publics: MzCheck(i,napad,vlad)
{
	if (ZoneID < 1 || ZoneID > sizeof (MafiaWarZonePos))
	{
		KillTimer(MzCheckTimer); 
		return 1;
	}
	ZoneTimer--;
	UpdateMafiaWarSeconds();
 
	if (ZoneTimer == 600) {
	    SendFamilyMessage(napad,0x114D71AA, !"У вас осталось 10 минут на подготовку!");
	    SendFamilyMessage(vlad,0x114D71AA, !"У вас осталось 10 минут на подготовку!");
	}
	if (ZoneTimer == 120) {
	    SendFamilyMessage(napad,COLOR_RED, !"Пора решать кому будет принадлежать бизнес. Осталось 2 минуты");
	    SendFamilyMessage(vlad,COLOR_RED, !"Пора решать кому будет принадлежать бизнес. Осталось 2 минуты");
	}

	if (ZoneTimer < 1) 
	{ 
		new count_on_zone[2] = {0, ...};
        
        foreach(new x: PlayerTeam[vlad])
        {
            if (GetPlayerState(x) == PLAYER_STATE_ONFOOT && pTemp[x][PlayerAFK] <= 2 && IsPlayerToMafiaWar(x))
            {
                count_on_zone[0]++; 
                if (count_on_zone[0] == MAFIAWAR_EXTENSION_MIN_PLAYER) break;
            }
        }
        foreach(new x: PlayerTeam[napad])
        {
            if (GetPlayerState(x) == PLAYER_STATE_ONFOOT && pTemp[x][PlayerAFK] <= 2 && IsPlayerToMafiaWar(x))
            {
                count_on_zone[1]++; 
                if (count_on_zone[1] == MAFIAWAR_EXTENSION_MIN_PLAYER) break;
            }
        }

		new str_biz_name[64],str_control[68+sizeof(str_biz_name)];
		format(str_biz_name,sizeof(str_biz_name),"%s",BusinessInfo[i][bName]);

		if (count_on_zone[0] == MAFIAWAR_EXTENSION_MIN_PLAYER && count_on_zone[1] == MAFIAWAR_EXTENSION_MIN_PLAYER) 
        {
            ZoneTimer = 120;
			format( str_control,sizeof(str_control),"Вам добавлено 2 минуты для решения: кто будет контролировать бизнес %s.",str_biz_name);
			SendFamilyMessage(napad, 0x00cc44FF,str_control);
			SendFamilyMessage(vlad, 0x00cc44FF,str_control);
            return 1;
        }
		if (count_on_zone[0] < count_on_zone[1])
       // if (kills_mafia[0] > kills_mafia[1])
        {
			format(str_control,sizeof(str_control),"Вы взяли под контроль бизнес %s",str_biz_name);
			SendFamilyMessage(napad, 0x114D71AA,str_control);
			format(str_control,sizeof(str_control),"Вы потеряли контроль над бизнесом %s",str_biz_name);
			SendFamilyMessage(vlad, 0xC56565AA,str_control);
			BusinessInfo[i][bMafia] = napad;

			new qury_[60];
			format(qury_, sizeof (qury_), "bMafia = %i", BusinessInfo[i][bMafia]);
			SaveBusiness(i, qury_);

			StopWar();
        }
        else
        {
			format(str_control,sizeof(str_control), "Вы отстояли бизнес %s",str_biz_name);
           	SendFamilyMessage(vlad,0x114D71AA,str_control);
			format(str_control,sizeof(str_control), "Вам не удалось захватить  бизнес %s",str_biz_name);
			SendFamilyMessage(napad,0xC56565AA,str_control);
			StopWar();
        }
		ClearKillFeed(napad);
		ClearKillFeed(vlad);

		capture_now[capture_band( napad )] = 0;
        capture_now[capture_band( vlad )] = 0;

        capture_start[capture_band( napad )] = 2;
        capture_start[capture_band( vlad )] = 2;

        gang_capture--;

		#if defined _capture_stats_inc
			if (CAPTURE_STATS_ENABLED) {
				new capture_id = TYPE_WAR_MAFIA;
				if (capture_id != -1) {
					#if !defined CAPTURE_SHOW_ALWAYS
					if (capture_band(capture_gangs[capture_id][0]) < sizeof (capture_band_captureid))
						capture_band_captureid[capture_band(capture_gangs[capture_id][0])] = -1;
					if (capture_band(capture_gangs[capture_id][1]) < sizeof (capture_band_captureid))
						capture_band_captureid[capture_band(capture_gangs[capture_id][1])] = -1;
					#endif
					captureid_slots[capture_id] = 
					capture_gangs[capture_id][0] = 
					capture_gangs[capture_id][1] = 0;
				}
			}
        #endif

	}
	return 1;
}

stock StopWar()
{ 
    foreach(new idx: PlayerTeam[mafia_frac_id[0]])
	{
		/*for(new i_ = 0; i_ < 5; i_++) {
			if (!player_mobile[idx]) SendDeathMessageToPlayer(idx,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
		}*/
		HideTextDrawCapture(idx, TYPE_WAR_MAFIA); 
		OnPlayerQuestProgress(idx, QUEST_MAFIA, QUEST_TASK_MAFIA_WAR);
	}
	foreach(new idx: PlayerTeam[mafia_frac_id[1]])
	{
		/*for(new i_ = 0; i_ < 5; i_++) {
			if (!player_mobile[idx]) SendDeathMessageToPlayer(idx,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
		}*/
		HideTextDrawCapture(idx, TYPE_WAR_MAFIA);

		OnPlayerQuestProgress(idx, QUEST_MAFIA, QUEST_TASK_MAFIA_WAR);
	}
 
	ZoneID = 0;
	ZoneTimer = 0;
	mafia_frac_id[0] = 0;
	mafia_frac_id[1] = 0;
	kills_mafia[0] = 0;
	kills_mafia[1] = 0; 
	GangZoneStopFlashForAll(ZoneWar);
	GangZoneHideForAll(ZoneWar);
	KillTimer(MzCheckTimer);
}  

publics: BzCheck(i,napad,vlad)
{ //), 7, 1, -1, 111122)
	BikersTimer--;
	UpdateBikersWarSeconds();

	if (BikersTimer == 600) {//Пора выяснить, кто завоюет крышу клиентуры. До конца стрелы осталось 10 минут.
	    SendFamilyMessage(napad,0x114D71AA, !"Пора выяснить, кто завоюет крышу клиентуры. До конца стрелы осталось 10 минут.", .dliv = true);
	    SendFamilyMessage(vlad,0x114D71AA, !"Пора выяснить, кто завоюет крышу клиентуры. До конца стрелы осталось 10 минут.", .dliv = true);
		SendAdminMessage(0x114D71AA, "Пора выяснить, кто завоюет крышу клиентуры. До конца стрелы осталось 10 минут.");
	}
	if (BikersTimer == 120) {
	    SendFamilyMessage(napad, 0x114D71AA, !"Поторопитесь, до конца стрелы осталось 2 минуты.", .dliv = true);
	    SendFamilyMessage(vlad, 0x114D71AA, !"Поторопитесь, до конца стрелы осталось 2 минуты.", .dliv = true);
		SendAdminMessage(0x114D71AA, "Поторопитесь, до конца стрелы осталось 2 минуты.");
	}

	if (BikersTimer < 1) 
	{ 
		new count_on_zone[2] = {0, ...};
        
        foreach(new x: PlayerTeam[vlad])
        {
            if (GetPlayerState(x) == PLAYER_STATE_ONFOOT && pTemp[x][PlayerAFK] <= 2 && IsPlayerToBikersWar(x, i))
            {
                count_on_zone[0]++; 
                if (count_on_zone[0] == BIKERWAR_EXTENSION_MIN_PLAYER) break;
            }
        }
        foreach(new x: PlayerTeam[napad])
        {
            if (GetPlayerState(x) == PLAYER_STATE_ONFOOT && pTemp[x][PlayerAFK] <= 2 && IsPlayerToBikersWar(x, i))
            {
                count_on_zone[1]++; 
                if (count_on_zone[1] == BIKERWAR_EXTENSION_MIN_PLAYER) break;
            }
        } 
		new string_[128]; 

		if (count_on_zone[0] == BIKERWAR_EXTENSION_MIN_PLAYER && count_on_zone[1] == BIKERWAR_EXTENSION_MIN_PLAYER) 
        {
            BikersTimer = 120; 
			SendFamilyMessage(napad, 0x114D71AA, "Война за клиентуру продлена на 2 минуты.", .dliv = true);
			SendFamilyMessage(vlad, 0x114D71AA, "Война за клиентуру продлена на 2 минуты.", .dliv = true);
			SendAdminMessage(0x114D71AA, "Война за клиентуру продлена на 2 минуты.");
            return 1;
        }
        if (kills_bikers[0] > kills_bikers[1])
        {
			format(string_, sizeof string_, "Вы взяли под контроль дом семьи: %s", FamilyHouse[i][fhOwner]);
			SendFamilyMessage(napad, 0x114D71AA, string_);
			format(string_, sizeof string_, "Вы потеряли контроль над домом семьи: %s", FamilyHouse[i][fhOwner]);
			SendFamilyMessage(vlad, 0xC56565AA, string_);
			FamilyHouse[i][fhBikers] = napad;

			new query_[64];
			format(query_, sizeof query_, "hBikers = '%d'", FamilyHouse[i][fhBikers]);
			SaveFamilyHouse(i, query_);  

			StopBikersWar();
        }
        else
        {
			format(string_, sizeof string_, "Вы отстояли свою крышу %s",FamilyHouse[i][fhOwner]);
           	SendFamilyMessage(vlad,0x114D71AA, string_);
			format(string_, sizeof string_, "Вам не удалось завоевать крышу семейного особняка: %s",FamilyHouse[i][fhOwner]);
			SendFamilyMessage(napad,0xC56565AA, string_);
			StopBikersWar();
        }
		capture_now[capture_band( napad )] = 0;
        capture_now[capture_band( vlad )] = 0;

        capture_start[capture_band( napad )] = 2;
        capture_start[capture_band( vlad )] = 2;
		#if defined _capture_stats_inc
			if (CAPTURE_STATS_ENABLED) {
				new capture_id = TYPE_WAR_BIKERS;
				if (capture_id != -1) {
					#if !defined CAPTURE_SHOW_ALWAYS
					if (capture_band(capture_gangs[capture_id][0]) < sizeof (capture_band_captureid))
						capture_band_captureid[capture_band(capture_gangs[capture_id][0])] = -1;
					if (capture_band(capture_gangs[capture_id][1]) < sizeof (capture_band_captureid))
						capture_band_captureid[capture_band(capture_gangs[capture_id][1])] = -1;
					#endif
					captureid_slots[capture_id] = 
					capture_gangs[capture_id][0] = 
					capture_gangs[capture_id][1] = 0;
				}
			}
        #endif

	}
	return 1;
}

stock StopBikersWar()
{ 
    foreach(new idx: PlayerTeam[bikers_frac_id[0]])
	{
		/*for(new i_ = 0; i_ < 5; i_++) {
			if (!player_mobile[idx]) SendDeathMessageToPlayer(idx,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
		}*/
		HideTextDrawCapture(idx, TYPE_WAR_BIKERS); 
	}
	foreach(new idx: PlayerTeam[bikers_frac_id[1]])
	{
		/*for(new i_ = 0; i_ < 5; i_++) {
			if (!player_mobile[idx]) SendDeathMessageToPlayer(idx,INVALID_PLAYER_ID-1, INVALID_PLAYER_ID-1, 0);
		}*/
		HideTextDrawCapture(idx, TYPE_WAR_BIKERS);
	}
  
	BikersTimer = 0;
	UpdateFamilyHouse(BikersFamilyHouseID);
	BikersFamilyHouseID = -1;
	bikers_frac_id[0] = 0;
	bikers_frac_id[1] = 0;
	kills_bikers[0] = 0;
	kills_bikers[1] = 0; 
	GangZoneStopFlashForAll(BikersWarGZ);
	GangZoneHideForAll(BikersWarGZ);
	GangZoneDestroy(BikersWarGZ);
	BikersWarGZ = INVALID_GANGZONE_ID;
	KillTimer(BzCheckTimer);
}  

stock GetIDOwnerGangZone(playerid) {
	new 
		bool: IsReturn = false;
	for(new idx = 1; idx <= TOTALGZ; idx++) {
		if(IsPlayerToSquare(playerid, GZInfo[idx][gCoords][0], GZInfo[idx][gCoords][1], GZInfo[idx][gCoords][2], GZInfo[idx][gCoords][3]) && pInfo[playerid][pMember] == GZInfo[idx][gFrakVlad]) {
			IsReturn = true; 
			break;
		}
	} 
	if (IsReturn) return true;
	return false;
}

stock IsPlayerInVehicleHome(playerid)
{
	if (!pTemp[playerid][tPlayerTrailerHome]) return 0;
	if (VehicleInfo[ pTemp[playerid][tPlayerTrailerHome] - 1 ][vFraction] == pInfo[playerid][pID]) return 1; 
	return 0;
}

publics: ShowNewsStatsAdvert(playerid, id_fraction, type_)
{
	new rows,
		edited_ads_,
		member_,
		NameShooter_[MAX_PLAYER_NAME],
		string_[164] ;
	t_string[0] = EOS;
	cache_get_row_count(rows);
	if (rows)
	{
        if (type_ == 0) strcat(t_string, ""colserver"[№] Никнейм\t"colserver"Отредактировал\n");
        else strcat(t_string, ""colserver"[№] Никнейм\t"colserver"Отредактировал\t"colserver"Организация\n");
		for ( new idx = 0 ; idx < rows ; idx ++ )
		{
		    cache_get_value_name(idx, "Name", NameShooter_, MAX_PLAYER_NAME);
		    cache_get_value_name_int(idx, "pMember", member_);
			cache_get_value_name_int(idx, "edited_ads", edited_ads_);
			if (member_ == 9 || member_ == 16 || member_ == 20)
			{
				if (type_ == 0)
				{
				    if (member_ == id_fraction)
				    {
						format(string_, sizeof string_, ""colwhi"[%d] %s\t%d объявлений\n", idx, NameShooter_, edited_ads_);
						strcat(t_string, string_);
					}
				}
				else
				{
				    format(string_, sizeof string_, ""colwhi"[%d] %s\t%d объявлений\t{%s}%s\n", idx, NameShooter_, edited_ads_, gFraction[member_][fRGBColor], fInfo[member_][fName]);
					strcat(t_string, string_);
				}
			}
		}
		ShowPlayerDialog(playerid, D_NEWS_PANEL_20, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Топ репортеров", t_string, "Назад", "Закрыть" ) ;
	}
	else err("Данные не найдены!");
	return 1 ;
}

stock IsPlayerInBlackList(name_player[], member_)
{
	new query_[128],
		rows ;
	format(query_, sizeof query_, "SELECT * FROM `s_blacklist` WHERE `NameBlack` = '%s' and `Fraction` = '%d'", name_player, member_);
	mysql_query(dbHandle, query_, true);
	cache_get_row_count(rows);

	if (!rows)
		return 0;
	else
		return 1;
}
publics: ShowBlackList(playerid)
{
	new rows;
	cache_get_row_count(rows);
	if (rows < 1)
	{
	    SendClientMessage(playerid, COLOR_GREY, !"Черный список Вашей организации пустой!");
	    ShowPlayerDialog(playerid, D_FRACTION_FUNC_8, DIALOG_STYLE_LIST, ""colserver"Участники организации", "[0] Все участники организации [OFFLINE]\n\
			[1] Фильтр по рангу\n[2] Участники организации [ONLINE]\n[3] Очистить Черный список\n[4] Посмотреть Черный список", "Выбрать", "Назад");
		return 1;
	}
	t_string[0] = EOS;
	new str_[128],
		nameleader[MAX_PLAYER_NAME],
		moneylist,
		reasonlist[64];
	strcat(t_string, ""colserver"Занёс\t\t\tСумма\t\tПричина\n\n");
	for(new idx; idx != rows; idx++)
	{
	    cache_get_value_name(idx, "NameLeader", nameleader, MAX_PLAYER_NAME);
	    cache_get_value_name(idx, "Reason", reasonlist, 64);
		cache_get_value_name_int(idx, "Money", moneylist);
		format(str_, sizeof str_, ""colwhi"%s\t"collime"$%d"colwhi"\t\t%s\n", nameleader, moneylist, reasonlist);
		strcat(t_string, str_);
	}
	ShowPlayerDialog(playerid, D_FRACTION_FUNC_21, 0, ""colserver"Чёрный список", t_string, "Назад", "Закрыть");
	return 1;
}
publics: LoadAccountBlackList(playerid)
{
	new rows;
	cache_get_row_count(rows);
	if (rows < 1)
	{
	    SendClientMessage(playerid, COLOR_GREY, !"Вы не найдены не в одном черном списке");
		return ShowBankCenterDialog(playerid);
	}
	t_string[0] = EOS;
	new str_[128],
		player_name[MAX_PLAYER_NAME],
		money_,
		fraction_;
	strcat(t_string, ""colserver"[№] Организация\t"colserver"Сумма\t"colserver"Занёс\n");
	for(new idx; idx != rows; idx++)
	{
		cache_get_value_name(idx, "NameLeader", player_name, MAX_PLAYER_NAME);
		cache_get_value_name_int(idx, "Money", money_);
		cache_get_value_name_int(idx, "Fraction", fraction_);
		format(str_, sizeof str_, "[%d] %s\t$%d\t%s\n",idx, fInfo[fraction_][fName], money_, player_name);
		strcat(t_string, str_);
	}
	ShowPlayerDialog(playerid, D_BANK_FUNC_7, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Выход из: "colwhi"Черного списка", t_string, "Выбрать", "Отмена");
	return 1;
}
publics: EnterSearchBlackList(playerid, list_)
{
	new rows;
	cache_get_row_count(rows);
	if (rows < 1) return SendClientMessage(playerid, COLOR_GREY, !"Error (EnterSearchBlackList)");
	new
		str_[140],
		player_name[MAX_PLAYER_NAME],
		money_,
		fraction_;
    cache_get_value_name(list_, "NameLeader", player_name, MAX_PLAYER_NAME);
	cache_get_value_name_int(list_, "Money", money_);
	cache_get_value_name_int(list_, "Fraction", fraction_);
	
	SetPVarInt(playerid, "BlackListPlayerList", list_);
	SetPVarInt(playerid, "BlackListMoney", money_);
	SetPVarInt(playerid, "BlackListFraction", fraction_);
	SetPVarString(playerid, "BlackListNameLeader", player_name);
	
	format(str_, sizeof str_, ""colwhi"Вы желаете оплатить выход из черного списка в организации "colserver"%s\n"colwhi"За "collime"$%d"colwhi", Вы уверены?",fInfo[fraction_][fName], money_);
	ShowPlayerDialog(playerid, D_BANK_FUNC_8, DIALOG_STYLE_MSGBOX, ""colserver"Выход из: "colwhi"Черного списка", str_, "Да", "Нет");
	return 1;
}

stock uninvite_player(playerid)
{
    SendClientMessage(playerid, 0x6BB3FFAA, !"Вы снова гражданский");
	if (pTemp[playerid][tDutyWork] == 1){
    	SendClientMessage(playerid, 0x6BB3FFAA, !"Рабочий день окончен");
	}
    leave_team(playerid, pInfo[playerid][pMember]);
	LeavePlayerTaxi(playerid); 

	pInfo[playerid][pMember] =
	pInfo[playerid][pLeader] = 
	pInfo[playerid][pRank] =
	pTemp[playerid][tDutyWork] = 
	pInfo[playerid][FractionMute] =
	pInfo[playerid][FractionWarn] =
	pInfo[playerid][pJob] = 0;

	SetPlayerColor(playerid, TEAM_HIT_COLOR);
	SetPlayerSkinEx(playerid, pInfo[playerid][pChar][0]);
	if (pInfo[playerid][PlayerSpawn] == 2)
	{
	    if (pInfo[playerid][pHouseID] == -1) pInfo[playerid][PlayerSpawn] = 0;
		else pInfo[playerid][PlayerSpawn] = 1;
	    SavePlayerInteger(playerid, "playerspawn", pInfo[playerid][PlayerSpawn]);
	}
	SetPlayerArmour(playerid,0);
	ResetPlayerWeapons(playerid);
    new query_[140];
	mysql_format(dbHandle,query_, sizeof query_ , "UPDATE `s_users` SET `pLeader` = '0', `pMember` = '0', `pRank` = '0', `pJob` = '0' WHERE `Name` = '%e' LIMIT 1", pInfo[playerid][pName]);
	mysql_tquery(dbHandle, query_, "", "");

	#if defined _businesses_inc
		if (pTemp[playerid][tPlayerStartRob] != 0)
		{
			TextDrawHideForPlayer(playerid,Loading[0]);
			TextDrawHideForPlayer(playerid,Loading[1]);
			TextDrawHideForPlayer(playerid,BusinessInfo[pTemp[playerid][tPlayerStartRob]][LoadingProgress]);
			pTemp[playerid][tPlayerStartRob] = 0;
		}
	#endif

	return 1;
}

publics: TestOffmembers(playerid)
{
	new
		rows,
		get_name[MAX_PLAYER_NAME],
		get_rank,
		get_date[32],
		string_[128];
	cache_get_row_count(rows);
	if (rows)
	{
	    SendClientMessage(playerid, 0x059BD3FF, !"Список игроков: [Ник] [Ранг] [Последний вход]");
	    for(new i; i < rows; i++)
		{
		    cache_get_value_name(i, "Name", get_name);
		 	cache_get_value_name_int(i, "pRank", get_rank);
			cache_get_value_name(i, "pGetonDate", get_date);
			format(string_, sizeof string_, "[%s] [%d] [%s]",get_name, get_rank, get_date);
			SendClientMessage(playerid, 0x059BD3FF, string_);
		}
	}
	else return SendClientMessage(playerid, COLOR_GREY, !"Все члены организации в сети!");
	return 1;
}
publics: callback_offmembers(playerid)
{
	new rows;
	cache_get_row_count(rows);
	if (!rows) {
		SendClientMessage(playerid, COLOR_GREY, !"Участники с данными параметрами не найдены") ;
		//ShowLeaderMenu ( playerid ) ;
		DeletePVar ( playerid, "ofm_list_page" ) ;
		return 1 ;
	}
	new rows_list = GetPVarInt(playerid, "ofm_list_page") - 1;
	SetPVarInt ( playerid, "ofm_list_rows", rows ) ; 
	t_string[0] = EOS;
	strcat(t_string, ""colserver"<< Предыдущая страница\t \t \n"colserver">> Следующая страница\t \t \n"); 
	for(new i = rows_list * 10, pl_ofm_name[MAX_PLAYER_NAME], pl_ofm_rank, string_[128], pl_ofm_online[16]; i <  rows_list * 10 + 10; i++)
	{
		if (i >= rows) break;
		cache_get_value_name(i, "Name", pl_ofm_name);
		cache_get_value_name_int(i, "pRank", pl_ofm_rank);
		cache_get_value_name(i, "pGetonDate", pl_ofm_online);

		new pvar_string[8];
		format(pvar_string, sizeof (pvar_string), "ofm_%d", i - rows_list * 10 ) ;
		SetPVarString(playerid, pvar_string, pl_ofm_name);

		format(string_, sizeof string_, "%s"colserver"\t%s(%d)"colwhi"\t%s\n",
			pl_ofm_name, fFractionRank[pInfo[playerid][pMember]][ pl_ofm_rank - 1 ],
			pl_ofm_rank, pl_ofm_online 
		);
		strcat(t_string, string_);
	}
	ShowPlayerDialog(playerid, D_FRACTION_FUNC_10, DIALOG_STYLE_TABLIST, ""colserver"Участники организации [OFFLINE]", t_string, "Выбрать", "Назад");
	return 1 ;
}
publics: callback_offmembers_info(playerid)
{
	new rows;
	cache_get_row_count(rows);
	if (rows)
	{
		new pl_rank, last_date [ 16 ]; 
		cache_get_value_name_int(0, "pRank", pl_rank);
		cache_get_value_name(0, "pGetonDate", last_date);
		new pvar_string[20], pl_name[MAX_PLAYER_NAME] ;
		format(pvar_string, sizeof pvar_string, "ofm_%d", GetPVarInt ( playerid, "ofm_listitem" ));
		GetPVarString(playerid, pvar_string, pl_name, MAX_PLAYER_NAME);
		new 
			dialog_string[186];
		format(dialog_string, sizeof dialog_string, ""colwhi"Имя: %s\nРанг:%s [%d]\nПоследний вход: %s",
			pl_name, fFractionRank[pInfo[playerid][pMember]][ pl_rank - 1 ],
			pl_rank, last_date
		);
		ShowPlayerDialog(playerid, D_FRACTION_FUNC_12, DIALOG_STYLE_MSGBOX, ""colserver"Информация об игроке", dialog_string, "Назад", "" );
	}
	if (!rows) {
		new 
			query_[128];
		DeletePVar(playerid, "ofm_listitem");
		if (!GetPVarInt(playerid, "ofm_type"))
		{
			mysql_format(dbHandle, query_, sizeof query_, "SELECT `Name`,`pRank`,`pGetonDate` FROM `s_users` WHERE `pMember` = '%d' AND `pLogin` = '0'", pInfo[playerid][pMember]);
			mysql_tquery(dbHandle, query_, "callback_offmembers", "i", playerid);
			return 1;
		}
		mysql_format(dbHandle, query_, sizeof query_, "SELECT `Name`,`pRank`,`pGetonDate` FROM `s_users` WHERE `pMember` = '%d' AND `pRank` = '%d' AND `pLogin` = '0'", pInfo[playerid][pMember], GetPVarInt(playerid, "ofm_type"));
		mysql_tquery(dbHandle, query_, "callback_offmembers", "i", playerid);

	}
	return 1 ;
}

stock OnPlayerServerBanWarn(playerid, nick[], reason[])
{
	new unwarndate, string[300];
	unwarndate = gettime() + (14 * 86400);
	mysql_format(dbHandle, string, sizeof(string), "INSERT INTO `s_ban`  ( `Text`, `Name`, `NameAdmin`, `Date`, `Unban`) VALUES ('%e', '%s', '%s', '%d', '%d')",reason, nick, pInfo[playerid][pName], gettime(), unwarndate);
	mysql_tquery(dbHandle, string);
	return 1;
}

stock OnPlayerServerBan(playerid, targetid = INVALID_PLAYER_ID, const reason[], temp_day)
{
	new unwarndate;

	unwarndate = gettime() + temp_day * 86400;

	mysql_format(dbHandle, 
        totalstring, 
        sizeof totalstring, 
        "INSERT INTO `s_ban`  ( `Text`, `Name`, `NameAdmin`, `Date`, `Unban`) VALUES ('%e', '%e', '%e', '%d', '%d')",
        reason, 
        pInfo[targetid][pName], 
        pInfo[playerid][pName], 
        gettime(), 
        unwarndate
    );
	mysql_tquery(dbHandle, totalstring);

	Kick(targetid);

    totalstring[0] = EOS;

	return 1;
}

stock HistoryPlayerBan(player_id, const newname[], const reason[])
{
	mysql_format(
        dbHandle, 
        totalstring, sizeof totalstring, "\
        INSERT INTO `sh_ban` (`pID`, `NameAdmin`, `Date`, `Text` ) VALUES ('%d', '%e', NOW(), '%e')", 
        player_id, 
        newname, 
        reason
    );
	mysql_tquery(dbHandle, totalstring);

    totalstring[0] = EOS;

    return 1;
}

stock HistoryPlayerWarn(player_id, const newname[], const reason[])
{
	mysql_format(
        dbHandle, 
        totalstring, 
        sizeof totalstring, "\
        INSERT INTO `sh_warn` (`pID`, `NameAdmin`, `Date`, `Text` ) VALUES ('%d', '%e', NOW(), '%e')", 
        player_id, 
        newname, 
        reason
    );
	mysql_tquery(dbHandle, totalstring);

    totalstring[0] = EOS;

    return 1;
}

stock SetPlayerHistoryName(player_id, const newname[], const oldname[])
{
	new query[156];
	format(query, sizeof(query), "INSERT INTO `sh_login` (`pID`, `PlayerName`, `OldName`, `Data`) VALUES ('%d', '%s', '%s', NOW())", player_id, newname, oldname);
	return mysql_tquery(dbHandle, query);
}

stock SetPlayerConnection(player_id, newname[], player_ip[])
{
	new query[156];
	format(query, sizeof(query), "INSERT INTO `sh_connect` (`pID`, `PlayerName`, `PlayerIP`, `Data`) VALUES ('%d', '%s', '%s', NOW())", player_id, newname, player_ip);
	return mysql_tquery(dbHandle, query);
}

publics: GetIDAccountNameStore(playerid, nick[], type)
{
	new rows, query[128], id_player;
	cache_get_row_count(rows);
	if (!rows) return 1;
	else
	{
        cache_get_value_name_int(0, "pID", id_player);
        if (type == 0)
        {
	        mysql_format(dbHandle, query, sizeof query, "SELECT * FROM `sh_ban` WHERE `pID` = '%d'", id_player);
			mysql_tquery(dbHandle, query, "LoadHistoryNameList", "dsd", playerid,nick, type);
		}
		else if (type == 1)
		{
		    mysql_format(dbHandle, query, sizeof query, "SELECT * FROM `sh_warn` WHERE `pID` = '%d'", id_player);
			mysql_tquery(dbHandle, query, "LoadHistoryNameList", "dsd", playerid,nick, type);
		}
		else if (type == 2)
		{
	        mysql_format(dbHandle, query, sizeof query, "SELECT * FROM `sh_login` WHERE `pID` = '%d' ORDER BY `Data` DESC LIMIT 0, 15", id_player);
			mysql_tquery(dbHandle, query, "LoadHistoryNameList", "dsd", playerid, nick, type);
		}
        else if (type == 3)
		{
	        mysql_format(dbHandle, query, sizeof query, "SELECT * FROM `sh_connect` WHERE `pID` = '%d' ORDER BY `Data` DESC LIMIT 0, 15", id_player);
			mysql_tquery(dbHandle, query, "LoadHistoryNameList", "dsd", playerid, nick, type);
		}
	}
	return 1;
}
publics: LoadHistoryNameList(playerid, nick[], type)
{
	new rows;
	cache_get_row_count(rows);
	new string_[128],
		NameAdm[MAX_PLAYER_NAME],
		BanDate[32],
		Reason[64],
		SetIP[16],
		SetLogin[MAX_PLAYER_NAME],
		SetOldLogin[MAX_PLAYER_NAME];
    t_string[0] = EOS ;
	if (type == 0)
	{
	    if (!rows)
	        return SendClientMessage(playerid, COLOR_GREY, !"У игрока нет банов!");
		strcat(t_string, ""colserver"[№] Дата блокировки\tПричина\tЗаблокировал\n");
		for(new idx; idx != rows; idx++)
		{
		    cache_get_value_name(idx, "Text", Reason, 64);
			cache_get_value_name(idx, "Date", BanDate, 32);
			cache_get_value_name(idx, "NameAdmin", NameAdm, MAX_PLAYER_NAME);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%s\t%s\n", idx, BanDate, Reason, NameAdm);
			strcat(t_string, string_);
		}
		ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"История блокировок", t_string, "Закрыть","");
	}
	else if (type == 1)
	{
	    if (!rows)
	        return SendClientMessage(playerid, COLOR_GREY, !"У игрока нет варнов!");
	    strcat(t_string, ""colserver"[№] Дата предупреждения\t"colserver"Причина\t"colserver"Выдал предупреждение\n");
		for(new idx; idx != rows; idx++)
		{
		    cache_get_value_name(idx, "Text", Reason, 64);
			cache_get_value_name(idx, "Date", BanDate, 32);
			cache_get_value_name(idx, "NameAdmin", NameAdm, MAX_PLAYER_NAME);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%s\t%s\n", idx, BanDate, Reason, NameAdm);
			strcat(t_string, string_);
		}
		ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"История предупреждений", t_string, "Закрыть","");
	}
	else if (type == 2)
	{
	    if (!rows)
	        return SendClientMessage(playerid, COLOR_GREY, !"Никнейм не менялся!");
	    strcat(t_string, ""colserver"[№] Старый Никнейм\t"colserver"Новый Никнейм\t"colserver"Дата смены\n");
		for(new idx; idx != rows; idx++)
		{
		    cache_get_value_name(idx, "PlayerName", SetLogin, MAX_PLAYER_NAME);
		    cache_get_value_name(idx, "OldName", SetOldLogin, MAX_PLAYER_NAME);
			cache_get_value_name(idx, "Data", BanDate, 32);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%s\t%s\n", idx, SetOldLogin, SetLogin, BanDate);
			strcat(t_string, string_);
		}
		new f_nickname[50];
		format(f_nickname, sizeof f_nickname, ""colserver"Текущий никнейм: "colwhi"%s",nick);
		ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_TABLIST_HEADERS, f_nickname, t_string, "Закрыть","");
	}
	else if (type == 3)
	{
	    if (!rows) return SendClientMessage(playerid, COLOR_GREY, !"История не найдена");
	    strcat(t_string, ""colserver"[№] Никнейм\t"colserver"IP\t"colserver"Дата авторизации\n");
		for(new idx; idx != rows; idx++)
		{
		    cache_get_value_name(idx, "PlayerName", SetLogin, MAX_PLAYER_NAME);
		    cache_get_value_name(idx, "PlayerIP", SetIP, MAX_PLAYER_NAME);
			cache_get_value_name(idx, "Data", BanDate, 32);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%s\t%s\n", idx, SetLogin, SetIP, BanDate);
			strcat(t_string, string_);
		}
		ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"История авторизации", t_string, "Закрыть","");
	}
	return 1;
}

ShowEconomyFraction(playerid)
{
	new 
		string_[256],
		str_[32],
		fraction_id = pInfo[playerid][pMember];
	t_string[0] = EOS;
	if (FractionInfo[fraction_id][fCDPrize] > gettime()) {
		format(str_, sizeof str_, "Через: "collime"%s", Convert(FractionInfo[pInfo[playerid][pMember]][fCDPrize] - gettime()) );
	} 
	else str_ = ""collime"Доступно";
	strcat(t_string, ""colserver"[№] Описание\t"colserver"Информация\n"); 
	strcat(t_string, ""colwhi"[0] Положить на счет организации\n[1] Снять со счета организации\n[2] Управление зарплатами");

	if (IsAMayor(playerid)) {
		new Cache:_result = mysql_query(dbHandle, "SELECT * FROM s_economy_mayor COUNT");
		new count_sender = cache_num_rows();
		if (cache_is_valid(_result)) cache_delete(_result);
		format(string_, sizeof string_, 
			"\n[3] Заявки на бюджет организаций\t["colwarn"Заявок: %d"colwhi"]\n\
			"colwhi"[4] Выдать премии\t%s\n\
			"colwhi"[5] Установить налог:\t"collime"$%d\n\
			"colwhi"[6] Установить налог на транспорт:\t"collime"$%d\n\
			"colwhi"[7] Управление пенсией:\tПенсия: "collime"$%d", 
			count_sender, str_, FractionInfo[fraction_id][fTaxState], fInfo[fraction_id][fCost][0], GetEconomyServer(ePension)
		); 
	}
	else if (pInfo[playerid][pMember] == FRACTION_LSPD) {
		format(string_, sizeof string_, 
			"\n[3] Запросить деньги у Мэрии\tБюджет: "collime"$%s\n\
			"colwhi"[4] Выдать премии\t%s\n\
			[5] Цена за сутки на штрафстоянке\t"collime"$%d", 
			convert_money(FractionInfo[fraction_id][fMoney]) , str_, fInfo[FRACTION_LSPD][fCost][0]
		);
	}
	else 
	{ 
		format(string_, sizeof string_, "\n[3] Запросить деньги у Мэрии\tБюджет: "collime"$%s\n\
			"colwhi"[4] Выдать премии\t%s", convert_money(FractionInfo[fraction_id][fMoney]), str_);
	} 
	strcat(t_string, string_);
	ShowPlayerDialog(playerid, D_FRACTION_FUNC_33, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Управление бюджетом", t_string, "Выбрать", "Закрыть");
	return 1;
}
stock ShowSenderFraction(playerid) 
{
	new query_[128]; 
	new 
		rows, 
		idx, 
		Cache:tempQuery = mysql_query(dbHandle, "SELECT id, eReason, eMoney,eFrac,eOwner FROM `s_economy_mayor` ORDER BY `id`");

	query_[0] = EOS;
	cache_get_row_count(rows);
	if (!rows) {
		SendClientMessage(playerid, COLOR_GREY, !"Запросов не найдено");
		if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
		return true;
	}
	format(t_string, sizeof (t_string), ""colserver"[№] Организация(Отправитель)\t"colserver"Финансирование\t"colserver"Сумма\n");

	for (new i = 0, reason[32 + 1], id, money, sender[MAX_PLAYER_NAME], frac; i < rows; i++) {
		cache_get_value_name_int(i, "id", id);
		cache_get_value_name(i, "eReason", reason, sizeof (reason));
		cache_get_value_name_int(i, "eMoney", money);
		cache_get_value_name_int(i, "eFrac", frac);
		cache_get_value_name(i, "eOwner", sender);
		//printf("ShowSuspectList: i %d id = %d", i, id);
		playerListItem[playerid][idx] = id;
		format(t_string, sizeof (t_string), "%s"colwhi"[%d] %s(%s)\t%s\t"collime"%d $\n", 
			t_string, idx++, gFraction[frac][fName], sender, reason, money
		);
	} 
	ShowPlayerDialog(playerid, D_FRACTION_FUNC_38, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Казна: "colwhi"Заявки на бюджет", t_string, "Выбрать", "Отмена");
	t_string[0] = EOS;
	if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
	return true;
}
stock GetPlayerFractionMoney(playerid)
{
	new _veh_count = 0,
		query_[78];
	format(query_, sizeof query_,"SELECT * FROM s_economy_mayor WHERE eFrac = '%d'", pInfo[playerid][pMember]);
	new Cache: result = mysql_query(dbHandle, query_);
	_veh_count = cache_num_rows( );
	if (cache_is_valid(result)) cache_delete(result);
	return _veh_count;
}
publics: ShowGangStatsKillers(playerid)
{
	new rows,
		CaptureKills_,
		Captures_,
		NameKillers_[MAX_PLAYER_NAME],
		string_[146] ;
	cache_get_row_count(rows);
	if (rows)
	{
		t_string[0] = EOS ;
		strcat(t_string, ""colserver"[№] Никнейм\t"colserver"Убийств\t"colserver"Захватов\n");
		for ( new idx = 0 ; idx < rows ; idx ++ )
		{
			
			cache_get_value_name_int(idx, "CaptureKills", CaptureKills_);
			cache_get_value_name_int(idx, "CapturesCount", Captures_);
			cache_get_value_name(idx, "Name", NameKillers_, MAX_PLAYER_NAME);
			format (string_, sizeof string_, ""colwhi"[%d] %s\t%d\t%d\n", idx, NameKillers_, CaptureKills_, Captures_ ) ;
			strcat (t_string, string_) ;
		}
		ShowPlayerDialog(playerid, D_GANG_FUNC_1, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Лучшие стрелки", t_string, "Назад", "Закрыть");
	}
	return 1 ;
}
publics: ShowGangStatsCaptures(playerid)
{
	new rows,
		CaptureStart_,
		NameShooter_[MAX_PLAYER_NAME],
		string_[146] ;
	cache_get_row_count(rows);
	if (rows)
	{
        t_string[0] = EOS ;
        strcat(t_string, ""colserver"[№] Никнейм\t"colserver"Спровоцировал\n");
		for ( new idx = 0 ; idx < rows ; idx ++ )
		{
			cache_get_value_name_int(idx, "CaptureStart", CaptureStart_);
			cache_get_value_name(idx, "Name", NameShooter_, MAX_PLAYER_NAME);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%d захватов\n", idx, NameShooter_, CaptureStart_ ) ;
			strcat(t_string, string_) ;
		}
		ShowPlayerDialog(playerid, D_GANG_FUNC_1, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Топ захватчиков", t_string, "Назад", "Закрыть" ) ;
	}
	return 1 ;
}
publics: ShowGangStatsDuel(playerid)
{
	new rows,
		DuelWinCount_,
		DuelLoseCount_,
		NameDuel_[MAX_PLAYER_NAME],
		string_[146] ;
	cache_get_row_count(rows);
	if (rows)
	{
        t_string[0] = EOS ;
        strcat(t_string, ""colserver"[№] Никнейм\t"colserver"Побед\t"colserver"Поражений\n");
		for ( new idx = 0 ; idx < rows ; idx ++ )
		{
			cache_get_value_name_int(idx, "DuelWinCount", DuelWinCount_);
			cache_get_value_name_int(idx, "DuelLoseCount", DuelLoseCount_);
			cache_get_value_name(idx, "Name", NameDuel_, MAX_PLAYER_NAME);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%d\t%d\n", idx,NameDuel_, DuelWinCount_, DuelLoseCount_ ) ;
			strcat(t_string, string_) ;
		}
		ShowPlayerDialog(playerid, D_GANG_FUNC_1, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Топ дуэлянтов", t_string, "Назад", "Закрыть" ) ;
	}
	return 1 ;
}
publics: ShowGangStatsGraffiti(playerid)
{
	new rows,
		GraffitiCount_,
		NameGraffiti_[MAX_PLAYER_NAME];
	cache_get_row_count(rows);
	if (rows)
	{
        t_string[0] = EOS ;
        strcat(t_string, ""colserver"[№] Никнейм\t"colserver"Закрасил\n");
		for ( new idx = 0, string_[146]; idx < rows ; idx ++ )
		{
			cache_get_value_name_int(idx, "GraffitiCount", GraffitiCount_);
			cache_get_value_name(idx, "Name", NameGraffiti_, MAX_PLAYER_NAME);
			format(string_, sizeof string_, ""colwhi"[%d] %s\t%d граффити\n", idx, NameGraffiti_, GraffitiCount_ ) ;
			strcat(t_string, string_) ;
		}
		ShowPlayerDialog(playerid, D_GANG_FUNC_1, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Топ райтеров", t_string, "Назад", "Закрыть" ) ;
	}
	return 1 ;
}

stock UpdateHouseSafe(idx)
{
	new query_[164];
	format(query_, sizeof query_, "UPDATE `house` SET `hSafe` = '%d,%d,%d,%d', `hSafeGun` = '%d,%d,%d,%d,%d,%d', `hSafeAmmo` = '%d,%d,%d,%d,%d,%d' WHERE `hID` = '%d' LIMIT 1",
	HouseInfo[idx][hSafe][0],HouseInfo[idx][hSafe][1],HouseInfo[idx][hSafe][2],HouseInfo[idx][hSafe][3],
	HouseInfo[idx][hSafeGun][0],HouseInfo[idx][hSafeGun][1],HouseInfo[idx][hSafeGun][2],HouseInfo[idx][hSafeGun][3],HouseInfo[idx][hSafeGun][4],HouseInfo[idx][hSafeGun][5],
	HouseInfo[idx][hSafeAmmo][0],HouseInfo[idx][hSafeAmmo][1],HouseInfo[idx][hSafeAmmo][2],HouseInfo[idx][hSafeAmmo][3],HouseInfo[idx][hSafeAmmo][4],HouseInfo[idx][hSafeAmmo][5],
	HouseInfo[idx][hID]);
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
}
ShowFamilyGunSafe(playerid)
{
	new H_IDX = pInfo[playerid][pHouseID], gunname[32], str[64];
	t_string[0] = EOS;
	strcat(t_string, "Оружие\tКоличество патронов\n");
	for (new x; x < 6; x ++)
	{
		if (HouseInfo[H_IDX][hSafeGun][x] != 0) GetWeaponName(HouseInfo[H_IDX][hSafeGun][x], gunname, 32);
		else gunname = "Свободный слот";
		format(str, sizeof(str), "[%d] %s\t%d\n", x + 1, gunname, HouseInfo[H_IDX][hSafeAmmo][x]);
		strcat(t_string, str);
	}
	return ShowPlayerDialog(playerid, D_SAFE_FAMILY_2, DIALOG_STYLE_TABLIST_HEADERS, ""colwhi"Оружие", t_string, "Выбрать", "Отмена");
}
ShowFamilySafeUsingMenu(playerid, listitem)
{
	new name[16], message[256];
	switch(listitem)
	{
		case 0: name = "Материалы", SetPVarInt(playerid, "SAFEUSEID", 0);
		case 1: name = "Наркотики", SetPVarInt(playerid, "SAFEUSEID", 1);
		case 2: name = "Ключи от камеры", SetPVarInt(playerid, "SAFEUSEID", 2);
		case 3: name = "Готовая рыба", SetPVarInt(playerid, "SAFEUSEID", 3);
	}
	format(message, sizeof(message), "\
	- "colserver"%s{ffffff}\n\
	Для того чтобы взять: \"-\" и количество.\n\
	Для того чтобы положить: \"+\" и количество.", name);
	return ShowPlayerDialog(playerid, D_SAFE_FAMILY_1, DIALOG_STYLE_INPUT, "Сейф", message, "Ввести", "Отмена");
}
ShowPlayerGunSafe(playerid)
{
	new H_IDX = pInfo[playerid][pHouseID], gunname[32], str[64];
	t_string[0] = EOS;
	strcat(t_string, "Оружие\tКоличество патронов\n");
	for (new x; x < 6; x ++)
	{
		if (HouseInfo[H_IDX][hSafeGun][x] != 0) GetWeaponName(HouseInfo[H_IDX][hSafeGun][x], gunname, 32);
		else gunname = "Свободный слот";
		format(str, sizeof(str), "[%d] %s\t%d\n", x + 1, gunname, HouseInfo[H_IDX][hSafeAmmo][x]);
		strcat(t_string, str);
	}
	return ShowPlayerDialog(playerid, D_SAFE_FUNC_2, DIALOG_STYLE_TABLIST_HEADERS, "Оружие", t_string, "Выбрать", "Отмена");
}
ShowSafeUsingMenu(playerid, listitem)
{
	new name[16], message[256];
	switch(listitem)
	{
		case 0: name = "Материалы", SetPVarInt(playerid, "SAFEUSEID", 0);
		case 1: name = "Наркотики", SetPVarInt(playerid, "SAFEUSEID", 1);
		case 2: name = "Ключи от камеры", SetPVarInt(playerid, "SAFEUSEID", 2);
		case 3: name = "Готовая рыба", SetPVarInt(playerid, "SAFEUSEID", 3);
	}
	format(message, sizeof(message), "\
	- "colserver"%s{ffffff}\n\
	Для того чтобы взять: \"-\" и количество.\n\
	Для того чтобы положить: \"+\" и количество.", name);
	return ShowPlayerDialog(playerid, D_SAFE_FUNC_1, DIALOG_STYLE_INPUT, "Сейф", message, "Ввести", "Отмена");
}

show_skill(playerid, targetid)
{
	new points[6], percent[2] = "%";
	t_string[0] = EOS;
	points[0] = 100 - pInfo[targetid][pGunSkill][0];
	points[1] = 100 - pInfo[targetid][pGunSkill][1];
	points[2] = 100 - pInfo[targetid][pGunSkill][2];
	points[3] = 100 - pInfo[targetid][pGunSkill][3];
	points[4] = 100 - pInfo[targetid][pGunSkill][4];
	points[5] = 100 - pInfo[targetid][pGunSkill][5];
	format(t_string, sizeof t_string, "\nSDPistol:\t[%s]%d%s\nDeagle:\t[%s]%d%s\nShotGun:\t[%s]%d%s\nMP5\t\t[%s]%d%s\nAK47:\t\t[%s]%d%s\nM4A1:\t\t[%s]%d%s\n",
	ToDevelopSkills(pInfo[targetid][pGunSkill][0],points[0]),pInfo[targetid][pGunSkill][0],percent,
	ToDevelopSkills(pInfo[targetid][pGunSkill][1],points[1]),pInfo[targetid][pGunSkill][1],percent,
	ToDevelopSkills(pInfo[targetid][pGunSkill][2],points[2]),pInfo[targetid][pGunSkill][2],percent,
	ToDevelopSkills(pInfo[targetid][pGunSkill][3],points[3]),pInfo[targetid][pGunSkill][3],percent,
	ToDevelopSkills(pInfo[targetid][pGunSkill][4],points[4]),pInfo[targetid][pGunSkill][4],percent,
	ToDevelopSkills(pInfo[targetid][pGunSkill][5],points[5]),pInfo[targetid][pGunSkill][5],percent);
	ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_MSGBOX, ""colserver"Навыки: "colserver"Владения оружием", t_string, "Готово", "");
}
#include "../source/fraction/function.pwn"
#include "../source/fraction/commands.pwn"
ShowBankCenterDialog(playerid) {
	return ShowPlayerDialog(playerid, D_BANK_FUNC_0, DIALOG_STYLE_LIST, "Банк", 
		""colwhi"[0] Пополнить счет\n\
		[1] Снять со счета\n\
		[2] Сделать перевод\n\
		[3] Баланс\n\
		[4] Оплатить квартплату\n\
		[5] Оплатить семейный дом\n\
		[6] Оплатить налог на транспорт\n\
		[7] Счет бизнеса\n\
		"C_PODS"[8] Управление депозитом\n\
		"colwhi"[9] Выйти из черного списка\n\
		"colwhi"[10] Операции с EURO", "Выбрать", "Отмена"		
	);
}

stock ShowPlayerMemberFraction(playerid, family, page = 1)
{
	#pragma unused page
    //pTemp[playerid][tSelectNextList] = 0;
	t_string[0] = EOS;
    t_string = ""colserver"Никнейм [ID]\t"colserver"Ранг\t"colserver"Выговоры\t"colserver"Статус\n"; 


	/* new max_page = (MAX_DIALOG_LIST_ITEMS + PlayerTeam[family]) / MAX_DIALOG_LIST_ITEMS, idx = 0;
    if (page < 1) page = 1;
    else if (page > max_page) page = max_page; 

    t_string = ""colserver"Никнейм\t"colserver"Уровень\n"colwhi"";
    for (new i = ((page - 1) * MAX_DIALOG_LIST_ITEMS), tempName[32], tempLevel; i < (page * MAX_DIALOG_LIST_ITEMS); i++) {
        if (i >= rows) continue;
        cache_get_value_name(i, "Name", tempName, sizeof (tempName));
        cache_get_value_name_int(i, "pLevel", tempLevel); 

        format(t_string, sizeof (t_string), "%s[%i] %s\t%d уровень\n", t_string, (page - 1) * MAX_DIALOG_LIST_ITEMS + idx, tempName, tempLevel);
        playerListItem[playerid][idx++] = -1;
    }
    if (page > 1) {
        strcat(t_string, "[<<<] Предыдущая страница\n");
        playerListItem[playerid][idx++] = 2; // (-)
    }
    if (page < max_page) {
        strcat(t_string, "Следующая страница [>>>] \n");
        playerListItem[playerid][idx++] = 1; // (+)
    }
    pTemp[playerid][tSelectPage] = page; */
/*
	new max_page = (5 + Iter_Count(PlayerTeam[family])) / 5, idx = 0;
    if (page < 1) page = 1;
    else if (page > max_page) page = max_page;
*/
	foreach(new i : PlayerTeam[family])
	{
        //if (pInfo[i][pAdmin]) continue;
		//if (i >= Iter_Count(PlayerTeam[family])) continue;
        format(t_string, sizeof t_string, "%s%s [%d]\t%s (%d)\t(%d/3)\t%s %s\n",
            t_string,
            pInfo[i][pName], i,
            fFractionRank[family][pInfo[i][pRank] - 1], pInfo[i][pRank], 
			pInfo[i][FractionWarn], 
			(pTemp[i][tDutyWork]) ? ("[На работе]") : ("[Не на работе]"),
            pTemp[i][PlayerAFK] >= 3 ? (""colwarn"[AFK]"colwhi"") : (""collime"[ONLINE]"colwhi"") );
		//playerListItem[playerid][idx++] = -1;
    }
	/*if (page > 1) {
        strcat(t_string, "[<<<] Предыдущая страница\n");
        playerListItem[playerid][idx++] = 2; // (-)
    }
    if (page < max_page) {
        strcat(t_string, "Следующая страница [>>>] \n");
        playerListItem[playerid][idx++] = 1; // (+)
    }
    pTemp[playerid][tSelectPage] = page; */
    new
        str_[128];
    format(str_, sizeof str_, ""colserver"Организация: "colwhi"%s (В сети: %d)", fInfo[family][fName], Iter_Count(PlayerTeam[family]));
    return ShowPlayerDialog(playerid, D_NULL,/*D_FRAC_FUNC_5,*/ DIALOG_STYLE_TABLIST_HEADERS, str_, t_string, "Выбрать", "Закрыть");
} 

GetPlayerSpawnName(playerid) {
	new spawnpos[36];
	switch(pInfo[playerid][PlayerSpawn])
	{
		case 0: spawnpos = "Стандартный";
		case 1: spawnpos = "Дом";
		case 2:
		{
		    if (pTemp[playerid][tDutyWork] == 1) spawnpos = "Организация (Рабочий день начат)";
			else spawnpos = "Организация (Рабочий день окончен)";
		}
		case 3: spawnpos = "Дом на колёсах";
		case 4: spawnpos = "Яхта";
		case 5: spawnpos = "Семейный особняк";
		case 6: spawnpos = "Семейный дом";		
		default: spawnpos = "ОШИБКА/БАГ";
	}
	return spawnpos;
}

CMD:switchskin(playerid, params[])
{
    if (pTemp[playerid][tSelectSkinShop] != -1) return true;
    if (!IsAGang(playerid)) return 1;
	if (forma[playerid] != 1) return SendClientMessage(playerid, COLOR_GRAD1, !"У вас нет военной формы!");
	SetPlayerSkinEx(playerid, pInfo[playerid][pSex] == 1 ? 287 : 191);
	SetPlayerColor(playerid, COLOR_GREEN);
	forma[playerid] = 0;
	pTemp[playerid][PlayerInArmyForm] = true;
	return 1;
}

CMD:getdebt(playerid, params[])
{
	if (!IsAMafia(playerid)) return 1;
	if (pInfo[playerid][pRank] < 3) return SendClientMessage(playerid, COLOR_GREY, !"Доступно с 3 ранга!");
	if (sscanf(params, "u", params[0])) return SendClientMessage(playerid, COLOR_GREY, !"Введите: /getdebt [id]");
	if (!PlayerInConnected(params[0])) return SendClientMessage(playerid, COLOR_GREY, !"Человек не найден!");
	if (!IsPlayerInRangeOfPlayer(8.0, playerid, params[0])) return 1;
	new string_[128], query_[128];
	if (pInfo[playerid][pMember] == pInfo[params[0]][pKrisha])
	{
	    if (pInfo[params[0]][pDolg] < 50) return SendClientMessage(params[0], COLOR_GRAD1, "Не достаточная сумма, для возврата долга!");
	    if (kLibGetPlayerMoney(params[0]) < pInfo[params[0]][pDolg]) return SendClientMessage(playerid, COLOR_GREY, !"У игрока недостаточно денег!");
		kLibGivePlayerMoney(params[0], -pInfo[params[0]][pDolg], "/getdebt");
		scm(playerid, -1, "Вы выбили долг из должника!");
		scm(params[0], -1, "С вас выбили долг!");
        switch(pInfo[params[0]][pKrisha])
		{
			case 6:
			{
				SendClientMessage(params[0], COLOR_YELLOW, "Долг был возвращён мафии Yakuza!");
				format(string_, sizeof string_, "%s вернул долг в размере $%s",pInfo[params[0]][pName],pInfo[params[0]][pDolg]);
			}
			case 5:
			{
				SendClientMessage(params[0], COLOR_YELLOW, "Долг был возвращён LCN!");
				format(string_, sizeof string_, "%s вернул долг в размере $%s",pInfo[params[0]][pName],pInfo[params[0]][pDolg]);
			}
			case 14:
			{
				SendClientMessage(params[0], COLOR_YELLOW, "Долг был возвращён Русской мафии!");
				format(string_, sizeof string_, "%s вернул долг в размере $%s",pInfo[params[0]][pName],pInfo[params[0]][pDolg]);
			}
		}
		SendFamilyMessage(pInfo[params[0]][pKrisha], COLOR_YELLOW2, string_);
		FractionInfo[pInfo[params[0]][pKrisha]][fMoney] += pInfo[params[0]][pDolg] ;
		SaveFractionInfoID(FractionInfo[pInfo[params[0]][pKrisha]][fID], false);
		pInfo[params[0]][pDolg] = 0;
		format(query_, sizeof query_, "UPDATE `s_users` SET `pDolg` = '%d' WHERE `Name` = '%s'", pInfo[params[0]][pDolg], pInfo[params[0]][pName]);
		mysql_tquery(dbHandle, query_, "", "");
	}
	return 1;
}

CMD:hackbase(playerid, params[])
{
	if (!IsAMafia(playerid)) return 1;
    if (GetVehicleModel(GetPlayerVehicleID(playerid)) != 497 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 427 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 523 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 415
	&& GetVehicleModel(GetPlayerVehicleID(playerid)) != 521 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 596 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 597 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 598
	&& GetVehicleModel(GetPlayerVehicleID(playerid)) != 490 && GetVehicleModel(GetPlayerVehicleID(playerid)) != 560) return SendClientMessage(playerid, COLOR_GRAD1, "Вы не в полицейской машине");
    if (sscanf(params, "u", params[0])) return SendClientMessage(playerid, COLOR_WHITE, !"Введите: /hackbase [id]");
	if (!PlayerInConnected(params[0])) return SendClientMessage(playerid, COLOR_GREY, !"Человек не найден!");
	new str_[128];
 	if (pInfo[params[0]][pWantedLevel] == 0) return SendClientMessage(playerid, COLOR_GREY, !"Человек не находиться в розыске!");
	format(str_, sizeof str_, "Вы сняли уровни розыска у %s.", pInfo[params[0]][pName]);
	SendClientMessage(playerid, 0x6495EDFF, str_);
	format(str_, sizeof str_, "Мафиози %s снял с Вас уровни розыска.", pInfo[playerid][pName]);
	SendClientMessage(params[0], 0x6495EDFF, str_);
	pInfo[params[0]][pWantedLevel] = 0;
	SetPlayerWantedLevelEx(params[0], pInfo[params[0]][pWantedLevel]);

	if (pInfo[params[0]][pMember] == pInfo[playerid][pMember])
		OnPlayerQuestProgress(playerid, QUEST_MAFIA, QUEST_TASK_HACKBASE);
	return 1;
}
CMD:tie(playerid, params[])
{
    if (!IsAMafia(playerid)) return 1;
	if (pInfo[playerid][pRank] < 3) return SendClientMessage(playerid, COLOR_GREY, !"Вы должны быть 3 рангом");
	if (sscanf(params, "u",params[0])) return SendClientMessage(playerid, COLOR_WHITE, !"Введите: /tie [id]");
	if (!PlayerInConnected(params[0])) return SendClientMessage(playerid, COLOR_GREY, !"Человек не найден!");
	if (pTemp[params[0]][PlayerTied]) return SendClientMessage(playerid, COLOR_GREY, !"Человек уже связан!");
	if (!IsPlayerInRangeOfPlayer(8.0, playerid, params[0])) return 1;
	new car = GetPlayerVehicleID(playerid),
		str_[64];
	if (params[0] == playerid) return SendClientMessage(playerid, COLOR_GREY, !"Нельзя связать самого себя!");
	if (IsPlayerInAnyVehicle(playerid) && GetPlayerState(playerid) == 2 && IsPlayerInVehicle(params[0], car))
	{
		format(str_, sizeof str_, "Вас связал %s.",pInfo[playerid][pName]);
		SendClientMessage(params[0], 0x6495EDFF, str_);
		format(str_, sizeof str_, "%s связал %s", pInfo[playerid][pName] ,pInfo[params[0]][pName]);
		SendBeside(playerid,COLOR_PURPLE, str_,30.0);
		TogglePlayerControllable(params[0], 0);
		TieTime[params[0]] = 300;
		pTemp[params[0]][PlayerTied] = true;
		if (pInfo[params[0]][pMember] != pInfo[playerid][pMember]) {
			OnPlayerQuestProgress(playerid, QUEST_MAFIA, QUEST_TASK_MAFIA_TIE);//QUEST_TASK_PD_PATRUL
		}
			
	}
	else return SendClientMessage(playerid, COLOR_GREY, !"Человек не в машине!");
	return 1;
}
CMD:debtors(playerid, params[])
{
    if (!IsAMafia(playerid)) return 1;
	if (pInfo[playerid][pRank] < 6) return SendClientMessage(playerid, COLOR_GREY, !"Вы должны быть 6 рангом");
	SendClientMessage(playerid, COLOR_YELLOW2, "Должники:");
	new string_[100];
	foreach(new i: PlayerInLogin)
	{
		if (pInfo[i][pKrisha] == pInfo[playerid][pMember] && pInfo[i][pMember] == 0)
		{
			format(string_, sizeof string_, "Должник: %s | Долг: %s",pInfo[i][pName],pInfo[i][pDolg]);
			SendClientMessage(playerid, COLOR_WHITE, string_);
		}
	}
	return 1;
}
CMD:untie(playerid, params[])
{
    if (!IsAMafia(playerid) && pInfo[playerid][pMember] != 2) return 1;
	if (pInfo[playerid][pRank] < 3) return SendClientMessage(playerid, COLOR_GREY, !"Вы должны быть 3 рангом");
	if (sscanf(params, "u",params[0])) return SendClientMessage(playerid, COLOR_WHITE, !"Введите: /untie [id]");
	if (!PlayerInConnected(params[0]) || playerid == params[0]) return SendClientMessage(playerid, COLOR_GREY, !"Человек не найден!");
	if (!pTemp[params[0]][PlayerTied]) return SendClientMessage(playerid, COLOR_GREY, !"Человек не связан!");
	if (!IsPlayerInRangeOfPlayer(8.0, playerid, params[0])) return 1;
	new string_[64];
	format(string_, sizeof string_, "Вы были развязаны %s.",pInfo[playerid][pName]);
	SendClientMessage(params[0], 0x6495EDFF, string_);
	format(string_, sizeof string_, "%s развязал %s", pInfo[playerid][pName] ,pInfo[params[0]][pName]);
	SendBeside(playerid,COLOR_PURPLE, string_,30.0);
	TogglePlayerControllable(params[0], 1);
	TieTime[params[0]] = 0;
	pTemp[params[0]][PlayerTied] = false;
	return 1;
}
CMD:showpass(playerid, params[])
{
	if (sscanf(params, "u",params[0])) return SendClientMessage(playerid, COLOR_WHITE, !"Введите: /showpass [id]");
	if (!PlayerInConnected(params[0])) return SendClientMessage(playerid, COLOR_GREY, !"Человек не найден!");
    if (!IsPlayerInRangeOfPlayer(8.0, playerid, params[0]) || GetPlayerState(params[0]) == PLAYER_STATE_SPECTATING) return 1;
    new ttext[21];
    if (pTemp[playerid][FBISpyAction] != -1)
	{
		switch(pTemp[playerid][FBISpyAction])
		{
  			case 1: ttext = "LSPD";
	    	case 2: ttext = "ФБР";
		    case 3: ttext = "Армия СФ";
		    case 4: ttext = "Медики СФ";
		    case 0, 5, 6, 12..15, 17, 18, 24..26: ttext = "Неизвестно";
		    case 7: ttext = "Мэрия";
		    case 8: ttext = "Casino";
		    case 9: ttext = "SF News";
		    case 10: ttext = "SFPD";
		    case 11: ttext = "Автошкола";
		    case 16: ttext = "LS News";
		    case 19: ttext = "Армия ЛВ";
		    case 20: ttext = "LV News";
		    case 21: ttext = "LVPD";
		    case 22: ttext = "Медики ЛС";
		    case 23: ttext = "Медики ЛВ";
		}
	}
	else
	{
	    switch(pInfo[playerid][pMember])
		{
  			case 1: ttext = "LSPD";
	    	case 2: ttext = "ФБР";
		    case 3: ttext = "Армия СФ";
		    case 4: ttext = "Медики СФ";
		    case 0, 5, 6, 8, 12..15, 17, 18, 24..26: ttext = "Неизвестно";
		    case 7: ttext = "Мэрия"; 
		    case 9: ttext = "SF News";
		    case 10: ttext = "SFPD";
		    case 11: ttext = "Автошкола";
		    case 16: ttext = "LS News";
		    case 19: ttext = "Армия ЛВ";
		    case 20: ttext = "LV News";
		    case 21: ttext = "LVPD";
		    case 22: ttext = "Медики ЛС";
		    case 23: ttext = "Медики ЛВ";
		}
	}
	new rangz[40];
	if (IsAGang(playerid) || IsAMafia(playerid) || IsABiker(playerid) || !pInfo[playerid][pMember] || pTemp[playerid][FBISpyAction] == 5 || pTemp[playerid][FBISpyAction] == 6
 		|| pTemp[playerid][FBISpyAction] == 12 || pTemp[playerid][FBISpyAction] == 13 || pTemp[playerid][FBISpyAction] == 14 || pTemp[playerid][FBISpyAction] == 15
	  	|| pTemp[playerid][FBISpyAction] == 17 || pTemp[playerid][FBISpyAction] == 18 || pTemp[playerid][FBISpyAction] == 24 || pTemp[playerid][FBISpyAction] == 25
	  	|| pTemp[playerid][FBISpyAction] == 26) rangz = "Неизвестно";
	else strmid(rangz,fFractionRank[pInfo[playerid][pMember]][pInfo[playerid][pRank] - 1], 0, strlen(fFractionRank[pInfo[playerid][pMember]][pInfo[playerid][pRank] - 1]), 32);
	new level = pInfo[playerid][pLevel];
	new string_[256];
	SendClientMessage(params[0], COLOR_YELLOW, "---------===[PASSPORT]===---------");
	format(string_, sizeof string_, "Имя: %s", pInfo[playerid][pName]);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);
	format(string_, sizeof string_, "Возраст: %d",level);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);
	format(string_, sizeof string_, "Телефон: %d",pInfo[playerid][PlayerNumber]);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);
	format(string_, sizeof string_, "Организация: %s",ttext);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);
	format(string_, sizeof string_, "Должность: %s",rangz);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);
	format(string_, sizeof string_, "Работа: %s",gJobNames[pInfo[playerid][pJob]]);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);

	if (pInfo[playerid][pHouseID] != -1) {
		format(string_, sizeof string_, "Дом №%d", pInfo[playerid][pHouseID]); 
		SendClientMessage(params[0], COLOR_YELLOW2, string_);
	}  
	if (pInfo[playerid][pRentHouse] != -1) {
		format(string_, sizeof string_, "Прописка в доме №%d", pInfo[playerid][pRentHouse]); 
		SendClientMessage(params[0], COLOR_YELLOW2, string_);
	}  
	format(string_, sizeof string_, "Законопослушность: %d",pInfo[playerid][pZakonp]);
	SendClientMessage(params[0], COLOR_YELLOW2, string_);
	SendClientMessage(params[0], COLOR_YELLOW, "========================");
	if (pInfo[playerid][pWantedLevel] > 0) SendClientMessage(params[0], COLOR_REDD, "Внимание! Этот человек в розыске!"); 
	MeAction(playerid, "показал(a) свой паспорт", SELECT_ACTION_GENERAL); 
	if (IsACopQuest(params[0])) {
		OnPlayerQuestProgress(params[0], QUEST_PD, QUEST_TASK_PD_NEWBIE);
	}
	return 1;
}
CMD:showudost(playerid, params[])
{
    if (!IsACop(playerid)) return 1;
	if (sscanf(params, "u",params[0])) return SendClientMessage(playerid, COLOR_WHITE, !"Введите: /showudost [id]");
	if (!PlayerInConnected(params[0])) return SendClientMessage(playerid, COLOR_GREY, !"Человек не найден!");
	if (!IsPlayerInRangeOfPlayer(8.0, playerid, params[0]) || GetPlayerState(params[0]) == PLAYER_STATE_SPECTATING) return 1;
	new ttext[32];
	if (pInfo[playerid][pMember] == 0) { ttext = "Гражданин"; }
	else if (pInfo[playerid][pMember] == 1) { ttext = "LSPD"; }
	else if (pInfo[playerid][pMember] == 2) { ttext = "ФБР"; }
	else if (pInfo[playerid][pMember] == 10) { ttext = "SFPD"; }
	else if (pInfo[playerid][pMember] == 21) { ttext = "LVPD"; }
	new rank = pInfo[playerid][pRank],
		level = pInfo[playerid][pLevel],
		string_[128];
	format(string_, sizeof string_, "Имя: %s\nТелефон: %d\nВозвраст: %d\nПодразделение: %s\nРанг: %d", pInfo[playerid][pName],pInfo[playerid][PlayerNumber],level,ttext,rank);
	ShowPlayerDialog(params[0], D_NULL, DIALOG_STYLE_MSGBOX, "Удостоверение", string_, "Готово", "");
	format(string_, sizeof string_, "%s показал своё удостоверение %s'у",pInfo[playerid][pName],pInfo[params[0]][pName]);
	SendBeside(playerid,COLOR_PURPLE, string_, 30.0);
	format(string_, sizeof string_, "показал своё удостоверение %s'у",pInfo[params[0]][pName]);
	SetPlayerChatBubble(playerid, string_,COLOR_PURPLE,30.0,10000);
	return 1;
}

stock IsPlayerToGhetto(playerid) {
	return IsPlayerToSquare(playerid, .min_x = 1636.18, .min_y = -2180.56, .max_x = 2930.04, .max_y = -846.89);
}
stock IsPlayerToSquare(playerid,Float:min_x,Float:min_y,Float:max_x,Float:max_y)
{
	new Float:xxp,Float:yyp,Float:zzp;
	GetPlayerPos(playerid,xxp,yyp,zzp);
	if ((xxp <= max_x && xxp >= min_x) && (yyp <= max_y && yyp >= min_y)) return 1;
	return 0;
}
stock GetPlayerGangZone(playerid)
{
	for(new i = 1; i <= TOTALGZ; i++)
	{
	    if (IsPlayerToSquare(playerid, GZInfo[i][gCoords][0], GZInfo[i][gCoords][1], GZInfo[i][gCoords][2], GZInfo[i][gCoords][3]))
     	{
     	    return i;
     	}
	}
	return -1;
}

stock GetFreeSeat(vehicleid)
{
	if (!vehicleid) return -1;
	new model = GetVehicleModel(vehicleid);
	new maxs = GetMaxSeat(model) - 1;
	new bool:seat[3], cnt;
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pTemp[i][PlayerVehicle] != vehicleid) continue;
		new pseat = GetPlayerVehicleSeat(i);
		if (pseat < 1 || pseat > 3) continue;
		seat[pseat-1] = true;
		cnt++;
		if (cnt >= maxs) return -1;
	}
	for(new i; i < 3; i++) if (!seat[i]) return i+1;
	return -1;
}

stock GetMaxSeat(modelid)
{
	switch(modelid)
	{
		case 596..598, 427, 490: return 4;
		case 599, 497, 528: return 2;
	}
	return -1;
}


stock ShowMaskingMenu(playerid)
{
    goto skip_initialization_array;

    static const str_mask[] = 
    "Снять маскировку\n\
    Гражданин\n\
    {%s}Крупье\n\
    {%s}Police\n\
    {%s}Army\n\
    {%s}Hospital\n\
    {%s}LS News\n\
    {%s}SF News\n\
    {%s}LV News\n\
    {%s}Autoschool\n\
    {%s}Mayor\n\
    {%s}Ballas\n\
	{%s}Vagos\n\
	{%s}Grove\n\
	{%s}Aztec\n\
	{%s}Rifa\n\
    {%s}LCN\n\
	{%s}Yakuza\n\
	{%s}RM\n\
	{%s}Mongols\n\
	{%s}Warlock MC\n\
	{%s}Outlaws MC";

    new str_tmp[sizeof(str_mask) + 20*10 ];

	skip_initialization_array:

	new fraction_id[22] = 
    {
        0,0,8,1,3,4,16,9,20,11,7,12,13,15,17,18,5,6,14,24,25,26
    };

	format(str_tmp,sizeof(str_tmp),str_mask,
    gFraction[ fraction_id[2] ][fRGBColor],
    gFraction[ fraction_id[3] ][fRGBColor],
    gFraction[ fraction_id[4] ][fRGBColor],
    gFraction[ fraction_id[5] ][fRGBColor],
    gFraction[ fraction_id[6] ][fRGBColor],
    gFraction[ fraction_id[7] ][fRGBColor],
    gFraction[ fraction_id[8] ][fRGBColor],
    gFraction[ fraction_id[9] ][fRGBColor],
    gFraction[ fraction_id[10] ][fRGBColor],
    gFraction[ fraction_id[11] ][fRGBColor],
    gFraction[ fraction_id[12] ][fRGBColor],
    gFraction[ fraction_id[13] ][fRGBColor],
    gFraction[ fraction_id[14] ][fRGBColor],
    gFraction[ fraction_id[15] ][fRGBColor],
    gFraction[ fraction_id[16] ][fRGBColor],
    gFraction[ fraction_id[17] ][fRGBColor],
    gFraction[ fraction_id[18] ][fRGBColor],
    gFraction[ fraction_id[19] ][fRGBColor],
    gFraction[ fraction_id[20] ][fRGBColor],
    gFraction[ fraction_id[21] ][fRGBColor]);

    return ShowPlayerDialog(playerid, D_FRAC_FUNC_2, DIALOG_STYLE_LIST, "Маскировка", str_tmp, "Выбрать", "Отмена");
}


stock GetPlayerAdminSearch(playerid)
{
	new _veh_count = 0,
		query_[78];
	format(query_, sizeof query_,"SELECT * FROM s_admin WHERE Name = '%s' LIMIT 1", pInfo[playerid][pName]);
	new Cache: result = mysql_query(dbHandle, query_);
	_veh_count = cache_num_rows();
	cache_get_value_name_int(0, "level", _veh_count);
	if (cache_is_valid(result)) cache_delete(result);
	return _veh_count;
}

publics: AdminReportCleaner()
{
	for(new i = 1; i < MAX_REPORT_SLOTS; i++)
	{
		if (aReportInfo[i][rPlayerID] == -1) continue;
		if (gettime() - aReportInfo[i][rWhenWroted_Time] >= 10)
		{
			SendClientMessage(aReportInfo[i][rPlayerID], COLOR_SERVER, !"Ваша жалоба/вопрос для администрации было удалено системой.");
			DeletePVar(aReportInfo[i][rPlayerID], "report_id");
			aReportInfo[i][rIsTooked] = false;
			aReportInfo[i][rID] = i;
			aReportInfo[i][rPlayerID] = -1;
			aReportInfo[i][rText][0] = EOS;
			aReportInfo[i][rType] = TICKETS_TYPE_ASK;
			aReportInfo[i][rWhenWroted_Time] = -1;
			aReportInfo[i][rWhenWroted_Text][0] = EOS;
			aReportInfo[i][adminID] = 0; 
		}
	} 
	GameTextForAdmin("REPORT CLEAR");
	GameTextForSupport("REPORT CLEAR");
	return 1;
}
stock ShowReportForAdmin(playerid)
{
	t_string[0] = EOS;
	new R_IDX = 0;
    strcat(t_string, ""colserver"[№] Заявитель\t"colserver"Статус\t"colserver"Тип\n");
	for(new i = 1; i < MAX_REPORT_SLOTS; i++)
	{
		if (aReportInfo[i][rPlayerID] == -1) continue;
		
		format(t_string, sizeof t_string, ""colwhi"%s[%d] %s\t%s\t%s\n",
			t_string, i,
			pInfo[aReportInfo[i][rPlayerID]][pName], 
			(aReportInfo[i][rIsTooked] == true)?(""colwarn"Проверяется"):(""collime"Свободен"), 
			(aReportInfo[i][rType] == TICKETS_TYPE_REPORT)?(""colwarn"REPORT"):(""collime"ASK"));
		//pInfo[playerid][pSex] == 1 ? ("вышел") : ("вышла")	
		playerListItem[playerid][R_IDX] = i; 
		R_IDX++;
	}
	if (R_IDX == 0) return SendClientMessage(playerid, -1, !"На данный момент нет доступных жалоб/вопросов от игроков.");

	ShowPlayerDialog(playerid, D_REPORT_0, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Список жалоб", t_string, "Выбрать", "Отмена");
	return 1;
}


//AutoSalon
stock NextCar(playerid)
{
	if (pTemp[playerid][LoadShowCar] > gettime()) return GameTextForPlayer(playerid,"Loading...",1000,3); 
	pTemp[playerid][tSelectVehicleShop] ++;
	switch(GetPVarInt(playerid,"CarShop"))
	{
		case 0:if (pTemp[playerid][tSelectVehicleShop] > 19) pTemp[playerid][tSelectVehicleShop] = 0;//nope
		case 1:if (pTemp[playerid][tSelectVehicleShop] > 38) pTemp[playerid][tSelectVehicleShop] = 20;//c
		case 2:if (pTemp[playerid][tSelectVehicleShop] > 56) pTemp[playerid][tSelectVehicleShop] = 39;//d
		case 3:if (pTemp[playerid][tSelectVehicleShop] > 84) pTemp[playerid][tSelectVehicleShop] = 72;//a
		case 4:if (pTemp[playerid][tSelectVehicleShop] > 71) pTemp[playerid][tSelectVehicleShop] = 57;//b
	}
	return ShowingCar(playerid);
}
stock BackCar(playerid)
{
	if (pTemp[playerid][LoadShowCar] > gettime()) return GameTextForPlayer(playerid,"Loading...",1000,3);
	pTemp[playerid][tSelectVehicleShop] --;
	switch(GetPVarInt(playerid,"CarShop"))
	{
		case 0:if (pTemp[playerid][tSelectVehicleShop] < 0) pTemp[playerid][tSelectVehicleShop] = 19;//nope
		case 1:if (pTemp[playerid][tSelectVehicleShop] < 20) pTemp[playerid][tSelectVehicleShop] = 38;//c
		case 2:if (pTemp[playerid][tSelectVehicleShop] < 39) pTemp[playerid][tSelectVehicleShop] = 56;//d
		case 3:if (pTemp[playerid][tSelectVehicleShop] < 72) pTemp[playerid][tSelectVehicleShop] = 84;//a
		case 4:if (pTemp[playerid][tSelectVehicleShop] < 57) pTemp[playerid][tSelectVehicleShop] = 71;//b
	}
	return ShowingCar(playerid);
}
stock ShowingCar(playerid)
{//GetPVarInt(playerid,"BuyColor"), GetPVarInt(playerid,"BuyColor1"));
	if (pTemp[playerid][TempSalonCar] != INVALID_VEHICLE_ID) _DestroyVehicle(pTemp[playerid][TempSalonCar]);
	
	pTemp[playerid][TempSalonCar] = _CreateVehicle(ShopCar[ pTemp[playerid][tSelectVehicleShop] ][0],-1658.7123,1212.8981,20.9499,285.2443,1,1,-1);

	ChangeVehicleState(pTemp[playerid][TempSalonCar], 0, VEHICLE_STATE_ERROR);
	SetVehicleVirtualWorld(pTemp[playerid][TempSalonCar], playerid+1);
	PutPlayerInVehicle(playerid,pTemp[playerid][TempSalonCar],0);
	SetPlayerCameraPos(playerid,-1654.097045,1218.596679,22.708799);
	SetPlayerCameraLookAt(playerid,-1659.106201,1210.380737,19.987318);
	SetPVarInt(playerid,"BuyColor", 1);
	SetPVarInt(playerid,"BuyColor1", 1);
	update_info_salon(playerid);
	pTemp[playerid][LoadShowCar] = gettime()+1;
	return 1;
}
stock update_info_salon(playerid)
{
	new 
		string_[128];
	new cost = GetVipBoostMaxPlayerValueSale(playerid, vSaleCar, bSaleCar, ShopCar[ pTemp[playerid][tSelectVehicleShop] ][1]);
	

	format(string_, sizeof string_, "~n~~n~~n~~n~~n~~n~~n~~n~~b~NAME: ~w~%s~n~~g~COST: ~w~%d~n~~y~COLOR1: ~w~%d ~y~COLOR2: ~w~%d",
		VehicleNames[ShopCar[ pTemp[playerid][tSelectVehicleShop] ][0]-400],
		cost,
		GetPVarInt(playerid,"BuyColor"),
		GetPVarInt(playerid,"BuyColor1")
	);
	GameTextForPlayer(playerid, string_, 5000, 3);
	format(string_, sizeof string_, "Model: %s~n~Cost: %d",
		VehicleNames[ShopCar[ pTemp[playerid][tSelectVehicleShop] ][0]-400],
		cost
	);
	PlayerTextDrawSetString(playerid, ShopText[playerid], string_);
	return 1;
}
stock NextColor(playerid,whocolor)
{
	if (whocolor == 0) {
		SetPVarInt(playerid,"BuyColor",GetPVarInt(playerid,"BuyColor")+1);
		if (GetPVarInt(playerid,"BuyColor") > 255) SetPVarInt(playerid,"BuyColor",0);
	}
	else {
		SetPVarInt(playerid,"BuyColor1",GetPVarInt(playerid,"BuyColor1")+1);
		if (GetPVarInt(playerid,"BuyColor1") > 255) SetPVarInt(playerid,"BuyColor1",0);
	}
	ChangeVehicleColor(GetPlayerVehicleID(playerid), GetPVarInt(playerid,"BuyColor"), GetPVarInt(playerid,"BuyColor1"));
	update_info_salon(playerid);
	return 1;
}
stock BackColor(playerid,whocolor)
{
	if (whocolor == 0) {
		SetPVarInt(playerid,"BuyColor",GetPVarInt(playerid,"BuyColor")-1);
		if (GetPVarInt(playerid,"BuyColor") < 0) SetPVarInt(playerid,"BuyColor",255);
	}
	else {
		SetPVarInt(playerid,"BuyColor1",GetPVarInt(playerid,"BuyColor1")-1);
		if (GetPVarInt(playerid,"BuyColor1") < 0) SetPVarInt(playerid,"BuyColor1",255);
	}
	ChangeVehicleColor(GetPlayerVehicleID(playerid), GetPVarInt(playerid,"BuyColor"), GetPVarInt(playerid,"BuyColor1"));
	update_info_salon(playerid);
	return 1;
}
stock ShowBuyCar(playerid)
{
	new gAutoClassSelect[5] = {0, 20, 39, 72, 57};//20 c | 39 d | 72 a | 57 b
	new shop_id = GetPVarInt(playerid,"CarShop"); 
	pTemp[playerid][tSelectVehicleShop] = gAutoClassSelect[shop_id];
	ShopText[playerid] = CreatePlayerTextDraw(playerid,509.000000,180.000000,"Model: Landstalker");
	PlayerTextDrawBackgroundColor(playerid,ShopText[playerid],255);
	PlayerTextDrawFont(playerid,ShopText[playerid],1);
	PlayerTextDrawSetOutline(playerid,ShopText[playerid],1);
	PlayerTextDrawSetShadow(playerid,ShopText[playerid],0);
	PlayerTextDrawLetterSize(playerid,ShopText[playerid],0.270000,1.200000);
	PlayerTextDrawColor(playerid,ShopText[playerid],-1);
	PlayerTextDrawSetProportional(playerid,ShopText[playerid],1);

	PlayerTextDrawShow(playerid, ShopText[playerid]);
	for(new x; x < 12; x++) TextDrawShowForPlayer(playerid, AutoShopText[x]);
	SetPlayerVirtualWorld(playerid,playerid+1);
	SelectTextDraw(playerid, 0x0080FFFF);
 	return ShowingCar(playerid);
}
stock ExitCar(playerid)
{
    for(new x; x < 12; x++) TextDrawHideForPlayer(playerid, AutoShopText[x]);
	PlayerTextDrawHide(playerid, ShopText[playerid]);
	PlayerTextDrawDestroy(playerid, ShopText[playerid]);
	if (pTemp[playerid][TempSalonCar] != INVALID_VEHICLE_ID) _DestroyVehicle(pTemp[playerid][TempSalonCar]);
	pTemp[playerid][TempSalonCar] = INVALID_VEHICLE_ID;
	pTemp[playerid][LoadShowCar] = 0;
	pTemp[playerid][tSelectVehicleShop] = -1;
	DeletePVar(playerid,#CarShop);
	DeletePVar(playerid,#BuyColor);
	DeletePVar(playerid,#BuyColor1);
	CancelSelectTextDraw(playerid);
	new Float:gAutoShopSpawn[4][4] = {
		{539.5839,-1291.5419,17.2422,4.2049}, //ЛС
		{-1954.4395,293.9200,35.4688,89.5773}, // СФ возле вокзала
		{-1654.5570,1211.2758,7.2500,245.9087}, //СФ А/Б
		{2200.8931,1391.5768,10.8203,181.0480} //ЛВ Автосалон
	};
	if (GetPVarInt(playerid,#AutoShopShow) != 0)
	{
	    new
			salon_id = GetPVarInt(playerid,"AutoShopShow") - 1;
	    SetPlayerPosAC(playerid, gAutoShopSpawn[salon_id][0],gAutoShopSpawn[salon_id][1],gAutoShopSpawn[salon_id][2], 0, 0);
	    SetPlayerFacingAngle(playerid,gAutoShopSpawn[salon_id][3]);
	    SetCameraBehindPlayer(playerid);
		DeletePVar(playerid,#AutoShopShow);
	}
	return 1;
}

stock UpdateWeapon_AC(const playerid,const type_e )
{
	const MAX_SLOT_NOSAVE = 6;
	static const slot_nosave[MAX_SLOT_NOSAVE] = {0,7,9,10,11,12};

	if(type_e == 1)
	{
		const MAX_SLOT_SAVE = 2;
		static const slot_save[MAX_SLOT_SAVE] = {1,8};
		
		new weapon_id,
			weapon_ammo;

		for(new i; i < MAX_SLOT_SAVE; i++)
		{
			GetPlayerWeaponData(playerid, slot_save[i], weapon_id, weapon_ammo);

			if (weapon_id != player_weapon_id[playerid][slot_save[i]] && weapon_ammo > 1) {
				ResetPlayerWeapons(playerid);
			}
			if (weapon_ammo > player_weapon_ammo[playerid][slot_save[i]]) {
				ResetPlayerWeapons(playerid);
			}
			else player_weapon_ammo[playerid][slot_save[i]] = weapon_ammo; 
		}
	}
	else 
	{
		for(new i; i < MAX_SLOT_NOSAVE; i++)
		{
			player_weapon_ammo[playerid][slot_nosave[i]] = 0;
			player_weapon_id[playerid][slot_nosave[i]] = 0; 
		}
	}

	return 1;
}

kLibUpdatePlayerWeapons(playerid)
{
	static const save_weap[] =  "UPDATE `s_users` SET `pWeapons` = '0,%d,%d,%d,%d,%d,%d,0,%d,0,0,0,0', \
	`pAmmos` = '0,%d,%d,%d,%d,%d,%d,0,%d,0,0,0,0' WHERE `pID` = '%d' LIMIT 1";

	UpdateWeapon_AC(playerid,0);

	new query_[sizeof(save_weap)+84];

	format(query_,sizeof(query_), save_weap, 
	player_weapon_id[playerid][1],player_weapon_id[playerid][2], player_weapon_id[playerid][3],
	player_weapon_id[playerid][4], player_weapon_id[playerid][5], player_weapon_id[playerid][6],
	player_weapon_id[playerid][8],

	player_weapon_ammo[playerid][1],player_weapon_ammo[playerid][2], player_weapon_ammo[playerid][3],
	player_weapon_ammo[playerid][4], player_weapon_ammo[playerid][5], player_weapon_ammo[playerid][6],
	player_weapon_ammo[playerid][8], 
	
	pInfo[playerid][pID]);

	mysql_tquery(dbHandle, query_, "", "");

	if (MYSQL_DEBUG) printf("CALLBACK | kLibUpdatePlayerWeapons (%d) | Good", strlen(query_));
	return 1;
} 
stock SearchingHit(playerid)
{
	new full_ = 0, str_[128];
	t_string[0] = EOS;
	strcat(t_string, "Имя/ID\tЦена за голову\n");
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][pHeadValue] > 0 && ContractInfo[i][cHitman] == INVALID_PLAYER_ID)
		{
			format(str_, sizeof str_, "{FFFF00}%s[%d]{FFFFFF}\t[%d $]\n", pInfo[i][pName], i, pInfo[i][pHeadValue]);
			strcat(t_string, str_);
			full_++;
		}
	}
	if (!full_) return SendClientMessage(playerid, COLOR_GREY, !"Нет заказов.");
	return ShowPlayerDialog(playerid, D_ZAKAZ_KILL_4, DIALOG_STYLE_TABLIST_HEADERS, "Список заказов", t_string, "Выбрать", "Закрыть");
}
stock GetNameWithNumber(number)
{
	new str[24] = {"Offline/None"};
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		if (pInfo[i][PlayerNumber] == number)
		{
			format(str, 24, "%s", pInfo[i][pName]);
			break;
		}
	}
	return str;
}

stock SaveAccounts()
{
	foreach(new i: PlayerInLogin)
	{
		if (!pInfo[i][pLogin]) continue;
		SavePlayerID(i); 
		//save_player_phonelist(i);
		//save_player_skins(i);
	}
	return 1;
}
stock SaveFractionInfoID(idx, bool: save = true) {
	if (save) {
		new
		query_[300];
		mysql_format(dbHandle, query_, sizeof query_, 
			"UPDATE `s_fractionbank` SET `fMats` = '%d', `fMoney` = '%d', `fHeal` = '%d', `fLock` = '%d', `fHouseLock` = '%d', `fRepute` = '%d', `fPoints` = '%d', `fTaxState` = '%d', `fCDPrize` = '%d' WHERE `fID` = '%d' LIMIT 1",
			FractionInfo[idx][fMaterials], FractionInfo[idx][fMoney], 
			FractionInfo[idx][fHeal], FractionInfo[idx][fLock], 
			FractionInfo[idx][fHouseLock], FractionInfo[idx][fRepute], 
			FractionInfo[idx][fPoints], FractionInfo[idx][fTaxState], 
			FractionInfo[idx][fCDPrize], FractionInfo[idx][fID]
		);
		mysql_tquery(dbHandle, query_, "", ""); 
	} 
	return 1;
}
 
stock SavePlayerID(i)
{
 	if (!pInfo[i][pLogin] || !IsPlayerConnected(i)) return 1;
	if (GetPVarInt(i,"player_save")) return false;
    SetPVarInt(i,"player_save", 1);


 	format(t_string, sizeof t_string, "UPDATE `s_users` SET \
		w_rSpins = '%d', pHP = '%f', Satiety = '%.2f', pMuted = '%d', rMuted = '%d', pMats = '%d', pDrugs = '%d', pLDrugs = '%d', pHospital = '%d', pCaptureStats = '%d|%d|%.1f', pPayCheck = '%d', \
		pNarcoLomka = '%d', pAddiction = '%d', pWantedLevel = '%d', ptaxilvl = '%i', ptaxiexp = '%i', pRobHouse = '%d', CaptureKills = '%d', pHouseID = '%d' \
		WHERE `pID` = '%d' LIMIT 1",
		pInfo[i][pSpins], GetPlayerHP(i), pInfo[i][Satiety], pInfo[i][pMuted], pInfo[i][rMuted], pInfo[i][pMats], pInfo[i][pDrugs], pInfo[i][pLDrugs], pInfo[i][pHospital], CaptureInfo[i][pKills], CaptureInfo[i][pDeaths], CaptureInfo[i][pDMG],
		pInfo[i][pPayCheck], pInfo[i][pNarcoLomka], pInfo[i][pAddiction], pInfo[i][pWantedLevel], pInfo[i][pTaxiLevel], pInfo[i][pTaxiExp], pInfo[i][pRobHouse], pInfo[i][pCaptureKills], pInfo[i][pHouseID],
		pInfo[i][pID]
	);
	mysql_tquery(dbHandle, t_string, "", ""), t_string[0] = EOS;

    format(t_string, sizeof t_string, "UPDATE `s_users` SET pZakonp = '%d', pJailTime = '%d', pJob = '%d', pUseKrisha = '%d',pKrisha = '%d', \
 		playerspawn = '%d', pFishes = '%f', pBank = '%d', pMobile = '%d', pDolg = '%d', sTool = '%d', pKeys = '%d', fwarn = '%d', \
		pLeader = '%d', pMember = '%d', pRank = '%d', punWarns = '%d', pWarns = '%d', pGunSkills = '%d,%d,%d,%d,%d,%d', pFishesWorms = '%d' WHERE `pID` = '%d' LIMIT 1",
		pInfo[i][pZakonp], pInfo[i][pJailTime], pInfo[i][pJob], pInfo[i][pUseKrisha], pInfo[i][pKrisha],
		pInfo[i][PlayerSpawn], pInfo[i][pFishes], pInfo[i][pBank], pInfo[i][pMobile], pInfo[i][pDolg], pInfo[i][sTool], pInfo[i][pKeys], pInfo[i][FractionWarn],
		pInfo[i][pLeader], pInfo[i][pMember], pInfo[i][pRank], pInfo[i][punWarns], pInfo[i][pWarns],
		pInfo[i][pGunSkill][0], pInfo[i][pGunSkill][1], pInfo[i][pGunSkill][2], pInfo[i][pGunSkill][3], pInfo[i][pGunSkill][4], pInfo[i][pGunSkill][5],
		pInfo[i][pFishesWorms],//pRecordArena[6],
		pInfo[i][pID]
	);
	mysql_tquery(dbHandle, t_string, "", ""), t_string[0] = EOS;

    format(t_string, sizeof t_string, "UPDATE `s_users` SET pBoxSkill = '%d', pKongfuSkill = '%d', gRoulleteTime = '%d', pDepInTime = '%d', pDepPutTime = '%d', pDepCashBack = '%d', \
		pKickboxSkill = '%d', pRecognition = '%d', pDrivingSkill = '%d', pDMgruz = '%d', pDLevel = '%d', pDExp = '%d', fmute = '%d', pDeposit = '%d', pMestoJail = '%d', pArrested = '%d', \
		pFracIntKeys = '%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i|%i', InGameDay = '%d', InGameAllTime = '%d', LastData = '%d', InGameMember = '%d' \
		WHERE `pID` = '%d' LIMIT 1",
		pInfo[i][pBoxSkill], pInfo[i][pKongfuSkill], pTemp[i][gTimeNoAFK], pInfo[i][pDepInTime], pInfo[i][pDepPutTime], pInfo[i][pDepCashBack], pInfo[i][pKickboxSkill], pInfo[i][pRecognition], pInfo[i][pDrivingSkill],
		pInfo[i][pDMgruz], pInfo[i][pDLevel], pInfo[i][pDExp], pInfo[i][FractionMute], pInfo[i][pDeposit], pInfo[i][pMestoJail], pInfo[i][pArrested],
		pInfo[i][pFracIntKeys][0], pInfo[i][pFracIntKeys][1], pInfo[i][pFracIntKeys][2], pInfo[i][pFracIntKeys][3], pInfo[i][pFracIntKeys][4], pInfo[i][pFracIntKeys][5], pInfo[i][pFracIntKeys][6], pInfo[i][pFracIntKeys][7],
		pInfo[i][pFracIntKeys][8], pInfo[i][pFracIntKeys][9], pInfo[i][pFracIntKeys][10], pInfo[i][pFracIntKeys][11], pInfo[i][pFracIntKeys][12], pInfo[i][pFracIntKeys][13], pInfo[i][pFracIntKeys][14], pInfo[i][pFracIntKeys][15],
		pInfo[i][pFracIntKeys][16], pInfo[i][pFracIntKeys][17], pInfo[i][pFracIntKeys][18], pInfo[i][pFracIntKeys][19], pInfo[i][pFracIntKeys][20], pInfo[i][pFracIntKeys][21], pInfo[i][pFracIntKeys][22], pInfo[i][pFracIntKeys][23],
		pInfo[i][pFracIntKeys][24], pInfo[i][pFracIntKeys][25], pInfo[i][pInGameDay], pInfo[i][pInGameAllTime], pInfo[i][pLastData], pInfo[i][pInGameMember],
		pInfo[i][pID]
	);
	mysql_tquery(dbHandle, t_string, "", ""), t_string[0] = EOS;

	new
		str_[128];
	for(new idx; idx < MAX_ACHIEV; idx++) {
		if (!idx) format(str_,sizeof str_, "%d", pAchivID[i][idx]);
		else format(str_, sizeof str_, "%s|%d", str_, pAchivID[i][idx]);
	}
    format(t_string, sizeof t_string, "UPDATE `s_users` SET `pAchivID` = '%s' WHERE `pID` = '%d' LIMIT 1",
        str_,
        pInfo[i][pID]
    );
    mysql_tquery(dbHandle, t_string, "", ""), t_string[0] = EOS;

	DeletePVar(i, "player_save");
	return 1;
}
WC_PlayerSpectate(playerid) {
	return SpecID[playerid];
}

DamageActive(playerid) {//setDamageInfo
	if (pInfo[playerid][PlayerSettings] & setDamageInfo) {
		return 1;
	} 
	return 0;
}
stock SetPlayerSatiety(playerid, Float:amount) {
	pInfo[playerid][Satiety] = amount;
    if (pInfo[playerid][PlayerSettings] & setShowEatBar) {
		SetPlayerProgressBarValue(playerid, EatBar[playerid],pInfo[playerid][Satiety]);
	}
	return 1;
}
stock GivePlayerSatiety(playerid, Float:amount) {
    pInfo[playerid][Satiety] += amount;
	if (pInfo[playerid][Satiety] > 1000) pInfo[playerid][Satiety] = 1000;
    if (pInfo[playerid][PlayerSettings] & setShowEatBar) {
		SetPlayerProgressBarValue(playerid, EatBar[playerid],pInfo[playerid][Satiety]);
	}
	return 1;
}

stock SavePlayerStr(playerid, const query_string[])
{
	new str_query[144];
	format(str_query, sizeof (str_query),
		"UPDATE `s_users` SET %s WHERE `pID` = '%i'", query_string, pInfo[playerid][pID]
	);
	mysql_tquery(dbHandle, str_query, "", "");
	return 1;
}

stock SavePlayerInteger(playerid, const field[], var) {
	new query_[128];
	format(query_, sizeof query_, "UPDATE `s_users` SET `%s` = '%d' WHERE `pID` = '%d' LIMIT 1", field, var, pInfo[playerid][pID]);
	mysql_tquery(dbHandle, query_, "", ""); 
	return 1;
} 
stock save_player_phonelist(playerid)
{

	//if (GetPVarInt(playerid, "SaveLicStr")) return false;
   // SetPVarInt(playerid,"SaveLicStr", 1);
	new 
		query_[160];
		format(query_, sizeof query_, "UPDATE `s_users` SET `phoneList` = '%d,%d,%d,%d,%d,%d,%d,%d'  WHERE `pID` = '%d' LIMIT 1",
		pInfo[playerid][PhoneBook][0], pInfo[playerid][PhoneBook][1], 
		pInfo[playerid][PhoneBook][2], pInfo[playerid][PhoneBook][3], 
		pInfo[playerid][PhoneBook][4], pInfo[playerid][PhoneBook][5], pInfo[playerid][PhoneBook][6], pInfo[playerid][PhoneBook][7],
		pInfo[playerid][pID]
	);
	mysql_tquery(dbHandle, query_, "", "");
 //	DeletePVar(playerid, "SaveLicStr"); 
	return 1;
}

stock save_player_skins(playerid)
{

	//if (GetPVarInt(playerid, "SaveLicStr")) return false;
   // SetPVarInt(playerid,"SaveLicStr", 1);
	new 
		query_save[106];
	format(query_save, sizeof query_save, "UPDATE `s_users` SET `pChars` = '%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d'  WHERE `pID` = '%d' LIMIT 1",//11
		pInfo[playerid][pChar][0], pInfo[playerid][pChar][1], pInfo[playerid][pChar][2], pInfo[playerid][pChar][3], pInfo[playerid][pChar][4], pInfo[playerid][pChar][5], pInfo[playerid][pChar][6], pInfo[playerid][pChar][7], pInfo[playerid][pChar][8], pInfo[playerid][pChar][9], pInfo[playerid][pChar][10], //10
		pInfo[playerid][pID]
	);
	mysql_tquery(dbHandle, query_save, "", "");
	return 1;
}

stock SavePlayerString(playerid, const field[], const variable[])
{
    new query_[128];
	format(query_, sizeof query_, "UPDATE `s_users` SET `%s` = '%s' WHERE `pID` = '%d' LIMIT 1", field, variable, pInfo[playerid][pID]);
	mysql_tquery(dbHandle, query_, "", ""); 
	return 1;
}
/*stock SavePlayerFloat(playerid, field[], Float: var) {
	new query_[128];
	format(query_, sizeof query_, "UPDATE `s_users` SET `%s` = '%f' WHERE `pID` = '%d'", field, var, pInfo[playerid][pID]);
	mysql_tquery(dbHandle, query_, "", ""); 
	return 1;
}*/

stock SaveFractionInteger(idx, const field[], var)
{
	new query_[128];
	format(query_, sizeof query_, "UPDATE s_fraction SET  %s = '%d' WHERE fID = '%d' LIMIT 1", field, var, idx);
    mysql_tquery(dbHandle, query_, "", ""); 
	return 1;
}
stock SaveFractionString(idx, const field[], const var[])
{
	format(totalstring, sizeof totalstring, "UPDATE `s_fraction` SET  %s = '%s' WHERE fID = '%d' LIMIT 1", field, var, idx);
    mysql_tquery(dbHandle, totalstring);
    totalstring[0] = EOS;

	return 1;
} 

stock GetBootVehicle(vehicleid, &Float:x, &Float:y, &Float:z)
{
    new Float:angle,Float:distance; // объявляем переменные
    GetVehicleModelInfo(GetVehicleModel(vehicleid), 1, x, distance, z); // узнаём длину машины
    distance = distance/2 + 0.1; // полученную длину делим на два
    GetVehiclePos(vehicleid, x, y, z); // узнаём координаты авто
    GetVehicleZAngle(vehicleid, angle); // узнаем угол поворота авто
    x += (distance * floatsin(-angle+180, degrees)); // вычитаем координату x богажника
    y += (distance * floatcos(-angle+180, degrees)); // вычитаем координату y богажника
    return 1;
}

load_test_rob_system()
{
	SmsNewsEnter[0] = false;
	SmsNewsEnter[1] = false;
	SmsNewsEnter[2] = false;
    /*for(new i; i < MAX_BONE; i++)
	{
		CreateDynamicObject(1824, BoneCoor[i][0], BoneCoor[i][1], BoneCoor[i][2], 0, 0, BoneCoor[i][3]);
		BoneInfo[i][Crupie] = INVALID_PLAYER_ID;
    	for(new idx= 0; idx < 5; idx++) BoneInfo[i][Gamer][idx] = INVALID_PLAYER_ID;
    	BoneInfo[i][GameStart] = 0;
	} */
	SetTimer("RobbingTimer", 2000, true); 
	return 1;
}


publics: ClearAnim(playerid){ 
	if (GetPVarInt(playerid, !"ClearAnimSI") > gettime()) return 1;
	return ApplyAnimation(playerid, "CARRY", "crry_prtial",4.0,0,0,0,0,0,1);
} 
publics: CarryDelay(playerid) ApplyAnimation(playerid,"CARRY","crry_prtial",4.0,1,1,1,1,1,1);


stock bool: UseCar(vehicleid) {
	foreach(new i: PlayerInVehicle[vehicleid]) {
		if (GetPlayerVehicleSeat(i) != -1) return true; 
	} 
    return false;
}
publics: UpdateVehiclePos(vehicleid, type)
{
    if(type == 1) {
        BanCar[vehicleid] = false;
    }
    GetVehiclePos(vehicleid, VehPos[vehicleid][0], VehPos[vehicleid][1], VehPos[vehicleid][2]);
    GetVehicleZAngle(vehicleid, VehPos[vehicleid][3]);
    return true;
}
stock Difference(Float:Value1, Float:Value2)
{
    return floatround((Value1 > Value2) ? (Value1 - Value2) : (Value2 - Value1));
}
stock SetVehiclePosition(vehicleid, Float:X, Float:Y, Float:Z)
{
    SetVehiclePos(vehicleid ,X,Y,Z);  
	UpdateVehiclePos(vehicleid, false); 
    return true;
}


/*
stock IsRpNickname(nickname[]) {
    new regex: r = regex_new("[A-Z][a-z]+_[A-Z][a-z]+");
    new check = regex_check(nickname, r);
    regex_delete(r);
    return check;
}*/
/*IsValidTextEx(const text_[]) {
	new	
		Regex: rAdverts = Regex_New("([0-9]{1,3})[^[:digit:]^[:cntrl:]]{1,3}([0-9]{1,3})[^[:digit:]^[:cntrl:]]{1,3}([0-9]{1,3})[^[:digit:]^[:cntrl:]]{1,3}([0-9]{1,3})"),
		check = Regex_Check(text_, rAdverts);
	Regex_Delete(rAdverts);
	return check;
}*/
IsValidRpNameEx(const name_[]) {
	new	
		Regex: rRpName = Regex_New("([A-Z]{1,1})[a-z]{2,9}+_([A-Z]{1,1})[a-z]{2,9}"),
		check = Regex_Check(name_, rRpName);
	Regex_Delete(rRpName);
	return check;
	/*static regex:rRpName;
	if ( !rRpName ) rRpName = regex_new("([A-Z]{1,1})[a-z]{2,9}+_([A-Z]{1,1})[a-z]{2,9}");
	return regex_match_exid(name_, rRpName);*/
}
IsValidEmailEx(const email_[]) {
	new	
		Regex: rEmail = Regex_New("[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?"),
		check = Regex_Check(email_, rEmail);
	Regex_Delete(rEmail);
	return check;
	/*static regex:rEmail;
	if ( !rEmail ) rEmail = regex_new("[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?");
	return regex_match_exid(email_, rEmail);*/
} 
IsValidURLVKEx(const url_[]) {
	new	
		Regex: rEmail = Regex_New("^[a-z0-9_.]{5,32}"),
		check = Regex_Check(url_, rEmail);
	Regex_Delete(rEmail);
	return check;
	/*static regex:url_;
	if ( !url_ ) url_ = regex_new("^[a-z0-9_.]{5,32}");
	return regex_match_exid(url_, url_);*/
} //((?:(?:25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))\.){3}(?:25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))) >> regular IP



stock ExpExp(playerid, countEXP)
{
	if (pInfo[playerid][JobDriverProdInfo][0] != 12) 
	{
		pInfo[playerid][JobDriverProdInfo][1] += countEXP;
		
		if (pInfo[playerid][JobDriverProdInfo][1] >= 100)
		{
			pInfo[playerid][JobDriverProdInfo][0]++;
			pInfo[playerid][JobDriverProdInfo][1] = 0;
			pInfo[playerid][JobDriverProdInfo][2] += 200;

			SendClientMessage(playerid, 0x00D26DFF, !"Поздравляем! Ваш навык развозчика улучшился.");
		}

		new query_[128];
		
		format(query_, sizeof(query_), "UPDATE s_users SET SkillProd = '%d,%d,%d' WHERE Name = '%s'",
			pInfo[playerid][JobDriverProdInfo][0], pInfo[playerid][JobDriverProdInfo][1], 
			pInfo[playerid][JobDriverProdInfo][2], pInfo[playerid][pName]);
			
		mysql_tquery(dbHandle, query_, "", "");
	}
}

stock GetPlayerZone(playerid, value)
{
	new zone[32],bool:getzone;
	new Float:x1,Float:y1,Float:z1;
	GetPlayerPos(playerid,x1,y1,z1);
	for(new i = 0; i < sizeof(gZoneInfo); i++)
	{
		switch(value)
		{
			case 0:
			{
				if (x1 >= gZoneInfo[i][SAZONE_AREA][0] && x1 <= gZoneInfo[i][SAZONE_AREA][3]
						&& y1 >= gZoneInfo[i][SAZONE_AREA][1] && y1 <= gZoneInfo[i][SAZONE_AREA][4])
				{
					settext(zone, gZoneInfo[i][SAZONE_NAME]);
					getzone = true;
					break;
				}
			}
			case 1: { 
				if (FamilyHouse[playerid][fhEnter][0] >= gZoneInfo[i][SAZONE_AREA][0] && FamilyHouse[playerid][fhEnter][0] <= gZoneInfo[i][SAZONE_AREA][3]
						&& FamilyHouse[playerid][fhEnter][1] >= gZoneInfo[i][SAZONE_AREA][1] && FamilyHouse[playerid][fhEnter][1] <= gZoneInfo[i][SAZONE_AREA][4])
				{
					settext(zone, gZoneInfo[i][SAZONE_NAME]);
					getzone = true;
					break;
				}
			}
		}
	}
	if (!getzone) zone = "Неизвестно";
	return zone;
} 
stock settext(str_[], const text[])
{
	strmid(str_, text, 0, strlen(text), 255);
	return 1;
}
stock PreloadAnimLib(playerid, const animlib[]) return ApplyAnimation(playerid, animlib, "null", 0.0, 0, 0, 0, 0, 0);
stock PreloadAllAnimLibs(playerid)
{
	//PreloadAnimLib(playerid,"AIRPORT");
	//PreloadAnimLib(playerid,"Attractors");
	PreloadAnimLib(playerid,"BAR");
	//PreloadAnimLib(playerid,"BASEBALL");
	PreloadAnimLib(playerid,"BD_FIRE");
	PreloadAnimLib(playerid,"BEACH");
	PreloadAnimLib(playerid,"benchpress");
	//PreloadAnimLib(playerid,"BF_injection");
	//PreloadAnimLib(playerid,"BIKED");
	//PreloadAnimLib(playerid,"BIKEH");
	//PreloadAnimLib(playerid,"BIKELEAP");
	//PreloadAnimLib(playerid,"BIKES");
	//PreloadAnimLib(playerid,"BIKEV");
	//PreloadAnimLib(playerid,"BIKE_DBZ");
	//PreloadAnimLib(playerid,"BLOWJOBZ");
	//PreloadAnimLib(playerid,"BMX");
	PreloadAnimLib(playerid,"BOMBER");
	//PreloadAnimLib(playerid,"BOX");
	PreloadAnimLib(playerid,"BSKTBALL");
	//PreloadAnimLib(playerid,"BUDDY");
	//PreloadAnimLib(playerid,"BUS");
	PreloadAnimLib(playerid,"CAMERA");
	PreloadAnimLib(playerid,"CAR");
	PreloadAnimLib(playerid,"CARRY");
	PreloadAnimLib(playerid,"CAR_CHAT");
	PreloadAnimLib(playerid,"CASINO");
	//PreloadAnimLib(playerid,"CHAINSAW");
	//PreloadAnimLib(playerid,"CHOPPA");
	//PreloadAnimLib(playerid,"CLOTHES");
	//PreloadAnimLib(playerid,"COACH");
	//PreloadAnimLib(playerid,"COLT45");
	PreloadAnimLib(playerid,"COP_AMBIENT");
	//PreloadAnimLib(playerid,"COP_DVBYZ");
	PreloadAnimLib(playerid,"CRACK");
	//PreloadAnimLib(playerid,"CRIB");
	//PreloadAnimLib(playerid,"DAM_JUMP");
	//PreloadAnimLib(playerid,"DANCING");
	PreloadAnimLib(playerid,"DEALER");
	//PreloadAnimLib(playerid,"DILDO");
	//PreloadAnimLib(playerid,"DODGE");
	//PreloadAnimLib(playerid,"DOZER");
	//PreloadAnimLib(playerid,"DRIVEBYS");
	PreloadAnimLib(playerid,"FAT");
	//PreloadAnimLib(playerid,"FIGHT_B");
	//PreloadAnimLib(playerid,"FIGHT_C");
	//PreloadAnimLib(playerid,"FIGHT_D");
	//PreloadAnimLib(playerid,"FIGHT_E");
	//PreloadAnimLib(playerid,"FINALE");
	//PreloadAnimLib(playerid,"FINALE2");
	//PreloadAnimLib(playerid,"FLAME");
	//PreloadAnimLib(playerid,"Flowers");
	PreloadAnimLib(playerid,"FOOD");
	//PreloadAnimLib(playerid,"Freeweights");
	PreloadAnimLib(playerid,"GANGS");
	PreloadAnimLib(playerid,"GHANDS");
	//PreloadAnimLib(playerid,"GHETTO_DB");
	PreloadAnimLib(playerid,"goggles");
	PreloadAnimLib(playerid,"GRAFFITI");
	PreloadAnimLib(playerid,"GRAVEYARD");
	//PreloadAnimLib(playerid,"GRENADE");
	//PreloadAnimLib(playerid,"GYMNASIUM");
	//PreloadAnimLib(playerid,"HAIRCUTS");
	//PreloadAnimLib(playerid,"HEIST9");
	PreloadAnimLib(playerid,"INT_HOUSE");
	PreloadAnimLib(playerid,"INT_OFFICE");
	//PreloadAnimLib(playerid,"INT_SHOP");
	//PreloadAnimLib(playerid,"JST_BUISNESS");
	//PreloadAnimLib(playerid,"KART");
	//PreloadAnimLib(playerid,"KISSING");
	//PreloadAnimLib(playerid,"KNIFE");
	//PreloadAnimLib(playerid,"LAPDAN1");
	//PreloadAnimLib(playerid,"LAPDAN2");
	//PreloadAnimLib(playerid,"LAPDAN3");
	PreloadAnimLib(playerid,"LOWRIDER");
	//PreloadAnimLib(playerid,"MD_CHASE");
	//PreloadAnimLib(playerid,"MD_END");
	PreloadAnimLib(playerid,"MEDIC");
	PreloadAnimLib(playerid,"MISC");
	//PreloadAnimLib(playerid,"MTB");
	//PreloadAnimLib(playerid,"MUSCULAR");
	//PreloadAnimLib(playerid,"NEVADA");
	//PreloadAnimLib(playerid,"ON_LOOKERS");
	//PreloadAnimLib(playerid,"OTB");
	//PreloadAnimLib(playerid,"PARACHUTE");
	PreloadAnimLib(playerid,"PARK");
	PreloadAnimLib(playerid,"PAULNMAC");
	PreloadAnimLib(playerid,"PED");
	//PreloadAnimLib(playerid,"PLAYER_DVBYS");
	//PreloadAnimLib(playerid,"PLAYIDLES");
	//PreloadAnimLib(playerid,"POLICE");
	//PreloadAnimLib(playerid,"POOL");
	//PreloadAnimLib(playerid,"POOR");
	//PreloadAnimLib(playerid,"PYTHON");
	//PreloadAnimLib(playerid,"QUAD");
	//PreloadAnimLib(playerid,"QUAD_DBZ");
	//PreloadAnimLib(playerid,"RAPPING");
	//PreloadAnimLib(playerid,"RIFLE");
	PreloadAnimLib(playerid,"RIOT");
	//PreloadAnimLib(playerid,"ROB_BANK");
	//PreloadAnimLib(playerid,"ROCKET");
	//PreloadAnimLib(playerid,"RUSTLER");
	PreloadAnimLib(playerid,"RYDER");
	//PreloadAnimLib(playerid,"SCRATCHING");
	//PreloadAnimLib(playerid,"SHAMAL");
	PreloadAnimLib(playerid,"SHOP");
	//PreloadAnimLib(playerid,"SHOTGUN");
	//PreloadAnimLib(playerid,"SILENCED");
	//PreloadAnimLib(playerid,"SKATE");
	PreloadAnimLib(playerid,"SMOKING");
	//PreloadAnimLib(playerid,"SNIPER");
	PreloadAnimLib(playerid,"SPRAYCAN");
	//PreloadAnimLib(playerid,"STRIP");
	//PreloadAnimLib(playerid,"SUNBATHE");
	//PreloadAnimLib(playerid,"SWAT");
	PreloadAnimLib(playerid,"SWEET");
	//PreloadAnimLib(playerid,"SWIM");
	PreloadAnimLib(playerid,"SWORD");
	PreloadAnimLib(playerid,"SMOKING");
	//PreloadAnimLib(playerid,"TANK");
	//PreloadAnimLib(playerid,"TATTOOS");
	//PreloadAnimLib(playerid,"TEC");
	//PreloadAnimLib(playerid,"TRAIN");
	//PreloadAnimLib(playerid,"TRUCK");
	//PreloadAnimLib(playerid,"UZI");
	//PreloadAnimLib(playerid,"VAN");
	//PreloadAnimLib(playerid,"VENDING");
	//PreloadAnimLib(playerid,"VORTEX");
	//PreloadAnimLib(playerid,"WAYFARER");
	//PreloadAnimLib(playerid,"WEAPONS");
	//PreloadAnimLib(playerid,"WUZI");
	return 1;
}
stock SetVehicleBling(vehicleid_, speed_)
{
    VehicleBlinkStatus[vehicleid_] = true;
	VehicleBlinkTimer[vehicleid_] = SetTimerEx("vehicle_blink_start" , speed_, true, "i", vehicleid_);
}
stock StopVehicleBling(vehicleid_)
{
    new stat[4];
	KillTimer(VehicleBlinkTimer[vehicleid_]);
	VehicleBlinkStatus[vehicleid_] = false;
	GetVehicleDamageStatus(vehicleid_,stat[0],stat[1],stat[2],stat[3]);
	UpdateVehicleDamageStatus(vehicleid_,stat[0],stat[1],0,stat[3]);
}
publics: vehicle_blink_start(vehicleid_)
{
    new stat[4];
	GetVehicleDamageStatus(vehicleid_, stat[0], stat[1], stat[2], stat[3]);
	UpdateVehicleDamageStatus(vehicleid_, stat[0], stat[1], rand_blink_param[random(2)], stat[3]);
} 


stock SaveGraffiti(graffiti)
{
	new query_[128];
	format(query_, sizeof query_, "UPDATE `s_graffiti` SET `tFraction` = '%d' WHERE `tID` = '%d'",TagInfo[graffiti][tFraction],graffiti);
	return mysql_tquery(dbHandle, query_, "", "");
} 
stock convert_money(amount, const delimiter[2] = ".")
{
	new int_string[15];
	format(int_string, sizeof(int_string), "%d", amount >= 0 ? amount : -amount);

	new value = strlen(int_string);
	switch(value)
	{
		case 4..6:
			strins(int_string, delimiter, value - 3, 1);
		case 7..9:
			strins(int_string, delimiter, value - 3, 1),
			strins(int_string, delimiter, value - 6, 1);
		case 10..12:
			strins(int_string, delimiter, value - 3, 1),
			strins(int_string, delimiter, value - 6, 1),
			strins(int_string, delimiter, value - 9, 1);
	}

	if(amount < 0) strins(int_string, "-", 0);
	return int_string;
}
stock Declension_GetWord(result[], const size = sizeof(result), num, const word_1[], const word_2[], const word_3[])
{
    num %= 100;
    if (num > 19)
    {
        num %= 10;
    }
    result[0] = '\0';
    switch (num)
    {
        case 1: strcat(result, word_1, size);
        case 2..4: strcat(result, word_2, size);
        default: strcat(result, word_3, size);
    }
} 

#define MAX_LANG_VALUE_STRING 20
stock Declension_ReturnWord(num, const word_1[MAX_LANG_VALUE_STRING], const word_2[MAX_LANG_VALUE_STRING], const word_3[MAX_LANG_VALUE_STRING])
{
	new result[MAX_LANG_VALUE_STRING];
	Declension_GetWord(result, sizeof(result), num, word_1, word_2, word_3);
	return result;
} 
stock PlayerUsePromoCode(playerid, code_name[], codeid) {
	new 
		query_[256]; 
	SendMes(playerid, COLOR_YELLOW, "[Подсказка] "colwhi"Промокод "colserver"%s"colwhi" успешно использован", code_name); 
	/*if ( (GetString(code_name, "#borov") || GetString(code_name, "#waerd")) && SKILL_PROMO) {
		pInfo[playerid][pGunSkill][0] =
		pInfo[playerid][pGunSkill][1] =
		pInfo[playerid][pGunSkill][2] =
		pInfo[playerid][pGunSkill][3] =
		pInfo[playerid][pGunSkill][4] =
		pInfo[playerid][pGunSkill][5] = 100;

		pInfo[playerid][pAddiction] = 5_000; 
		SetPlayerSkills(playerid);
		SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"У Вас уникальный промокод!");
		SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Вы получаете 100 процентов навыков владения оружия + максимальную наркозависимость!");
	}
	if ( (GetString(code_name, "#bike") || GetString(code_name, "#pirus") || GetString(code_name, "#hant")) && JOB_PROMO) {
		if (GetString(code_name, "#bike") ) {
			GivePlayerLicense(playerid, DRIVE_LIC, 30, true);
		}
		if (GetString(code_name, "#pirus") ) {
			pInfo[playerid][pGunSkill][0] =
			pInfo[playerid][pGunSkill][1] =
			pInfo[playerid][pGunSkill][2] =
			pInfo[playerid][pGunSkill][3] =
			pInfo[playerid][pGunSkill][4] =
			pInfo[playerid][pGunSkill][5] = 100; 
			SetPlayerSkills(playerid);
		}
		if (GetString(code_name, "#hant") ) {
			GivePlayerLicense(playerid, FISH_LIC, 30, true);
		}
		pInfo[playerid][VIPRank] = VIP_PACK_GOLD; 
		new unboost = gettime() + (7 * 86400);
		pInfo[playerid][VIPTime] = unboost; 
	}*/
	pInfo[playerid][PromoCode] = codeid;
	new
		code_5lvl = 0;
	if (pInfo[playerid][pLevel] > 5) {
		code_5lvl = 1;
	}

	if (pInfo[playerid][pLevel] < 4) SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Следующую награду вы получите при достижении 4 уровня.");
	else if (pInfo[playerid][pLevel] < 10) SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Следующую награду вы получите при достижении 10 уровня.");
	else if (pInfo[playerid][pLevel] < 20) SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Следующую награду вы получите при достижении 20 уровня.");
	format(query_, sizeof query_, 
		"`vip_rank` = '%i', `vip_time` = '%i', `PromoCode` = '%i'", 
		pInfo[playerid][VIPRank], pInfo[playerid][VIPTime], pInfo[playerid][PromoCode]
	);
	SavePlayerStr(playerid, query_); 
	query_[0] = EOS;//w_rSpins = w_rSpins+1
    mysql_format(dbHandle, query_, sizeof query_, 
		"UPDATE s_promocode SET  used_count = used_count+1, used_5lvl = used_5lvl+%d WHERE code = '%s'", 
		code_5lvl, code_name
	);
    mysql_tquery(dbHandle, query_, "", ""); 
	return 1;
}
publics: PromoCodeCreate(playerid, code[])
{
    new
		free_slot = -1,
		query_[128];

    if (free_slot != -1)
	{
		SendClientMessage(playerid, COLOR_GREY, !"Указанный промокод уже есть в списке");
		return 0;
	}
    mysql_format(dbHandle, query_, sizeof query_, "INSERT INTO s_promocode (code) VALUES ('%s')", code);
	mysql_tquery(dbHandle, query_, "", "");

	query_[0] = EOS;
	format(query_, sizeof query_, ""colwhi"Промокод {FFFF00}%s"colwhi" успешно создан!\n", code);
    ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_MSGBOX, ""colserver"Промокод: "colwhi"Успешно создан!", query_, "Закрыть", "");
	return 1;
} 
stock ShowPromoCodeList(playerid, page = 1) {
    format(t_string, sizeof (t_string), "SELECT * FROM s_promocode ORDER BY `used_count` DESC", 
        pInfo[playerid][pName]
    );
    new rows, Cache:tempQuery = mysql_query(dbHandle, t_string);
    cache_get_row_count(rows);
    t_string[0] = EOS;
    
    if (!rows) {
        SendClientMessage(playerid, COLOR_GREY, !"В данный момент нет промокодов");
		pc_cmd_setpromo(playerid);
        if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
        return true;
    }
    new max_page = (MAX_DIALOG_LIST_ITEMS + rows) / MAX_DIALOG_LIST_ITEMS, idx = 0;
    if (page < 1) page = 1;
    else if (page > max_page) page = max_page;  
    t_string = ""colserver"[№] Название\t"colserver"Активаций\n"colwhi"";
    for (new i = ((page - 1) * MAX_DIALOG_LIST_ITEMS), tempName[32], tempLevel; i < (page * MAX_DIALOG_LIST_ITEMS); i++) {
        if (i >= rows) continue;
        cache_get_value_name(i, "code", tempName, sizeof (tempName));
        cache_get_value_name_int(i, "used_count", tempLevel); 

        format(t_string, sizeof (t_string), "%s[%i] %s\t%d раз\n", t_string, (page - 1) * MAX_DIALOG_LIST_ITEMS + idx, tempName, tempLevel);
        playerListItem[playerid][idx++] = -1;
    }
    if (page > 1) {
        strcat(t_string, "[<<<] Предыдущая страница\n");
        playerListItem[playerid][idx++] = 2; // (-)
    }
    if (page < max_page) {
        strcat(t_string, "Следующая страница [>>>] \n");
        playerListItem[playerid][idx++] = 1; // (+)
    }
    pTemp[playerid][tSelectPage] = page; 

    new titleSTR[46];
    format(titleSTR, sizeof (titleSTR), ""colserver"Список промокодов (всего: %d)", rows);
    ShowPlayerDialog(playerid, D_PROMO_CODE_2, DIALOG_STYLE_TABLIST_HEADERS, titleSTR, t_string, "Выбрать", "Закрыть");

    if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
    t_string[0] = EOS;
    return true;
}
		
publics: GetPromoCodeDelete(playerid, code[])
{
	new
		rows,
		query_[128];
	cache_get_row_count(rows);
    if (!rows) return scm(playerid, COLOR_WHITE, !"Указанный промокод не найден");
    SendMes(playerid, COLOR_WHITE, "Промокод {FFFF00}%s{FFFFFF} успешно удалён", code);
    mysql_format(dbHandle, query_, sizeof query_, "DELETE FROM s_promocode WHERE code = '%s'", code);
    mysql_tquery(dbHandle, query_, "", "");
	return 1;
}
stock UpdateBuildText(b_id)
{
	new font_face[4][12] = {"Arial", "Calibri", "Tahoma", "Verdana"},
 		text[144+16];
	if (!BildInfo[b_id][bOwned])//fRGBColor
	{
		format(text,144+16,"{000000}Рекламное место свободно!\nВладелец: {%s}%s",gFraction[BildInfo[b_id][bMember]][fRGBColor],gFraction[BildInfo[b_id][bMember]][fName]);
		BildInfo[b_id][bAligment] = 1;
		BildInfo[b_id][bFontSize] = 25;
		BildInfo[b_id][bBackColor] = 1;
	}
	else format(text,144+16,"{000000}%s",BildInfo[b_id][bText]);
	return SetDynamicObjectMaterialText(BildInfo[b_id][bObjectID], 0,text, 130, font_face[BildInfo[b_id][bFontFace]], BildInfo[b_id][bFontSize], 0, 0xFF000000,Colors_BIG[BildInfo[b_id][bBackColor]], BildInfo[b_id][bAligment]);
}
stock ShowPlayerEditMenu(playerid)
{
	t_string[0] = EOS;
	new
		str_[64],
		p_var = GetPVarInt(playerid,"SelectBildID"),
		font_face[4][12] = {"Arial", "Calibri", "Tahoma", "Verdana"},
	    aligment_name[3][16] = {"По левому краю", "По центру", "По правому краю"};

	t_string = ""colserver"[№] Параметр\t"colserver"Значение\n";
	
	BildIntro(playerid, p_var, -13);
	
	strcat(t_string,"\n"colwhi"[0] Текст\tИзменить");
	format(str_, sizeof str_,"\n[1] Цвет фона\t{%s}[||||||]",Colors_LOW[BildInfo[p_var][bBackColor]]);
	strcat(t_string, str_);
	format(str_, sizeof str_,"\n"colwhi"[2] Шрифт текста\t%s",font_face[BildInfo[p_var][bFontFace]]);
	strcat(t_string, str_);
	format(str_, sizeof str_,"\n[3] Размер текста\t%d",BildInfo[p_var][bFontSize]);
	strcat(t_string, str_);
	format(str_, sizeof str_,"\n[4] Выравнивание текста\t%s",aligment_name[BildInfo[p_var][bAligment]]);
	strcat(t_string, str_);
	strcat(t_string,"\n[5] Разорвать договор аренды");
	strcat(t_string,"\n[6] Завершить редактирование");
	return ShowPlayerDialog(playerid, D_NEWS_FUNC_2, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Редактирование: "colwhi"Настройка рекламы", t_string, "Выбрать", "Закрыть");
}
stock BildIntro(playerid, b_id, c_dist)
{
	new
		Float: x = BildInfo[b_id][bPos][0],
		Float: y = BildInfo[b_id][bPos][1];
    GetXYInFront(x, y, BildInfo[b_id][bPos][3], c_dist);
    TogglePlayerControllable(playerid, false);
	SetPlayerPosAC(playerid, x, y, BildInfo[b_id][bPos][2]);
    SetPlayerCameraPos(playerid, x, y, BildInfo[b_id][bPos][2]);
    SetPlayerCameraLookAt(playerid, BildInfo[b_id][bPos][0], BildInfo[b_id][bPos][1], BildInfo[b_id][bPos][2]);
    return SetPlayerInterior(playerid, 0), 1;
}
stock BildExit(playerid)
{
	SetPlayerPosAC(playerid, GetPVarFloat(playerid,"bild_x"), GetPVarFloat(playerid,"bild_y"), GetPVarFloat(playerid,"bild_z"), GetPVarInt(playerid,"bild_world"), GetPVarInt(playerid,"bild_int"));
	SetPlayerFacingAngle(playerid,273.5792);
	SetCameraBehindPlayer(playerid);
	TogglePlayerControllable(playerid, 1);
    return 1;
}
stock GetXYInFront(&Float:x, &Float:y, Float:angle, Float:distance) {
    x += (distance * floatsin(-angle, degrees));
    y += (distance * floatcos(-angle, degrees));
}
stock ShowPlayer_Admin_Report_Answer(playerid, report_id)
{
	SetPVarInt(playerid, "report_id_to_answer", report_id);

	aReportInfo[report_id][adminID] = playerid;
	aReportInfo[report_id][rIsTooked] = true;
	new
	    string_[64];
	t_string[0] = EOS;
	format(string_, sizeof string_, ""colserver"Жалоба от: "colwhi"[%d] %s", 
		report_id, pInfo[ aReportInfo[report_id][rPlayerID] ][pName]
	);
	
	format(t_string, sizeof t_string, ""colwhi"Жалоба: %s\n\nОтправил: %s\nВремя отправки: %s\n\nВведите ваш ответ в диалоговое поле ниже:",
		aReportInfo[report_id][rText],
		pInfo[aReportInfo[report_id][rPlayerID]][pName],
		aReportInfo[report_id][rWhenWroted_Text]
	);

	ShowPlayerDialog(playerid, D_REPORT_1, DIALOG_STYLE_INPUT, string_, t_string, "Ответить", "Назад");
	return 1;
} 

stock IsVehicleInQuad(Float:veh_x, Float:veh_y, Float:q_minx, Float:q_miny, Float:q_maxx, Float:q_maxy )
{
	if ( veh_x >= q_minx && veh_x <= q_maxx && veh_y >= q_miny && veh_y <= q_maxy ) return 1;
	else return 0;
} 

publics: clear_leave_np_td ( playerid )
{
	DeletePVar ( playerid, "leavenp_td_status" ) ;
	for ( new j = 0 ; j < 6 ; j ++ )
	{
		TextDrawHideForPlayer ( playerid, np_td [ j ] ) ;
	}
	return 1 ;
}
publics: SearchFineVehiclePlayer(playerid)
{
	new rows;
	cache_get_row_count(rows);
	if (!rows) return SendClientMessage(playerid, -1, !"У Вас нет арестованных транспортных средств") ;
	t_string[0] = EOS;
	for(new i = 0 ; i < rows ; i ++)
	{
		new veh_model,
			veh_plate[12],
			veh_id,
			veh_tax_fine;
        cache_get_value_name_int(i, "vID", veh_id);
        cache_get_value_name_int(i, "vModel", veh_model);
        cache_get_value_name(i, "vNumber", veh_plate, 12);
		cache_get_value_name_int(i, "vDayFine", veh_tax_fine);

		new line_string[120] ;
		format(line_string, sizeof line_string, ""colwhi"[%d] %s(%d)\tНомерной знак: %s\tСумма выкупа: "collime"$%d\n", 
			i, VehicleNames[ veh_model - 400 ], veh_model, veh_plate, (veh_tax_fine*fInfo[FRACTION_LSPD][fCost][0])
		);
		strcat(t_string, line_string) ;

		format(line_string, 16, "lf_listid_%d", i);
		SetPVarInt(playerid, line_string, veh_id);

		format(line_string, 16, "lf_listmodel_%d", i);
		SetPVarInt(playerid, line_string, veh_model);

		format(line_string, 16, "lf_listtax_%d", i);
		SetPVarInt(playerid, line_string, (veh_tax_fine*fInfo[FRACTION_LSPD][fCost][0]));
	}
	ShowPlayerDialog(playerid, D_FINE_CAR_0, DIALOG_STYLE_TABLIST, ""colserver"Штрафстоянка: "colwhi"Los Santos", t_string, "Выбрать", "Закрыть");
	return 1 ;
}
				
stock UpdateFractionStore(fraction_id)
{
	new
		c_gzGang[6],
		string_[512];
    for(new i = 1; i <= TOTALGZ; i++){
		if (GZInfo[i][gFrakVlad] == 12)
			c_gzGang[0]++;
		else if (GZInfo[i][gFrakVlad] == 13)
            c_gzGang[1]++;
		else if (GZInfo[i][gFrakVlad] == 15)
		    c_gzGang[2]++;
		else if (GZInfo[i][gFrakVlad] == 17)
		    c_gzGang[3]++;
		else if (GZInfo[i][gFrakVlad] == 18)
		    c_gzGang[4]++;
		else if (GZInfo[i][gFrakVlad] == 8)
		    c_gzGang[5]++;
	}
	
	if (fraction_id == FRACTION_LSPD || fraction_id == FRACTION_FBI || fraction_id == FRACTION_SFPD || fraction_id == FRACTION_LVPD) {
		format(string_, sizeof string_, "{FFD700}Склад оружия\n"colwhi"Материалов: {F58B11}%d ед.\n\n{CAFA0A}Используйте: ALT",
			FractionInfo[fraction_id][fMaterials]
		);
	} 
	else if (fraction_id == FRACTION_LCN)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_MAFIA_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_MAFIA_MATERIALS;
		if (FractionInfo[fraction_id][fMoney] > 1_000_000_000) {
			FractionInfo[fraction_id][fMoney] = 1_000_000_000;
		} 
		format(string_, sizeof string_, "{FFD700}Склад La Cosa Nostra\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\n\
			"colwhi"Используйте: ALT", FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], convert_money(FractionInfo[fraction_id][fMoney]));
	}
	else if (fraction_id == FRACTION_YAKUZA)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_MAFIA_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_MAFIA_MATERIALS;
		if (FractionInfo[fraction_id][fMoney] > 1_000_000_000) {
			FractionInfo[fraction_id][fMoney] = 1_000_000_000;
		} 
		format(string_, sizeof string_, "{FFD700}Склад Yakuza\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\n\
			"colwhi"Используйте: ALT", FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], convert_money(FractionInfo[fraction_id][fMoney]));
	}
	else if (fraction_id == FRACTION_CITYHALL)
	{
		format(string_, sizeof string_, "{FFD700}Казна\n\
			"colwhi"Денег: {F58B11}%s\n\
			"colwhi"Налог: {F58B11}%d\n\n\
			{CAFA0A}Используйте: ALT", convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fTaxState]);
	}
	else if (fraction_id == FRACTION_PIRUS)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_GANG_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_GANG_MATERIALS;
		format(string_, sizeof string_, "{FFD700}Склад The Pirus\n\
			"colwhi"Кол-во территорий: {F58B11}%d\n\
			"colwhi"Кол-во граффити: {F58B11}%d\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\
			"colwhi"G-Points:  {F58B11}%d points\n\n\
			{CAFA0A}Используйте: ALT", c_gzGang[5], tFractionGraffiti[fraction_id], FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]);
    }
	else if (fraction_id == FRACTION_BALLAS)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_GANG_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_GANG_MATERIALS;
		format(string_, sizeof string_, "{FFD700}Склад Ballas\n\
			"colwhi"Кол-во территорий: {F58B11}%d\n\
			"colwhi"Кол-во граффити: {F58B11}%d\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\
			"colwhi"G-Points:  {F58B11}%d points\n\n\
			{CAFA0A}Используйте: ALT", c_gzGang[0], tFractionGraffiti[fraction_id], FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]);
    }
	else if (fraction_id == FRACTION_VAGOS)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_GANG_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_GANG_MATERIALS;
		format(string_, sizeof string_, "{FFD700}Склад Vagos\n\
			"colwhi"Кол-во территорий: {F58B11}%d\n\
			"colwhi"Кол-во граффити: {F58B11}%d\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\
			"colwhi"G-Points:  {F58B11}%d points\n\n\
			{CAFA0A}Используйте: ALT", c_gzGang[1], tFractionGraffiti[fraction_id], FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]);
    }
	else if (fraction_id == FRACTION_RUSSIAN)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_MAFIA_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_MAFIA_MATERIALS;
		if (FractionInfo[fraction_id][fMoney] > 1_000_000_000) {
			FractionInfo[fraction_id][fMoney] = 1_000_000_000;
		}
		format(string_, sizeof string_, "{FFD700}Склад Русской мафии\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\n\
			"colwhi"Используйте: ALT", FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], convert_money(FractionInfo[fraction_id][fMoney]));
	}
	else if (fraction_id == FRACTION_GROVE)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_GANG_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_GANG_MATERIALS;
		format(string_, sizeof string_, "{FFD700}Склад Grove\n\
			"colwhi"Кол-во территорий: {F58B11}%d\n\
			"colwhi"Кол-во граффити: {F58B11}%d\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\
			"colwhi"G-Points:  {F58B11}%d points\n\n\
			{CAFA0A}Используйте: ALT", c_gzGang[2], tFractionGraffiti[fraction_id], FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]);
    }
	else if (fraction_id == FRACTION_AZTEC)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_GANG_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_GANG_MATERIALS;
		format(string_, sizeof string_, "{FFD700}Склад Aztec\n\
			"colwhi"Кол-во территорий: {F58B11}%d\n\
			"colwhi"Кол-во граффити: {F58B11}%d\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\
			"colwhi"G-Points:  {F58B11}%d points\n\n\
			{CAFA0A}Используйте: ALT", c_gzGang[3], tFractionGraffiti[fraction_id], FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]);
    }
	else if (fraction_id == FRACTION_RIFA)
	{
		if (FractionInfo[fraction_id][fMaterials] > STORE_GANG_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_GANG_MATERIALS;
		format(string_, sizeof string_, "{FFD700}Склад Rifa\n\
			"colwhi"Кол-во территорий: {F58B11}%d\n\
			"colwhi"Кол-во граффити: {F58B11}%d\n\
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\
			"colwhi"G-Points:  {F58B11}%d points\n\n\
			{CAFA0A}Используйте: ALT", c_gzGang[4], tFractionGraffiti[fraction_id], FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]);
    }
	else if (fraction_id == FRACTION_MONGOLS_MC) {
		format(string_, sizeof string_, "{FFD700}Склад Mongols MC\n\ 
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
			"colwhi"Легкие наркотики: {F58B11}%d гр\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\n\
			{CAFA0A}Используйте: ALT", FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fDrugs], FractionInfo[fraction_id][fSpeedDrugs], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]
		);
	}
	else if (fraction_id == FRACTION_BANDIDOS_MC) {
		format(string_, sizeof string_, "{FFD700}Склад Bandidos MC\n\ 
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
			"colwhi"Легкие наркотики: {F58B11}%d гр\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\n\
			{CAFA0A}Используйте: ALT", FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fDrugs], FractionInfo[fraction_id][fSpeedDrugs], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]
		);
	}
	else if (fraction_id == FRACTION_OUTLAWS_MC) {
		format(string_, sizeof string_, "{FFD700}Склад Outlaws MC\n\ 
			"colwhi"Материалы: {F58B11}%d\n\
			"colwhi"Тяжелые наркотики: {F58B11}%d гр\n\
			"colwhi"Легкие наркотики: {F58B11}%d гр\n\
			"colwhi"Аптечек: {F58B11}%d\n\
			"colwhi"Деньги: {F58B11}$%s\n\n\
			{CAFA0A}Используйте: ALT", FractionInfo[fraction_id][fMaterials], FractionInfo[fraction_id][fDrugs], FractionInfo[fraction_id][fSpeedDrugs], FractionInfo[fraction_id][fHeal], 
			convert_money(FractionInfo[fraction_id][fMoney]), FractionInfo[fraction_id][fPoints]
		);
	}
	UpdateDynamic3DTextLabelText(FractionInfo[fraction_id][fText], -1, string_);


	//if (FractionInfo[fraction_id][fMaterials] > STORE_LIMITS_MATERIALS) FractionInfo[fraction_id][fMaterials] = STORE_LIMITS_MATERIALS;
	/*if (FractionInfo[fraction_id][fHeal] > 20000) FractionInfo[fraction_id][fHeal] = 20000;
	if (FractionInfo[fraction_id][fMoney] > 10000) FractionInfo[fraction_id][fMoney] = 10000;*/
	return 1;
}

stock GetVehicleRotation(vehicleid,&Float:rx,&Float:ry,&Float:rz){
	new Float:qw,Float:qx,Float:qy,Float:qz;
	GetVehicleRotationQuat(vehicleid,qw,qx,qy,qz ) ;
	rx = asin(2*qy*qz-2*qx*qw ) ;
	ry = -atan2(qx*qz+qy*qw,0.5-qx*qx-qy*qy ) ;
	rz = -atan2(qx*qy+qz*qw,0.5-qx*qx-qz*qz ) ;
}

stock IsVehicleDrivingBackwards ( vehicleid )
{
    new Float: float_var [ 3 ] ;
    if (GetVehicleVelocity(vehicleid, float_var [ 1 ], float_var [ 2 ], float_var [ 0 ] ) )
	{
        GetVehicleZAngle ( vehicleid, float_var[0] ) ;
        if (float_var[0] < 90) {
            if (float_var[1] > 0 && float_var[2] < 0) return 1;
        }
        else if (float_var[0] < 180) {
            if (float_var[1] > 0 && float_var[2] > 0) return 1;
        }
        else if (float_var[0] < 270) {
            if (float_var[1] < 0 && float_var[2] > 0) return 1;
        }
        else if (float_var[1] < 0 && float_var[2] < 0) return 1;
    }
    return false;
}
/*
stock GetVehicleSpeed(vehicleid)
{
    new Float:X, Float:Y, Float:Z, Float:_speed;
    GetVehicleVelocity(vehicleid, X, Y, Z ) ;
    _speed = ( (floatsqroot( (X*X) + (Y*Y) )*10) / 1.65 ) * 30;
    return floatround ( _speed, floatround_round ) ;
}*/


stock DialogBootVehicle(playerid, vehicleid)
{
	t_string[0] = EOS;
	new
	    str_[90],
		string_[128],
		count_gun = 0;
	strcat(t_string, ""colserver"[№] Наименование\t"colserver"Кол-во\n");

	format(string_, sizeof string_, ""colwhi"[0] Деньги\t"colserver"%d / 20.000.000 вирт\n", VehicleInfo[ vehicleid - 1 ][vMoney]);
	strcat(t_string, string_);
	format(string_, sizeof string_, ""colwhi"[1] Канистры\t"colserver"%d / 3 шт.\n", VehicleInfo[ vehicleid - 1 ][vFillBag]);
	strcat(t_string, string_);
	format(string_, sizeof string_, ""colwhi"[2] Рем. комплект\t"colserver"%d / 3 шт.\n", VehicleInfo[ vehicleid - 1 ][vRepair]);
	strcat(t_string, string_);
	format(string_, sizeof string_, ""colwhi"[3] Наркотики\t"colserver"%d / 500 ед.\n", VehicleInfo[ vehicleid - 1 ][vDrugs]);
	strcat(t_string, string_);
	format(string_, sizeof string_, ""colwhi"[4] Материалы\t"colserver"%d / 1500 ед\n", VehicleInfo[ vehicleid - 1 ][vMaterials]);
	strcat(t_string, string_);
	for(new t = 0; t < 6; t++) {
    	if (VehicleInfo[ vehicleid - 1 ][vBootGun][t] != 0) {
    		count_gun ++;
    	}
	}
	format(string_, sizeof string_, ""colwhi"[5] Оружие\t"colserver"%d / 6 Занято", count_gun);
	strcat(t_string, string_);

	format(str_, sizeof str_, ""colserver"Багажник: "colwhi"%s(%d)", VehicleNames[ GetVehicleModel(vehicleid) - 400], GetVehicleModel(vehicleid));
	ShowPlayerDialog(playerid, D_VEHICLE_FUNC_0, DIALOG_STYLE_TABLIST_HEADERS, str_, t_string, "Выбрать", "Закрыть");
}
stock ShowBootUsingMenu(playerid, listitem)
{
	new
		str_name[16];
	t_string[0] = EOS;
	switch(listitem)
	{
		case 0: str_name = "Деньги", SetPVarInt(playerid, #SelectBootID, 0);
		case 1: str_name = "Канистры", SetPVarInt(playerid, #SelectBootID, 1);
		case 2: str_name = "Рем. комплект", SetPVarInt(playerid, #SelectBootID, 2);
		case 3: str_name = "Наркотики", SetPVarInt(playerid, #SelectBootID, 3);
		case 4: str_name = "Материалы", SetPVarInt(playerid, #SelectBootID, 4);
	}
	format(t_string, sizeof t_string, "- "colserver"%s"colwhi"\n\
	Для того чтобы взять: \"-\" и количество.\n\
	Для того чтобы положить: \"+\" и количество.", str_name);
	return ShowPlayerDialog(playerid, D_VEHICLE_FUNC_1, DIALOG_STYLE_INPUT, ""colserver"Багажник", t_string, "Ввести", "Отмена");
}
stock ShowBootGunVehicle(playerid)
{
	new
		V_IDX = GetPVarInt(playerid, #PlayerVehicleID),
		gunname[32],
		str_[64];
	t_string[0] = EOS;
	strcat(t_string, ""colserver"[№] Оружие\t"colserver"Количество патронов\n");
	for(new x; x < 6; x ++)
	{
		if (VehicleInfo[V_IDX - 1][vBootGun][x] != 0)
		{
			GetWeaponName(VehicleInfo[V_IDX - 1][vBootGun][x], gunname, 32);
		}
		else gunname = ""collime"Свободный слот"colwhi"";
		format(str_, sizeof str_, ""colwhi"[%d] %s\t%d\n", x + 1, gunname, VehicleInfo[V_IDX - 1][vBootAmmo][x]);
		strcat(t_string, str_);
	}
	return ShowPlayerDialog(playerid, D_VEHICLE_FUNC_2, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Багажник: "colwhi"Оружие", t_string, "Выбрать", "Отмена");
}
stock ShowVehicleHomeGunVehicle(playerid)
{
	new
		//V_IDX = GetPVarInt(playerid, #PlayerVehicleID),
		gunname[32],
		str_[64];
	t_string[0] = EOS;
	strcat(t_string, ""colserver"[№] Оружие\t"colserver"Количество патронов\n");
	for(new x; x < 6; x ++)
	{
		if (VehicleInfo[pTemp[playerid][tPlayerTrailerHome] - 1][vBootGun][x] != 0) {
			GetWeaponName(VehicleInfo[pTemp[playerid][tPlayerTrailerHome] - 1][vBootGun][x], gunname, 32);
		}
		else gunname = ""collime"Свободный слот"colwhi"";
		format(str_, sizeof str_, ""colwhi"[%d] %s\t%d\n", x + 1, gunname, VehicleInfo[pTemp[playerid][tPlayerTrailerHome] - 1][vBootAmmo][x]);
		strcat(t_string, str_);
	}
	return ShowPlayerDialog(playerid, D_VEHICLE_HOME_4, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Шкаф: "colwhi"Оружие", t_string, "Выбрать", "Отмена");
}
stock GetNearestVehicle(playerid)
{
	new Float:X,
		Float:Y,
		Float:Z;
	for(new veh = 1; veh < MAX_VEHICLES; veh++)
	{
		if (GetVehicleModel(veh))
		{ 
			if (GetVehicleVirtualWorld(veh) != GetPlayerVirtualWorld(playerid)) continue;
			GetVehiclePos(veh, X, Y,Z);
			if (IsPlayerInRangeOfPoint(playerid, 3.5, X, Y, Z)) return veh;
		}
	}
	return -1;
} 

stock ShowTextDrawCapture(playerid, index)
{
    for(new i = 0; i < sizeof (CaptureTD[]); i++)
        TextDrawShowForPlayer(playerid, CaptureTD[index][i]); 
    return 1;
}
stock HideTextDrawCapture(playerid,index)
{
    for(new i = 0; i < sizeof (CaptureTD[]); i++)
        TextDrawHideForPlayer(playerid, CaptureTD[index][i]); 
    return 1;
}

stock UpdateSeconds(i)
{
	new str[64];
	{
		new str_time[32];
		Convert_GZ(GZInfo[i][gCaptureTime],str_time);
		
		new index = GZInfo[i][gTD];

		format(str,sizeof(str),"%s",str_time);
		TextDrawSetString(CaptureTD[index][3], str);
	}
    
    return 1;
}

stock UpdateKillsCapture(i)
{
    new index = GZInfo[i][gTD];
    new m1,m2,sr[12];
    m1 = GZInfo[i][gNapad];
    m2 = GZInfo[i][gFrakVlad];

    format(sr, sizeof(sr), "%d",capture_kills[capture_band(m1)]);
    TextDrawSetString(CaptureTD[index][9], sr);

    format(sr, sizeof(sr), "%d",capture_kills[capture_band(m2)]);
    TextDrawSetString(CaptureTD[index][10], sr);
	
    return 1;
}
Convert_GZ(number, const str[])
{
    new mins = 0, secs = 0;
    mins = floatround((number / 60));
    secs = floatround(number - (mins * 60));
    format(str, 32, "%02d:%02d", mins, secs);
}
//
new	Text: ActionGame_TD[7]; 
stock LeaveRobHouse(playerid) {
	if(rob_veh[playerid] != INVALID_VEHICLE_ID) {
		A_DestroyVehicle(rob_veh[playerid]);
		rob_veh[playerid] = INVALID_VEHICLE_ID;
	}
	if(IsValidDynamicPickup(RobPlayer[playerid][RobPickup])) {
		DestroyDynamicPickup(RobPlayer[playerid][RobPickup]);
		DestroyDynamicArea(RobPlayer[playerid][RobArea]);
		DestroyDynamic3DTextLabel(RobPlayer[playerid][RobText]);
	}
}

stock ActionMiniGamePlayer(playerid, bool:status)
{
	if (status)
	{
		//SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Для выхода используйте клавишу "colserver"\"F\"");
		TogglePlayerControllable(playerid, false); 
		for (new i = 0; i < sizeof (ActionGame_TD); i++) 
			TextDrawShowForPlayer(playerid, ActionGame_TD[i]);
		action_ptd[playerid][1]  = CreatePlayerTextDraw(playerid, 229.999938, 371.011047, "PRESS:_Y");
		PlayerTextDrawLetterSize(playerid, action_ptd[playerid][1] , 0.202915, 0.894814);
		PlayerTextDrawTextSize(playerid, action_ptd[playerid][1] , 423.000000, 0.000000);
		PlayerTextDrawAlignment(playerid, action_ptd[playerid][1] , 1);
		PlayerTextDrawColor(playerid, action_ptd[playerid][1] , -1);
		PlayerTextDrawSetShadow(playerid, action_ptd[playerid][1] , 0);
		PlayerTextDrawSetOutline(playerid, action_ptd[playerid][1] , 1);
		PlayerTextDrawBackgroundColor(playerid, action_ptd[playerid][1] , 255);
		PlayerTextDrawFont(playerid, action_ptd[playerid][1] , 1);
		PlayerTextDrawSetProportional(playerid, action_ptd[playerid][1] , 1);
		switch ( random ( 5 ) )
		{
			case 0 .. 2:pTemp[playerid][tActionKey] = KEY_YES, PlayerTextDrawSetString ( playerid, action_ptd [ playerid ] [ 1 ], "PRESS:_Y" ) ;
			case 3 .. 5:pTemp[playerid][tActionKey] = KEY_NO, PlayerTextDrawSetString ( playerid, action_ptd [ playerid ] [ 1 ], "PRESS:_N" ) ;
		}
		//SendMes(playerid, -1, "action_key: %d", pTemp[playerid][tActionKey]);
		action_ptd[playerid][2] = CreatePlayerTextDraw(playerid, 242.300125, 384.951919, "LD_SPAC:white");
		PlayerTextDrawTextSize(playerid, action_ptd[playerid][2], 0.000000, 16.000000);
		PlayerTextDrawAlignment(playerid, action_ptd[playerid][2], 1);
		PlayerTextDrawColor(playerid, action_ptd[playerid][2], 255);
		PlayerTextDrawSetShadow(playerid, action_ptd[playerid][2], 0);
		PlayerTextDrawBackgroundColor(playerid, action_ptd[playerid][2], 255);
		PlayerTextDrawFont(playerid, action_ptd[playerid][2], 4);
		PlayerTextDrawSetProportional(playerid, action_ptd[playerid][2], 0);

		action_ptd[playerid][0] = CreatePlayerTextDraw(playerid, 319.583343, 387.298614, "_");
		PlayerTextDrawLetterSize(playerid, action_ptd[playerid][0], 0.195500, 1.161481);
		PlayerTextDrawAlignment(playerid, action_ptd[playerid][0], 2);
		PlayerTextDrawColor(playerid, action_ptd[playerid][0], -1);
		PlayerTextDrawSetShadow(playerid, action_ptd[playerid][0], 0);
		PlayerTextDrawSetOutline(playerid, action_ptd[playerid][0], 1);
		PlayerTextDrawBackgroundColor(playerid, action_ptd[playerid][0], 255);
		PlayerTextDrawFont(playerid, action_ptd[playerid][0], 2);
		PlayerTextDrawSetProportional(playerid, action_ptd[playerid][0], 1);
		for ( new i = 0 ; i < 3 ; i ++ ) {
			PlayerTextDrawShow ( playerid, action_ptd [ playerid ] [ i ] ) ;
		}  
		TextDrawHideForPlayer(playerid, ActionGame_TD[6]); 
	}
	else
	{
		TogglePlayerControllable(playerid, true);
		for (new i = 0; i < sizeof (ActionGame_TD); i++) 
			TextDrawHideForPlayer(playerid, ActionGame_TD[i]);
		for (new i = 0; i < 3; i++) {
			PlayerTextDrawDestroy(playerid, action_ptd[playerid][i]);
			action_ptd[playerid][i] = PlayerText:-1; 
		}
		pTemp[playerid][tActionType] = 0 ;
		pTemp[playerid][tActionStep] = 0 ;
		pTemp[playerid][tActionKey] = 0;
	}
	return 1 ;
}  
stock SetActionGameProgressBar(playerid, fuel, bool:random_key = true) { 
	if (fuel <= 0)  {
		fuel = 0/* + 1*/;
		//Проиграл
	} 
	else if (fuel > 10) {
		fuel = 10;
	}

	pTemp[playerid][tActionStep] = fuel;
	//SendMes(playerid, -1, "%d", pTemp[playerid][tActionStep]); 
	switch (pTemp[playerid][tActionType])
	{
		case ACTION_ROB_HOUSE: {   
			ApplyAnimation(playerid,"BD_FIRE","wash_up",4.1,1,0,0,1,1, 1);
		}
		case ACTION_TAKE_ATM_CASH, ACTION_HUNTER_DEER: {
			ApplyAnimation( playerid, "BOMBER", "BOM_Plant_Crouch_In", 4.1, 0, 1, 1, 1, 0 );
		}
		case ACTION_FACTORY_SORT: {
			ApplyAnimation(playerid, "CASINO", "Slot_Plyr", 4.1, 0, 0, 0, 0, 0, 1);
		}
	}
	if (random_key) {
		switch ( random ( 5 ) )
		{
			case 0 .. 2: pTemp[playerid][tActionKey] = KEY_YES, PlayerTextDrawSetString(playerid, action_ptd[playerid][1], "PRESS:_Y");
			case 3 .. 5: pTemp[playerid][tActionKey] = KEY_NO, PlayerTextDrawSetString(playerid, action_ptd[playerid][1], "PRESS:_N");
		}
	}
	/*else {

	}*/
	 
	new Float: progress = pTemp[playerid][tActionStep] * (2.5 * 1.652);
	if (progress > 95.0) 
		TextDrawShowForPlayer(playerid, ActionGame_TD[6]);
	else TextDrawHideForPlayer(playerid, ActionGame_TD[6]);
	
	progress *= (2.5 * 1.652); // (>95%)
	if (progress > 157.0) progress = 157.0; 
	PlayerTextDrawTextSize(playerid, action_ptd[playerid][2], progress, 16.000000);
	PlayerTextDrawShow(playerid, action_ptd[playerid][2]);  
	return true;
} 

stock LoadMiniGamesTD() {
ActionGame_TD[0] = TextDrawCreate(230.000000, 380.000000, "LD_SPAC:white");
	TextDrawTextSize(ActionGame_TD[0], 181.000000, 27.489988);
	TextDrawAlignment(ActionGame_TD[0], 1);
	TextDrawColor(ActionGame_TD[0], COLOR_SERVER);
	TextDrawSetShadow(ActionGame_TD[0], 0);
	TextDrawBackgroundColor(ActionGame_TD[0], 255);
	TextDrawFont(ActionGame_TD[0], 4);
	TextDrawSetProportional(ActionGame_TD[0], 0);

	ActionGame_TD[1] = TextDrawCreate(212.133453, 373.188903, "ld_beat:chit");
	TextDrawTextSize(ActionGame_TD[1], 41.000000, 41.000000);
	TextDrawAlignment(ActionGame_TD[1], 1);
	TextDrawColor(ActionGame_TD[1], COLOR_SERVER);
	TextDrawSetShadow(ActionGame_TD[1], 0);
	TextDrawBackgroundColor(ActionGame_TD[1], 255);
	TextDrawFont(ActionGame_TD[1], 4);
	TextDrawSetProportional(ActionGame_TD[1], 0);

	ActionGame_TD[2] = TextDrawCreate(390.166595, 373.188903, "ld_beat:chit");
	TextDrawTextSize(ActionGame_TD[2], 41.000000, 41.000000);
	TextDrawAlignment(ActionGame_TD[2], 1);
	TextDrawColor(ActionGame_TD[2], COLOR_SERVER);
	TextDrawSetShadow(ActionGame_TD[2], 0);
	TextDrawBackgroundColor(ActionGame_TD[2], 255);
	TextDrawFont(ActionGame_TD[2], 4);
	TextDrawSetProportional(ActionGame_TD[2], 0);

	ActionGame_TD[3] = TextDrawCreate(231.983901, 381.185241, "ld_beat:chit");
	TextDrawTextSize(ActionGame_TD[3], 22.000000, 24.000000);
	TextDrawAlignment(ActionGame_TD[3], 1);
	TextDrawColor(ActionGame_TD[3], 255);
	TextDrawSetShadow(ActionGame_TD[3], 0);
	TextDrawBackgroundColor(ActionGame_TD[3], 255);
	TextDrawFont(ActionGame_TD[3], 4);
	TextDrawSetProportional(ActionGame_TD[3], 0);

	ActionGame_TD[4] = TextDrawCreate(388.599914, 381.185241, "ld_beat:chit");
	TextDrawTextSize(ActionGame_TD[4], 22.000000, 24.000000);
	TextDrawAlignment(ActionGame_TD[4], 1);
	TextDrawColor(ActionGame_TD[4], 673720575);
	TextDrawSetShadow(ActionGame_TD[4], 0);
	TextDrawBackgroundColor(ActionGame_TD[4], 255);
	TextDrawFont(ActionGame_TD[4], 4);
	TextDrawSetProportional(ActionGame_TD[4], 0);

	ActionGame_TD[5] = TextDrawCreate(242.300125, 384.951919, "LD_SPAC:white");
	TextDrawTextSize(ActionGame_TD[5], 157.000000, 16.220005);
	TextDrawAlignment(ActionGame_TD[5], 1);
	TextDrawColor(ActionGame_TD[5], 673720575);
	TextDrawSetShadow(ActionGame_TD[5], 0);
	TextDrawBackgroundColor(ActionGame_TD[5], 255);
	TextDrawFont(ActionGame_TD[5], 4);
	TextDrawSetProportional(ActionGame_TD[5], 0);

	ActionGame_TD[6] = TextDrawCreate(388.599914, 381.185241, "ld_beat:chit");
	TextDrawTextSize(ActionGame_TD[6], 22.000000, 24.000000);
	TextDrawAlignment(ActionGame_TD[6], 1);
	TextDrawColor(ActionGame_TD[6], 255);
	TextDrawSetShadow(ActionGame_TD[6], 0);
	TextDrawBackgroundColor(ActionGame_TD[6], 255);
	TextDrawFont(ActionGame_TD[6], 4);
	TextDrawSetProportional(ActionGame_TD[6], 0);
}
stock InittextDraw_Capture()
{
	#if defined _capture_stats_inc
		CreateCaptureStats_TD();
	#endif
	#if defined _businesses_inc
	LoadMiniGamesTD();
	BusinessGAS_TD[0] = TextDrawCreate(230.000000, 160.000000, "LD_SPAC:white");
	TextDrawTextSize(BusinessGAS_TD[0], 181.000000, 27.489988);
	TextDrawAlignment(BusinessGAS_TD[0], 1);
	TextDrawColor(BusinessGAS_TD[0], COLOR_SERVER);
	TextDrawSetShadow(BusinessGAS_TD[0], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[0], 255);
	TextDrawFont(BusinessGAS_TD[0], 4);
	TextDrawSetProportional(BusinessGAS_TD[0], 0);

	BusinessGAS_TD[1] = TextDrawCreate(212.133453, 153.188903, "ld_beat:chit");
	TextDrawTextSize(BusinessGAS_TD[1], 41.000000, 41.000000);
	TextDrawAlignment(BusinessGAS_TD[1], 1);
	TextDrawColor(BusinessGAS_TD[1], COLOR_SERVER);
	TextDrawSetShadow(BusinessGAS_TD[1], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[1], 255);
	TextDrawFont(BusinessGAS_TD[1], 4);
	TextDrawSetProportional(BusinessGAS_TD[1], 0);

	BusinessGAS_TD[2] = TextDrawCreate(390.166595, 153.188903, "ld_beat:chit");
	TextDrawTextSize(BusinessGAS_TD[2], 41.000000, 41.000000);
	TextDrawAlignment(BusinessGAS_TD[2], 1);
	TextDrawColor(BusinessGAS_TD[2], COLOR_SERVER);
	TextDrawSetShadow(BusinessGAS_TD[2], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[2], 255);
	TextDrawFont(BusinessGAS_TD[2], 4);
	TextDrawSetProportional(BusinessGAS_TD[2], 0);

	BusinessGAS_TD[3] = TextDrawCreate(231.983901, 161.185241, "ld_beat:chit");
	TextDrawTextSize(BusinessGAS_TD[3], 22.000000, 24.000000);
	TextDrawAlignment(BusinessGAS_TD[3], 1);
	TextDrawColor(BusinessGAS_TD[3], 255);
	TextDrawSetShadow(BusinessGAS_TD[3], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[3], 255);
	TextDrawFont(BusinessGAS_TD[3], 4);
	TextDrawSetProportional(BusinessGAS_TD[3], 0);

	BusinessGAS_TD[4] = TextDrawCreate(388.599914, 161.185241, "ld_beat:chit");
	TextDrawTextSize(BusinessGAS_TD[4], 22.000000, 24.000000);
	TextDrawAlignment(BusinessGAS_TD[4], 1);
	TextDrawColor(BusinessGAS_TD[4], 673720575);
	TextDrawSetShadow(BusinessGAS_TD[4], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[4], 255);
	TextDrawFont(BusinessGAS_TD[4], 4);
	TextDrawSetProportional(BusinessGAS_TD[4], 0);

	BusinessGAS_TD[5] = TextDrawCreate(242.300125, 164.951919, "LD_SPAC:white");
	TextDrawTextSize(BusinessGAS_TD[5], 157.000000, 16.220005);
	TextDrawAlignment(BusinessGAS_TD[5], 1);
	TextDrawColor(BusinessGAS_TD[5], 673720575);
	TextDrawSetShadow(BusinessGAS_TD[5], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[5], 255);
	TextDrawFont(BusinessGAS_TD[5], 4);
	TextDrawSetProportional(BusinessGAS_TD[5], 0);

	BusinessGAS_TD[6] = TextDrawCreate(229.800109, 164.363143, "-");
	TextDrawLetterSize(BusinessGAS_TD[6], 0.400000, 1.600000);
	TextDrawTextSize(BusinessGAS_TD[6], 12.000000, 8.000000);
	TextDrawAlignment(BusinessGAS_TD[6], 2);
	TextDrawColor(BusinessGAS_TD[6], 255);
	TextDrawSetShadow(BusinessGAS_TD[6], 0);
	TextDrawSetOutline(BusinessGAS_TD[6], 1);
	TextDrawBackgroundColor(BusinessGAS_TD[6], 255);
	TextDrawFont(BusinessGAS_TD[6], 1);
	TextDrawSetProportional(BusinessGAS_TD[6], 1);
	TextDrawSetSelectable(BusinessGAS_TD[6], true);

	BusinessGAS_TD[7] = TextDrawCreate(414.600891, 165.463211, "+");
	TextDrawLetterSize(BusinessGAS_TD[7], 0.394582, 1.558518);
	TextDrawTextSize(BusinessGAS_TD[7], 12.000000, 8.000000);
	TextDrawAlignment(BusinessGAS_TD[7], 2);
	TextDrawColor(BusinessGAS_TD[7], 255);
	TextDrawSetShadow(BusinessGAS_TD[7], 0);
	TextDrawSetOutline(BusinessGAS_TD[7], 1);
	TextDrawBackgroundColor(BusinessGAS_TD[7], 255);
	TextDrawFont(BusinessGAS_TD[7], 3);
	TextDrawSetProportional(BusinessGAS_TD[7], 1);
	TextDrawSetSelectable(BusinessGAS_TD[7], true);

	BusinessGAS_TD[8] = TextDrawCreate(229.999938, 151.011047, "FILLING STATION");
	TextDrawLetterSize(BusinessGAS_TD[8], 0.202915, 0.894814);
	TextDrawTextSize(BusinessGAS_TD[8], 423.000000, 0.000000);
	TextDrawAlignment(BusinessGAS_TD[8], 1);
	TextDrawColor(BusinessGAS_TD[8], -1);
	TextDrawSetShadow(BusinessGAS_TD[8], 0);
	TextDrawSetOutline(BusinessGAS_TD[8], 1);
	TextDrawBackgroundColor(BusinessGAS_TD[8], 255);
	TextDrawFont(BusinessGAS_TD[8], 1);
	TextDrawSetProportional(BusinessGAS_TD[8], 1);

	BusinessGAS_TD[9] = TextDrawCreate(273.333282, 192.333389, "LD_SPAC:white");
	TextDrawTextSize(BusinessGAS_TD[9], 85.000000, 21.000000);
	TextDrawAlignment(BusinessGAS_TD[9], 1);
	TextDrawColor(BusinessGAS_TD[9], 8388775);
	TextDrawSetShadow(BusinessGAS_TD[9], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[9], 255);
	TextDrawFont(BusinessGAS_TD[9], 4);
	TextDrawSetProportional(BusinessGAS_TD[9], 0);

	BusinessGAS_TD[10] = TextDrawCreate(274.733367, 194.233505, "LD_SPAC:white");
	TextDrawTextSize(BusinessGAS_TD[10], 82.000000, 16.929975);
	TextDrawAlignment(BusinessGAS_TD[10], 1);
	TextDrawColor(BusinessGAS_TD[10], 16711785);
	TextDrawSetShadow(BusinessGAS_TD[10], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[10], 255);
	TextDrawFont(BusinessGAS_TD[10], 4);
	TextDrawSetProportional(BusinessGAS_TD[10], 0);
	TextDrawSetSelectable(BusinessGAS_TD[10], true);

	BusinessGAS_TD[11] = TextDrawCreate(317.083282, 195.703720, "FILL");
	TextDrawLetterSize(BusinessGAS_TD[11], 0.414582, 1.428889);
	TextDrawTextSize(BusinessGAS_TD[11], 0.000000, 295.000000);
	TextDrawAlignment(BusinessGAS_TD[11], 2);
	TextDrawColor(BusinessGAS_TD[11], -1);
	TextDrawSetShadow(BusinessGAS_TD[11], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[11], 255);
	TextDrawFont(BusinessGAS_TD[11], 1);
	TextDrawSetProportional(BusinessGAS_TD[11], 1);

	BusinessGAS_TD[12] = TextDrawCreate(388.599914, 161.185241, "ld_beat:chit");
	TextDrawTextSize(BusinessGAS_TD[12], 22.000000, 24.000000);
	TextDrawAlignment(BusinessGAS_TD[12], 1);
	TextDrawColor(BusinessGAS_TD[12], 255);
	TextDrawSetShadow(BusinessGAS_TD[12], 0);
	TextDrawBackgroundColor(BusinessGAS_TD[12], 255);
	TextDrawFont(BusinessGAS_TD[12], 4);
	TextDrawSetProportional(BusinessGAS_TD[12], 0);
	#endif
FamilyHouse_TD[0] = TextDrawCreate(502.666503, 139.651794, "LD_BEAT:chit");
	TextDrawLetterSize(FamilyHouse_TD[0], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[0], 14.000000, 17.000000);
	TextDrawAlignment(FamilyHouse_TD[0], 1);
	TextDrawColor(FamilyHouse_TD[0], COLOR_SERVER);
	TextDrawSetShadow(FamilyHouse_TD[0], 0);
	TextDrawSetOutline(FamilyHouse_TD[0], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[0], 255);
	TextDrawFont(FamilyHouse_TD[0], 4);
	TextDrawSetProportional(FamilyHouse_TD[0], 0);
	TextDrawSetShadow(FamilyHouse_TD[0], 0);
//"PRESS 'ALT' TO MENU"
	FamilyHouse_TD[1] = TextDrawCreate(509.532989, 142.340698, "LD_SPAC:white");
	TextDrawLetterSize(FamilyHouse_TD[1], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[1], 88.000000, 11.000000);
	TextDrawAlignment(FamilyHouse_TD[1], 1);
	TextDrawColor(FamilyHouse_TD[1], COLOR_SERVER);
	TextDrawSetShadow(FamilyHouse_TD[1], 0);
	TextDrawSetOutline(FamilyHouse_TD[1], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[1], 255);
	TextDrawFont(FamilyHouse_TD[1], 4);
	TextDrawSetProportional(FamilyHouse_TD[1], 0);
	TextDrawSetShadow(FamilyHouse_TD[1], 0);

	FamilyHouse_TD[2] = TextDrawCreate(590.333374, 139.651794, "LD_BEAT:chit");
	TextDrawLetterSize(FamilyHouse_TD[2], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[2], 14.000000, 17.000000);
	TextDrawAlignment(FamilyHouse_TD[2], 1);
	TextDrawColor(FamilyHouse_TD[2], COLOR_SERVER);
	TextDrawSetShadow(FamilyHouse_TD[2], 0);
	TextDrawSetOutline(FamilyHouse_TD[2], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[2], 255);
	TextDrawFont(FamilyHouse_TD[2], 4);
	TextDrawSetProportional(FamilyHouse_TD[2], 0);
	TextDrawSetShadow(FamilyHouse_TD[2], 0);

	FamilyHouse_TD[3] = TextDrawCreate(504.633087, 148.777801, "LD_SPAC:white");
	TextDrawLetterSize(FamilyHouse_TD[3], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[3], 97.379798, 92.000000);
	TextDrawAlignment(FamilyHouse_TD[3], 1);
	TextDrawColor(FamilyHouse_TD[3], 421075455);
	TextDrawSetShadow(FamilyHouse_TD[3], 0);
	TextDrawSetOutline(FamilyHouse_TD[3], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[3], 255);
	TextDrawFont(FamilyHouse_TD[3], 4);
	TextDrawSetProportional(FamilyHouse_TD[3], 0);
	TextDrawSetShadow(FamilyHouse_TD[3], 0);

	FamilyHouse_TD[4] = TextDrawCreate(504.633087, 157.903701, "LD_SPAC:white");
	TextDrawLetterSize(FamilyHouse_TD[4], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[4], 97.269996, 17.000000);
	TextDrawAlignment(FamilyHouse_TD[4], 1);
	TextDrawColor(FamilyHouse_TD[4], 673720575);
	TextDrawSetShadow(FamilyHouse_TD[4], 0);
	TextDrawSetOutline(FamilyHouse_TD[4], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[4], 255);
	TextDrawFont(FamilyHouse_TD[4], 4);
	TextDrawSetProportional(FamilyHouse_TD[4], 0);
	TextDrawSetShadow(FamilyHouse_TD[4], 0);

	FamilyHouse_TD[5] = TextDrawCreate(552.400024, 159.333297, "HOUSE");
	TextDrawLetterSize(FamilyHouse_TD[5], 0.163000, 0.728799);
	TextDrawAlignment(FamilyHouse_TD[5], 2);
	TextDrawColor(FamilyHouse_TD[5], -1);
	TextDrawSetShadow(FamilyHouse_TD[5], 0);
	TextDrawSetOutline(FamilyHouse_TD[5], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[5], 6);
	TextDrawFont(FamilyHouse_TD[5], 1);
	TextDrawSetProportional(FamilyHouse_TD[5], 1);
	TextDrawSetShadow(FamilyHouse_TD[5], 0); 

	FamilyHouse_TD[6] = TextDrawCreate(504.333099, 150.951797, "particle:lamp_shad_64");
	TextDrawLetterSize(FamilyHouse_TD[6], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[6], 97.000000, -6.000000);
	TextDrawAlignment(FamilyHouse_TD[6], 1);
	TextDrawColor(FamilyHouse_TD[6], 119);
	TextDrawSetShadow(FamilyHouse_TD[6], 0);
	TextDrawSetOutline(FamilyHouse_TD[6], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[6], 255);
	TextDrawFont(FamilyHouse_TD[6], 4);
	TextDrawSetProportional(FamilyHouse_TD[6], 0);
	TextDrawSetShadow(FamilyHouse_TD[6], 0);

	FamilyHouse_TD[7] = TextDrawCreate(504.633087, 185.281494, "LD_SPAC:white");
	TextDrawLetterSize(FamilyHouse_TD[7], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[7], 97.269996, 17.000000);
	TextDrawAlignment(FamilyHouse_TD[7], 1);
	TextDrawColor(FamilyHouse_TD[7], 673720575);
	TextDrawSetShadow(FamilyHouse_TD[7], 0);
	TextDrawSetOutline(FamilyHouse_TD[7], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[7], 255);
	TextDrawFont(FamilyHouse_TD[7], 4);
	TextDrawSetProportional(FamilyHouse_TD[7], 0);
	TextDrawSetShadow(FamilyHouse_TD[7], 0);

	FamilyHouse_TD[8] = TextDrawCreate(553.466613, 186.981506, "FAMILY_HOUSE");
	TextDrawLetterSize(FamilyHouse_TD[8], 0.163000, 0.728799);
	TextDrawAlignment(FamilyHouse_TD[8], 2);
	TextDrawColor(FamilyHouse_TD[8], -1);
	TextDrawSetShadow(FamilyHouse_TD[8], 0);
	TextDrawSetOutline(FamilyHouse_TD[8], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[8], 6);
	TextDrawFont(FamilyHouse_TD[8], 1);
	TextDrawSetProportional(FamilyHouse_TD[8], 1);
	TextDrawSetShadow(FamilyHouse_TD[8], 0);

	FamilyHouse_TD[9] = TextDrawCreate(505.033111, 240.651901, "LD_SPAC:white");
	TextDrawLetterSize(FamilyHouse_TD[9], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[9], 97.000000, 1.209900);
	TextDrawAlignment(FamilyHouse_TD[9], 1);
	TextDrawColor(FamilyHouse_TD[9], COLOR_SERVER);
	TextDrawSetShadow(FamilyHouse_TD[9], 0);
	TextDrawSetOutline(FamilyHouse_TD[9], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[9], 255);
	TextDrawFont(FamilyHouse_TD[9], 4);
	TextDrawSetProportional(FamilyHouse_TD[9], 0);
	TextDrawSetShadow(FamilyHouse_TD[9], 0);

	FamilyHouse_TD[10] = TextDrawCreate(504.633087, 212.959304, "LD_SPAC:white");
	TextDrawLetterSize(FamilyHouse_TD[10], 0.000000, 0.000000);
	TextDrawTextSize(FamilyHouse_TD[10], 97.269996, 17.000000);
	TextDrawAlignment(FamilyHouse_TD[10], 1);
	TextDrawColor(FamilyHouse_TD[10], 673720575);
	TextDrawSetShadow(FamilyHouse_TD[10], 0);
	TextDrawSetOutline(FamilyHouse_TD[10], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[10], 255);
	TextDrawFont(FamilyHouse_TD[10], 4);
	TextDrawSetProportional(FamilyHouse_TD[10], 0);
	TextDrawSetShadow(FamilyHouse_TD[10], 0);

	FamilyHouse_TD[11] = TextDrawCreate(552.333312, 213.959304, "COST");
	TextDrawLetterSize(FamilyHouse_TD[11], 0.163000, 0.728799);
	TextDrawAlignment(FamilyHouse_TD[11], 2);
	TextDrawColor(FamilyHouse_TD[11], -1);
	TextDrawSetShadow(FamilyHouse_TD[11], 0);
	TextDrawSetOutline(FamilyHouse_TD[11], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[11], 6);
	TextDrawFont(FamilyHouse_TD[11], 1);
	TextDrawSetProportional(FamilyHouse_TD[11], 1);
	TextDrawSetShadow(FamilyHouse_TD[11], 0);

	FamilyHouse_TD[12] = TextDrawCreate(552.333312, 232.211151, "PRESS_'ALT'_TO_MENU");
	TextDrawLetterSize(FamilyHouse_TD[12], 0.122333, 0.567021);
	TextDrawAlignment(FamilyHouse_TD[12], 2);
	TextDrawColor(FamilyHouse_TD[12], -171);
	TextDrawSetShadow(FamilyHouse_TD[12], 0);
	TextDrawSetOutline(FamilyHouse_TD[12], 0);
	TextDrawBackgroundColor(FamilyHouse_TD[12], 6);
	TextDrawFont(FamilyHouse_TD[12], 1);
	TextDrawSetProportional(FamilyHouse_TD[12], 1);
	TextDrawSetShadow(FamilyHouse_TD[12], 0);
    return 1;
}

stock is_text_invalid (const text [ ] )
{
	if ( strfind ( text, "'", true ) != -1 ) return 1;
	if ( strfind ( text, "=", true ) != -1 ) return 1;
	if ( strfind ( text, "%", true ) != -1 ) return 1;
	if ( strfind ( text, "&", true ) != -1 ) return 1;
	if ( strfind ( text, "*", true ) != -1 ) return 1;
	if ( strfind ( text, "( ", true ) != -1 ) return 1;
	if ( strfind ( text, ")", true ) != -1 ) return 1;
	if ( strfind ( text, ",", true ) != -1 ) return 1;
	if ( strfind ( text, "`", true ) != -1 ) return 1;
	if ( strfind ( text, ";", true ) != -1 ) return 1;
	if ( strfind ( text, "|", true ) != -1 ) return 1;
	return 0 ;
}

stock Hide_SkinShop(playerid)
{ 
	new 
		id = pTemp[playerid][tBusinessID],
		interior_id = BusinessInfo[id][bInteriorID];

	PressedPickup[playerid] = BusinessInfo[id][bBuyPickup];

	SetPlayerPosAC(playerid, 
		BusinessInteriorInfo[interior_id][bIntMenuPos][0],
		BusinessInteriorInfo[interior_id][bIntMenuPos][1],
		BusinessInteriorInfo[interior_id][bIntMenuPos][2], BusinessInfo[id][bWorld], 
		BusinessInteriorInfo[interior_id][bIntInterior]
	);
	SetPlayerFacingAngle(playerid, 0.000);
    //if (PlayerInfo[playerid][pPlayerMember] != 0) SetPlayerSkinEx(playerid, PlayerInfo[playerid][pModel]);
	//else SetPlayerSkinEx(playerid, PlayerInfo[playerid][pChar]);
	SetPlayerSkinEx(playerid, pInfo[playerid][pChar][0]);
	PlayerTextDrawHide(playerid, sk_info_text[playerid]);
	for(new t; t != 33; t++) {
		TextDrawHideForPlayer(playerid, SkinShopMenu[t]);
	}
	pTemp[playerid][tSelectSkinShop] = -1;
	SetCameraBehindPlayer(playerid);
	TogglePlayerControllable(playerid, 1);
	CancelSelectTextDraw(playerid);
	return 1;
} 



stock IsPlayerInFractionInterior(playerid, memberid) {
	if (
		IsPlayerInRangeOfPoint(playerid, 100.0, gFraction[memberid][fPos][0], gFraction[memberid][fPos][1], gFraction[memberid][fPos][2]) &&
		GetPlayerInterior(playerid) == gFraction[memberid][fInt] && GetPlayerVirtualWorld(playerid) == gFraction[memberid][fWorld]
	) return true;
	return false;
}


stock IsFracIntBlocked(playerid, memberid) {
	if (
		!(0 <= memberid < FRACTION_COUNT) || /*pTemp[playerid][PlayerADostup] || */ 
		IsACop(playerid) || pInfo[playerid][pFracIntBlock][memberid - 1] - gettime() <= 0
	) return false;

	format(t_string, sizeof (t_string), "Вас недавно выгнали из помещения, войти можно будет через %s.", 
		Convert(pInfo[playerid][pFracIntBlock][memberid - 1] - gettime())
	);
	SendClientMessage(playerid, COLOR_GREY, t_string), t_string[0] = EOS;
	return true;
}
stock SaveFractionSalary(fraction_id) {
	new query_[256];
	mysql_format(dbHandle, query_, sizeof query_, "UPDATE `s_fraction` SET \
		`fSalary` = '%i,%i,%i,%i,%i,%i,%i,%i,%i,%i,%i,%i,%i,%i,%i' WHERE `fID` = '%d' LIMIT 1",
		fFractionSalary[fraction_id][0], fFractionSalary[fraction_id][1], fFractionSalary[fraction_id][2], 
		fFractionSalary[fraction_id][3], fFractionSalary[fraction_id][4], fFractionSalary[fraction_id][5], 
		fFractionSalary[fraction_id][6], fFractionSalary[fraction_id][7], fFractionSalary[fraction_id][8], 
		fFractionSalary[fraction_id][9], fFractionSalary[fraction_id][10], fFractionSalary[fraction_id][11], 
		fFractionSalary[fraction_id][12], fFractionSalary[fraction_id][13], fFractionSalary[fraction_id][14], 
		fraction_id
	);
	mysql_tquery(dbHandle, query_, "", "");
}
stock ShowSuspectList(playerid, member, type = 1) {
	new query_[128];
	format(query_, sizeof (query_), "SELECT id, suspectReason, wantedLevel FROM \
		`s_suspect` WHERE fracID = %d ORDER BY `wantedLevel`", member
	);
	new rows, idx, Cache:tempQuery = mysql_query(dbHandle, query_);

	query_[0] = EOS;
	cache_get_row_count(rows);
	format(t_string, sizeof (t_string), ""colserver"[№] Наказание\t"colserver"Розыск\n");

	for (new i = 0, reason[32 + 1], id, level; i < rows; i++) {
		cache_get_value_name_int(i, "id", id);
		cache_get_value_name(i, "suspectReason", reason, sizeof (reason));
		cache_get_value_name_int(i, "wantedLevel", level);

		//printf("ShowSuspectList: i %d id = %d", i, id);
		playerListItem[playerid][idx] = id;
		format(t_string, sizeof (t_string), "%s"colwhi"[%d] %s\t%d\n", t_string, idx++, reason, level);
	}
	if (type == 1) {
		playerListItem[playerid][idx] = 100000_1;
		format(t_string, sizeof (t_string), "%s"collime"[%d] Добавить пункт\t \n", t_string, idx++);
	} 
	else if (type == D_GIVE_SUSPECT) {
		if (!rows) return SendClientMessage(playerid, COLOR_GREY, !"Лидер еще не настроил /suspect!");
		ShowPlayerDialog(playerid, D_GIVE_SUSPECT, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Выберите: "colwhi"Наказание", t_string, "Выбрать", "Отмена");
		t_string[0] = EOS;
		if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
		return true;
	}
	ShowPlayerDialog(playerid, D_LIST_SUSPECT, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Изменение: "colwhi"Наказаний", t_string, "Выбрать", "Отмена");

	
	t_string[0] = EOS;
	if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
	return true;
}


stock GetDynamicAreaTypeID(areaid, &area_id, &type, &area_extra_id) {
	new areaType[3];
	Streamer_GetArrayData(STREAMER_TYPE_AREA, areaid, E_STREAMER_EXTRA_ID, areaType, sizeof (areaType));
	area_id = areaType[0];
	type = areaType[1];
	area_extra_id = areaType[2];
}
stock SetDynamicAreaType(areaid, type, extra_id = 0) {
	new areaType[3];
	areaType[0] = areaid;
	areaType[1] = type;
	areaType[2] = extra_id;
	Streamer_SetArrayData(STREAMER_TYPE_AREA, areaid, E_STREAMER_EXTRA_ID, areaType, sizeof (areaType));
}
/*stock GetDynamicPickupType(pickupid, &pickup_id, &type, &pickup_extra_id) {
	new pickupType[3];
	Streamer_GetArrayData(STREAMER_TYPE_PICKUP, pickupid, E_STREAMER_EXTRA_ID, pickupType, sizeof (pickupType));
	pickup_id = pickupType[0];
	type = pickupType[1];
	pickup_extra_id = pickupType[2];
}
stock SetDynamicPickupType(pickupid, type, extra_id = 0) {
	new pickupType[3];
	pickupType[0] = areaid;
	pickupType[1] = type;
	pickupType[2] = extra_id;
	Streamer_SetArrayData(STREAMER_TYPE_PICKUP, pickupid, E_STREAMER_EXTRA_ID, pickupType, sizeof (pickupType));
}*/
stock SetDynamic3DLabelType(label, type, extra_id = 0) {
	new labelType[3];
	labelType[0] = Text3D:label;
	labelType[1] = type;
	labelType[2] = extra_id;
	Streamer_SetArrayData(STREAMER_TYPE_3D_TEXT_LABEL, Text3D:label, E_STREAMER_EXTRA_ID, labelType, sizeof (labelType));
}
stock GetDynamic3DLabelType(label, &label_id, &type, &label_extra_id) {
	new labelType[3];
	Streamer_GetArrayData(STREAMER_TYPE_3D_TEXT_LABEL, Text3D:label, E_STREAMER_EXTRA_ID, labelType, sizeof (labelType));
	label_id = labelType[0];
	type = labelType[1];
	label_extra_id = labelType[2];
}


stock EditBoomboxURL(playerid, const url[]) {
	if (!pTemp[playerid][tBoomboxArea]) return false;
	format(pTemp[playerid][tBoomboxURL], 128, url);

	foreach(new i: PlayerInLogin) {
		if (!pInfo[i][pLogin]) continue;
		if (!IsPlayerInDynamicArea(i, pTemp[playerid][tBoomboxArea] - 1)) 
			continue;
		PlayAudioStreamForPlayer(playerid, pTemp[playerid][tBoomboxURL], 
			pTemp[playerid][tBoomboxPos][0], pTemp[playerid][tBoomboxPos][1], 
			pTemp[playerid][tBoomboxPos][2], pTemp[playerid][tBoomboxRange], 1
		);
	}
	return true;
}
stock DestroyBoombox(playerid) {
	if (!pTemp[playerid][tBoomboxArea]) return false;
	new areaid = pTemp[playerid][tBoomboxArea] - 1;
	pTemp[playerid][tBoomboxArea] = 0;

	StopAudioStreamForPlayer(playerid);
	foreach(new i: PlayerInLogin) {
		if (!pInfo[i][pLogin]) continue;
		if (!IsPlayerInDynamicArea(i, areaid)) 
			continue;
		StopAudioStreamForPlayer(i);
	}
	if (IsValidDynamic3DTextLabel(pTemp[playerid][tBoomboxText])) {
		DestroyDynamic3DTextLabel(pTemp[playerid][tBoomboxText]);
		pTemp[playerid][tBoomboxText] = Text3D:0;
	}
	DestroyDynamicArea(areaid);
	DestroyDynamicObject(pTemp[playerid][tBoomboxObject]);
	return true;
}


stock GiveFractionRepute(fraction, point, bool: save = true) {
	
	FractionInfo[fraction][fRepute] += point;
	if (FractionInfo[fraction][fRepute] < 0) FractionInfo[fraction][fRepute] = 0;
	if (save) {
		SaveFractionInfoID(FractionInfo[fraction][fID]);
	}
	
}
stock GiveFractionPoints(fraction, point, bool: save = true) {
	FractionInfo[fraction][fPoints] += point;
	if (FractionInfo[fraction][fPoints] < 0) FractionInfo[fraction][fPoints] = 0;
	UpdateFractionStore(FractionInfo[fraction][fID]);
	if (save) {
		SaveFractionInfoID(FractionInfo[fraction][fID]);
	}
}  
stock GiveFractionPointsAdmin(fraction, point, bool: save = true) {
	FractionInfo[fraction][fPoints] = point;
	if (FractionInfo[fraction][fPoints] < 0) FractionInfo[fraction][fPoints] = 0;
	UpdateFractionStore(FractionInfo[fraction][fID]);
	if (save) {
		SaveFractionInfoID(FractionInfo[fraction][fID]);
	}
}  


stock AttachDynamic3DTextLabelToVeh(Text3D:labelid, vehicleid, Float:offsetx, Float:offsety, Float:offsetz)
{
	//В первый аргумент передали тип элемента - STREAMER_TYPE_3D_TEXT_LABEL
	//Во второй аргумент передали сам ID элемента - labelid
	//В третий аргумент тип данных, который хотим установить - E_STREAMER_ATTACHED_VEHICLE
	//В четвёртый аргумент сам ID машины - vehicleid
	Streamer_SetIntData(STREAMER_TYPE_3D_TEXT_LABEL, labelid, E_STREAMER_ATTACHED_VEHICLE, vehicleid);
	//В третий аргумент тип данных, который хотим установить - E_STREAMER_ATTACH_OFFSET_X
	//В четвёртый аргумент саму координату смещения аттача по x - offsetx
	Streamer_SetFloatData(STREAMER_TYPE_3D_TEXT_LABEL, labelid, E_STREAMER_ATTACH_OFFSET_X, offsetx);
	//В третий аргумент тип данных, который хотим установить - E_STREAMER_ATTACH_OFFSET_Y
	//В четвёртый аргумент саму координату смещения аттача по y - offsety
	Streamer_SetFloatData(STREAMER_TYPE_3D_TEXT_LABEL, labelid, E_STREAMER_ATTACH_OFFSET_Y, offsety);
	//В третий аргумент тип данных, который хотим установить - E_STREAMER_ATTACH_OFFSET_Z
	//В четвёртый аргумент саму координату смещения аттача по z - offsetz
	//По итогу: аттачим динамический 3D-текст к машине на заданные координаты и возвращаем результат выполнения функции
	return Streamer_SetFloatData(STREAMER_TYPE_3D_TEXT_LABEL, labelid, E_STREAMER_ATTACH_OFFSET_Z, offsetz);
}

 
stock CheckPlayerPass(playerid)
{ 
	for(new i = 0; i < FRACTION_COUNT; i++)
	{ 
		if (pInfo[playerid][pFracIntKeys][i] == 322) { 
			pInfo[playerid][pFracIntKeys][i] = 0;
		}  
	}
	return 1;
}
 
publics: ItogWeekGangStats() { 
	new rows = cache_num_rows();
	new id,
		WinsMats[] = {100000, 50000, 25000},
		WinsMoney[] = {100000, 50000, 25000};
	if (rows) {
		for(new i, string[128]; i < rows; i ++) {
			cache_get_value_name_int(i, "fID", id);
			if (i == 0 || i == 1 || i == 2) {
				format(string,sizeof(string), "%s занимает "collime"%d место"colserver" в Gang-Top за текущую неделю", gFraction[id][fName], i + 1);
				SendGangMessage(COLOR_SERVER, string);

				FractionInfo[id][fMaterials] += WinsMats[i]; 
				FractionInfo[id][fMoney] += WinsMoney[i]; 
			}  
		}
	} 
	FractionInfo[FRACTION_BALLAS][fRepute] = 0;
	FractionInfo[FRACTION_VAGOS][fRepute] = 0;
	FractionInfo[FRACTION_GROVE][fRepute] = 0;
	FractionInfo[FRACTION_AZTEC][fRepute] = 0;
	FractionInfo[FRACTION_RIFA][fRepute] = 0; 
	UpdateFractionStore(FRACTION_BALLAS);
	UpdateFractionStore(FRACTION_VAGOS);
	UpdateFractionStore(FRACTION_RIFA);
	UpdateFractionStore(FRACTION_GROVE);
	UpdateFractionStore(FRACTION_AZTEC); 
}
  
stock CheckPlayerTaxiOff(playerid)
{
	if (GetPlayerTaxi{playerid} == 1)
	{
		for(new i; i < 3; i++)
		{
			if (pTemp[playerid][pTaxiCalled][i] != INVALID_PLAYER_ID)
			{
				new id_player = pTemp[playerid][pTaxiCalled][i];
				if (pTemp[id_player][pTaxiDriver]  == playerid || pTemp[playerid][pTaxiCalled][i] == playerid )
				{
					if (IsPlayerConnected(id_player))
					{
						SendClientMessage(id_player, 0xdc143cFF, !"[Диспетчер] Добрый день, таксист который к Вам направлялся попал в аварию!");
						SendClientMessage(id_player, 0xdc143cFF, !"[Диспетчер] Сделайте новый вызов!");
					}
					pTemp[id_player][pTaxiDriver] = INVALID_PLAYER_ID;
					pTemp[playerid][pTaxiCalled][i] = INVALID_PLAYER_ID;
					break;
				}
			}
		}
	}
	return 1;
}

stock CheckPlayerCalledTaxi(playerid)
{
	if (pTemp[playerid][pTaxiDriver] != INVALID_PLAYER_ID)
	{
		new id_player = pTemp[playerid][pTaxiDriver];
		for(new i; i < 3; i++)
		{
			if (pTemp[id_player][pTaxiCalled][i] == playerid)
			{
				CheckTaxiPlayer(playerid,id_player);
				break;
			}
		}
	}
	return 1;
}


stock CheckTaxiPlayer(playerid,id)
{
	if (IsPlayerConnected( id ))
	{
		for(new i; i < 3; i++)
		{
			if (pTemp[id][pTaxiCalled][i] == playerid)
			{
				pTemp[id][pTaxiCalled][i] = INVALID_PLAYER_ID;
				if (CP[id] == 777) {
					CP[id] = 0;
					DisablePlayerCheckpoint(playerid);
				}
				break;
			}
		}
		new str_tmp[64];
		format(str_tmp, sizeof str_tmp, "[Диспечер] %s отказался от вызова такси",pInfo[playerid][pName]);
		SendClientMessage(id, CGRAY2, str_tmp);
		SendClientMessage(id, CGRAY2, !"[Диспечер] Если у Вас уже есть активный вызов, то введите \"/to [id клиента]\"");
	}
	return 1;
}


stock GetPlayerUseCar(const playerid,const  vehicleid, bool: helper = false)
{
	///if (VehicleInfo[ vehicleid- 1 ][vLocked] == true) return 0;
	/*enum 
	{
		VEHICLE_STATE_ERROR,// Авто для просмотра передпокупкой
		VEHICLE_STATE_TRAILER, // трейлер
		VEHICLE_STATE_TRAIN, // поезд
		VEHICLE_STATE_LOW_BIKE, // велики
		VEHICLE_STATE_BOAT, // яхты
		VEHICLE_STATE_PLANE, // самалеты / вертолёты
		VEHICLE_STATE_BIKE, // мотоциклы мопед
		VEHICLE_STATE_CAR // авто
	}
	GetVehicleState(vehicleid)
	
	*/

	if ( (GetVehicleState(vehicleid) == VEHICLE_STATE_BOAT && pInfo[playerid][pLicense][2] == 0 || GetVehicleState(vehicleid) == VEHICLE_STATE_PLANE && pInfo[playerid][pLicense][1] == 0 
		|| GetVehicleState(vehicleid) >= VEHICLE_STATE_BIKE && pInfo[playerid][pLicense][0] == 0) && pTemp[playerid][TakingLesson] == false )
	{
		SendClientMessage(playerid, COLOR_WHITE, !"У Вас нет лицензии на управлением этим транспортом! (( /gps - Автошкола ))");
		return 0;
	}

	if (VehicleInfo[ vehicleid - 1 ][vType] == VEHICLE_TYPE_FRACTION)
	{	
		if (pInfo[playerid][pAdmin] == 0) {
			if (VehicleInfo[ vehicleid - 1 ][vSubFraction] == 0)
			{
				if (VehicleInfo[ vehicleid - 1 ][vFraction] != pInfo[playerid][pMember])
				{
					if (
						(VehicleInfo[ vehicleid - 1 ][vFraction] == FRACTION_ARMY_SF  || 
						VehicleInfo[ vehicleid - 1 ][vFraction] == FRACTION_ARMY_LV) && pTemp[playerid][PlayerInArmyForm] == true
						){
						return 1;
					}
					else if 
						(VehicleInfo[ vehicleid - 1 ][vFraction] == FRACTION_AUTOSCHOOL && pInfo[playerid][pLicense][0] == 0 && pTemp[playerid][TakingLesson]) 
						{
						return 1;
					}
						SendClientMessage(playerid, COLOR_GREY, !"Этот транспорт недоступен для Вас");
					return 0;
				}
			}
			else if (VehicleInfo[ vehicleid - 1 ][vSubFraction] == 0)
			{
				if (pInfo[playerid][pMember] == FRACTION_ARMY_SF ||
				pInfo[playerid][pMember] == FRACTION_ARMY_LV  ||
				pTemp[playerid][PlayerInArmyForm] == true)
				{
					return 1;
				}
				SendClientMessage(playerid, COLOR_GREY, !"Этот транспорт недоступен для Вас");
				return 0;
			}
		}	
	}
	else if (VehicleInfo[ vehicleid - 1 ][vType] == VEHICLE_TYPE_JOB)
	{
		if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_BUS && pInfo[playerid][pJob] != PLAYER_JOB_BUS) {
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {B4B5B7}\"Водитель автобуса\"");
			return 0;
		}
		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_TAXI && pInfo[playerid][pJob] != PLAYER_JOB_TAXI) {
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {CECECE}\"Таксист\"");
			return 0;
		}
		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_DELIVERY && pInfo[playerid][pJob] != PLAYER_JOB_DELIVERY) {
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {B4B5B7}\"Развозчик продуктов\"");
			return 0;
		}
		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_HOTDOG_SALLER && pInfo[playerid][pJob] != PLAYER_JOB_HOTDOG_SALLER) {
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {B4B5B7}\"Продавец Хот-Догов\"");
			return 0;
		}
		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_MECHANIC && pInfo[playerid][pJob] != PLAYER_JOB_MECHANIC) {
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {B4B5B7}\"Механик\"");
			return 0;
		}
		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_TRUCKER && pInfo[playerid][pJob] != PLAYER_JOB_TRUCKER)
		{
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {B4B5B7}\"Дальнобойщик\"");
			return 0;
		}
		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_COLLECTOR && pInfo[playerid][pJob] != PLAYER_JOB_COLLECTOR)
		{
			if (pInfo[playerid][pJob] == PLAYER_JOB_COLLECTOR && pTemp[playerid][pRentCar] != vehicleid)
			{
				SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен сотрудникам работы {B4B5B7}\"Инкассатор\"");
				return 0;
			}
			else 
			{
				if (pTemp[playerid][pRentCar] == vehicleid) {
					if (VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobAmount] == 0 && helper) {
						SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Используйте команду \"/atmlist\" для поиска банкомата с наличкой");
					}
					if (VehicleInfo[ pTemp[playerid][pRentCar] - 1 ][vJobLoad]) {
						ShowPlayerDialog(playerid, D_ATM_FUNC_5, DIALOG_STYLE_MSGBOX, ""colserver"Работа: "colwhi"Инкассатора", ""colwhi"Вы действительно желаете завершить загрузку?", "Да", "Нет");
					}
				}
				
			} 
		}

		else if (VehicleInfo[ vehicleid - 1 ][vFraction] == PLAYER_JOB_HUNTER && !pTemp[playerid][tJobHunter]) {
			SendClientMessage(playerid, COLOR_WHITE, !"Данный автомобиль доступен работникам {B4B5B7}\"Мясника Сэма\"");
			return 0;
		}		
		
	}
	else if (
		VehicleInfo[ vehicleid - 1 ][vType] == VEHICLE_TYPE_JOB_FARM && 
		(VehicleInfo[ vehicleid - 1 ][vFraction] != pTemp[playerid][TempFermID] || pTemp[playerid][JobInFarmRank] < 2))
	{ 
		new 
			str_[100]; 
		format(str_, sizeof str_, "Данный автомобиль доступен сотрудникам {B4B5B7}\"Фермы %d\"", VehicleInfo[ vehicleid - 1 ][vFraction] - 1);
		SendClientMessage(playerid, COLOR_WHITE, str_);
		return 0;
	}
	else if (VehicleInfo[ vehicleid - 1][vType] == VEHICLE_TYPE_DYNAMIC && VehicleInfo[ vehicleid - 1][vFraction] == DYNAMIC_VEH_ROB_HOUSE) {
		if (VehicleInfo[ vehicleid - 1][vSubFraction] != playerid) {
			new 
				str_[100]; 
			format(str_, sizeof str_, "Данный автомобиль доступен {B4B5B7}\"%s\"", pInfo[ VehicleInfo[ vehicleid - 1][vSubFraction] ][pName]);
			SendClientMessage(playerid, COLOR_WHITE, str_);
			return 0;
		}
		else {
			if (VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobAmount] == 0 && helper) {
				SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Отправляйтесь к любому купленному дому и вынесите из него всё!");
			}
			if (VehicleInfo[ pTemp[playerid][tRobVeh] - 1 ][vJobLoad]) {
				ShowPlayerDialog(playerid, D_ROB_HOUSE_1, DIALOG_STYLE_MSGBOX, ""colserver"Ограбление: "colwhi"Завершение", ""colwhi"Вы действительно желаете завершить ограбление?", "Да", "Нет");
			}
			
		}

	}
	else if (VehicleInfo[ vehicleid - 1][vType] == VEHICLE_TYPE_FAMILY)
	{
		if (VehicleInfo[ vehicleid - 1 ][vFraction] != pInfo[playerid][pFamily])
		{
			new 
				string_[100];
			format(string_, sizeof string_, "Данный автомобиль доступен семье {%s}\"%s\"",
				family_chat_color[ FamilyInfo[ VehicleInfo[ vehicleid - 1 ][vFraction] - 1 ][fChatColor] ],
				FamilyInfo[ VehicleInfo[ vehicleid - 1 ][vFraction] - 1 ][fName]
			);
			SendClientMessage(playerid, COLOR_WHITE, string_);
			return 0;
		}
		else if (pInfo[playerid][pFamilyRank] < VehicleInfo[ vehicleid - 1 ][vRank] && VehicleInfo[ vehicleid - 1 ][vRank] > 0)
		{
			new 
				string_[100];
			format(string_, sizeof string_, "Данный автомобиль доступен с ранга {%s}\"%s\"",
				family_chat_color[ FamilyInfo[ VehicleInfo[ vehicleid - 1 ][vFraction] - 1 ][fChatColor] ],
				fFamilyRank[ VehicleInfo[ vehicleid - 1 ][vFraction] - 1 ][ VehicleInfo[ vehicleid - 1 ][vRank] - 1 ]
			);
			SendClientMessage(playerid, COLOR_WHITE, string_);
			return 0;
		}
	}
	//if (VehicleInfo[ V_IDX - 1][vType] == VEHICLE_TYPE_DYNAMIC && VehicleInfo[ V_IDX - 1][vFraction] == DYNAMIC_VEH_MATS)
	else 
	{
		 //
	}
	return 1;
}

stock OnPlayerWarning(const playerid,const result[],type = 0)
{ 
	if (pTemp[playerid][AntiFloodWarning] < gettime())
	{
		new string_[144];
		format(string_, sizeof string_, "<Warning> %s[%d]: %s", pInfo[playerid][pName], playerid, result);
		ABroadCast(COLOR_REDD, string_, 2);
		if (type == 1) AddCheater(playerid);
		pTemp[playerid][AntiFloodWarning] = gettime()+3;
	}
	return 1;
}


stock HaveWeapon(playerid, weaponid) {
	new weapon,
        ammo;
    GetPlayerWeaponData(playerid, GetWeaponSlot[weaponid], weapon, ammo);
		if ((weapon== weaponid) && ammo) return 1;
        
	return 0;
} 


stock ClearKillFeed(playerid = INVALID_PLAYER_ID)
{// by Londlem & Daniel_Cortez \\ pro-pawn.ru
    if ((playerid != INVALID_PLAYER_ID) && (0 == IsPlayerConnected(playerid)))
        return 0;
    goto L_start;
    // avoid possible stack overflow (due to using push.* opcodes)
    {
        new dummy[16/(cellbits/charbits)];
        #emit const.pri dummy
    }
#if __Pawn < 0x030A
    // optional sysreq.c bugfix
    SendDeathMessage(0, 0, 0),
    SendDeathMessageToPlayer(0, 0, 0, 0);
#endif
L_start:
    const CKF_MAGIC_ID = INVALID_PLAYER_ID - 1;
    // this variable is also used as weaponid parameter
    new i = 5;
    // push killer and killee IDs
    #emit    push.c    CKF_MAGIC_ID
    #emit    push.c    CKF_MAGIC_ID
    if (playerid == INVALID_PLAYER_ID)
    {
        #emit    push.c    12
        do{
            #emit    sysreq.c    SendDeathMessage
        }while(--i != 0);
        #emit    stack    12
    }
    else
    {
        #emit    push.s    playerid
        #emit    push.c    16
        do{
            #emit    sysreq.c    SendDeathMessageToPlayer
        }while(--i != 0);
        #emit    stack    16
    }
    return 1;
} 

stock GiveFreeRoulette(playerid)
{
	new
		string_[100];
	pInfo[playerid][pSpins]++;
	format(string_, sizeof string_, "Вы получили бесплатную прокрутку. У Вас %d прокрут(ов)", pInfo[playerid][pSpins]);
	SendClientMessage(playerid, COLOR_GREEN, string_);
}
/*
publics: CheckFreeRoulette(playerid) {
	new rows;
	cache_get_row_count(rows);
    if(!rows) {
		return 1;
	} 
	new w_rSpins;
	cache_get_value_int(0, "w_rSpins", w_rSpins);
	if(w_rSpins > 0 ) {
		new 
			string_[100];
		format(string_, sizeof string_, "Вы получили бесплатную прокрутку. У Вас %d прокруток", w_rSpins);
		SendClientMessage(playerid, COLOR_GREEN, string_);
	}  
	return 1;
}
*/
stock IsGosVehicle(const vehicleid)
{
	if (!(1 <= vehicleid < MAX_VEHICLES)) return 0;
	if (VehicleInfo[ vehicleid ][vType] == VEHICLE_TYPE_FRACTION)
	{
		switch(VehicleInfo[ vehicleid  ][vFraction])
		{
			case 1,2,10,21: return 1;
		}
	}
	return 0;
} 
publics: LoadTopServer() {
	new 
		top_name[MAX_PLAYER_NAME],
		rows,
		top_level,
		top_charity; 
	cache_get_row_count(rows);
	if (rows) {
		t_string[0] = EOS;
		strcat(t_string, ""colwhi"Благотворительность:\n(( Статистика за месяц ))\n\n"); 
		for(new i, str_[128]; i < rows; i ++) {
			cache_get_value_name(i, "Name", top_name, MAX_PLAYER_NAME);
			cache_get_value_name_int(i, "pLevel", top_level);
			cache_get_value_name_int(i, "pCharity", top_charity); 
			format(str_, sizeof str_,""C_PODS"%d. "colwhi"%s ["collime"$%s"colwhi"], В штате: "colmaline"%d %s\n", i+1, top_name, convert_money(top_charity), top_level, Declension_ReturnWord(top_level, "год", "года", "лет")),
			strcat(t_string, str_);
			UpdateDynamic3DTextLabelText(TopCharity, -1, t_string);
		}
	} 
	else {
		strcat(t_string, ""colwhi"Благотворительность:\n(( Статистика за месяц ))\n\nИнформации еще нет\n");
		UpdateDynamic3DTextLabelText(TopCharity, -1, t_string);
	} 
	return 1;
}

publics: LoadTopMadHouse()
{
	new 
		top_name[MAX_PLAYER_NAME],
		rows, 
		all_time; 
	cache_get_row_count(rows);
	t_string[0] = EOS;
	if (rows) { 
		strcat(t_string, ""colwhi"Больше всех посетили нашу лечебницу:\n(( Статистика за месяц ))\n\n");
		for(new i, str_[128]; i < rows; i ++) {
			cache_get_value_name(i, "Name", top_name, MAX_PLAYER_NAME);
			cache_get_value_name_int(i, "MadTime", all_time);
 
			format(str_, sizeof str_,""C_PODS"%d. "colwhi"%s Провел за месяц: "collime"%s"colwhi"\n", 
				i+1, top_name, ConvertsCmdTime(all_time)),
			strcat(t_string, str_);
			UpdateDynamic3DTextLabelText(TopMadHouse, -1, t_string);
		}
	}
	else {
		strcat(t_string, ""colwhi"Больше всех посетили нашу лечебницу:\n(( Статистика за месяц ))\n\nИнформации еще нет\n");
		UpdateDynamic3DTextLabelText(TopMadHouse, -1, t_string);
	} 
	return 1;
}
stock UpdateInfoTD(playerid) {
	new string[128];
    if (pTemp[playerid][tDMArea][0]) format(string,sizeof(string),"~r~Kills:~w~ %d~n~~r~Deaths:~w~ %d",pTemp[playerid][tDMArea][1], pTemp[playerid][tDMArea][2]); 
	if (!strlen(string)) PlayerTextDrawHide(playerid, DmArenaTextDraw[playerid]);
	else {
	    switch(string[0]) {
			case '~': strdel(string,0,3);
		}
	    PlayerTextDrawSetString(playerid,DmArenaTextDraw[playerid], string);
		PlayerTextDrawShow(playerid,DmArenaTextDraw[playerid]);
	}
	return 1;
}

stock MessagePlayerOffline(const MySQLID, const message[])
{
	static const str_mess_[] = "INSERT INTO `s_user_message` (`pID`,`message`) VALUES ('%d','%s')";

	new str_tmp_query[sizeof(str_mess_) + 152 ];

	format(str_tmp_query, sizeof str_tmp_query , str_mess_, MySQLID, message);
	mysql_tquery(dbHandle, str_tmp_query, "", "");
	return 1;
}

stock LoadMessagePlayerOffline(const playerid)
{
	static const str_mess_get[] = "SELECT `id`,`pID`,`message` FROM `s_user_message` WHERE `pID` = '%d'";

	new str_tmp_query[sizeof(str_mess_get) + 11 ];

	format(str_tmp_query, sizeof(str_tmp_query), str_mess_get,pInfo[playerid][pID]);
	mysql_tquery(dbHandle, str_tmp_query, "LoadPlayerMessage", "i", playerid);
	return 1;
}

publics:LoadPlayerMessage(const playerid)
{
	new rows;
	cache_get_row_count(rows);
    if (rows)
	{
		new id,message[144];
		static const delete_message[] = "DELETE FROM `s_user_message` WHERE `id` = '%d' LIMIT 1";
		//new str_tmp[sizeof(delete_message) + 11];
		for(new i; i < rows; i++)
    	{
			cache_get_value_name_int(i,"id", id);
        	cache_get_value_name(i,"message", message, 144);

			SendClientMessage(playerid, COLOR_LI_RED, message);

			format(message,70,delete_message,id); 
			mysql_tquery(dbHandle, message, "", "");
		}
	}
	return 1;
}

publics:UpdateStatusGate(const gate_id, const type)
{
	if (gate_id == 0) // gate_lva[0]
	{
		static lva_go,lva_type;

		if (type == 2)
		{
			lva_type = 0;
			if (lva_go == 1) goto close_gate_lva;
			return 1;
		}
		if (lva_go == 0)
		{
			lva_go = 1; // открывается 
			MoveDynamicObject(gate_lva[0], 343.24249, 1796.24011, 17.025+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[1], 344.45901, 1797.08557, 17.025+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[2], 345.86121, 1798.04834, 17.025+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[3], 347.20370, 1798.97168, 17.025+0.04, 0.24, 0.000, 0.000, 0.0);
			if (type == 1 && lva_type == 0)
			{
				lva_type = 1;
				SetTimerEx("UpdatewStatusGate", 10_000, false, "ii",0,2);
			}
		}
		else
		{
			close_gate_lva:
			if(type == 3) return 1;
			lva_go = 0; // закрывается 968, 343.184, 1796.366, 17.924, 0.000000, 88.399, 35.200

			MoveDynamicObject(gate_lva[0], 343.24249, 1796.24011, 18.05-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[1], 344.45901, 1797.08557, 18.05-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[2], 345.86121, 1798.04834, 18.05-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[3], 347.20370, 1798.97168, 18.05-0.04, 0.24, 0.000, 0.000, 0.0);

		}
	}
	else if (gate_id == 1)
	{
		static lva_go1,lva_type1;

		if (type == 2)
		{
			lva_type1 = 0;
			if (lva_go1 == 1) goto close_gate_lva1;
			return 1;
		}
		if (lva_go1 == 0)
		{
			lva_go1 = 1; // открывается
			MoveDynamicObject(gate_lva[4], 139.38071, 1941.12976, 17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[5], 137.88071, 1941.12976, 17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[6], 136.38071, 1941.12976, 17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[7], 134.88071, 1941.12976, 17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[8], 133.38071, 1941.12976, 17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[9], 131.88071, 1941.12976, 17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[10], 130.38071, 1941.12976,17.6+0.04, 0.24, 0.000, 0.000, 0.0);
			if (type == 1 && lva_type1 == 0)
			{
				lva_type1 = 1;
				SetTimerEx("UpdateStatusGate", 10_000, false, "ii",1,2);
			}
		}
		else
		{
			close_gate_lva1:
			if(type == 3) return 1;
			lva_go1 = 0; // закрывается 286.070, 1827.317, 19.410, 0.000, 0.000, 89.699
			MoveDynamicObject(gate_lva[4], 139.38071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[5], 137.88071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[6], 136.38071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[7], 134.88071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[8], 133.38071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[9], 131.88071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
			MoveDynamicObject(gate_lva[10], 130.38071, 1941.12976, 18.813-0.04, 0.24, 0.000, 0.000, 0.0);
		}
	}
	/*else if (gate_id == 2)
	{
		static lva_go2,lva_type2;

		if (type == 2)
		{
			lva_type2 = 0;
			if (lva_go2 == 1) goto close_gate_lva2;
			return 1;
		}
		if (lva_go2 == 0)
		{
			lva_go2 = 1; // открывается
			MoveDynamicObject(gate_lva[2], 121.963,1941.384,20.953+0.04, 2.2, 0.000, 0.000, 0.0);
			if (type == 1 && lva_type2 == 0)
			{
				lva_type2 = 1;
				SetTimerEx("UpdateStatusGate", 10_000, false, "ii",2,2);
			}
		}
		else
		{
			close_gate_lva2:
			lva_go2 = 0; // закрывается 286.070, 1827.317, 19.410, 0.000, 0.000, 89.699
			MoveDynamicObject(gate_lva[2],134.483,1941.384,20.953-0.04,2.2,0.000, 0.000, 0.0);
		}
	}
	else if (gate_id == 3)
	{
		static lva_go3,lva_type3;
		if (type == 2)
		{
			lva_type3 = 0;
			if (lva_go3 == 1) goto close_gate_lva3;
			return 1;
		}
		if (lva_go3 == 0)
		{
			lva_go3 = 1; // открывается
			MoveDynamicObject(gate_lva[3], 2552.7066, -1417.3065, 1499.8870+0.04, 3.5);
			if (type == 1 && lva_type3 == 0)
			{
				lva_type3 = 1;
				SetTimerEx("UpdateStatusGate", 10_000, false, "ii",3,2);
			}
		}
		else
		{
			close_gate_lva3:
			lva_go3 = 0; // закрывается 286.070, 1827.317, 19.410, 0.000, 0.000, 89.699
			MoveDynamicObject(gate_lva[3], 2551.226562, -1417.306518, 1499.886962-0.04, 3.5);
		}
	}*/
	if (gate_id == 4)
	{
		static lspd_go,lspd_type;
		if (type == 2)
		{
			lspd_type = 0;
			if (lspd_go == 1) goto close_gate_lspd;
			return 1;
		}
		if (lspd_go == 0)
		{
			lspd_go = 1; // открывается
			MoveDynamicObject(gate_lspd, 1544.703, -1630.804,13.021+0.04,0.04, -0.399, -3.299, -89.899);
			if (type == 1 && lspd_type == 0)
			{
				lspd_type = 1;
				SetTimerEx("UpdateStatusGate", 10_000, false, "ii",gate_id,2);
			} 
		}
		else
		{
			close_gate_lspd:
			lspd_go = 0; 
            MoveDynamicObject(gate_lspd, 1544.703, -1630.804, 13.021-0.04,0.04, -0.399, -88.899, -89.899);
		}
	}
	/*else if (gate_id == 5)
	{
		static sfa_go,sfa_type;
		if (type == 2)
		{
			sfa_type = 0;
			if (sfa_go == 1) goto close_gate_sfa;
			return 1;
		}
		if (sfa_go == 0)
		{
			sfa_go = 1; // открывается -1526.374 481.389 6.863 0.000 -1.299 0.000
			MoveDynamicObject(gate_sfa, -1526.374, 481.389, 6.863+0.04,0.04, 0.000, -1.299, 0.000);
			if (type == 1 && sfa_type == 0)
			{
				sfa_type = 1;
				SetTimerEx("UpdateStatusGate", 10_000, false, "ii",gate_id,2);
			}
		}
		else
		{
			close_gate_sfa:
			sfa_go = 0;  // -1526.374 481.389 6.863 0.000 -89.599 0.000
            MoveDynamicObject(gate_sfa, -1526.374, 481.389, 6.863-0.04,0.04, 0.000, -89.599, 0.000);
		}
	}*/
	else if (gate_id == 6)
	{
		static fbi_go,fbi_type;
		if (type == 2)
		{
			fbi_type = 0;
			if (fbi_go == 1) goto close_gate_fbi;
			return 1;
		}
		if (fbi_go == 0)
		{
			fbi_go = 1; // открывается  968 -2436.865 495.447 29.647 0.000 -0.300 24.999
			MoveDynamicObject(gate_fbi, -2436.865, 495.447,29.647+0.04,0.04, 0.000, -0.300, 24.999);
			if (type == 1 && fbi_type == 0)
			{
				fbi_type = 1;
				SetTimerEx("UpdateStatusGate", 10_000, false, "ii",gate_id,2);
			}
		}
		else
		{
			close_gate_fbi:
			fbi_go = 0;  // 968 -2436.865 495.447 29.647 0.000 89.099 24.999
            MoveDynamicObject(gate_fbi, -2436.865, 495.447, 29.647-0.04,0.04, 0.000, 89.099, 24.999);
		}
	}
	return 1;
}


stock SaveAdminStr(playerid, const query_string[])
{
	new 
		query_[256];
	format(query_, sizeof query_,
		"UPDATE `s_admin` SET %s WHERE `id` = '%i'", query_string, aAdminInfo[playerid][aID]
	); 
	mysql_tquery(dbHandle, query_, "", "");
	return 1;
} 

stock hide_welcome_interface(playerid)
{
	new
		query_[156], time = GetTickCount();
	mysql_format(dbHandle, query_, sizeof query_, "SELECT pID, Name, pVK_ID, pConfirmVK, pvIp, pTG_ID, pConfirmTG, Settings FROM `s_users` WHERE `Name` = '%e' LIMIT 1", pInfo[playerid][pName]);
	mysql_tquery(dbHandle, query_, "OnPlayerRequestSearch", "ii", playerid, time);
	for(new ix; ix < 5; ix++)
	{
		TextDrawHideForPlayer(playerid, Text:TD_welcome[ix]);
		pTemp[playerid][tWelcomeTimer] = -1;
	}
	return 1;
}
new adminPostNames[][] =
{
	"никто", "модератор 1 уровня", "модератор 2 уровня", "модератор 3 уровня",
	"модератор 4 уровня", "модератор 5 уровня", "модератор 6 уровня",
	"модератор 7 уровня", "модератор 8 уровня", "модератор 9 уровня", "модератор 10 уровня"
};

publics: SetLoadAdminInfo(playerid, type)
{
	new rows;
	cache_get_row_count(rows);
	if (!rows)
	{
		/*ADMIN ACC NOT FOUND */
		return 1;
	}
	cache_get_value_int(0, "id", aAdminInfo[playerid][aID]); 
	cache_get_value_int(0, "level", pInfo[playerid][pAdmin]); 
	cache_get_value_int(0, "s_Reports", aAdminInfo[playerid][aReport]); //++
	cache_get_value_int(0, "s_Reputes", aAdminInfo[playerid][aRepute]); //++
	cache_get_value_int(0, "s_Jails", aAdminInfo[playerid][aJail]); //++
	cache_get_value_int(0, "s_Mutes", aAdminInfo[playerid][aMute]); //++
	cache_get_value_int(0, "s_Prisons", aAdminInfo[playerid][aPrison]); //++
	cache_get_value_int(0, "s_Warns", aAdminInfo[playerid][aWarn]); //++
	cache_get_value_int(0, "s_Bans", aAdminInfo[playerid][aBan]); //++
	cache_get_value_name(0, "IP", aAdminInfo[playerid][aRegIP]);
	cache_get_value_name(0, "Prefix", aAdminInfo[playerid][aPrefix]);
	cache_get_value_name(0, "Color", aAdminInfo[playerid][aColor]);	
				//SetPVarString(playerid, "adminsIP", admins_ip);
  
	pTemp[playerid][PlayerADostup] = true;
	pTemp[playerid][PlayerUseAdminGM] = true;
	if (type == 1)
	{ 	 
		SendClientMessage(playerid, COLOR_GREEN, !"Вы получили доступ модератора");
		SendClientMessage(playerid, COLOR_GREEN, !"Автоматически включился GM (от пуль). Выключить >> (/agm)");   
	}
	else {
		new 
			player_ip[16],
			query_[128];
		GetPlayerIp(playerid, player_ip, sizeof player_ip);

		mysql_format(dbHandle, query_, sizeof query_, "UPDATE `s_admin` SET LastCon = '%d', LastIP = '%s' WHERE id = '%d' LIMIT 1", 
			gettime(), player_ip, aAdminInfo[playerid][aID]
		);
		mysql_tquery(dbHandle, query_, "", ""); 
	}
	new 
		string_[128];
	Iter_Add(AdminsTeam, playerid); 

		if(!strcmp(aAdminInfo[playerid][aPrefix], "None", true)){
			format(string_, sizeof(string_), "Вы успешно авторизовались как %s", adminPostNames[pInfo[playerid][pAdmin]]);
			SendClientMessage(playerid, 0xFFFFFFFF, string_);

			f(string_, "[A] %s %s в административной панели как %s", pInfo[playerid][pName], 

			pInfo[playerid][pSex] == 1 ? ("авторизовался") : ("авторизовалась"), adminPostNames[pInfo[playerid][pAdmin]]
			);
			SendAdminMessage(0xF4B800AA, string_); 			
		}
		else{
			format(string_, sizeof(string_), "Вы успешно авторизовались как {%s}%s", aAdminInfo[playerid][aColor], aAdminInfo[playerid][aPrefix]);

			SendClientMessage(playerid, 0xFFFFFFFF, string_);

			f(string_, "[A] %s %s в административной панели как {%s}%s", pInfo[playerid][pName], 

			pInfo[playerid][pSex] == 1 ? ("авторизовался") : ("авторизовалась"), aAdminInfo[playerid][aColor], aAdminInfo[playerid][aPrefix]
			);
			SendAdminMessage(0xF4B800AA, string_); 
		}


		for(new i; i < sizeof(CheatShow); i++) {
			TextDrawShowForPlayer(playerid, CheatShow[i]);
		} 
	return 1;
}

stock IsPlayerGetSettings(playerid, type) {
	return (pInfo[playerid][PlayerSettings] & type) ? true : false;
} 

stock StartDeliveryMats()
{
	new zone_delivery[28],
		zone_start,
		vehicleid;

	const max_spawn_position = 5;
	static Float:spawn_deliver_car[max_spawn_position][4] = {
		{1190.8505,238.9082,19.7070,334.3705},
		{2644.6152,729.9600,10.8844,90.00},
		{2866.4045,940.6224,10.8191,180.00},
		{2399.7021,2800.6113,10.8250,360.00},
		{1681.4958,2358.6951,10.8850,268.54}
	};

	static str_deliv[] = "Неподалёку от района \"%s\" был замечен фургон с материалами, заберите его и привезите на базу! (помечено на карте)";
	new tmp_str[sizeof(str_deliv) + sizeof(zone_delivery) - 2];

	zone_start = random(max_spawn_position);

	GetPos2DZone(spawn_deliver_car[zone_start][0],spawn_deliver_car[zone_start][1],zone_delivery,sizeof(zone_delivery));


	vehicleid = _CreateVehicle(609, spawn_deliver_car[zone_start][0],spawn_deliver_car[zone_start][1],spawn_deliver_car[zone_start][2],spawn_deliver_car[zone_start][3], 151, 122, -1);
	_SetVehicleHealth(vehicleid, 3000.0);
	VehicleInfo[ vehicleid - 1 ][vType] = VEHICLE_TYPE_DYNAMIC;
	VehicleInfo[ vehicleid - 1][vFraction] = DYNAMIC_VEH_MATS;
	VehicleInfo[ vehicleid - 1 ][vMaterials] = 200000;
	VehicleInfo[ vehicleid - 1 ][vFuel] = GetModelMaxFuel(VehicleInfo[ vehicleid - 1 ][vModel]);
	VehicleInfo[ vehicleid - 1 ][vLocked] = false;
	GetVehicleParamsEx(vehicleid, engine1, lights2, alarm2, doors3, bonnet2, boot1, objective1);
	SetVehicleParamsEx(vehicleid, engine1, lights2, alarm2, false, bonnet2, boot1, objective1);

	format(tmp_str,sizeof(tmp_str),str_deliv,zone_delivery);

	SendGangMessage(0xE8EE7BFF, tmp_str);
	SendMafiaMessage(0xE8EE7BFF, tmp_str);

	foreach(new playerid: PlayerInLogin)
	{
		if (IsAGang(playerid) || IsAMafia(playerid))
		{
			SetPlayerMapIcon(playerid, 99,
				spawn_deliver_car[zone_start][0],
				spawn_deliver_car[zone_start][1],
				spawn_deliver_car[zone_start][2],
				51, 0xFCFCFCFF, MAPICON_GLOBAL_CHECKPOINT);
		}
	}
	SetTimer("ResetMapIconDelivery", 120_000, false);
	return 1;
}

publics:ResetMapIconDelivery()
{
	foreach(new playerid: PlayerInLogin)
	{
		RemovePlayerMapIcon(playerid, 99);
	}
	return 1;
}   

stock ShowPlayerInteractionMenu(playerid, target_id) {
	if (target_id == INVALID_PLAYER_ID) {
		SendClientMessage(playerid, COLOR_GREY, !"Игрок не найден!");
	}
	pTemp[playerid][tPlayerTargetID] = target_id;
	new 
		str_[64];
	format(str_, sizeof str_, ""colserver"Взаимодействия с "colwhi"%s[%d]", pInfo[target_id][pName], target_id);
	switch(pInfo[playerid][pMember]) {
		case FRACTION_LSPD, FRACTION_SFPD, FRACTION_LVPD: {
			ShowPlayerDialog(playerid, D_PLAYER_TATGET_0, DIALOG_STYLE_LIST, str_, 
				"[0] Зачитать права\n[1] Показать удостоверение\n[2] Оглушить электрошокером\n[3] Надеть наручники\n[4] Обыскать\n[5] Вести за собой", "Выбрать", "Закрыть"
			);
		}
		case FRACTION_FBI: {
			ShowPlayerDialog(playerid, D_PLAYER_TATGET_1, DIALOG_STYLE_LIST, str_, 
				"[0] Зачитать права\n[1] Показать удостоверение\n[2] Оглушить электрошокером\n[3] Надеть наручники\n[4] Обыскать\n[5] Вести за собой", "Выбрать", "Закрыть"
			);
		}
		case FRACTION_AUTOSCHOOL: {
			ShowPlayerDialog(playerid, D_PLAYER_TATGET_2, DIALOG_STYLE_LIST, str_, 
				"[0] Выдача лицензий\n[1] Показать удостоверение", "Выбрать", "Закрыть"
			);
		}
		case FRACTION_LV_NEWS, FRACTION_LS_NEWS, FRACTION_SF_NEWS: {

		}
	}
	return 1;
}

		
stock ShowPlayerCertificate(playerid, targetid) {  
	format(t_string, sizeof t_string,
		"\n"colwhi"Удостоверение: "collime"%s\n\
		"colwhi"Организация: "collime"%s\n\
		"colwhi"Должность: "collime"%s(%d)\n", pInfo[targetid][pName], gFraction[pInfo[targetid][pMember]][fName], fFractionRank[pInfo[targetid][pMember]][pInfo[targetid][pRank] - 1], pInfo[targetid][pRank]
	); 
	ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_MSGBOX, ""colserver"Удостоверение", t_string, "Закрыть", ""); 
	return 1;
}
publics: HideObjectsHands(playerid,index) {
	if(HideObjHands[playerid] > -1) {
		if(IsPlayerAttachedObjectSlotUsed(playerid, index))RemovePlayerAttachedObject(playerid, index);
		HideObjHands[playerid] = -1;
	}
	return 1;
}
stock CheckPlayerGoCuff(playerid) {
    gFollowInfo[playerid][gtX] 		=
	gFollowInfo[playerid][gtY] 		=
	gFollowInfo[playerid][gtZ] 		=
	gFollowInfo[playerid][gtTPX] 	= 
	gFollowInfo[playerid][gtTPY] 	= 
	gFollowInfo[playerid][gtTPZ] 	= 0.0;
	SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
	if(gFollowInfo[playerid][gtGoID] != INVALID_PLAYER_ID) gFollowInfo[gFollowInfo[playerid][gtGoID]][gtID] = INVALID_PLAYER_ID;

	gFollowInfo[playerid][gtID] 	= 
	gFollowInfo[playerid][gtGoID] 	= INVALID_PLAYER_ID;
	gFollowInfo[playerid][gtState] 	= 
	gFollowInfo[playerid][gtStayed] = 0;
    return true;
}
stock TurnPlayerFaceToPlayer(playerid, facingtoid) {
	new Float:x, Float:y, Float:z;
	GetPlayerPos(facingtoid, x, y, z);
	SetPlayerFaceToPoint(playerid, x, y);
	return true;
}
stock SetPlayerFaceToPoint(playerid, Float:X, Float:Y) {
    new Float:angle;
	new Float:misc = 5.0;
	new Float:x, Float:y, Float:z;
	GetPlayerPos(playerid, x, y, z);
	angle = 180.0-atan2(x-X,y-Y);
	angle += misc;
	misc *= -1;
	SetPlayerFacingAngle(playerid, angle+misc);
    return true;
}
stock ShiftCords(style, &Float:x, &Float:y, &Float:z, Float:a, Float:distance) {
	#pragma unused z
	switch(style) {
	    case 0: {
	        x += (distance * floatsin(-a, degrees));
			y += (distance * floatcos(-a, degrees));
	    }
	    case 1: {
		    x -= (distance * floatsin(-a, degrees));
			y -= (distance * floatcos(-a, degrees));
		}
		default: return false;
	}
	return true;
}
stock GoPlayerAnimation(playerid, Float:X, Float:Y, Float:Z) {
	if(IsPlayerInAnyVehicle(playerid)) return false; 
	else if(IsPlayerInRangeOfPoint(playerid, 2.0, X, Y, Z)) return ApplyAnimation(playerid, "PED", "IDLE_STANCE", 6.0, 1, 1, 1, 1, 0, 1);
	else if(IsPlayerInRangeOfPoint(playerid, 4.0, X, Y, Z)) return ApplyAnimation(playerid, "PED", "WALK_PLAYER", 6.0, 1, 1, 1, 1, 0, 1);
	else if(IsPlayerInRangeOfPoint(playerid, 7.0, X, Y, Z)) return ApplyAnimation(playerid, "PED", "RUN_GANG1", 6.0, 1, 1, 1, 1, 0, 1); 
	ApplyAnimation(playerid, "PED", "SPRINT_PANIC", 6.0, 1, 1, 1, 1, 0, 1);
	return true;
}
stock GivePlayerLicense(playerid, type, fordays, bool: save = true) {
	pInfo[playerid][pLicense][type] = 1;
	new 
		un_lic = gettime() + (fordays * 86400);
	pInfo[playerid][pLicenseTime][type] = un_lic;
	if (save) {
		new 
			query_[256];
		format(query_, sizeof query_, 
			"UPDATE `s_users` SET `licenses` = '%d,%d,%d,%d,%d,%d', `licensesTime` = '%d|%d|%d|%d|%d|%d' WHERE `pID` = '%d' LIMIT 1",
			pInfo[playerid][pLicense][0], pInfo[playerid][pLicense][1], pInfo[playerid][pLicense][2], 
			pInfo[playerid][pLicense][3], pInfo[playerid][pLicense][4], pInfo[playerid][pLicense][5],
			pInfo[playerid][pLicenseTime][0], pInfo[playerid][pLicenseTime][1], pInfo[playerid][pLicenseTime][2], 
			pInfo[playerid][pLicenseTime][3], pInfo[playerid][pLicenseTime][4], pInfo[playerid][pLicenseTime][5],
			pInfo[playerid][pID]
		);
		mysql_tquery(dbHandle, query_, "", "");
		printf("GivePlayerLicense -> strlen %d", query_);
	} 
} 
stock CheckPlayerLicenseTime(playerid) { 
	new
		current_time = gettime();
	if (current_time > pInfo[playerid][pLicenseTime][DRIVE_LIC] && pInfo[playerid][pLicense][DRIVE_LIC]) { 
		ClearPlayerLicense(playerid, DRIVE_LIC);
		SendClientMessage(playerid, COLOR_LI_RED, !"[Оповещения] "colwhi"Внимание! Время "collime"Водительского удостоверения "colwhi"истекло, обратитесь в Автошколу!");
	}
	if (current_time > pInfo[playerid][pLicenseTime][FLY_LIC] && pInfo[playerid][pLicense][FLY_LIC]) { 
		ClearPlayerLicense(playerid, FLY_LIC);
		SendClientMessage(playerid, COLOR_LI_RED, !"[Оповещения] "colwhi"Внимание! Время лицензии на "collime"Воздушный ТС "colwhi"истекло, обратитесь в Автошколу!");
	}
	if (current_time > pInfo[playerid][pLicenseTime][BOAT_LIC] && pInfo[playerid][pLicense][BOAT_LIC]) { 
		ClearPlayerLicense(playerid, BOAT_LIC);
		SendClientMessage(playerid, COLOR_LI_RED, !"[Оповещения] "colwhi"Внимание! Время лицензии на "collime"Водный ТС "colwhi"истекло, обратитесь в Автошколу!");
	}
	if (current_time > pInfo[playerid][pLicenseTime][FISH_LIC] && pInfo[playerid][pLicense][FISH_LIC]) { 
		ClearPlayerLicense(playerid, FISH_LIC);
		SendClientMessage(playerid, COLOR_LI_RED, !"[Оповещения] "colwhi"Внимание! Время лицензии на "collime"Охоту "colwhi"истекло, обратитесь в Автошколу!");
	}
	if (current_time > pInfo[playerid][pLicenseTime][GUN_LIC] && pInfo[playerid][pLicense][GUN_LIC]) { 
		ClearPlayerLicense(playerid, GUN_LIC);
		SendClientMessage(playerid, COLOR_LI_RED, !"[Оповещения] "colwhi"Внимание! Время лицензии на "collime"Оружие "colwhi"истекло, обратитесь в Автошколу!");
	}   
}
stock ClearPlayerLicense(playerid, type, bool: save = true) {
	pInfo[playerid][pLicense][type] = 0;
	pInfo[playerid][pLicenseTime][type] = 0;
	if (save) {
		new 
			query_[256];
		format(query_, sizeof query_, 
			"UPDATE `s_users` SET `licenses` = '%d,%d,%d,%d,%d,%d', `licensesTime` = '%d|%d|%d|%d|%d|%d' WHERE `pID` = '%d' LIMIT 1",
			pInfo[playerid][pLicense][0], pInfo[playerid][pLicense][1], pInfo[playerid][pLicense][2], 
			pInfo[playerid][pLicense][3], pInfo[playerid][pLicense][4], pInfo[playerid][pLicense][5],
			pInfo[playerid][pLicenseTime][0], pInfo[playerid][pLicenseTime][1], pInfo[playerid][pLicenseTime][2], 
			pInfo[playerid][pLicenseTime][3], pInfo[playerid][pLicenseTime][4], pInfo[playerid][pLicenseTime][5],
			pInfo[playerid][pID]
		);
		mysql_tquery(dbHandle, query_, "", "");
		printf("ClearPlayerLicense -> strlen %d", query_);
	}
}  
stock OnLoadDiplomationCriminals() {
	new 
		time = GetTickCount(),
		Cache:tempQuery = mysql_query(dbHandle, "SELECT * FROM `s_diplomation`"), rows;
	cache_get_row_count(rows);
	if (!rows) {
		print(!"[Загрузка ...] Данные из s_diplomation не получены!");
		if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
		return;
	} 
	for(new i = 0, str_[32]; i < rows; i++) {
		cache_get_value(i, "dStatus", str_ , sizeof str_);
		sscanf(str_, "p<|>iiiiiiiiiiii", 
			crimeDiplomation[i][0], crimeDiplomation[i][1], crimeDiplomation[i][2], crimeDiplomation[i][3], 
			crimeDiplomation[i][4], crimeDiplomation[i][5], crimeDiplomation[i][6], crimeDiplomation[i][7],
			crimeDiplomation[i][8], crimeDiplomation[i][9], crimeDiplomation[i][10], crimeDiplomation[i][11]);
	} 
    if (cache_is_valid(tempQuery)) cache_delete(tempQuery);
	printf("[Загрузка ...] Данные из s_diplomation получены! (%d шт.) Время: %d", rows, GetTickCount() - time); 
}

stock SaveDiplomationCriminals(playerid, id) {
	new 
		string_[128];
	format(string_, sizeof string_, "UPDATE `s_diplomation` SET `dStatus` = '%d|%d|%d|%d|%d|%d|%d|%d' WHERE `dID` =  '%d' LIMIT 1",
		crimeDiplomation[capture_band(pInfo[playerid][pMember])][0], crimeDiplomation[capture_band(pInfo[playerid][pMember])][1], crimeDiplomation[capture_band(pInfo[playerid][pMember])][2], 
		crimeDiplomation[capture_band(pInfo[playerid][pMember])][3], crimeDiplomation[capture_band(pInfo[playerid][pMember])][4], crimeDiplomation[capture_band(pInfo[playerid][pMember])][5], 
		crimeDiplomation[capture_band(pInfo[playerid][pMember])][6], crimeDiplomation[capture_band(pInfo[playerid][pMember])][7], crimeDiplomation[capture_band(pInfo[playerid][pMember])][8],
		crimeDiplomation[capture_band(pInfo[playerid][pMember])][9], crimeDiplomation[capture_band(pInfo[playerid][pMember])][10], crimeDiplomation[capture_band(pInfo[playerid][pMember])][11], id
	);
	mysql_tquery(dbHandle, string_, "", "");
}
stock ShowDialogDiplomationCriminals(playerid, bool:edit_dip = true) {
	static const f_str[][] = { 
		""C_PODS"Нейтралитет",
		""colwarn"Война",
		""collime"Союз",
		""colrose"Запрос на союз",
		""colrose"Запрос на союз"
	};
	new pvar_string_[8], step;
	new string_[128]; 
	t_string[0] = EOS;
	strcat(t_string, ""colserver"[№] Организация\t"colserver"Статус\n");
	for(new i = 0 ; i < 12; i ++) {  
		format(pvar_string_, 8, "d_%d", step);
		SetPVarInt(playerid, pvar_string_, i); 
		format(string_, sizeof string_, "[%d] {%s} %s\t%s\n", i, gFraction[ back_capture_band(i) ][fRGBColor], gFraction[ back_capture_band(i) ][fName], f_str[ crimeDiplomation[ capture_band(pInfo[playerid][pMember]) ][i] ]);
		strcat(t_string, string_); 
		step++;
	}
	if(edit_dip) ShowPlayerDialog(playerid, D_DIPLOMATION, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Преступная: "colwhi"Дипломатия", t_string, "Выбрать", "Отмена");
	else ShowPlayerDialog(playerid, D_NULL, DIALOG_STYLE_TABLIST_HEADERS, ""colserver"Преступная: "colwhi"Дипломатия", t_string, "Закрыть", "");
	return 1;
}


new Request:OnGetDataVkSSL_ID;

stock SendVk(const vk_id[], const message[]) {

    format(totalstring, sizeof totalstring, "https://api.vk.com/method/messages.send?domain=%s&message=%s&random_id=%d&access_token=vk1.a.sJICI80gkJeWbVpaR2ubnUZiLFMUUNmcP9f5s5Z7t02SsFRqWVgb-sGFJD7ZP2-KGLmlCqnKiqzMvHhDV-hnEeXZshCyNJM6flm7XYWAUkcKJHHZs-JyTnZRYQQL3fCkseqiLDbBKyRm4axL7TDsK-RlFXbWeOYnFgPuUnoi3m67sFXR7R2XO8hn-dSwVmxM",
        vk_id, message, RandomFIX(99999,10000));
    new index;

    for(new i = 0; totalstring[i] != '\0'; i++)
    {
        switch(totalstring[i])
        {
            case ' ': totalstring[index++] = '+';
            default: totalstring[index++] = totalstring[i];
        }
    }

   /* new RequestsClient:client = RequestsClient(totalstring, RequestHeaders(
        ));
        OnGetDataVkSSL_ID = Request(
            client,
            "",
            HTTP_METHOD_GET,
            "OnGetDataVkSSL",
        .headers = RequestHeaders()
    ); */
    totalstring[0] = EOS;
    return 1;
} 

publics: OnGetDataVkSSL(Request:id, E_HTTP_STATUS:status, data[], dataLen) {
    ASSERT(id == OnGetDataVkSSL_ID);
    //ASSERT(status == HTTP_STATUS_OK);
    print(data);
    print("\nPASS!");
    return 1;
}

stock SendVKMessage(playerid, const message[], const vk_id[]) {
	format(bigstring, sizeof bigstring, "http://creative-rp.ru/api?secret=vk1.a.sJICI80gkJeWbVpaR2ubnUZiLFMUUNmcP9f5s5Z7t02SsFRqWVgb-sGFJD7ZP2-KGLmlCqnKiqzMvHhDV-hnEeXZshCyNJM6flm7XYWAUkcKJHHZs-JyTnZRYQQL3fCkseqiLDbBKyRm4axL7TDsK-RlFXbWeOYnFgPuUnoi3m67sFXR7R2XO8hn-dSwVmxM&method=vk&user=%s&mess=%s", vk_id, message); 
//
    new 
        index;

    for(new i = 0; bigstring[i] != '\0'; i++)
    {
        switch(bigstring[i])
        {
            case ' ': bigstring[index++] = '+';
            default: bigstring[index++] = bigstring[i];
        }
    }

    HTTP(playerid, HTTP_GET, bigstring, "", "SendMessageResponse"); 

    printf("%s", bigstring);

    bigstring[0] = EOS;

    return 1;
} 
stock SendTelegramMessage(playerid, const message[], const tg_id[]) { 
	new	
		inc_string[512];
	format(inc_string, sizeof inc_string, "http://h-rp.su/api?secret=d9d4adfc4d99842ed5d0b92d4b08387a&method=telegram&user=%s&mess=%s", tg_id, message); 
    for(new i, str = strlen(inc_string); i < str; i++) {
        if(inc_string[i] == ' ') inc_string[i] = '+';
    }

    HTTP(playerid, HTTP_GET, inc_string, "", ""); 
    return 1;
} 
stock SendMailMessage(playerid, const message[], const email[]) {
	new	
		inc_string[512];
	format(inc_string, sizeof inc_string, 
		"http://h-rp.su/api?secret=d9d4adfc4d99842ed5d0b92d4b08387a&method=mail&user=%s&type=confirm&code=%s", 
		email, message
	);  
    for(new i, str = strlen(inc_string); i < str; i++) {
        if(inc_string[i] == ' ') inc_string[i] = '+';
    }

    HTTP(playerid, HTTP_GET, inc_string, "", "SendMessageResponse"); 
	return 1;
}
publics: SendMessageResponse(index, response_code, data[])
{
	switch(response_code) {
		case 200: {
			return print("[Guard] Сообщение отправлено!"); 
		}
		case 500: {
			return print("[Guard] Ошибка сервера веб-части!"); 
		}
		default: {
			printf("[Guard] Сбой в запросе, код ответа: %d", response_code); 
		}
	} 
    return 1;
}


stock InsertCreateVehicleAC(model, Float:x,Float:y,Float:z,Float:r, c, c_, fraction, type)
{
	new
		query_[256],
		number_car[12];

	format(number_car, 12, "%dARMY%d", RandomEx(10), RandomFIX(100, 999));
	mysql_format(dbHandle, query_, sizeof query_,
		"INSERT INTO `s_vehicle_server` (`vType`,`vModel`,`vPos`,`vColor`,`vNumber`,`vFraction`,`vSubFraction`) VALUES ('%d','%d','%f|%f|%f|%f','%d,%d','%s','%d','0')",
		type, model, x, y, z, r, c, c_, number_car, fraction
	);
	printf(query_);
	mysql_tquery(dbHandle, query_, "", "");
    return 1;
}


stock IsPlayerToHunterZone(playerid) {
	return IsPlayerToSquare(playerid, .min_x = -811.8267, .min_y = -2544.8973, .max_x = -360.8267, .max_y = -2103.8973);
}

stock DestroyHunter(i) {
	//SendClientMessageToAll(COLOR_RED, !"Destroy Deer");
    DestroyDynamicObject(gDeerHunterInfo[i][deerObject]);
    DestroyDynamic3DTextLabel(gDeerHunterInfo[i][deerText]);
    gDeerHunterInfo[i][deerSpawned] = false;
    gDeerHunterInfo[i][deerKilled] = false;
	gDeerHunterInfo[i][deerUsePlayer] = false;
    gDeerHunterInfo[i][deerCoolDown] = 0;
}

stock LeavePlayerFactoryJob(playerid, bool: text = false) {
	if (pTemp[playerid][tJobFactory])
	{ 
		pTemp[playerid][tJobFactory] = false;  
		new salary = pTemp[playerid][tSalaryJob][0]*SALARY_FACTORY_JOB,
			salary_ = pTemp[playerid][tSalaryJob][1]*SALARY_FACTORY_BOX_JOB;
			
		salary = GetVipBoostMaxPlayerValue(playerid, vPercentSalary, bPercentSalary, salary); 
		salary_ = GetVipBoostMaxPlayerValue(playerid, vPercentSalary, bPercentSalary, salary_); 
		SetMoveCashServer(IN_JOB, (salary+salary_));
		if (text) {
			new 
				string_[128];
			format(string_, sizeof string_, "Вы собрали упаковок: "colserver"%d"colwhi" и заработали "collime"$%d", 
				pTemp[playerid][tSalaryJob][0], salary
			);
			SendClientMessage(playerid, COLOR_WHITE, string_); 
			format(string_, sizeof string_, "Вы отсортировали упаковок: "colserver"%d"colwhi" и заработали "collime"$%d", 
				pTemp[playerid][tSalaryJob][1], salary_
			);
			SendClientMessage(playerid, COLOR_WHITE, string_); 
			SendClientMessage(playerid, COLOR_GREEN, !"Рабочий день окончен, заработанные деньги вы получили на руки"); 
			MeAction(playerid, "уволился(ась) с работы", SELECT_ACTION_IN_BUBBLE);
		} 
		kLibGivePlayerMoney(playerid, (salary+salary_), "зп factory");
		pTemp[playerid][tSalaryJob][0] =
		pTemp[playerid][tSalaryJob][1] = 0;
		SetPlayerSkinEx(playerid, pInfo[playerid][pChar][0]); 
		if (IsPlayerAttachedObjectSlotUsed(playerid, ATTACHED_SLOT_JOB_1)) RemovePlayerAttachedObject(playerid, ATTACHED_SLOT_JOB_1);
		
		if (pTemp[playerid][tJobTimer] != -1) {
			KillTimer(pTemp[playerid][tJobTimer]);
		}
	}
	for(new i = 0; i < S_FACTORY_TABLE_COUNT; i++) {
		if (gFactoryInfo[i][tableToggle] == playerid) {
			gFactoryInfo[i][tableToggle] = INVALID_PLAYER_ID;
			if (IsValidDynamicObject(gFactoryInfo[i][tableObject])) {
				DestroyDynamicObject(gFactoryInfo[i][tableObject]);
			}
			if (IsValidDynamicObject(gFactoryInfo[i][tableObjectStatus])) {
				DestroyDynamicObject(gFactoryInfo[i][tableObjectStatus]);
				gFactoryInfo[i][tableObjectStatus] = CreateDynamicTrigger(gFactoryInfo[i][tablePos][0], gFactoryInfo[i][tablePos][1], gFactoryInfo[i][tablePos][2], 
					.worldid = 1, .interiorid = FACTORY_INT, .t_type = 2
				);
			} 
			
		} 
    }
	if (pTemp[playerid][tUseFactorySordID] != -1) {
		gFactorySortInfo[ pTemp[playerid][tUseFactorySordID] ][sortPlaceToggle] = INVALID_PLAYER_ID;
	} 
}
stock LeaveJobPlayer(playerid, bool:text = false) {
	if (pTemp[playerid][tJobHunter])
	{
		new 
			salary = pTemp[playerid][tSalaryJob][0] * SALARY_HUNTER_JOB,
			salary_ = pTemp[playerid][tSalaryJob][1] * SALARY_HUNTER_MEET_JOB;
		if (text) {
			new 
				string_[128];
			format(string_, sizeof string_, "Вы убили оленей: "colserver"%d"colwhi" и заработали "collime"$%d", 
				pTemp[playerid][tSalaryJob][0], salary
			);
			SendClientMessage(playerid, COLOR_WHITE, string_); 
			format(string_, sizeof string_, "Вы обработали мяса: "colserver"%d"colwhi" и заработали "collime"$%d", 
				pTemp[playerid][tSalaryJob][1], salary_
			);
			SendClientMessage(playerid, COLOR_WHITE, string_); 
			SendClientMessage(playerid, COLOR_GREEN, !"Рабочий день окончен, заработанные деньги вы получили на руки"); 
		}
		pTemp[playerid][tJobHunter] = false; 
		
		kLibGivePlayerMoney(playerid, (salary_+ salary), "spawn salary tJobHunter");
		SetMoveCashServer(IN_JOB, (salary_+ salary)); 
		pTemp[playerid][tSalaryJob][0] =
		pTemp[playerid][tSalaryJob][1] = 0;
		pTemp[playerid][tUseDeerKnifeID] = -1;
		ResetPlayerWeapons(playerid);
		
	}
}
publics: MainJobsTimers(playerid, index)
{ 
	//ClearAnimations(playerid);
	gFactoryInfo[index][tableToggle] = INVALID_PLAYER_ID; 
	DestroyDynamicObject(gFactoryInfo[index][tableObject]);
	DestroyDynamicObject(gFactoryInfo[index][tableObjectStatus]);
	gFactoryInfo[index][tableObjectStatus] = CreateDynamicTrigger(gFactoryInfo[index][tablePos][0], gFactoryInfo[index][tablePos][1], gFactoryInfo[index][tablePos][2], 
		.worldid = 1, .interiorid = FACTORY_INT, .t_type = 2
	);
	if(!IsPlayerInDynamicArea(playerid, gFactoryInfo[index][tableAreaID])) { 
		SendClientMessage(playerid, COLOR_GREY, !"Вы отвлекались от работы, и у Вас вышел бракованный ящик");
		return 1;
	}  
	Streamer_Update(playerid);
	SetPlayerAttachedObject(playerid, ATTACHED_SLOT_JOB_1, 3052, 6, 0.0, 0.10, -0.2, -110.0, 0.0, 78.0);
	SendClientMessage(playerid, COLOR_YELLOW, !"[Подсказка] "colwhi"Вы собрали ящик. Отнесите его на конвейерную ленту");
	pTemp[playerid][tFactoryUseBox] = true;
	pTemp[playerid][tJobTimer] = -1; 
	//SetPlayerSpecialAction (playerid, SPECIAL_ACTION_CARRY);
	ClearAnimations(playerid);
	ApplyAnimation(playerid, !"CARRY", !"crry_prtial", 4.0, 0, 1, 1, 1, 1, 1);
	//ApplyAnimation(playerid,"CARRY","crry_prtial", 4.1, 0, 1, 1, 1, 1); 
	//SetTimerEx("CarryDelay", 500, false, "i", playerid);  
	return 1;
}


LoadingTrucker() {
	new _str[356];
	strcat (_str,"Нажмите: "colserver"\"H\"\n\n"colwhi"Для того, чтобы загрузить фуру\n\nОчередь на загрузку\n" ) ;
	for ( new i ; i < 10 ; i ++ )
	{
		if (TurnLoadingTrucker[LOADING_SAWMILL_0][i] != INVALID_PLAYER_ID && !IsPlayerConnected(TurnLoadingTrucker[LOADING_SAWMILL_0][i]) 
			|| (TurnLoadingTrucker[LOADING_SAWMILL_0][i] != INVALID_PLAYER_ID && !GetPVarInt(TurnLoadingTrucker[LOADING_SAWMILL_0][i], "truck_waiting"))) {
				TurnLoadingTrucker[LOADING_SAWMILL_0][i] = INVALID_PLAYER_ID;
		}
		if(i != 9 && TurnLoadingTrucker[LOADING_SAWMILL_0][i] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_SAWMILL_0] [ i + 1 ] != INVALID_PLAYER_ID) {
			TurnLoadingTrucker[LOADING_SAWMILL_0][i] = TurnLoadingTrucker[LOADING_SAWMILL_0] [ i + 1 ];
			TurnLoadingTrucker[LOADING_SAWMILL_0][ i + 1 ] = INVALID_PLAYER_ID;
		}
		if(TurnLoadingTrucker[LOADING_SAWMILL_0][i] != INVALID_PLAYER_ID) {
			format (_str, sizeof _str, "%s\n%i. %s", _str, i + 1, pInfo[TurnLoadingTrucker[LOADING_SAWMILL_0][i]][pName]);
		}
	}
	UpdateDynamic3DTextLabelText(TextLoadingTrucker[0], -1, _str);
	_str [ 0 ] = EOS;
	strcat (_str,"Нажмите: "colserver"\"H\"\n\n"colwhi"Для того, чтобы загрузить фуру\n\nОчередь на загрузку\n" ) ;
	for ( new i ; i < 10 ; i ++ )
	{
		if (TurnLoadingTrucker[LOADING_SAWMILL_1][i] != INVALID_PLAYER_ID && !IsPlayerConnected(TurnLoadingTrucker[LOADING_SAWMILL_1][i]) 
			|| (TurnLoadingTrucker[LOADING_SAWMILL_1][i] != INVALID_PLAYER_ID && !GetPVarInt(TurnLoadingTrucker[LOADING_SAWMILL_1][i], "truck_waiting"))) {
				TurnLoadingTrucker[LOADING_SAWMILL_1][i] = INVALID_PLAYER_ID;
		}
		if(i != 9 && TurnLoadingTrucker[LOADING_SAWMILL_1][i] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_SAWMILL_1] [ i + 1 ] != INVALID_PLAYER_ID) {
			TurnLoadingTrucker[LOADING_SAWMILL_1][i] = TurnLoadingTrucker[LOADING_SAWMILL_1] [ i + 1 ];
			TurnLoadingTrucker[LOADING_SAWMILL_1][ i + 1 ] = INVALID_PLAYER_ID;
		}
		if(TurnLoadingTrucker[LOADING_SAWMILL_1][i] != INVALID_PLAYER_ID) {
			format (_str, sizeof _str, "%s\n%i. %s", _str, i + 1, pInfo[TurnLoadingTrucker[LOADING_SAWMILL_1][i]][pName]);
		}
	}
	UpdateDynamic3DTextLabelText(TextLoadingTrucker[1], -1, _str);
	_str [ 0 ] = EOS;
	strcat (_str,"Нажмите: "colserver"\"H\"\n\n"colwhi"Для того, чтобы загрузить фуру\n\nОчередь на загрузку\n" ) ;
	for ( new i ; i < 10 ; i ++ )
	{
		if (TurnLoadingTrucker[LOADING_COAL_0][i] != INVALID_PLAYER_ID && !IsPlayerConnected(TurnLoadingTrucker[LOADING_COAL_0][i]) 
			|| (TurnLoadingTrucker[LOADING_COAL_0][i] != INVALID_PLAYER_ID && !GetPVarInt(TurnLoadingTrucker[LOADING_COAL_0][i], "truck_waiting"))) {
				TurnLoadingTrucker[LOADING_COAL_0][i] = INVALID_PLAYER_ID;
		}
		if(i != 9 && TurnLoadingTrucker[LOADING_COAL_0][i] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_COAL_0] [ i + 1 ] != INVALID_PLAYER_ID) {
			TurnLoadingTrucker[LOADING_COAL_0][i] = TurnLoadingTrucker[LOADING_COAL_0] [ i + 1 ];
			TurnLoadingTrucker[LOADING_COAL_0][ i + 1 ] = INVALID_PLAYER_ID;
		}
		if(TurnLoadingTrucker[LOADING_COAL_0][i] != INVALID_PLAYER_ID) {
			format (_str, sizeof _str, "%s\n%i. %s", _str, i + 1, pInfo[TurnLoadingTrucker[LOADING_COAL_0][i]][pName]);
		}
	}
	UpdateDynamic3DTextLabelText(TextLoadingTrucker[2], -1, _str);
	_str [ 0 ] = EOS;
	strcat (_str,"Нажмите: "colserver"\"H\"\n\n"colwhi"Для того, чтобы загрузить фуру\n\nОчередь на загрузку\n" ) ;
	for ( new i ; i < 10 ; i ++ )
	{
		if (TurnLoadingTrucker[LOADING_COAL_1][i] != INVALID_PLAYER_ID && !IsPlayerConnected(TurnLoadingTrucker[LOADING_COAL_1][i]) 
			|| (TurnLoadingTrucker[LOADING_COAL_1][i] != INVALID_PLAYER_ID && !GetPVarInt(TurnLoadingTrucker[LOADING_COAL_1][i], "truck_waiting"))) {
				TurnLoadingTrucker[LOADING_COAL_1][i] = INVALID_PLAYER_ID;
		}
		if(i != 9 && TurnLoadingTrucker[LOADING_COAL_1][i] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_COAL_1] [ i + 1 ] != INVALID_PLAYER_ID) {
			TurnLoadingTrucker[LOADING_COAL_1][i] = TurnLoadingTrucker[LOADING_COAL_1] [ i + 1 ];
			TurnLoadingTrucker[LOADING_COAL_1][ i + 1 ] = INVALID_PLAYER_ID;
		}
		if(TurnLoadingTrucker[LOADING_COAL_1][i] != INVALID_PLAYER_ID) {
			format (_str, sizeof _str, "%s\n%i. %s", _str, i + 1, pInfo[TurnLoadingTrucker[LOADING_COAL_1][i]][pName]);
		}
	}
	UpdateDynamic3DTextLabelText(TextLoadingTrucker[3], -1, _str);
	_str [ 0 ] = EOS;
	strcat (_str,"Нажмите: "colserver"\"H\"\n\n"colwhi"Для того, чтобы загрузить фуру\n\nОчередь на загрузку\n" ) ;
	for ( new i ; i < 10 ; i ++ )
	{
		if (TurnLoadingTrucker[LOADING_OIL_0][i] != INVALID_PLAYER_ID && !IsPlayerConnected(TurnLoadingTrucker[LOADING_OIL_0][i]) 
			|| (TurnLoadingTrucker[LOADING_OIL_0][i] != INVALID_PLAYER_ID && !GetPVarInt(TurnLoadingTrucker[LOADING_OIL_0][i], "truck_waiting"))) {
				TurnLoadingTrucker[LOADING_OIL_0][i] = INVALID_PLAYER_ID;
		}
		if(i != 9 && TurnLoadingTrucker[LOADING_OIL_0][i] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_OIL_0] [ i + 1 ] != INVALID_PLAYER_ID) {
			TurnLoadingTrucker[LOADING_OIL_0][i] = TurnLoadingTrucker[LOADING_OIL_0] [ i + 1 ];
			TurnLoadingTrucker[LOADING_OIL_0][ i + 1 ] = INVALID_PLAYER_ID;
		}
		if(TurnLoadingTrucker[LOADING_OIL_0][i] != INVALID_PLAYER_ID) {
			format (_str, sizeof _str, "%s\n%i. %s", _str, i + 1, pInfo[TurnLoadingTrucker[LOADING_OIL_0][i]][pName]);
		}
	}
	UpdateDynamic3DTextLabelText(TextLoadingTrucker[4], -1, _str);
	_str [ 0 ] = EOS;
	strcat (_str,"Нажмите: "colserver"\"H\"\n\n"colwhi"Для того, чтобы загрузить фуру\n\nОчередь на загрузку\n" ) ;
	for ( new i ; i < 10 ; i ++ )
	{
		if (TurnLoadingTrucker[LOADING_OIL_1][i] != INVALID_PLAYER_ID && !IsPlayerConnected(TurnLoadingTrucker[LOADING_OIL_1][i]) 
			|| (TurnLoadingTrucker[LOADING_OIL_1][i] != INVALID_PLAYER_ID && !GetPVarInt(TurnLoadingTrucker[LOADING_OIL_1][i], "truck_waiting"))) {
				TurnLoadingTrucker[LOADING_OIL_1][i] = INVALID_PLAYER_ID;
		}
		if(i != 9 && TurnLoadingTrucker[LOADING_OIL_1][i] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_OIL_1] [ i + 1 ] != INVALID_PLAYER_ID) {
			TurnLoadingTrucker[LOADING_OIL_1][i] = TurnLoadingTrucker[LOADING_OIL_1] [ i + 1 ];
			TurnLoadingTrucker[LOADING_OIL_1][ i + 1 ] = INVALID_PLAYER_ID;
		}
		if(TurnLoadingTrucker[LOADING_OIL_1][i] != INVALID_PLAYER_ID) {
			format (_str, sizeof _str, "%s\n%i. %s", _str, i + 1, pInfo[TurnLoadingTrucker[LOADING_OIL_1][i]][pName]);
		}
	}
	UpdateDynamic3DTextLabelText(TextLoadingTrucker[5], -1, _str);

	TurnLoadingCD[LOADING_SAWMILL_0] += 1 ;
	if (TurnLoadingCD[LOADING_SAWMILL_0] == 125 ) TurnLoadingPlayerID[ LOADING_SAWMILL_0 ] = INVALID_PLAYER_ID;
	if (TurnLoadingPlayerID [ LOADING_SAWMILL_0 ] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_SAWMILL_0][0] != INVALID_PLAYER_ID )
	{
		TurnLoadingPlayerID [ LOADING_SAWMILL_0 ] = TurnLoadingTrucker[LOADING_SAWMILL_0][0] ;
		TurnLoadingCD[ LOADING_SAWMILL_0 ] = 0 ;
		SendClientMessage ( TurnLoadingTrucker[LOADING_SAWMILL_0][0], COLOR_GREY, !"Ваша фура загружена. У вас есть 2 минуты, чтобы прицепить её");
		SendClientMessage ( TurnLoadingTrucker[LOADING_SAWMILL_0][0], COLOR_GREY, !"Если вы не успеете, деньги не будут возвращены"); 
		new trailer_id = _CreateVehicle(435,-468.4995,-88.6335,59.8888,354.5496,1,1, -1); 
		pTemp[ TurnLoadingTrucker[LOADING_SAWMILL_0][0] ][tTruckerTrailerBuy] = trailer_id;
	
		trailer_type [ trailer_id - 1 ] = LOADING_SAWMILL_0;
		trailer_count [ trailer_id - 1 ] = GetPVarInt ( TurnLoadingTrucker[LOADING_SAWMILL_0][0], "truck_count" ) ;
 
		pTemp[ TurnLoadingTrucker[LOADING_SAWMILL_0][0] ][tTruckerLoadTime] = 120; 
		ShowTruckerMainMenu(TurnLoadingTrucker[LOADING_SAWMILL_0][0], trailer_id, .timer = true);

		DeletePVar ( TurnLoadingTrucker[LOADING_SAWMILL_0][0], "truck_count" ) ;
	} 
	TurnLoadingCD[LOADING_SAWMILL_1] += 1 ;
	if (TurnLoadingCD[LOADING_SAWMILL_1] == 125 ) TurnLoadingPlayerID[ LOADING_SAWMILL_1 ] = INVALID_PLAYER_ID;
	if (TurnLoadingPlayerID [ LOADING_SAWMILL_1 ] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_SAWMILL_1][0] != INVALID_PLAYER_ID )
	{
		TurnLoadingPlayerID [ LOADING_SAWMILL_1 ] = TurnLoadingTrucker[LOADING_SAWMILL_1][0] ;
		TurnLoadingCD[ LOADING_SAWMILL_1 ] = 0 ;
		SendClientMessage ( TurnLoadingTrucker[LOADING_SAWMILL_1][0], COLOR_GREY, !"Ваша фура загружена. У вас есть 2 минуты, чтобы прицепить её");
		SendClientMessage ( TurnLoadingTrucker[LOADING_SAWMILL_1][0], COLOR_GREY, !"Если вы не успеете, деньги не будут возвращены"); 
		new trailer_id = _CreateVehicle(435,-1970.7585,-2433.0134,30.6250,137.8556,1,1, -1); 
		pTemp[ TurnLoadingTrucker[LOADING_SAWMILL_1][0] ][tTruckerTrailerBuy] = trailer_id;

		trailer_type [ trailer_id - 1 ] = LOADING_SAWMILL_1;
		trailer_count [ trailer_id - 1 ] = GetPVarInt ( TurnLoadingTrucker[LOADING_SAWMILL_1][0], "truck_count" ) ;
 
		pTemp[ TurnLoadingTrucker[LOADING_SAWMILL_1][0] ][tTruckerLoadTime] = 120; 
		ShowTruckerMainMenu(TurnLoadingTrucker[LOADING_SAWMILL_1][0], trailer_id, .timer = true);
		DeletePVar ( TurnLoadingTrucker[LOADING_SAWMILL_1][0], "truck_count" ) ;
	}

	TurnLoadingCD[LOADING_COAL_0] += 1 ;
	if (TurnLoadingCD[LOADING_COAL_0] == 125) TurnLoadingPlayerID[ LOADING_COAL_0 ] = INVALID_PLAYER_ID;
	if (TurnLoadingPlayerID [ LOADING_COAL_0 ] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_COAL_0][0] != INVALID_PLAYER_ID )
	{
		TurnLoadingPlayerID [ LOADING_COAL_0 ] = TurnLoadingTrucker[LOADING_COAL_0][0] ;
		TurnLoadingCD[ LOADING_COAL_0 ] = 0 ;
		SendClientMessage ( TurnLoadingTrucker[LOADING_COAL_0][0], COLOR_GREY, !"Ваша фура загружена. У вас есть 2 минуты, чтобы прицепить её");
		SendClientMessage ( TurnLoadingTrucker[LOADING_COAL_0][0], COLOR_GREY, !"Если вы не успеете, деньги не будут возвращены"); 
		new trailer_id = _CreateVehicle(450, 588.2112, 844.9619, -42.8014, 272.4998,1,1, -1); 
		pTemp[ TurnLoadingTrucker[LOADING_COAL_0][0] ][tTruckerTrailerBuy] = trailer_id;

		trailer_type [ trailer_id - 1 ] = LOADING_COAL_0;
		trailer_count [ trailer_id - 1 ] = GetPVarInt ( TurnLoadingTrucker[LOADING_COAL_0][0], "truck_count" ) ;
 
		pTemp[ TurnLoadingTrucker[LOADING_COAL_0][0] ][tTruckerLoadTime] = 120; 
		ShowTruckerMainMenu(TurnLoadingTrucker[LOADING_COAL_0][0], trailer_id, .timer = true);
		DeletePVar ( TurnLoadingTrucker[LOADING_COAL_0][0], "truck_count" ) ;
	}

	TurnLoadingCD[LOADING_COAL_1] += 1 ;
	if (TurnLoadingCD[LOADING_COAL_1] == 125 ) TurnLoadingPlayerID[ LOADING_COAL_1 ] = INVALID_PLAYER_ID;
	if (TurnLoadingPlayerID [ LOADING_COAL_1 ] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_COAL_1][0] != INVALID_PLAYER_ID )
	{
		TurnLoadingPlayerID [ LOADING_COAL_1 ] = TurnLoadingTrucker[LOADING_COAL_1][0] ;
		TurnLoadingCD[ LOADING_COAL_1 ] = 0 ;
		SendClientMessage ( TurnLoadingTrucker[LOADING_COAL_1][0], COLOR_GREY, !"Ваша фура загружена. У вас есть 2 минуты, чтобы прицепить её");
		SendClientMessage ( TurnLoadingTrucker[LOADING_COAL_1][0], COLOR_GREY, !"Если вы не успеете, деньги не будут возвращены"); 
		new trailer_id = _CreateVehicle(450,-1881.3596,-1689.1852,22.3543,172.1823,1,1, -1); 
		pTemp[ TurnLoadingTrucker[LOADING_COAL_1][0] ][tTruckerTrailerBuy] = trailer_id;

		trailer_type [ trailer_id - 1 ] = LOADING_COAL_1;
		trailer_count [ trailer_id - 1 ] = GetPVarInt ( TurnLoadingTrucker[LOADING_COAL_1][0], "truck_count" ) ;
 
		pTemp[ TurnLoadingTrucker[LOADING_COAL_1][0] ][tTruckerLoadTime] = 120; 
		ShowTruckerMainMenu(TurnLoadingTrucker[LOADING_COAL_1][0], trailer_id, .timer = true);
		DeletePVar ( TurnLoadingTrucker[LOADING_COAL_1][0], "truck_count" ) ;
	}

	TurnLoadingCD[LOADING_OIL_0] += 1 ;
	if (TurnLoadingCD[LOADING_OIL_0] == 125) TurnLoadingPlayerID[ LOADING_OIL_0 ] = INVALID_PLAYER_ID;
	if (TurnLoadingPlayerID [ LOADING_OIL_0 ] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_OIL_0][0] != INVALID_PLAYER_ID )
	{
		TurnLoadingPlayerID [ LOADING_OIL_0 ] = TurnLoadingTrucker[LOADING_OIL_0][0] ;
		TurnLoadingCD[ LOADING_OIL_0 ] = 0 ;
		SendClientMessage(TurnLoadingTrucker[LOADING_OIL_0][0], COLOR_GREY, !"Ваша фура загружена. У вас есть 2 минуты, чтобы прицепить её");
		SendClientMessage(TurnLoadingTrucker[LOADING_OIL_0][0], COLOR_GREY, !"Если вы не успеете, деньги не будут возвращены"); 
		new trailer_id = _CreateVehicle(584, 249.1628,1420.7445,11.1698,269.4982,1,1, -1); 
		pTemp[ TurnLoadingTrucker[LOADING_OIL_0][0] ][tTruckerTrailerBuy] = trailer_id;

		trailer_type [ trailer_id - 1 ] = LOADING_OIL_0;
		trailer_count [ trailer_id - 1 ] = GetPVarInt ( TurnLoadingTrucker[LOADING_OIL_0][0], "truck_count" ) ;
 
		pTemp[ TurnLoadingTrucker[LOADING_OIL_0][0] ][tTruckerLoadTime] = 120; 
		ShowTruckerMainMenu(TurnLoadingTrucker[LOADING_OIL_0][0], trailer_id, .timer = true);
		DeletePVar ( TurnLoadingTrucker[LOADING_OIL_0][0], "truck_count" ) ;
	}

	TurnLoadingCD[LOADING_OIL_1] += 1 ;
	if (TurnLoadingCD[LOADING_OIL_1] == 125 ) TurnLoadingPlayerID[ LOADING_OIL_1 ] = INVALID_PLAYER_ID;
	if (TurnLoadingPlayerID [ LOADING_OIL_1 ] == INVALID_PLAYER_ID && TurnLoadingTrucker[LOADING_OIL_1][0] != INVALID_PLAYER_ID )
	{
		TurnLoadingPlayerID [ LOADING_OIL_1 ] = TurnLoadingTrucker[LOADING_OIL_1][0] ;
		TurnLoadingCD[ LOADING_OIL_1 ] = 0 ;
		SendClientMessage ( TurnLoadingTrucker[LOADING_OIL_1][0], COLOR_GREY, !"Ваша фура загружена. У вас есть 2 минуты, чтобы прицепить её");
		SendClientMessage ( TurnLoadingTrucker[LOADING_OIL_1][0], COLOR_GREY, !"Если вы не успеете, деньги не будут возвращены"); 
		new trailer_id = _CreateVehicle(584,-1043.4102,-686.8473,32.6164,1.1470,1,1, -1); 
		pTemp[ TurnLoadingTrucker[LOADING_OIL_1][0] ][tTruckerTrailerBuy] = trailer_id;

		trailer_type [ trailer_id - 1 ] = LOADING_OIL_1;
		trailer_count [ trailer_id - 1 ] = GetPVarInt ( TurnLoadingTrucker[LOADING_OIL_1][0], "truck_count" ) ;
 
		pTemp[ TurnLoadingTrucker[LOADING_OIL_1][0] ][tTruckerLoadTime] = 120;

		ShowTruckerMainMenu(TurnLoadingTrucker[LOADING_OIL_1][0], trailer_id, .timer = true);
		DeletePVar ( TurnLoadingTrucker[LOADING_OIL_1][0], "truck_count" ) ;
	}
}
 
publics: UpdateTruckerTrailerMinute(playerid)
{
	for(new i = 0; i < LOADING_ALL; i++) {
		if (TurnLoadingTrucker[i][0] == playerid) {
			TurnLoadingTrucker[i][0] = INVALID_PLAYER_ID;
		} 
	} 
}  
stock ShowTruckerMainMenu(playerid, vehicleid, bool: main = true, bool: timer = true) {
	if (main) {
		for(new i = 0; i < sizeof trucker_TD; i++) {
			TextDrawShowForPlayer(playerid, trucker_TD[i]);
		}
		trucker_PTD[playerid][0] = CreatePlayerTextDraw(playerid, 502.9992, 124.8587, "CARGO_TYPE: ~w~WOOD"); // ?CAB>
		PlayerTextDrawLetterSize(playerid, trucker_PTD[playerid][0], 0.2194, 0.9900);
		PlayerTextDrawTextSize(playerid, trucker_PTD[playerid][0], 738.0000, 0.0000);
		PlayerTextDrawAlignment(playerid, trucker_PTD[playerid][0], 1);
		PlayerTextDrawColor(playerid, trucker_PTD[playerid][0], COLOR_SERVER);
		PlayerTextDrawSetOutline(playerid, trucker_PTD[playerid][0], -1);
		PlayerTextDrawBackgroundColor(playerid, trucker_PTD[playerid][0], -754100980);
		PlayerTextDrawFont(playerid, trucker_PTD[playerid][0], 1);
		PlayerTextDrawSetProportional(playerid, trucker_PTD[playerid][0], 1);
		PlayerTextDrawSetShadow(playerid, trucker_PTD[playerid][0], 0);

		trucker_PTD[playerid][1] = CreatePlayerTextDraw(playerid, 502.9992, 136.4956, "AMOUNT: ~w~40/40 TON"); // ?CAB>
		PlayerTextDrawLetterSize(playerid, trucker_PTD[playerid][1], 0.2194, 0.9900);
		PlayerTextDrawTextSize(playerid, trucker_PTD[playerid][1], 738.0000, 0.0000);
		PlayerTextDrawAlignment(playerid, trucker_PTD[playerid][1], 1);
		PlayerTextDrawColor(playerid, trucker_PTD[playerid][1], COLOR_SERVER);
		PlayerTextDrawSetOutline(playerid, trucker_PTD[playerid][1], -1);
		PlayerTextDrawBackgroundColor(playerid, trucker_PTD[playerid][1], -754100980);
		PlayerTextDrawFont(playerid, trucker_PTD[playerid][1], 1);
		PlayerTextDrawSetProportional(playerid, trucker_PTD[playerid][1], 1);
		PlayerTextDrawSetShadow(playerid, trucker_PTD[playerid][1], 0);

		static const name_cargo[][] = {
			"WOOD",
			"WOOD",
			"COAL",
			"COAL",
			"OIL",
			"OIL"
		};
		new str_[32];
		format(str_, sizeof str_, "CARGO_TYPE: ~w~%s", name_cargo[ trailer_type [ vehicleid - 1 ] ]);
		PlayerTextDrawSetString(playerid, trucker_PTD[playerid][0], str_);

		format(str_, sizeof str_, "AMOUNT: ~w~%d/%d TON", trailer_count [ vehicleid - 1 ], pInfo[playerid][pDMgruz]);
		PlayerTextDrawSetString(playerid, trucker_PTD[playerid][1], str_);


		PlayerTextDrawShow(playerid, trucker_PTD[playerid][0]);
		PlayerTextDrawShow(playerid, trucker_PTD[playerid][1]);
	}
	if (timer) {
		for(new i = 0; i < sizeof TimerTrucker_TD; i++) {
			TextDrawShowForPlayer(playerid, TimerTrucker_TD[i]);
		}
		if (TimerTrucker_PTD[playerid] == PlayerText: -1) {
			TimerTrucker_PTD[playerid] = CreatePlayerTextDraw(playerid, 559.0000, 159.7998, "Time:_~y~00:00"); // ?CAB>
			PlayerTextDrawLetterSize(playerid, TimerTrucker_PTD[playerid], 0.2556, 1.0105);
			PlayerTextDrawTextSize(playerid, TimerTrucker_PTD[playerid], 686.0000, 0.0000);
			PlayerTextDrawAlignment(playerid, TimerTrucker_PTD[playerid], 1);
			PlayerTextDrawColor(playerid, TimerTrucker_PTD[playerid], -1);
			PlayerTextDrawBackgroundColor(playerid, TimerTrucker_PTD[playerid], 6);
			PlayerTextDrawFont(playerid, TimerTrucker_PTD[playerid], 1);
			PlayerTextDrawSetProportional(playerid, TimerTrucker_PTD[playerid], 1);
			PlayerTextDrawSetShadow(playerid, TimerTrucker_PTD[playerid], 0);
		}  
		PlayerTextDrawShow(playerid, TimerTrucker_PTD[playerid]);
	}
}

stock HideTruckerMainMenu(playerid, bool: main = true, bool: timer = true) {
	if (main) {
		for(new i = 0; i < sizeof trucker_TD; i++) {
			TextDrawHideForPlayer(playerid, trucker_TD[i]);
		}
		if (trucker_PTD[playerid][0] != PlayerText: -1) {
			PlayerTextDrawDestroy(playerid, trucker_PTD[playerid][0]);
		}
		if (trucker_PTD[playerid][1] != PlayerText: -1) {
			PlayerTextDrawDestroy(playerid, trucker_PTD[playerid][1]);
		} 
		trucker_PTD[playerid][0] = PlayerText: -1; 
		trucker_PTD[playerid][1] = PlayerText: -1;
	}
	if (timer) {
		for(new i = 0; i < sizeof TimerTrucker_TD; i++) {
			TextDrawHideForPlayer(playerid, TimerTrucker_TD[i]);
		}
		if (TimerTrucker_PTD[playerid] != PlayerText: -1) {
			PlayerTextDrawDestroy(playerid, TimerTrucker_PTD[playerid]);
		}
		TimerTrucker_PTD[playerid] = PlayerText: -1;
	}
}  
stock GetPlayerPromoCodeSearch(promoid)
{
	new 
        query_[84];
	format(query_, sizeof query_,"SELECT * FROM s_promocode WHERE id = '%d' LIMIT 1", promoid);
	new Cache: result = mysql_query(dbHandle, query_); 
	new 
		value = cache_num_rows(),
		promo_name[32];
	if (!value) {
		promo_name = "None";
	} else {
		cache_get_value_name(0, "code", promo_name);
	} 
	if (cache_is_valid(result)) cache_delete(result);
	return promo_name;
}

stock SetPosInFrontOfPlayer(playerid, targetid, Float:distance) {
	new 
		Float: x,
		Float: y,
		Float: z,
		Float: a;
	GetPlayerPos(playerid, x, y, z);
	GetPlayerFacingAngle(playerid, a);
	x += (distance * floatsin(-a, degrees));
	y += (distance * floatcos(-a, degrees));
	SetPlayerPosAC(targetid, x, y, z, pTemp[playerid][tVirtualWorld], pTemp[playerid][tInterior]);
	SetPlayerFacingAngle(targetid, a);
}
stock srace_end(playerid, type) {
	DestroyDynamicCP(pTemp[playerid][tRaceCP]);
	DestroyDynamicCP(pTemp[ pTemp[playerid][tRaceID] ][tRaceCP]);
	CP[ playerid ] = 777;
	DisablePlayerCheckpoint(playerid);
	CP[ pTemp[playerid][tRaceID] ] = 777;
	DisablePlayerCheckpoint(pTemp[playerid][tRaceID]);
	switch(type) {
		case 0: {
			new string[144];
			format(string, sizeof(string), "Вы одержали победу в гонках над "C_PODS"%s"c_offer". Вознаграждение: "collime"$%d",
				pInfo[ pTemp[playerid][tRaceID] ][pName], pTemp[playerid][tRaceMoney]*2
			);
			SendClientMessage(playerid, C_OFFER, string);
			GameTextForPlayer(playerid, !"~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~g~YOU WIN", 3000, 3);
			if (pInfo[playerid][pFamily]) GiveFamilyRepute(pInfo[playerid][pFamily], 1); //Проиграл гонку
			format(string, sizeof(string), "Вы проиграли "collime"$%d"c_offer" игроку "C_PODS"%s"c_offer" в гонках",
				pTemp[playerid][tRaceMoney]*2, pInfo[playerid][pName]
			);
			SendClientMessage(pTemp[playerid][tRaceID], C_OFFER, string); 
			GameTextForPlayer(pTemp[playerid][tRaceID], !"~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~r~YOU LOSE", 3000, 3);
			kLibGivePlayerMoney(playerid, pTemp[playerid][tRaceMoney] * 2, "победа в уличных гонках");
			if (pInfo[pTemp[playerid][tRaceID]][pFamily]) GiveFamilyRepute(pInfo[pTemp[playerid][tRaceID]][pFamily], -1);
			
		}
		case 1, 2: {
			new string[144];
			if (type == 1) {
				format(string,sizeof(string),"Игрок покинул сервер. Вы одержали победу в гонках над "C_PODS"%s"c_offer". Вознаграждение: "collime"$%d",
					pInfo[playerid][pName], pTemp[playerid][tRaceMoney]*2
				);
				SendClientMessage(pTemp[playerid][tRaceID], C_OFFER, string);
				GameTextForPlayer(pTemp[playerid][tRaceID], !"~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~g~YOU WIN", 3000, 3);
				if (pInfo[pTemp[playerid][tRaceID]][pFamily]) GiveFamilyRepute(pInfo[pTemp[playerid][tRaceID]][pFamily], 1);
			}
			if (type == 2) {
				format(string,sizeof(string),"Игрок покинул транспорт. Вы одержали победу в гонках над "C_PODS"%s"c_offer". Вознаграждение: "collime"$%d",
					pInfo[playerid][pName], pTemp[playerid][tRaceMoney]*2
				);
				SendClientMessage(pTemp[playerid][tRaceID], C_OFFER, string);
				GameTextForPlayer(pTemp[playerid][tRaceID], !"~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~g~YOU WIN", 3000, 3);
				if (pInfo[pTemp[playerid][tRaceID]][pFamily]) GiveFamilyRepute(pInfo[pTemp[playerid][tRaceID]][pFamily], 1); //Проиграл гонку
				format(string,sizeof(string),"Вы покинули транспорт во время гонке. Победитель в гонке: "C_PODS"%s",
					pInfo[ pTemp[playerid][tRaceID] ][pName]
				);
				SendClientMessage(playerid, C_OFFER, string);
				if (pInfo[playerid][pFamily]) GiveFamilyRepute(pInfo[playerid][pFamily], -1); //Проиграл гонку
				GameTextForPlayer(playerid, !"~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~r~YOU LOSE", 3000, 3);
			}
			kLibGivePlayerMoney(pTemp[playerid][tRaceID], pTemp[playerid][tRaceMoney]*2, "победа в уличных гонках");
			
		}
	}
	pTemp[playerid][tRaceMoney] = pTemp[pTemp[playerid][tRaceID]][tRaceMoney] = 0;
	pTemp[playerid][tRaceID] = pTemp[pTemp[playerid][tRaceID]][tRaceID] = INVALID_PLAYER_ID;
}

stock IsPlayerInMedical(playerid)
{
    if(
        IsPlayerInRangeOfPoint(playerid, 100.0,835.0920,1348.3275,1071.479) &&  GetPlayerInterior(playerid) == 7 ||
        IsPlayerInRangeOfPoint(playerid, 100.0,-2601.2571,603.7801,1338.9753) &&  GetPlayerInterior(playerid) == HOSPITAL_SF_INT ||
        IsPlayerInRangeOfPoint(playerid, 100.0,1672.6567,1781.9744,1098.1624) &&  GetPlayerInterior(playerid) == HOSPITAL_LV_INT
    )
    {
        return 1;
    }
    return 0;
}

stock  IsAFeMaleSkin(skiid)
{
	if(skiid < 0 || skiid > 311) return 0;
	new const gender_skins[312] = 
	{
		0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,
		0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,
		1,1,1,0,0,0,0,0,0,1,1,1,0,0,0,1,0,0,
		0,0,0,1,1,1,0,0,0,0,0,0,0,1,0,1,1,1,
		1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,1,1,1,0,0,0,0,0,0,1,1,1,1,0,0,
		0,1,0,0,1,0,1,1,1,0,0,0,0,1,0,0,0,0,
		0,0,0,0,0,0,0,1,0,0,1,0,0,0,0,0,1,0,
		0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,
		1,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,1,
		1,0,1,1,0,0,0,0,1,1,1,0,0,0,0,1,1,1,
		0,0,0,1,1,0,0,0,0,1,1,1,1,0,0,0,0,1,
		0,0,0,0,1,1,0,0,0,0,0,1,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,
		1,1,1,1,0
	};
	return gender_skins[skiid];
}

stock LoadPlayerDj(playerid)
{
    static get_dj[] = "SELECT * FROM `Creative_fm` WHERE `playerid` = '%d' LIMIT 1";
	new string[sizeof(get_dj) + ( -2 + MAX_PLAYER_NAME)+10];
	mysql_format(dbHandle,string, sizeof(string),get_dj, pInfo[playerid][pID]);
	mysql_tquery(dbHandle,string, "LoadCreativeDj","dddd",playerid,2,pInfo[playerid][pID],playerid);
    return 1;
}

publics:LoadCreativeDj( playerid, status, MySQLID, id )
{
	if(status == 0 )
	{
		if (cache_num_rows())
			return SendClientMessage(playerid, CGRAY2, !"Этот игрок уже есть в списке радиоведущих! ( Используйте /offDj [id аккаунта /getid ] )");

		new 
			query_[128];
		mysql_format(dbHandle, query_, sizeof query_, "INSERT INTO `Creative_fm` (`playerid`) VALUES ('%d')", MySQLID);
		mysql_tquery(dbHandle,query_, "LoadCreativeDj","dddd",playerid,1,pInfo[id][pID],id);
	}
	else if(status == 1)
	{
		pTemp[id][tRadioHost] = 1;
		SendMes(playerid,CGRAY2,"Вы назначили нового ведущего: %s",pInfo[id][pName]);
		SendMes(id,COLOR_GREEN,"Администратор %s назначил Вас ведущим радиостанции",pInfo[playerid][pName]);
	}
	else if(status == 2)
	{
		if (cache_num_rows())
			pTemp[playerid][tRadioHost] = 1;
	}
	else if(status == 3)
	{
		SendMes(playerid,CGRAY2,"Вы удалили доступ к радиостанции игроку MySQL id: %d",MySQLID);
		foreach(new i: PlayerInLogin)
    	{
			if(MySQLID == pInfo[i][pID] && pTemp[i][tRadioHost] != 0)
			{
				pTemp[i][tRadioHost] = 0;
				SendClientMessage(i,CGRAY2,!"У Вас забрали доступ к радиостанции Warrior FM");
				break;
			}
		}
	}
	return 1;
}

publics: get_user_id(const playerid, params[])
{
	new rows,
		string_[128];
	cache_get_row_count(rows);
	if(rows) {
		new 
			name[MAX_PLAYER_NAME], pid;
		cache_get_value_name_int(0, "pID",pid);
		cache_get_value_name(0, "Name", name, MAX_PLAYER_NAME);
 
		format(string_, sizeof string_,"Ник: %s. MySQL id: %d", name, pid);
		SendClientMessage(playerid, CGRAY2, string_);
	} else { 
		format(string_, sizeof string_, ""colwhi"По запросу %s не найден аккаунт", params);
		return ShowPlayerDialog(playerid, D_NULL, 0, "Запрос", string_, !"Закрыть", "");
	}

	return 1;
}
stock CheckFamilyHouseFree(idx) 
{	
    new 
		query_[100]; 
    format(query_, sizeof query_,"SELECT Name, pID FROM s_users WHERE playerspawn = '6' AND pFamily = '%d'", HouseInfo[idx][hFamily]);
    new Cache: result = mysql_query(dbHandle, query_), rows; 
    cache_get_row_count(rows);
    if (!rows) {
        if (cache_is_valid(result)) cache_delete(result);
        return 1;
    }
    for(new i = 0, account_id, name[MAX_PLAYER_NAME], get_id; i < rows; i++)
    {
        cache_get_value_name_int(i, "pID", account_id);
        cache_get_value_name(i, "Name", name, MAX_PLAYER_NAME + 1); 
        get_id = GetCheckID(name);
        if (get_id != INVALID_PLAYER_ID) {
            SendClientMessage(get_id, COLOR_YELLOW, !"[Подсказка] "colwhi"Дом семьи в котором Вы жили был продан");
            SendClientMessage(get_id, COLOR_YELLOW, !"[Подсказка] "colwhi"Ваш спавн был изменен на "colserver"Стандартный"); 
			if (pInfo[get_id][PlayerSpawn] == 6) {
				pInfo[get_id][PlayerSpawn] = 0;
			}       
        }
        format(query_, sizeof query_, "UPDATE s_users SET playerspawn = '0' WHERE pID = '%d'", account_id);
        mysql_query(dbHandle, query_);
    }
    FamilyInfo[ HouseInfo[idx][hFamily] - 1 ][fDefHouse] = -1;
    format(query_, sizeof query_, "UPDATE "TABLE_FAMILY" SET fDefHouse= '-1' WHERE fID = '%d'", HouseInfo[idx][hFamily]);
    mysql_query(dbHandle, query_);
	ClearFamilyVehicle(HouseInfo[idx][hFamily]);
    HouseInfo[idx][hFamily] = -1; 
	SaveHouse(idx, "hFamily = '-1'");
    if (cache_is_valid(result)) cache_delete(result);
    return 1;
} 


publics: OnPlayerSearchOld(playerid) {
	if (cache_num_rows()) {
		SendClientMessage(playerid, COLOR_YELLOW, "[Подсказка] "colwhi"Аккаунт найден, укажите Ваш пароль");
		ShowLoginTransfer(playerid);
		cache_get_value_name_int(0, "pID", pTransfer[playerid][tID_Users]);

	} else {
		SendClientMessage(playerid, COLOR_GREY, "Данный аккаунт не найден");
	}
	return 1;
}
stock ShowLoginTransfer(playerid) {
	t_string[0] = EOS;
	format(t_string, sizeof t_string, ""colwhi"____________________________________________________\n\n\
		\tДобро пожаловать на "colserver##NameServer##colwhi"\n\
		\tДанный аккаунт найден для восстановление\n\n\
		Введите пароль:\n\
		____________________________________________________",
		pInfo[playerid][pName]
	);
	ShowPlayerDialog(playerid, D_LOGIN_TRANSFER, DIALOG_STYLE_PASSWORD, ""colserver"Авторизация: "colwhi"Восстановление", t_string, "Войти", "Отмена");
}
publics: LoadPlayerTransfer(playerid)
{
	new
		rows, str_[128], 
		kickout[256], str_title[64];
	t_string[0] = EOS;
	cache_get_row_count(rows);
	if (!rows) {
		SendClientMessage(playerid, COLOR_GREY, !"Вы указали неверный пароль");
		ShowLoginTransfer(playerid);
	} else {
		new 
			name_transfer[MAX_PLAYER_NAME];
		cache_get_value_name(0, "Name", name_transfer, sizeof name_transfer);
		cache_get_value_name_int(0, "pID", pTransfer[playerid][tID_Users]);
	    cache_get_value_name_int(0, "pLevel", pTransfer[playerid][tLevel]);
	    cache_get_value_name_int(0, "pExp", pTransfer[playerid][tEXP]);
		
	    cache_get_value_name_int(0, "vip_rank", pTransfer[playerid][tVIP]);
		cache_get_value_name_int(0, "boost_rank", pTransfer[playerid][tBoost]);
	    cache_get_value_name_int(0, "pPnumber", pTransfer[playerid][tNumber]); 
		cache_get_value_name_int(0, "u_donate", pTransfer[playerid][tDonate]);
		cache_get_value_name_int(0, "pCash", pTransfer[playerid][tCash]);
		cache_get_value_name_int(0, "pBank", pTransfer[playerid][tBank]);
		cache_get_value_name_int(0, "pDeposit", pTransfer[playerid][tDeposit]);
		cache_get_value_name_int(0, "pMember", pTransfer[playerid][tMember]);
		cache_get_value_name_int(0, "pRank", pTransfer[playerid][tRank]);
		cache_get_value_name_int(0, "pModel", pTransfer[playerid][tModel]);
		cache_get_value_name_int(0, "pMats", pTransfer[playerid][tMaterials]);
		cache_get_value_name_int(0, "pDrugs", pTransfer[playerid][tDrugs]);
		cache_get_value_name(0, "pChars", kickout, sizeof kickout);
		sscanf(kickout, "p<,>a<d>[6]", pTransfer[playerid][tChar]);

		cache_get_value_name(0, "pGunSkills", kickout, sizeof kickout);
		sscanf(kickout, "p<,>a<d>[6]", pTransfer[playerid][tGunSkills]);
		cache_get_value_name(0, "playerItems", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>["#MAX_ITEMS_SLOTS"]", pTransfer[playerid][tPlayerItems]);
			
		cache_get_value_name(0, "playerItemsCount", kickout, sizeof (kickout));
		sscanf(kickout, "p<|>a<i>["#MAX_ITEMS_SLOTS"]", pTransfer[playerid][tPlayerItemsCount]);
		new	
			count_item = 0;
		for(new i = 0; i < MAX_ITEMS_SLOTS ; i ++) {
			if (pTransfer[playerid][tPlayerItems][i] != 0) {
				count_item++;
			} 
		} 

	    format(str_, sizeof str_, "Уровень:\t%d\nExp:\t%d\n", pTransfer[playerid][tLevel], pTransfer[playerid][tEXP]);
		strcat(t_string, str_);
		format(str_, sizeof str_, "VIP:\t%d\nСтартовый пакет:\t%d\nНомер:\t%d\nДенег:\t$%d\nБанк:\t$%d\n", pTransfer[playerid][tVIP], pTransfer[playerid][tBoost], pTransfer[playerid][tNumber], pTransfer[playerid][tCash], pTransfer[playerid][tBank]);
		strcat(t_string, str_);
		format(str_, sizeof str_, "Депозит:\t$%d\n"DonatePoint":\t$%d\nМатериалы:\t%d\nНаркотики:\t%d\n", pTransfer[playerid][tDeposit], pTransfer[playerid][tDonate], pTransfer[playerid][tMaterials], pTransfer[playerid][tDrugs]);
		strcat(t_string, str_);
		format(str_, sizeof str_, "Организация:\t%d(%s)\nРанг:\t%d\nПредметов в инветаре\t%d\n", pTransfer[playerid][tMember], gFraction[pTransfer[playerid][tMember]][fName], pTransfer[playerid][tRank], count_item);
		strcat(t_string, str_);

		format(str_title, sizeof str_title, "ID: %d | Name: %s "colwhi"(Восстановление)", pTransfer[playerid][tID_Users], name_transfer);
		ShowPlayerDialog(playerid, D_LOGIN_TRANSFER_0, DIALOG_STYLE_TABLIST, str_title, t_string, "Перенести", "Отмена");
	}
	return 1;
}

#if defined _hkac_included 
publics: hkOnCheatDetected(playerid, code) {

	if (GetPlayerAdmin(playerid) > 0 || NEW_ANTICHEAT_ALF == 0) return 0;
	new buffer[144];
	format(buffer, sizeof(buffer), " Вы были кикнуты по подозрению в читерстве. (#hk-%i)", code);
	SendClientMessage(playerid, hkKICK_COLOR, buffer);

	SetTimerEx(#hkKick, 250, false, "ii", playerid, code);
	//иначе сообщение в чат + кик
	return 1;
} 

publics: hkOnSendWarning(playerid, const message[]) {

	if (/*GetPlayerAdmin(playerid) > 0 ||*/ NEW_ANTICHEAT_ALF == 0) return 1;
	//format(string_, sizeof string_, "<Warning> %s[%d] Damager by Shot (1)[!]: Проверить", pInfo[playerid][pName], playerid);
	SendAdminMessage(COLOR_REDD, message);
	return 1;
}

#endif

UpdateFactoryText() {
	for (new i, str_name[32], string_[128]; i < S_FACTORY_SORT_COUNT; i++) {
		str_name = "Неизвестно";
		switch(i) {
			case 0, 2: str_name = "На сортировке";
			case 1, 3: str_name = "На отправку";
		} 
		format(string_, sizeof string_, "%s: "colserver"%d", str_name, gFactorySortInfo[i][sortBoxCount]);
		UpdateDynamic3DTextLabelText(gFactorySortInfo[i][sortText], -1, string_);
		if(gFactorySortInfo[i][sortPlaceToggle] != INVALID_PLAYER_ID) {
			Streamer_Update(gFactorySortInfo[i][sortPlaceToggle]);
		}
	}
}
